;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Fri Sep 14 23:31:46 2018                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_mmcsd.c")

$C$DW$823	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
$C$DW$824	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
$C$DW$825	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
$C$DW$826	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
$C$DW$827	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
$C$DW$828	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
$C$DW$829	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
$C$DW$830	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
$C$DW$831	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
$C$DW$832	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
$C$DW$833	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
$C$DW$834	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
$C$DW$835	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
$C$DW$836	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
$C$DW$837	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
$C$DW$838	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
$C$DW$839	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$47

$C$DW$T$48	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)

$C$DW$T$61	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
$C$DW$840	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CARD_NONE"), DW_AT_const_value(0x00)
$C$DW$841	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SD_CARD"), DW_AT_const_value(0x01)
$C$DW$842	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMC_CARD"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$61

$C$DW$T$62	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CardType")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)

$C$DW$T$85	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
$C$DW$843	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_POLLED"), DW_AT_const_value(0x00)
$C$DW$844	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_INTERRUPT"), DW_AT_const_value(0x01)
$C$DW$845	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_DMA"), DW_AT_const_value(0x02)
$C$DW$846	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_NONE"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$85

$C$DW$T$86	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDOpMode")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)

$C$DW$T$96	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
$C$DW$847	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
$C$DW$848	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_BIG"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$96

$C$DW$T$97	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdEndianMode")
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)

$C$DW$T$107	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$107, DW_AT_byte_size(0x01)
$C$DW$849	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD0_INST"), DW_AT_const_value(0x00)
$C$DW$850	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD1_INST"), DW_AT_const_value(0x01)
$C$DW$851	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INST_INV"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$107

$C$DW$T$108	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdInstId")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)

$C$DW$T$109	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
$C$DW$852	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDATDNE_INTERRUPT"), DW_AT_const_value(0x01)
$C$DW$853	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EBSYDNE_INTERRUPT"), DW_AT_const_value(0x02)
$C$DW$854	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ERSPDNE_INTERRUPT"), DW_AT_const_value(0x04)
$C$DW$855	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ETOUTRD_INTERRUPT"), DW_AT_const_value(0x08)
$C$DW$856	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ETOUTRS_INTERRUPT"), DW_AT_const_value(0x10)
$C$DW$857	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ECRCWR_INTERRUPT"), DW_AT_const_value(0x20)
$C$DW$858	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ECRCRD_INTERRUPT"), DW_AT_const_value(0x40)
$C$DW$859	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ECRCRS_INTERRUPT"), DW_AT_const_value(0x80)
$C$DW$860	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_RSV_BIT"), DW_AT_const_value(0x100)
$C$DW$861	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDXRDY_INTERRUPT"), DW_AT_const_value(0x200)
$C$DW$862	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDRRDY_INTERRUPT"), DW_AT_const_value(0x400)
$C$DW$863	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDATED_INTERRUPT"), DW_AT_const_value(0x800)
$C$DW$864	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ETRNDNE_INTERRUPT"), DW_AT_const_value(0x1000)
$C$DW$865	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INTERRUPT_NONE"), DW_AT_const_value(0x2000)
	.dwendtag $C$DW$T$109

$C$DW$T$110	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDEventType")
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x66)
$C$DW$866	.dwtag  DW_TAG_member
	.dwattr $C$DW$866, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$866, DW_AT_name("DMACH0SSAL")
	.dwattr $C$DW$866, DW_AT_TI_symbol_name("_DMACH0SSAL")
	.dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$867	.dwtag  DW_TAG_member
	.dwattr $C$DW$867, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$867, DW_AT_name("DMACH0SSAU")
	.dwattr $C$DW$867, DW_AT_TI_symbol_name("_DMACH0SSAU")
	.dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$868	.dwtag  DW_TAG_member
	.dwattr $C$DW$868, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$868, DW_AT_name("DMACH0DSAL")
	.dwattr $C$DW$868, DW_AT_TI_symbol_name("_DMACH0DSAL")
	.dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$869	.dwtag  DW_TAG_member
	.dwattr $C$DW$869, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$869, DW_AT_name("DMACH0DSAU")
	.dwattr $C$DW$869, DW_AT_TI_symbol_name("_DMACH0DSAU")
	.dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$870	.dwtag  DW_TAG_member
	.dwattr $C$DW$870, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$870, DW_AT_name("DMACH0TCR1")
	.dwattr $C$DW$870, DW_AT_TI_symbol_name("_DMACH0TCR1")
	.dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$871	.dwtag  DW_TAG_member
	.dwattr $C$DW$871, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$871, DW_AT_name("DMACH0TCR2")
	.dwattr $C$DW$871, DW_AT_TI_symbol_name("_DMACH0TCR2")
	.dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$872	.dwtag  DW_TAG_member
	.dwattr $C$DW$872, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$872, DW_AT_name("RSVD0")
	.dwattr $C$DW$872, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$873	.dwtag  DW_TAG_member
	.dwattr $C$DW$873, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$873, DW_AT_name("DMACH1SSAL")
	.dwattr $C$DW$873, DW_AT_TI_symbol_name("_DMACH1SSAL")
	.dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$874	.dwtag  DW_TAG_member
	.dwattr $C$DW$874, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$874, DW_AT_name("DMACH1SSAU")
	.dwattr $C$DW$874, DW_AT_TI_symbol_name("_DMACH1SSAU")
	.dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$875	.dwtag  DW_TAG_member
	.dwattr $C$DW$875, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$875, DW_AT_name("DMACH1DSAL")
	.dwattr $C$DW$875, DW_AT_TI_symbol_name("_DMACH1DSAL")
	.dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$876	.dwtag  DW_TAG_member
	.dwattr $C$DW$876, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$876, DW_AT_name("DMACH1DSAU")
	.dwattr $C$DW$876, DW_AT_TI_symbol_name("_DMACH1DSAU")
	.dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$877	.dwtag  DW_TAG_member
	.dwattr $C$DW$877, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$877, DW_AT_name("DMACH1TCR1")
	.dwattr $C$DW$877, DW_AT_TI_symbol_name("_DMACH1TCR1")
	.dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$878	.dwtag  DW_TAG_member
	.dwattr $C$DW$878, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$878, DW_AT_name("DMACH1TCR2")
	.dwattr $C$DW$878, DW_AT_TI_symbol_name("_DMACH1TCR2")
	.dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$879	.dwtag  DW_TAG_member
	.dwattr $C$DW$879, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$879, DW_AT_name("RSVD1")
	.dwattr $C$DW$879, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$880	.dwtag  DW_TAG_member
	.dwattr $C$DW$880, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$880, DW_AT_name("DMACH2SSAL")
	.dwattr $C$DW$880, DW_AT_TI_symbol_name("_DMACH2SSAL")
	.dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$881	.dwtag  DW_TAG_member
	.dwattr $C$DW$881, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$881, DW_AT_name("DMACH2SSAU")
	.dwattr $C$DW$881, DW_AT_TI_symbol_name("_DMACH2SSAU")
	.dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$882	.dwtag  DW_TAG_member
	.dwattr $C$DW$882, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$882, DW_AT_name("DMACH2DSAL")
	.dwattr $C$DW$882, DW_AT_TI_symbol_name("_DMACH2DSAL")
	.dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$883	.dwtag  DW_TAG_member
	.dwattr $C$DW$883, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$883, DW_AT_name("DMACH2DSAU")
	.dwattr $C$DW$883, DW_AT_TI_symbol_name("_DMACH2DSAU")
	.dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$884	.dwtag  DW_TAG_member
	.dwattr $C$DW$884, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$884, DW_AT_name("DMACH2TCR1")
	.dwattr $C$DW$884, DW_AT_TI_symbol_name("_DMACH2TCR1")
	.dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$885	.dwtag  DW_TAG_member
	.dwattr $C$DW$885, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$885, DW_AT_name("DMACH2TCR2")
	.dwattr $C$DW$885, DW_AT_TI_symbol_name("_DMACH2TCR2")
	.dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$886	.dwtag  DW_TAG_member
	.dwattr $C$DW$886, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$886, DW_AT_name("RSVD2")
	.dwattr $C$DW$886, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$887	.dwtag  DW_TAG_member
	.dwattr $C$DW$887, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$887, DW_AT_name("DMACH3SSAL")
	.dwattr $C$DW$887, DW_AT_TI_symbol_name("_DMACH3SSAL")
	.dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$888	.dwtag  DW_TAG_member
	.dwattr $C$DW$888, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$888, DW_AT_name("DMACH3SSAU")
	.dwattr $C$DW$888, DW_AT_TI_symbol_name("_DMACH3SSAU")
	.dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
	.dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$889	.dwtag  DW_TAG_member
	.dwattr $C$DW$889, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$889, DW_AT_name("DMACH3DSAL")
	.dwattr $C$DW$889, DW_AT_TI_symbol_name("_DMACH3DSAL")
	.dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$890	.dwtag  DW_TAG_member
	.dwattr $C$DW$890, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$890, DW_AT_name("DMACH3DSAU")
	.dwattr $C$DW$890, DW_AT_TI_symbol_name("_DMACH3DSAU")
	.dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
	.dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$891	.dwtag  DW_TAG_member
	.dwattr $C$DW$891, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$891, DW_AT_name("DMACH3TCR1")
	.dwattr $C$DW$891, DW_AT_TI_symbol_name("_DMACH3TCR1")
	.dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$892	.dwtag  DW_TAG_member
	.dwattr $C$DW$892, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$892, DW_AT_name("DMACH3TCR2")
	.dwattr $C$DW$892, DW_AT_TI_symbol_name("_DMACH3TCR2")
	.dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$22

$C$DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
$C$DW$893	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$893, DW_AT_type(*$C$DW$T$23)
$C$DW$894	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$894, DW_AT_type(*$C$DW$893)
$C$DW$T$24	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$894)
$C$DW$T$25	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$25, DW_AT_address_class(0x10)
$C$DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x09)
$C$DW$895	.dwtag  DW_TAG_member
	.dwattr $C$DW$895, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$895, DW_AT_name("dmaRegs")
	.dwattr $C$DW$895, DW_AT_TI_symbol_name("_dmaRegs")
	.dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$896	.dwtag  DW_TAG_member
	.dwattr $C$DW$896, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$896, DW_AT_name("chanNum")
	.dwattr $C$DW$896, DW_AT_TI_symbol_name("_chanNum")
	.dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$897	.dwtag  DW_TAG_member
	.dwattr $C$DW$897, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$897, DW_AT_name("dmaInstNum")
	.dwattr $C$DW$897, DW_AT_TI_symbol_name("_dmaInstNum")
	.dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$898	.dwtag  DW_TAG_member
	.dwattr $C$DW$898, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$898, DW_AT_name("isChanFree")
	.dwattr $C$DW$898, DW_AT_TI_symbol_name("_isChanFree")
	.dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$899	.dwtag  DW_TAG_member
	.dwattr $C$DW$899, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$899, DW_AT_name("chanDir")
	.dwattr $C$DW$899, DW_AT_TI_symbol_name("_chanDir")
	.dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$900	.dwtag  DW_TAG_member
	.dwattr $C$DW$900, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$900, DW_AT_name("trigger")
	.dwattr $C$DW$900, DW_AT_TI_symbol_name("_trigger")
	.dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$901	.dwtag  DW_TAG_member
	.dwattr $C$DW$901, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$901, DW_AT_name("trfType")
	.dwattr $C$DW$901, DW_AT_TI_symbol_name("_trfType")
	.dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$902	.dwtag  DW_TAG_member
	.dwattr $C$DW$902, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$902, DW_AT_name("dmaInt")
	.dwattr $C$DW$902, DW_AT_TI_symbol_name("_dmaInt")
	.dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$903	.dwtag  DW_TAG_member
	.dwattr $C$DW$903, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$903, DW_AT_name("pingPongEnabled")
	.dwattr $C$DW$903, DW_AT_TI_symbol_name("_pingPongEnabled")
	.dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$40

$C$DW$T$87	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
$C$DW$T$88	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$88, DW_AT_address_class(0x17)
$C$DW$T$89	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)

$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x0e)
$C$DW$904	.dwtag  DW_TAG_member
	.dwattr $C$DW$904, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$904, DW_AT_name("pingPongMode")
	.dwattr $C$DW$904, DW_AT_TI_symbol_name("_pingPongMode")
	.dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$905	.dwtag  DW_TAG_member
	.dwattr $C$DW$905, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$905, DW_AT_name("autoMode")
	.dwattr $C$DW$905, DW_AT_TI_symbol_name("_autoMode")
	.dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$906	.dwtag  DW_TAG_member
	.dwattr $C$DW$906, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$906, DW_AT_name("burstLen")
	.dwattr $C$DW$906, DW_AT_TI_symbol_name("_burstLen")
	.dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$907	.dwtag  DW_TAG_member
	.dwattr $C$DW$907, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$907, DW_AT_name("trigger")
	.dwattr $C$DW$907, DW_AT_TI_symbol_name("_trigger")
	.dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$908	.dwtag  DW_TAG_member
	.dwattr $C$DW$908, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$908, DW_AT_name("dmaEvt")
	.dwattr $C$DW$908, DW_AT_TI_symbol_name("_dmaEvt")
	.dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$909	.dwtag  DW_TAG_member
	.dwattr $C$DW$909, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$909, DW_AT_name("dmaInt")
	.dwattr $C$DW$909, DW_AT_TI_symbol_name("_dmaInt")
	.dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$910	.dwtag  DW_TAG_member
	.dwattr $C$DW$910, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$910, DW_AT_name("chanDir")
	.dwattr $C$DW$910, DW_AT_TI_symbol_name("_chanDir")
	.dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$911	.dwtag  DW_TAG_member
	.dwattr $C$DW$911, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$911, DW_AT_name("trfType")
	.dwattr $C$DW$911, DW_AT_TI_symbol_name("_trfType")
	.dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$912	.dwtag  DW_TAG_member
	.dwattr $C$DW$912, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$912, DW_AT_name("dataLen")
	.dwattr $C$DW$912, DW_AT_TI_symbol_name("_dataLen")
	.dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$913	.dwtag  DW_TAG_member
	.dwattr $C$DW$913, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$913, DW_AT_name("srcAddr")
	.dwattr $C$DW$913, DW_AT_TI_symbol_name("_srcAddr")
	.dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$914	.dwtag  DW_TAG_member
	.dwattr $C$DW$914, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$914, DW_AT_name("destAddr")
	.dwattr $C$DW$914, DW_AT_TI_symbol_name("_destAddr")
	.dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$50

$C$DW$T$90	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
$C$DW$T$111	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$111, DW_AT_address_class(0x17)

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x75)
$C$DW$915	.dwtag  DW_TAG_member
	.dwattr $C$DW$915, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$915, DW_AT_name("MMCCTL")
	.dwattr $C$DW$915, DW_AT_TI_symbol_name("_MMCCTL")
	.dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$916	.dwtag  DW_TAG_member
	.dwattr $C$DW$916, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$916, DW_AT_name("RSVD0")
	.dwattr $C$DW$916, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$917	.dwtag  DW_TAG_member
	.dwattr $C$DW$917, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$917, DW_AT_name("MMCCLK")
	.dwattr $C$DW$917, DW_AT_TI_symbol_name("_MMCCLK")
	.dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$918	.dwtag  DW_TAG_member
	.dwattr $C$DW$918, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$918, DW_AT_name("RSVD1")
	.dwattr $C$DW$918, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$919	.dwtag  DW_TAG_member
	.dwattr $C$DW$919, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$919, DW_AT_name("MMCST0")
	.dwattr $C$DW$919, DW_AT_TI_symbol_name("_MMCST0")
	.dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$920	.dwtag  DW_TAG_member
	.dwattr $C$DW$920, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$920, DW_AT_name("RSVD2")
	.dwattr $C$DW$920, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$921	.dwtag  DW_TAG_member
	.dwattr $C$DW$921, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$921, DW_AT_name("MMCST1")
	.dwattr $C$DW$921, DW_AT_TI_symbol_name("_MMCST1")
	.dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$922	.dwtag  DW_TAG_member
	.dwattr $C$DW$922, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$922, DW_AT_name("RSVD3")
	.dwattr $C$DW$922, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$923	.dwtag  DW_TAG_member
	.dwattr $C$DW$923, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$923, DW_AT_name("MMCIM")
	.dwattr $C$DW$923, DW_AT_TI_symbol_name("_MMCIM")
	.dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$924	.dwtag  DW_TAG_member
	.dwattr $C$DW$924, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$924, DW_AT_name("RSVD4")
	.dwattr $C$DW$924, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$925	.dwtag  DW_TAG_member
	.dwattr $C$DW$925, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$925, DW_AT_name("MMCTOR")
	.dwattr $C$DW$925, DW_AT_TI_symbol_name("_MMCTOR")
	.dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$926	.dwtag  DW_TAG_member
	.dwattr $C$DW$926, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$926, DW_AT_name("RSVD5")
	.dwattr $C$DW$926, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$927	.dwtag  DW_TAG_member
	.dwattr $C$DW$927, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$927, DW_AT_name("MMCTOD")
	.dwattr $C$DW$927, DW_AT_TI_symbol_name("_MMCTOD")
	.dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$928	.dwtag  DW_TAG_member
	.dwattr $C$DW$928, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$928, DW_AT_name("RSVD6")
	.dwattr $C$DW$928, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$929	.dwtag  DW_TAG_member
	.dwattr $C$DW$929, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$929, DW_AT_name("MMCBLEN")
	.dwattr $C$DW$929, DW_AT_TI_symbol_name("_MMCBLEN")
	.dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$930	.dwtag  DW_TAG_member
	.dwattr $C$DW$930, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$930, DW_AT_name("RSVD7")
	.dwattr $C$DW$930, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$931	.dwtag  DW_TAG_member
	.dwattr $C$DW$931, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$931, DW_AT_name("MMCNBLK")
	.dwattr $C$DW$931, DW_AT_TI_symbol_name("_MMCNBLK")
	.dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$932	.dwtag  DW_TAG_member
	.dwattr $C$DW$932, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$932, DW_AT_name("RSVD8")
	.dwattr $C$DW$932, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$933	.dwtag  DW_TAG_member
	.dwattr $C$DW$933, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$933, DW_AT_name("MMCNBLC")
	.dwattr $C$DW$933, DW_AT_TI_symbol_name("_MMCNBLC")
	.dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$934	.dwtag  DW_TAG_member
	.dwattr $C$DW$934, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$934, DW_AT_name("RSVD9")
	.dwattr $C$DW$934, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$935	.dwtag  DW_TAG_member
	.dwattr $C$DW$935, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$935, DW_AT_name("MMCDRR1")
	.dwattr $C$DW$935, DW_AT_TI_symbol_name("_MMCDRR1")
	.dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$936	.dwtag  DW_TAG_member
	.dwattr $C$DW$936, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$936, DW_AT_name("MMCDRR2")
	.dwattr $C$DW$936, DW_AT_TI_symbol_name("_MMCDRR2")
	.dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$937	.dwtag  DW_TAG_member
	.dwattr $C$DW$937, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$937, DW_AT_name("RSVD10")
	.dwattr $C$DW$937, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$938	.dwtag  DW_TAG_member
	.dwattr $C$DW$938, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$938, DW_AT_name("MMCDXR1")
	.dwattr $C$DW$938, DW_AT_TI_symbol_name("_MMCDXR1")
	.dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$939	.dwtag  DW_TAG_member
	.dwattr $C$DW$939, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$939, DW_AT_name("MMCDXR2")
	.dwattr $C$DW$939, DW_AT_TI_symbol_name("_MMCDXR2")
	.dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$940	.dwtag  DW_TAG_member
	.dwattr $C$DW$940, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$940, DW_AT_name("RSVD11")
	.dwattr $C$DW$940, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$941	.dwtag  DW_TAG_member
	.dwattr $C$DW$941, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$941, DW_AT_name("MMCCMD1")
	.dwattr $C$DW$941, DW_AT_TI_symbol_name("_MMCCMD1")
	.dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$942	.dwtag  DW_TAG_member
	.dwattr $C$DW$942, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$942, DW_AT_name("MMCCMD2")
	.dwattr $C$DW$942, DW_AT_TI_symbol_name("_MMCCMD2")
	.dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$943	.dwtag  DW_TAG_member
	.dwattr $C$DW$943, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$943, DW_AT_name("RSVD12")
	.dwattr $C$DW$943, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$944	.dwtag  DW_TAG_member
	.dwattr $C$DW$944, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$944, DW_AT_name("MMCARG1")
	.dwattr $C$DW$944, DW_AT_TI_symbol_name("_MMCARG1")
	.dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$945	.dwtag  DW_TAG_member
	.dwattr $C$DW$945, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$945, DW_AT_name("MMCARG2")
	.dwattr $C$DW$945, DW_AT_TI_symbol_name("_MMCARG2")
	.dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$946	.dwtag  DW_TAG_member
	.dwattr $C$DW$946, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$946, DW_AT_name("RSVD13")
	.dwattr $C$DW$946, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$947	.dwtag  DW_TAG_member
	.dwattr $C$DW$947, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$947, DW_AT_name("MMCRSP0")
	.dwattr $C$DW$947, DW_AT_TI_symbol_name("_MMCRSP0")
	.dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$948	.dwtag  DW_TAG_member
	.dwattr $C$DW$948, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$948, DW_AT_name("MMCRSP1")
	.dwattr $C$DW$948, DW_AT_TI_symbol_name("_MMCRSP1")
	.dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$949	.dwtag  DW_TAG_member
	.dwattr $C$DW$949, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$949, DW_AT_name("RSVD14")
	.dwattr $C$DW$949, DW_AT_TI_symbol_name("_RSVD14")
	.dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$950	.dwtag  DW_TAG_member
	.dwattr $C$DW$950, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$950, DW_AT_name("MMCRSP2")
	.dwattr $C$DW$950, DW_AT_TI_symbol_name("_MMCRSP2")
	.dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$951	.dwtag  DW_TAG_member
	.dwattr $C$DW$951, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$951, DW_AT_name("MMCRSP3")
	.dwattr $C$DW$951, DW_AT_TI_symbol_name("_MMCRSP3")
	.dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$952	.dwtag  DW_TAG_member
	.dwattr $C$DW$952, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$952, DW_AT_name("RSVD15")
	.dwattr $C$DW$952, DW_AT_TI_symbol_name("_RSVD15")
	.dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$953	.dwtag  DW_TAG_member
	.dwattr $C$DW$953, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$953, DW_AT_name("MMCRSP4")
	.dwattr $C$DW$953, DW_AT_TI_symbol_name("_MMCRSP4")
	.dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$954	.dwtag  DW_TAG_member
	.dwattr $C$DW$954, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$954, DW_AT_name("MMCRSP5")
	.dwattr $C$DW$954, DW_AT_TI_symbol_name("_MMCRSP5")
	.dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$955	.dwtag  DW_TAG_member
	.dwattr $C$DW$955, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$955, DW_AT_name("RSVD16")
	.dwattr $C$DW$955, DW_AT_TI_symbol_name("_RSVD16")
	.dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$956	.dwtag  DW_TAG_member
	.dwattr $C$DW$956, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$956, DW_AT_name("MMCRSP6")
	.dwattr $C$DW$956, DW_AT_TI_symbol_name("_MMCRSP6")
	.dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$957	.dwtag  DW_TAG_member
	.dwattr $C$DW$957, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$957, DW_AT_name("MMCRSP7")
	.dwattr $C$DW$957, DW_AT_TI_symbol_name("_MMCRSP7")
	.dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$958	.dwtag  DW_TAG_member
	.dwattr $C$DW$958, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$958, DW_AT_name("RSVD17")
	.dwattr $C$DW$958, DW_AT_TI_symbol_name("_RSVD17")
	.dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$959	.dwtag  DW_TAG_member
	.dwattr $C$DW$959, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$959, DW_AT_name("MMCDRSP")
	.dwattr $C$DW$959, DW_AT_TI_symbol_name("_MMCDRSP")
	.dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$960	.dwtag  DW_TAG_member
	.dwattr $C$DW$960, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$960, DW_AT_name("RSVD18")
	.dwattr $C$DW$960, DW_AT_TI_symbol_name("_RSVD18")
	.dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$961	.dwtag  DW_TAG_member
	.dwattr $C$DW$961, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$961, DW_AT_name("MMCCIDX")
	.dwattr $C$DW$961, DW_AT_TI_symbol_name("_MMCCIDX")
	.dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$962	.dwtag  DW_TAG_member
	.dwattr $C$DW$962, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$962, DW_AT_name("RSVD19")
	.dwattr $C$DW$962, DW_AT_TI_symbol_name("_RSVD19")
	.dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
	.dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$963	.dwtag  DW_TAG_member
	.dwattr $C$DW$963, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$963, DW_AT_name("SDIOCTL")
	.dwattr $C$DW$963, DW_AT_TI_symbol_name("_SDIOCTL")
	.dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$964	.dwtag  DW_TAG_member
	.dwattr $C$DW$964, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$964, DW_AT_name("RSVD20")
	.dwattr $C$DW$964, DW_AT_TI_symbol_name("_RSVD20")
	.dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$965	.dwtag  DW_TAG_member
	.dwattr $C$DW$965, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$965, DW_AT_name("SDIOST0")
	.dwattr $C$DW$965, DW_AT_TI_symbol_name("_SDIOST0")
	.dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$966	.dwtag  DW_TAG_member
	.dwattr $C$DW$966, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$966, DW_AT_name("RSVD21")
	.dwattr $C$DW$966, DW_AT_TI_symbol_name("_RSVD21")
	.dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
	.dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$967	.dwtag  DW_TAG_member
	.dwattr $C$DW$967, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$967, DW_AT_name("SDIOIEN")
	.dwattr $C$DW$967, DW_AT_TI_symbol_name("_SDIOIEN")
	.dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$968	.dwtag  DW_TAG_member
	.dwattr $C$DW$968, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$968, DW_AT_name("RSVD22")
	.dwattr $C$DW$968, DW_AT_TI_symbol_name("_RSVD22")
	.dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
	.dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$969	.dwtag  DW_TAG_member
	.dwattr $C$DW$969, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$969, DW_AT_name("SDIOIST")
	.dwattr $C$DW$969, DW_AT_TI_symbol_name("_SDIOIST")
	.dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$970	.dwtag  DW_TAG_member
	.dwattr $C$DW$970, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$970, DW_AT_name("RSVD23")
	.dwattr $C$DW$970, DW_AT_TI_symbol_name("_RSVD23")
	.dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
	.dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$971	.dwtag  DW_TAG_member
	.dwattr $C$DW$971, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$971, DW_AT_name("MMCFIFOCTL")
	.dwattr $C$DW$971, DW_AT_TI_symbol_name("_MMCFIFOCTL")
	.dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$55

$C$DW$T$77	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
$C$DW$972	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$972, DW_AT_type(*$C$DW$T$77)
$C$DW$973	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$973, DW_AT_type(*$C$DW$972)
$C$DW$T$78	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$973)
$C$DW$T$79	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$79, DW_AT_address_class(0x10)
$C$DW$T$80	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
$C$DW$974	.dwtag  DW_TAG_member
	.dwattr $C$DW$974, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$974, DW_AT_name("mfgId")
	.dwattr $C$DW$974, DW_AT_TI_symbol_name("_mfgId")
	.dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$975	.dwtag  DW_TAG_member
	.dwattr $C$DW$975, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$975, DW_AT_name("oemAppId")
	.dwattr $C$DW$975, DW_AT_TI_symbol_name("_oemAppId")
	.dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$976	.dwtag  DW_TAG_member
	.dwattr $C$DW$976, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$976, DW_AT_name("productName")
	.dwattr $C$DW$976, DW_AT_TI_symbol_name("_productName")
	.dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$977	.dwtag  DW_TAG_member
	.dwattr $C$DW$977, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$977, DW_AT_name("productRev")
	.dwattr $C$DW$977, DW_AT_TI_symbol_name("_productRev")
	.dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$978	.dwtag  DW_TAG_member
	.dwattr $C$DW$978, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$978, DW_AT_name("serialNumber")
	.dwattr $C$DW$978, DW_AT_TI_symbol_name("_serialNumber")
	.dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$979	.dwtag  DW_TAG_member
	.dwattr $C$DW$979, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$979, DW_AT_name("month")
	.dwattr $C$DW$979, DW_AT_TI_symbol_name("_month")
	.dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$980	.dwtag  DW_TAG_member
	.dwattr $C$DW$980, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$980, DW_AT_name("year")
	.dwattr $C$DW$980, DW_AT_TI_symbol_name("_year")
	.dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$981	.dwtag  DW_TAG_member
	.dwattr $C$DW$981, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$981, DW_AT_name("checksum")
	.dwattr $C$DW$981, DW_AT_TI_symbol_name("_checksum")
	.dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$58

$C$DW$T$63	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardIdObj")
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
$C$DW$T$64	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$64, DW_AT_address_class(0x17)

$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x22)
$C$DW$982	.dwtag  DW_TAG_member
	.dwattr $C$DW$982, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$982, DW_AT_name("csdStruct")
	.dwattr $C$DW$982, DW_AT_TI_symbol_name("_csdStruct")
	.dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$983	.dwtag  DW_TAG_member
	.dwattr $C$DW$983, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$983, DW_AT_name("mmcProt")
	.dwattr $C$DW$983, DW_AT_TI_symbol_name("_mmcProt")
	.dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$984	.dwtag  DW_TAG_member
	.dwattr $C$DW$984, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$984, DW_AT_name("taac")
	.dwattr $C$DW$984, DW_AT_TI_symbol_name("_taac")
	.dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$985	.dwtag  DW_TAG_member
	.dwattr $C$DW$985, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$985, DW_AT_name("nsac")
	.dwattr $C$DW$985, DW_AT_TI_symbol_name("_nsac")
	.dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$986	.dwtag  DW_TAG_member
	.dwattr $C$DW$986, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$986, DW_AT_name("tranSpeed")
	.dwattr $C$DW$986, DW_AT_TI_symbol_name("_tranSpeed")
	.dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$987	.dwtag  DW_TAG_member
	.dwattr $C$DW$987, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$987, DW_AT_name("ccc")
	.dwattr $C$DW$987, DW_AT_TI_symbol_name("_ccc")
	.dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$988	.dwtag  DW_TAG_member
	.dwattr $C$DW$988, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$988, DW_AT_name("readBlLen")
	.dwattr $C$DW$988, DW_AT_TI_symbol_name("_readBlLen")
	.dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$989	.dwtag  DW_TAG_member
	.dwattr $C$DW$989, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$989, DW_AT_name("readBlPartial")
	.dwattr $C$DW$989, DW_AT_TI_symbol_name("_readBlPartial")
	.dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$990	.dwtag  DW_TAG_member
	.dwattr $C$DW$990, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$990, DW_AT_name("writeBlkMisalign")
	.dwattr $C$DW$990, DW_AT_TI_symbol_name("_writeBlkMisalign")
	.dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$991	.dwtag  DW_TAG_member
	.dwattr $C$DW$991, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$991, DW_AT_name("readBlkMisalign")
	.dwattr $C$DW$991, DW_AT_TI_symbol_name("_readBlkMisalign")
	.dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$992	.dwtag  DW_TAG_member
	.dwattr $C$DW$992, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$992, DW_AT_name("dsrImp")
	.dwattr $C$DW$992, DW_AT_TI_symbol_name("_dsrImp")
	.dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$993	.dwtag  DW_TAG_member
	.dwattr $C$DW$993, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$993, DW_AT_name("cSize")
	.dwattr $C$DW$993, DW_AT_TI_symbol_name("_cSize")
	.dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$994	.dwtag  DW_TAG_member
	.dwattr $C$DW$994, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$994, DW_AT_name("vddRCurrMin")
	.dwattr $C$DW$994, DW_AT_TI_symbol_name("_vddRCurrMin")
	.dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$995	.dwtag  DW_TAG_member
	.dwattr $C$DW$995, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$995, DW_AT_name("vddRCurrMax")
	.dwattr $C$DW$995, DW_AT_TI_symbol_name("_vddRCurrMax")
	.dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$996	.dwtag  DW_TAG_member
	.dwattr $C$DW$996, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$996, DW_AT_name("vddWCurrMin")
	.dwattr $C$DW$996, DW_AT_TI_symbol_name("_vddWCurrMin")
	.dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$997	.dwtag  DW_TAG_member
	.dwattr $C$DW$997, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$997, DW_AT_name("vddWCurrMax")
	.dwattr $C$DW$997, DW_AT_TI_symbol_name("_vddWCurrMax")
	.dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$998	.dwtag  DW_TAG_member
	.dwattr $C$DW$998, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$998, DW_AT_name("cSizeMult")
	.dwattr $C$DW$998, DW_AT_TI_symbol_name("_cSizeMult")
	.dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$999	.dwtag  DW_TAG_member
	.dwattr $C$DW$999, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$999, DW_AT_name("eraseBlkEnable")
	.dwattr $C$DW$999, DW_AT_TI_symbol_name("_eraseBlkEnable")
	.dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1000	.dwtag  DW_TAG_member
	.dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1000, DW_AT_name("eraseGrpSize")
	.dwattr $C$DW$1000, DW_AT_TI_symbol_name("_eraseGrpSize")
	.dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1001	.dwtag  DW_TAG_member
	.dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1001, DW_AT_name("eraseGrpMult")
	.dwattr $C$DW$1001, DW_AT_TI_symbol_name("_eraseGrpMult")
	.dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1002	.dwtag  DW_TAG_member
	.dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1002, DW_AT_name("wpGrpSize")
	.dwattr $C$DW$1002, DW_AT_TI_symbol_name("_wpGrpSize")
	.dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1003	.dwtag  DW_TAG_member
	.dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1003, DW_AT_name("wpGrpEnable")
	.dwattr $C$DW$1003, DW_AT_TI_symbol_name("_wpGrpEnable")
	.dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1004	.dwtag  DW_TAG_member
	.dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1004, DW_AT_name("defaultEcc")
	.dwattr $C$DW$1004, DW_AT_TI_symbol_name("_defaultEcc")
	.dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1005	.dwtag  DW_TAG_member
	.dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1005, DW_AT_name("r2wFactor")
	.dwattr $C$DW$1005, DW_AT_TI_symbol_name("_r2wFactor")
	.dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1006	.dwtag  DW_TAG_member
	.dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1006, DW_AT_name("writeBlLen")
	.dwattr $C$DW$1006, DW_AT_TI_symbol_name("_writeBlLen")
	.dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1007	.dwtag  DW_TAG_member
	.dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1007, DW_AT_name("writeBlPartial")
	.dwattr $C$DW$1007, DW_AT_TI_symbol_name("_writeBlPartial")
	.dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1008	.dwtag  DW_TAG_member
	.dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1008, DW_AT_name("contProtApp")
	.dwattr $C$DW$1008, DW_AT_TI_symbol_name("_contProtApp")
	.dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1009	.dwtag  DW_TAG_member
	.dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1009, DW_AT_name("fileFmtGrp")
	.dwattr $C$DW$1009, DW_AT_TI_symbol_name("_fileFmtGrp")
	.dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1010	.dwtag  DW_TAG_member
	.dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1010, DW_AT_name("copyFlag")
	.dwattr $C$DW$1010, DW_AT_TI_symbol_name("_copyFlag")
	.dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1011	.dwtag  DW_TAG_member
	.dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1011, DW_AT_name("permWriteProtect")
	.dwattr $C$DW$1011, DW_AT_TI_symbol_name("_permWriteProtect")
	.dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1012	.dwtag  DW_TAG_member
	.dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1012, DW_AT_name("tmpWriteProtect")
	.dwattr $C$DW$1012, DW_AT_TI_symbol_name("_tmpWriteProtect")
	.dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1013	.dwtag  DW_TAG_member
	.dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1013, DW_AT_name("fileFmt")
	.dwattr $C$DW$1013, DW_AT_TI_symbol_name("_fileFmt")
	.dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1014	.dwtag  DW_TAG_member
	.dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1014, DW_AT_name("ecc")
	.dwattr $C$DW$1014, DW_AT_TI_symbol_name("_ecc")
	.dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1015	.dwtag  DW_TAG_member
	.dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1015, DW_AT_name("crc")
	.dwattr $C$DW$1015, DW_AT_TI_symbol_name("_crc")
	.dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$59

$C$DW$T$65	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardCsdObj")
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
$C$DW$T$66	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$66, DW_AT_address_class(0x17)

$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x06)
$C$DW$1016	.dwtag  DW_TAG_member
	.dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1016, DW_AT_name("securitySysId")
	.dwattr $C$DW$1016, DW_AT_TI_symbol_name("_securitySysId")
	.dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1017	.dwtag  DW_TAG_member
	.dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1017, DW_AT_name("securitySysVers")
	.dwattr $C$DW$1017, DW_AT_TI_symbol_name("_securitySysVers")
	.dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1018	.dwtag  DW_TAG_member
	.dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1018, DW_AT_name("maxLicenses")
	.dwattr $C$DW$1018, DW_AT_TI_symbol_name("_maxLicenses")
	.dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1019	.dwtag  DW_TAG_member
	.dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1019, DW_AT_name("xStatus")
	.dwattr $C$DW$1019, DW_AT_TI_symbol_name("_xStatus")
	.dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$60

$C$DW$T$67	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardXCsdObj")
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
$C$DW$T$68	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$68, DW_AT_address_class(0x17)

$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x1e)
$C$DW$1020	.dwtag  DW_TAG_member
	.dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1020, DW_AT_name("rca")
	.dwattr $C$DW$1020, DW_AT_TI_symbol_name("_rca")
	.dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1021	.dwtag  DW_TAG_member
	.dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1021, DW_AT_name("ST0")
	.dwattr $C$DW$1021, DW_AT_TI_symbol_name("_ST0")
	.dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1022	.dwtag  DW_TAG_member
	.dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1022, DW_AT_name("ST1")
	.dwattr $C$DW$1022, DW_AT_TI_symbol_name("_ST1")
	.dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1023	.dwtag  DW_TAG_member
	.dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1023, DW_AT_name("cardIndex")
	.dwattr $C$DW$1023, DW_AT_TI_symbol_name("_cardIndex")
	.dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1024	.dwtag  DW_TAG_member
	.dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1024, DW_AT_name("maxXfrRate")
	.dwattr $C$DW$1024, DW_AT_TI_symbol_name("_maxXfrRate")
	.dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1025	.dwtag  DW_TAG_member
	.dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1025, DW_AT_name("readAccessTime")
	.dwattr $C$DW$1025, DW_AT_TI_symbol_name("_readAccessTime")
	.dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1026	.dwtag  DW_TAG_member
	.dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1026, DW_AT_name("cardCapacity")
	.dwattr $C$DW$1026, DW_AT_TI_symbol_name("_cardCapacity")
	.dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1027	.dwtag  DW_TAG_member
	.dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1027, DW_AT_name("blockLength")
	.dwattr $C$DW$1027, DW_AT_TI_symbol_name("_blockLength")
	.dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1028	.dwtag  DW_TAG_member
	.dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1028, DW_AT_name("totalSectors")
	.dwattr $C$DW$1028, DW_AT_TI_symbol_name("_totalSectors")
	.dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1029	.dwtag  DW_TAG_member
	.dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1029, DW_AT_name("lastAddrRead")
	.dwattr $C$DW$1029, DW_AT_TI_symbol_name("_lastAddrRead")
	.dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1030	.dwtag  DW_TAG_member
	.dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1030, DW_AT_name("lastAddrWritten")
	.dwattr $C$DW$1030, DW_AT_TI_symbol_name("_lastAddrWritten")
	.dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1031	.dwtag  DW_TAG_member
	.dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$1031, DW_AT_name("cardType")
	.dwattr $C$DW$1031, DW_AT_TI_symbol_name("_cardType")
	.dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1032	.dwtag  DW_TAG_member
	.dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1032, DW_AT_name("cid")
	.dwattr $C$DW$1032, DW_AT_TI_symbol_name("_cid")
	.dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1033	.dwtag  DW_TAG_member
	.dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1033, DW_AT_name("csd")
	.dwattr $C$DW$1033, DW_AT_TI_symbol_name("_csd")
	.dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1034	.dwtag  DW_TAG_member
	.dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$1034, DW_AT_name("xcsd")
	.dwattr $C$DW$1034, DW_AT_TI_symbol_name("_xcsd")
	.dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1035	.dwtag  DW_TAG_member
	.dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1035, DW_AT_name("sdHcDetected")
	.dwattr $C$DW$1035, DW_AT_TI_symbol_name("_sdHcDetected")
	.dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1036	.dwtag  DW_TAG_member
	.dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1036, DW_AT_name("cardAtaFsOpen")
	.dwattr $C$DW$1036, DW_AT_TI_symbol_name("_cardAtaFsOpen")
	.dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1037	.dwtag  DW_TAG_member
	.dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1037, DW_AT_name("cardMscStatus")
	.dwattr $C$DW$1037, DW_AT_TI_symbol_name("_cardMscStatus")
	.dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$69

$C$DW$T$81	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardObj")
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
$C$DW$T$82	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$82, DW_AT_address_class(0x17)

$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x18)
$C$DW$1038	.dwtag  DW_TAG_member
	.dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1038, DW_AT_name("isr")
	.dwattr $C$DW$1038, DW_AT_TI_symbol_name("_isr")
	.dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$74

$C$DW$T$83	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackObj")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
$C$DW$T$84	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$84, DW_AT_address_class(0x17)

$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
$C$DW$1039	.dwtag  DW_TAG_member
	.dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1039, DW_AT_name("slice127_112")
	.dwattr $C$DW$1039, DW_AT_TI_symbol_name("_slice127_112")
	.dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1040	.dwtag  DW_TAG_member
	.dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1040, DW_AT_name("slice111_96")
	.dwattr $C$DW$1040, DW_AT_TI_symbol_name("_slice111_96")
	.dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1041	.dwtag  DW_TAG_member
	.dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1041, DW_AT_name("slice95_80")
	.dwattr $C$DW$1041, DW_AT_TI_symbol_name("_slice95_80")
	.dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1042	.dwtag  DW_TAG_member
	.dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1042, DW_AT_name("slice79_64")
	.dwattr $C$DW$1042, DW_AT_TI_symbol_name("_slice79_64")
	.dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1043	.dwtag  DW_TAG_member
	.dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1043, DW_AT_name("slice63_48")
	.dwattr $C$DW$1043, DW_AT_TI_symbol_name("_slice63_48")
	.dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1044	.dwtag  DW_TAG_member
	.dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1044, DW_AT_name("slice47_32")
	.dwattr $C$DW$1044, DW_AT_TI_symbol_name("_slice47_32")
	.dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1045	.dwtag  DW_TAG_member
	.dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1045, DW_AT_name("slice31_16")
	.dwattr $C$DW$1045, DW_AT_TI_symbol_name("_slice31_16")
	.dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1046	.dwtag  DW_TAG_member
	.dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1046, DW_AT_name("slice15_0")
	.dwattr $C$DW$1046, DW_AT_TI_symbol_name("_slice15_0")
	.dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$75

$C$DW$T$94	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDCidStruct")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)

$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
$C$DW$1047	.dwtag  DW_TAG_member
	.dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1047, DW_AT_name("slice127_112")
	.dwattr $C$DW$1047, DW_AT_TI_symbol_name("_slice127_112")
	.dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1048	.dwtag  DW_TAG_member
	.dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1048, DW_AT_name("slice111_96")
	.dwattr $C$DW$1048, DW_AT_TI_symbol_name("_slice111_96")
	.dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1049	.dwtag  DW_TAG_member
	.dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1049, DW_AT_name("slice95_80")
	.dwattr $C$DW$1049, DW_AT_TI_symbol_name("_slice95_80")
	.dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1050	.dwtag  DW_TAG_member
	.dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1050, DW_AT_name("slice79_64")
	.dwattr $C$DW$1050, DW_AT_TI_symbol_name("_slice79_64")
	.dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1051	.dwtag  DW_TAG_member
	.dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1051, DW_AT_name("slice63_48")
	.dwattr $C$DW$1051, DW_AT_TI_symbol_name("_slice63_48")
	.dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1052	.dwtag  DW_TAG_member
	.dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1052, DW_AT_name("slice47_32")
	.dwattr $C$DW$1052, DW_AT_TI_symbol_name("_slice47_32")
	.dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1053	.dwtag  DW_TAG_member
	.dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1053, DW_AT_name("slice31_16")
	.dwattr $C$DW$1053, DW_AT_TI_symbol_name("_slice31_16")
	.dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1054	.dwtag  DW_TAG_member
	.dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1054, DW_AT_name("slice15_0")
	.dwattr $C$DW$1054, DW_AT_TI_symbol_name("_slice15_0")
	.dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$76

$C$DW$T$95	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDCsdStruct")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)

$C$DW$T$98	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$98, DW_AT_byte_size(0x40)
$C$DW$1055	.dwtag  DW_TAG_member
	.dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1055, DW_AT_name("mmcRegs")
	.dwattr $C$DW$1055, DW_AT_TI_symbol_name("_mmcRegs")
	.dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1056	.dwtag  DW_TAG_member
	.dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$1056, DW_AT_name("cardObj")
	.dwattr $C$DW$1056, DW_AT_TI_symbol_name("_cardObj")
	.dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1057	.dwtag  DW_TAG_member
	.dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1057, DW_AT_name("numCardsActive")
	.dwattr $C$DW$1057, DW_AT_TI_symbol_name("_numCardsActive")
	.dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1058	.dwtag  DW_TAG_member
	.dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$1058, DW_AT_name("callBackTbl")
	.dwattr $C$DW$1058, DW_AT_TI_symbol_name("_callBackTbl")
	.dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1059	.dwtag  DW_TAG_member
	.dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$1059, DW_AT_name("opMode")
	.dwattr $C$DW$1059, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1060	.dwtag  DW_TAG_member
	.dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$1060, DW_AT_name("hDmaWrite")
	.dwattr $C$DW$1060, DW_AT_TI_symbol_name("_hDmaWrite")
	.dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1061	.dwtag  DW_TAG_member
	.dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$1061, DW_AT_name("hDmaRead")
	.dwattr $C$DW$1061, DW_AT_TI_symbol_name("_hDmaRead")
	.dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1062	.dwtag  DW_TAG_member
	.dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$1062, DW_AT_name("dmaWriteCfg")
	.dwattr $C$DW$1062, DW_AT_TI_symbol_name("_dmaWriteCfg")
	.dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1063	.dwtag  DW_TAG_member
	.dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$1063, DW_AT_name("dmaReadCfg")
	.dwattr $C$DW$1063, DW_AT_TI_symbol_name("_dmaReadCfg")
	.dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1064	.dwtag  DW_TAG_member
	.dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$1064, DW_AT_name("dataTransferCallback")
	.dwattr $C$DW$1064, DW_AT_TI_symbol_name("_dataTransferCallback")
	.dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1065	.dwtag  DW_TAG_member
	.dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1065, DW_AT_name("isCallbackSet")
	.dwattr $C$DW$1065, DW_AT_TI_symbol_name("_isCallbackSet")
	.dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1066	.dwtag  DW_TAG_member
	.dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$1066, DW_AT_name("cidSliceInfo")
	.dwattr $C$DW$1066, DW_AT_TI_symbol_name("_cidSliceInfo")
	.dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1067	.dwtag  DW_TAG_member
	.dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$1067, DW_AT_name("csdSliceInfo")
	.dwattr $C$DW$1067, DW_AT_TI_symbol_name("_csdSliceInfo")
	.dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$1067, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1068	.dwtag  DW_TAG_member
	.dwattr $C$DW$1068, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$1068, DW_AT_name("readEndianMode")
	.dwattr $C$DW$1068, DW_AT_TI_symbol_name("_readEndianMode")
	.dwattr $C$DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$1068, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1069	.dwtag  DW_TAG_member
	.dwattr $C$DW$1069, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$1069, DW_AT_name("writeEndianMode")
	.dwattr $C$DW$1069, DW_AT_TI_symbol_name("_writeEndianMode")
	.dwattr $C$DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$1069, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1070	.dwtag  DW_TAG_member
	.dwattr $C$DW$1070, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1070, DW_AT_name("blockLen")
	.dwattr $C$DW$1070, DW_AT_TI_symbol_name("_blockLen")
	.dwattr $C$DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
	.dwattr $C$DW$1070, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$98

$C$DW$T$112	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCControllerObj")
	.dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
$C$DW$T$113	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$T$113, DW_AT_address_class(0x17)
$C$DW$T$114	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdHandle")
	.dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)

$C$DW$T$99	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$99, DW_AT_byte_size(0x07)
$C$DW$1071	.dwtag  DW_TAG_member
	.dwattr $C$DW$1071, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1071, DW_AT_name("dmaEnable")
	.dwattr $C$DW$1071, DW_AT_TI_symbol_name("_dmaEnable")
	.dwattr $C$DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1071, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1072	.dwtag  DW_TAG_member
	.dwattr $C$DW$1072, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1072, DW_AT_name("dat3EdgeDetection")
	.dwattr $C$DW$1072, DW_AT_TI_symbol_name("_dat3EdgeDetection")
	.dwattr $C$DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1072, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1073	.dwtag  DW_TAG_member
	.dwattr $C$DW$1073, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1073, DW_AT_name("enableClkPin")
	.dwattr $C$DW$1073, DW_AT_TI_symbol_name("_enableClkPin")
	.dwattr $C$DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1073, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1074	.dwtag  DW_TAG_member
	.dwattr $C$DW$1074, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1074, DW_AT_name("cdiv")
	.dwattr $C$DW$1074, DW_AT_TI_symbol_name("_cdiv")
	.dwattr $C$DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1074, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1075	.dwtag  DW_TAG_member
	.dwattr $C$DW$1075, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1075, DW_AT_name("rspTimeout")
	.dwattr $C$DW$1075, DW_AT_TI_symbol_name("_rspTimeout")
	.dwattr $C$DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1075, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1076	.dwtag  DW_TAG_member
	.dwattr $C$DW$1076, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1076, DW_AT_name("dataTimeout")
	.dwattr $C$DW$1076, DW_AT_TI_symbol_name("_dataTimeout")
	.dwattr $C$DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1076, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1077	.dwtag  DW_TAG_member
	.dwattr $C$DW$1077, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1077, DW_AT_name("blockLen")
	.dwattr $C$DW$1077, DW_AT_TI_symbol_name("_blockLen")
	.dwattr $C$DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1077, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$99

$C$DW$T$119	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSetupNative")
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
$C$DW$T$120	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$T$120, DW_AT_address_class(0x17)

$C$DW$T$100	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x07)
$C$DW$1078	.dwtag  DW_TAG_member
	.dwattr $C$DW$1078, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1078, DW_AT_name("mmcctl")
	.dwattr $C$DW$1078, DW_AT_TI_symbol_name("_mmcctl")
	.dwattr $C$DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1078, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1079	.dwtag  DW_TAG_member
	.dwattr $C$DW$1079, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1079, DW_AT_name("mmcclk")
	.dwattr $C$DW$1079, DW_AT_TI_symbol_name("_mmcclk")
	.dwattr $C$DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1079, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1080	.dwtag  DW_TAG_member
	.dwattr $C$DW$1080, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1080, DW_AT_name("mmcim")
	.dwattr $C$DW$1080, DW_AT_TI_symbol_name("_mmcim")
	.dwattr $C$DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1080, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1081	.dwtag  DW_TAG_member
	.dwattr $C$DW$1081, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1081, DW_AT_name("mmctor")
	.dwattr $C$DW$1081, DW_AT_TI_symbol_name("_mmctor")
	.dwattr $C$DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1081, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1082	.dwtag  DW_TAG_member
	.dwattr $C$DW$1082, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1082, DW_AT_name("mmctod")
	.dwattr $C$DW$1082, DW_AT_TI_symbol_name("_mmctod")
	.dwattr $C$DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1082, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1083	.dwtag  DW_TAG_member
	.dwattr $C$DW$1083, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1083, DW_AT_name("mmcblen")
	.dwattr $C$DW$1083, DW_AT_TI_symbol_name("_mmcblen")
	.dwattr $C$DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1083, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1084	.dwtag  DW_TAG_member
	.dwattr $C$DW$1084, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$1084, DW_AT_name("mmcnblk")
	.dwattr $C$DW$1084, DW_AT_TI_symbol_name("_mmcnblk")
	.dwattr $C$DW$1084, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1084, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$100

$C$DW$T$121	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCConfig")
	.dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
$C$DW$T$122	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
	.dwattr $C$DW$T$122, DW_AT_address_class(0x17)

$C$DW$T$101	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$101, DW_AT_byte_size(0x05)
$C$DW$1085	.dwtag  DW_TAG_member
	.dwattr $C$DW$1085, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1085, DW_AT_name("pingPongEnable")
	.dwattr $C$DW$1085, DW_AT_TI_symbol_name("_pingPongEnable")
	.dwattr $C$DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1085, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1086	.dwtag  DW_TAG_member
	.dwattr $C$DW$1086, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$1086, DW_AT_name("autoMode")
	.dwattr $C$DW$1086, DW_AT_TI_symbol_name("_autoMode")
	.dwattr $C$DW$1086, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1086, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1087	.dwtag  DW_TAG_member
	.dwattr $C$DW$1087, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$1087, DW_AT_name("burstLen")
	.dwattr $C$DW$1087, DW_AT_TI_symbol_name("_burstLen")
	.dwattr $C$DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1087, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1088	.dwtag  DW_TAG_member
	.dwattr $C$DW$1088, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$1088, DW_AT_name("dmaInt")
	.dwattr $C$DW$1088, DW_AT_TI_symbol_name("_dmaInt")
	.dwattr $C$DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1088, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1089	.dwtag  DW_TAG_member
	.dwattr $C$DW$1089, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1089, DW_AT_name("chanDir")
	.dwattr $C$DW$1089, DW_AT_TI_symbol_name("_chanDir")
	.dwattr $C$DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1089, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$101

$C$DW$T$123	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdDmaConfig")
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
$C$DW$T$124	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$T$124, DW_AT_address_class(0x17)

$C$DW$T$104	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$104, DW_AT_byte_size(0x48)
$C$DW$1090	.dwtag  DW_TAG_member
	.dwattr $C$DW$1090, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1090, DW_AT_name("EBSR")
	.dwattr $C$DW$1090, DW_AT_TI_symbol_name("_EBSR")
	.dwattr $C$DW$1090, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1090, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1091	.dwtag  DW_TAG_member
	.dwattr $C$DW$1091, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1091, DW_AT_name("RSVD0")
	.dwattr $C$DW$1091, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$1091, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1091, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1092	.dwtag  DW_TAG_member
	.dwattr $C$DW$1092, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1092, DW_AT_name("PCGCR1")
	.dwattr $C$DW$1092, DW_AT_TI_symbol_name("_PCGCR1")
	.dwattr $C$DW$1092, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1092, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1093	.dwtag  DW_TAG_member
	.dwattr $C$DW$1093, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1093, DW_AT_name("PCGCR2")
	.dwattr $C$DW$1093, DW_AT_TI_symbol_name("_PCGCR2")
	.dwattr $C$DW$1093, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1093, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1094	.dwtag  DW_TAG_member
	.dwattr $C$DW$1094, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1094, DW_AT_name("PSRCR")
	.dwattr $C$DW$1094, DW_AT_TI_symbol_name("_PSRCR")
	.dwattr $C$DW$1094, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1094, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1095	.dwtag  DW_TAG_member
	.dwattr $C$DW$1095, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1095, DW_AT_name("PRCR")
	.dwattr $C$DW$1095, DW_AT_TI_symbol_name("_PRCR")
	.dwattr $C$DW$1095, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1095, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1096	.dwtag  DW_TAG_member
	.dwattr $C$DW$1096, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$1096, DW_AT_name("RSVD1")
	.dwattr $C$DW$1096, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$1096, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1096, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1097	.dwtag  DW_TAG_member
	.dwattr $C$DW$1097, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1097, DW_AT_name("TIAFR")
	.dwattr $C$DW$1097, DW_AT_TI_symbol_name("_TIAFR")
	.dwattr $C$DW$1097, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1097, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1098	.dwtag  DW_TAG_member
	.dwattr $C$DW$1098, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1098, DW_AT_name("RSVD2")
	.dwattr $C$DW$1098, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$1098, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$1098, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1099	.dwtag  DW_TAG_member
	.dwattr $C$DW$1099, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1099, DW_AT_name("ODSCR")
	.dwattr $C$DW$1099, DW_AT_TI_symbol_name("_ODSCR")
	.dwattr $C$DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1099, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1100	.dwtag  DW_TAG_member
	.dwattr $C$DW$1100, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1100, DW_AT_name("PDINHIBR1")
	.dwattr $C$DW$1100, DW_AT_TI_symbol_name("_PDINHIBR1")
	.dwattr $C$DW$1100, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$1100, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1101	.dwtag  DW_TAG_member
	.dwattr $C$DW$1101, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1101, DW_AT_name("PDINHIBR2")
	.dwattr $C$DW$1101, DW_AT_TI_symbol_name("_PDINHIBR2")
	.dwattr $C$DW$1101, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1101, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1102	.dwtag  DW_TAG_member
	.dwattr $C$DW$1102, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1102, DW_AT_name("PDINHIBR3")
	.dwattr $C$DW$1102, DW_AT_TI_symbol_name("_PDINHIBR3")
	.dwattr $C$DW$1102, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$1102, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1103	.dwtag  DW_TAG_member
	.dwattr $C$DW$1103, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1103, DW_AT_name("DMA0CESR1")
	.dwattr $C$DW$1103, DW_AT_TI_symbol_name("_DMA0CESR1")
	.dwattr $C$DW$1103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1103, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1104	.dwtag  DW_TAG_member
	.dwattr $C$DW$1104, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1104, DW_AT_name("DMA0CESR2")
	.dwattr $C$DW$1104, DW_AT_TI_symbol_name("_DMA0CESR2")
	.dwattr $C$DW$1104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$1104, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1105	.dwtag  DW_TAG_member
	.dwattr $C$DW$1105, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1105, DW_AT_name("DMA1CESR1")
	.dwattr $C$DW$1105, DW_AT_TI_symbol_name("_DMA1CESR1")
	.dwattr $C$DW$1105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1105, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1106	.dwtag  DW_TAG_member
	.dwattr $C$DW$1106, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1106, DW_AT_name("DMA1CESR2")
	.dwattr $C$DW$1106, DW_AT_TI_symbol_name("_DMA1CESR2")
	.dwattr $C$DW$1106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$1106, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1107	.dwtag  DW_TAG_member
	.dwattr $C$DW$1107, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1107, DW_AT_name("SDRAMCCR")
	.dwattr $C$DW$1107, DW_AT_TI_symbol_name("_SDRAMCCR")
	.dwattr $C$DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$1107, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1108	.dwtag  DW_TAG_member
	.dwattr $C$DW$1108, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1108, DW_AT_name("CCR2")
	.dwattr $C$DW$1108, DW_AT_TI_symbol_name("_CCR2")
	.dwattr $C$DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$1108, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1109	.dwtag  DW_TAG_member
	.dwattr $C$DW$1109, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1109, DW_AT_name("CGCR1")
	.dwattr $C$DW$1109, DW_AT_TI_symbol_name("_CGCR1")
	.dwattr $C$DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1109, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1110	.dwtag  DW_TAG_member
	.dwattr $C$DW$1110, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1110, DW_AT_name("CGICR")
	.dwattr $C$DW$1110, DW_AT_TI_symbol_name("_CGICR")
	.dwattr $C$DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$1110, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1111	.dwtag  DW_TAG_member
	.dwattr $C$DW$1111, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1111, DW_AT_name("CGCR2")
	.dwattr $C$DW$1111, DW_AT_TI_symbol_name("_CGCR2")
	.dwattr $C$DW$1111, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$1111, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1112	.dwtag  DW_TAG_member
	.dwattr $C$DW$1112, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1112, DW_AT_name("CGOCR")
	.dwattr $C$DW$1112, DW_AT_TI_symbol_name("_CGOCR")
	.dwattr $C$DW$1112, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$1112, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1113	.dwtag  DW_TAG_member
	.dwattr $C$DW$1113, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1113, DW_AT_name("CCSSR")
	.dwattr $C$DW$1113, DW_AT_TI_symbol_name("_CCSSR")
	.dwattr $C$DW$1113, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1113, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1114	.dwtag  DW_TAG_member
	.dwattr $C$DW$1114, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1114, DW_AT_name("RSVD3")
	.dwattr $C$DW$1114, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$1114, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$1114, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1115	.dwtag  DW_TAG_member
	.dwattr $C$DW$1115, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1115, DW_AT_name("ECDR")
	.dwattr $C$DW$1115, DW_AT_TI_symbol_name("_ECDR")
	.dwattr $C$DW$1115, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$1115, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1116	.dwtag  DW_TAG_member
	.dwattr $C$DW$1116, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1116, DW_AT_name("RSVD4")
	.dwattr $C$DW$1116, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$1116, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1117	.dwtag  DW_TAG_member
	.dwattr $C$DW$1117, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1117, DW_AT_name("RAMSLPMDCNTLR1")
	.dwattr $C$DW$1117, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
	.dwattr $C$DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1117, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1118	.dwtag  DW_TAG_member
	.dwattr $C$DW$1118, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1118, DW_AT_name("RSVD5")
	.dwattr $C$DW$1118, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$1118, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1119	.dwtag  DW_TAG_member
	.dwattr $C$DW$1119, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1119, DW_AT_name("RAMSLPMDCNTLR2")
	.dwattr $C$DW$1119, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
	.dwattr $C$DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1119, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1120	.dwtag  DW_TAG_member
	.dwattr $C$DW$1120, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1120, DW_AT_name("RAMSLPMDCNTLR3")
	.dwattr $C$DW$1120, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
	.dwattr $C$DW$1120, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$1120, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1121	.dwtag  DW_TAG_member
	.dwattr $C$DW$1121, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1121, DW_AT_name("RAMSLPMDCNTLR4")
	.dwattr $C$DW$1121, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
	.dwattr $C$DW$1121, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1121, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1122	.dwtag  DW_TAG_member
	.dwattr $C$DW$1122, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1122, DW_AT_name("RAMSLPMDCNTLR5")
	.dwattr $C$DW$1122, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
	.dwattr $C$DW$1122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$1122, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1123	.dwtag  DW_TAG_member
	.dwattr $C$DW$1123, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1123, DW_AT_name("RSVD6")
	.dwattr $C$DW$1123, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$1123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$1123, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1124	.dwtag  DW_TAG_member
	.dwattr $C$DW$1124, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1124, DW_AT_name("DMAIFR")
	.dwattr $C$DW$1124, DW_AT_TI_symbol_name("_DMAIFR")
	.dwattr $C$DW$1124, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1124, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1125	.dwtag  DW_TAG_member
	.dwattr $C$DW$1125, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1125, DW_AT_name("DMAIER")
	.dwattr $C$DW$1125, DW_AT_TI_symbol_name("_DMAIER")
	.dwattr $C$DW$1125, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$1125, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1126	.dwtag  DW_TAG_member
	.dwattr $C$DW$1126, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1126, DW_AT_name("USBSCR")
	.dwattr $C$DW$1126, DW_AT_TI_symbol_name("_USBSCR")
	.dwattr $C$DW$1126, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$1126, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1127	.dwtag  DW_TAG_member
	.dwattr $C$DW$1127, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1127, DW_AT_name("ESCR")
	.dwattr $C$DW$1127, DW_AT_TI_symbol_name("_ESCR")
	.dwattr $C$DW$1127, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr $C$DW$1127, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1128	.dwtag  DW_TAG_member
	.dwattr $C$DW$1128, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1128, DW_AT_name("RSVD7")
	.dwattr $C$DW$1128, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$1128, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1128, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1129	.dwtag  DW_TAG_member
	.dwattr $C$DW$1129, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1129, DW_AT_name("DMA2CESR1")
	.dwattr $C$DW$1129, DW_AT_TI_symbol_name("_DMA2CESR1")
	.dwattr $C$DW$1129, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$1129, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1130	.dwtag  DW_TAG_member
	.dwattr $C$DW$1130, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1130, DW_AT_name("DMA2CESR2")
	.dwattr $C$DW$1130, DW_AT_TI_symbol_name("_DMA2CESR2")
	.dwattr $C$DW$1130, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr $C$DW$1130, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1131	.dwtag  DW_TAG_member
	.dwattr $C$DW$1131, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1131, DW_AT_name("DMA3CESR1")
	.dwattr $C$DW$1131, DW_AT_TI_symbol_name("_DMA3CESR1")
	.dwattr $C$DW$1131, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1131, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1132	.dwtag  DW_TAG_member
	.dwattr $C$DW$1132, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1132, DW_AT_name("DMA3CESR2")
	.dwattr $C$DW$1132, DW_AT_TI_symbol_name("_DMA3CESR2")
	.dwattr $C$DW$1132, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$1132, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1133	.dwtag  DW_TAG_member
	.dwattr $C$DW$1133, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1133, DW_AT_name("CLKSTOP")
	.dwattr $C$DW$1133, DW_AT_TI_symbol_name("_CLKSTOP")
	.dwattr $C$DW$1133, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$1133, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1134	.dwtag  DW_TAG_member
	.dwattr $C$DW$1134, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$1134, DW_AT_name("RSVD8")
	.dwattr $C$DW$1134, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$1134, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$1134, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1135	.dwtag  DW_TAG_member
	.dwattr $C$DW$1135, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1135, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$1135, DW_AT_TI_symbol_name("_DIEIDR0")
	.dwattr $C$DW$1135, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1135, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1136	.dwtag  DW_TAG_member
	.dwattr $C$DW$1136, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1136, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$1136, DW_AT_TI_symbol_name("_DIEIDR1")
	.dwattr $C$DW$1136, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$1136, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1137	.dwtag  DW_TAG_member
	.dwattr $C$DW$1137, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1137, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$1137, DW_AT_TI_symbol_name("_DIEIDR2")
	.dwattr $C$DW$1137, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$1137, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1138	.dwtag  DW_TAG_member
	.dwattr $C$DW$1138, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1138, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$1138, DW_AT_TI_symbol_name("_DIEIDR3")
	.dwattr $C$DW$1138, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$1138, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1139	.dwtag  DW_TAG_member
	.dwattr $C$DW$1139, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1139, DW_AT_name("DIEIDR4")
	.dwattr $C$DW$1139, DW_AT_TI_symbol_name("_DIEIDR4")
	.dwattr $C$DW$1139, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1139, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1140	.dwtag  DW_TAG_member
	.dwattr $C$DW$1140, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1140, DW_AT_name("DIEIDR5")
	.dwattr $C$DW$1140, DW_AT_TI_symbol_name("_DIEIDR5")
	.dwattr $C$DW$1140, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$1140, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1141	.dwtag  DW_TAG_member
	.dwattr $C$DW$1141, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1141, DW_AT_name("DIEIDR6")
	.dwattr $C$DW$1141, DW_AT_TI_symbol_name("_DIEIDR6")
	.dwattr $C$DW$1141, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$1141, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1142	.dwtag  DW_TAG_member
	.dwattr $C$DW$1142, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1142, DW_AT_name("DIEIDR7")
	.dwattr $C$DW$1142, DW_AT_TI_symbol_name("_DIEIDR7")
	.dwattr $C$DW$1142, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$1142, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$104

$C$DW$T$125	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
	.dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
$C$DW$1143	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1143, DW_AT_type(*$C$DW$T$125)
$C$DW$1144	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$1144, DW_AT_type(*$C$DW$1143)
$C$DW$T$126	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$1144)
$C$DW$T$127	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$127, DW_AT_address_class(0x10)
$C$DW$T$128	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
	.dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)

$C$DW$T$106	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$106, DW_AT_byte_size(0x4c)
$C$DW$1145	.dwtag  DW_TAG_member
	.dwattr $C$DW$1145, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1145, DW_AT_name("IER0")
	.dwattr $C$DW$1145, DW_AT_TI_symbol_name("_IER0")
	.dwattr $C$DW$1145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1145, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1146	.dwtag  DW_TAG_member
	.dwattr $C$DW$1146, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1146, DW_AT_name("IFR0")
	.dwattr $C$DW$1146, DW_AT_TI_symbol_name("_IFR0")
	.dwattr $C$DW$1146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1146, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1147	.dwtag  DW_TAG_member
	.dwattr $C$DW$1147, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1147, DW_AT_name("ST0_55")
	.dwattr $C$DW$1147, DW_AT_TI_symbol_name("_ST0_55")
	.dwattr $C$DW$1147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1147, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1148	.dwtag  DW_TAG_member
	.dwattr $C$DW$1148, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1148, DW_AT_name("ST1_55")
	.dwattr $C$DW$1148, DW_AT_TI_symbol_name("_ST1_55")
	.dwattr $C$DW$1148, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1148, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1149	.dwtag  DW_TAG_member
	.dwattr $C$DW$1149, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$1149, DW_AT_name("ST3_55")
	.dwattr $C$DW$1149, DW_AT_TI_symbol_name("_ST3_55")
	.dwattr $C$DW$1149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1149, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$1150	.dwtag  DW_TAG_member
	.dwattr $C$DW$1150, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$1150, DW_AT_name("RSVD0")
