;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Sat Sep 22 03:36:56 2018                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_usb.c")

	.dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
$C$DW$394	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB0"), DW_AT_const_value(0x00)
$C$DW$395	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB1"), DW_AT_const_value(0x01)
$C$DW$396	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB2"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$67

$C$DW$T$68	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDevNum")
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)

$C$DW$T$69	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x01)
$C$DW$397	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OPMODE_POLLED"), DW_AT_const_value(0x00)
$C$DW$398	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OPMODE_DMA"), DW_AT_const_value(0x01)
$C$DW$399	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OPMODE_DMA_TXONLY"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$69

$C$DW$T$70	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbOpMode")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)

$C$DW$T$87	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x01)
$C$DW$400	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_FALSE"), DW_AT_const_value(0x00)
$C$DW$401	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_TRUE"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$87

$C$DW$T$88	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBoolean")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)

$C$DW$T$91	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
$C$DW$402	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_UNKNOWN_SPEED"), DW_AT_const_value(0x00)
$C$DW$403	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_FULL_SPEED"), DW_AT_const_value(0x02)
$C$DW$404	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_HIGH_SPEED"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$91

$C$DW$T$92	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBusSpeed")
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
$C$DW$T$129	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$T$129, DW_AT_address_class(0x17)

$C$DW$T$93	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$93, DW_AT_byte_size(0x01)
$C$DW$405	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_IDLE"), DW_AT_const_value(0x00)
$C$DW$406	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_STATUS_IN"), DW_AT_const_value(0x01)
$C$DW$407	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_TX"), DW_AT_const_value(0x02)
$C$DW$408	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_RX"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$93

$C$DW$T$94	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEp0State")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)

$C$DW$T$95	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
$C$DW$409	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
$C$DW$410	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$95

$C$DW$T$96	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
	.dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)

$C$DW$T$107	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$107, DW_AT_byte_size(0x01)
$C$DW$411	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
$C$DW$412	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
$C$DW$413	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
$C$DW$414	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
$C$DW$415	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
$C$DW$416	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
$C$DW$417	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
$C$DW$418	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
$C$DW$419	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
$C$DW$420	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
$C$DW$421	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
$C$DW$422	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
$C$DW$423	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
$C$DW$424	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
$C$DW$425	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
$C$DW$426	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
	.dwendtag $C$DW$T$107

$C$DW$T$108	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)

$C$DW$T$109	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
$C$DW$427	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
$C$DW$428	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
$C$DW$429	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
$C$DW$430	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
$C$DW$431	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$109

$C$DW$T$110	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$432, DW_AT_name("TXFUNCADDR")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_TXFUNCADDR")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$433, DW_AT_name("TXHUBADDR_TXHUBPORT")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_TXHUBADDR_TXHUBPORT")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$434, DW_AT_name("RSVD0")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$435, DW_AT_name("RXFUNCADDR")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_RXFUNCADDR")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$436, DW_AT_name("RXHUBADDR_RXHUBPORT")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_RXHUBADDR_RXHUBPORT")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$437, DW_AT_name("RSVD36")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_RSVD36")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$22

$C$DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEptrgRegs")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)

$C$DW$T$40	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x28)
$C$DW$438	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$438, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$40


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$439, DW_AT_name("TXMAXP")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_TXMAXP")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$440, DW_AT_name("PERI_TXCSR")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_PERI_TXCSR")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$441, DW_AT_name("RSVD0")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$442, DW_AT_name("RXMAXP")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_RXMAXP")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$443, DW_AT_name("PERI_RXCSR")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_PERI_RXCSR")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$444, DW_AT_name("RSVD1")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$445, DW_AT_name("RXCOUNT")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_RXCOUNT")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$446, DW_AT_name("RSVD41")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_RSVD41")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$24

$C$DW$T$42	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpcsrRegs")
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)

$C$DW$T$43	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x40)
$C$DW$447	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$447, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$43


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$448, DW_AT_name("TXGCR1")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_TXGCR1")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$449, DW_AT_name("TXGCR2")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_TXGCR2")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$450, DW_AT_name("RSVD0")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$451, DW_AT_name("RXGCR1")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_RXGCR1")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$452, DW_AT_name("RXGCR2")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_RXGCR2")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$453, DW_AT_name("RSVD1")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$454, DW_AT_name("RXHPCR1A")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_RXHPCR1A")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$455, DW_AT_name("RXHPCR2A")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_RXHPCR2A")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$456, DW_AT_name("RSVD2")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$457, DW_AT_name("RXHPCR1B")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_RXHPCR1B")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$458, DW_AT_name("RXHPCR2B")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_RXHPCR2B")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$459, DW_AT_name("RSVD46")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_RSVD46")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$27

$C$DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbChannelRegs")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)

$C$DW$T$47	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x80)
$C$DW$460	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$460, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$47


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$461, DW_AT_name("ENTRYLSW")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_ENTRYLSW")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$462, DW_AT_name("ENTRYMSW")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_ENTRYMSW")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$463, DW_AT_name("RSVD49")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_RSVD49")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$28

$C$DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbCdmaschetblwordRegs")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)

$C$DW$T$51	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
$C$DW$464	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$464, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$51


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$465, DW_AT_name("QMEMRBASE1")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_QMEMRBASE1")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$466, DW_AT_name("QMEMRBASE2")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_QMEMRBASE2")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$467, DW_AT_name("RSVD0")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$468, DW_AT_name("QMEMRCTRL1")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_QMEMRCTRL1")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$469, DW_AT_name("QMEMRCTRL2")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_QMEMRCTRL2")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$470, DW_AT_name("RSVD63")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_RSVD63")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$30

$C$DW$T$56	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmmemregrRegs")
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)

$C$DW$T$57	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x100)
$C$DW$471	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$471, DW_AT_upper_bound(0x0f)
	.dwendtag $C$DW$T$57


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$472, DW_AT_name("RSVD0")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$473, DW_AT_name("CTRL1D")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_CTRL1D")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$474, DW_AT_name("CTRL2D")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_CTRL2D")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$475, DW_AT_name("RSVD65")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_RSVD65")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$32

$C$DW$T$59	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnRegs")
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)

$C$DW$T$60	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x400)
$C$DW$476	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$476, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$60


$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$477, DW_AT_name("QSTATA")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_QSTATA")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$478, DW_AT_name("RSVD0")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$479, DW_AT_name("QSTAT1B")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_QSTAT1B")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$480, DW_AT_name("QSTAT2B")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_QSTAT2B")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$481, DW_AT_name("RSVD1")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$482, DW_AT_name("QSTAT1C")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_QSTAT1C")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$483, DW_AT_name("RSVD67")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_RSVD67")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$34

$C$DW$T$62	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnsRegs")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)

$C$DW$T$63	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x400)
$C$DW$484	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$484, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$63


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x6c00)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$485, DW_AT_name("REVID1")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_REVID1")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$486, DW_AT_name("REVID2")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_REVID2")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$487, DW_AT_name("RSVD0")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$488, DW_AT_name("CTRLR")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_CTRLR")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$489, DW_AT_name("RSVD1")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$490, DW_AT_name("STATR")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_STATR")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$491, DW_AT_name("RSVD2")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$492, DW_AT_name("EMUR")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_EMUR")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$493, DW_AT_name("RSVD3")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$494, DW_AT_name("MODE1")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_MODE1")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$495, DW_AT_name("MODE2")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_MODE2")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$496, DW_AT_name("RSVD4")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$497, DW_AT_name("AUTOREQ")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_AUTOREQ")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$498, DW_AT_name("RSVD5")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$499, DW_AT_name("SPRFIXTIME1")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_SPRFIXTIME1")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$500, DW_AT_name("SPRFIXTIME2")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_SPRFIXTIME2")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$501, DW_AT_name("RSVD6")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$502, DW_AT_name("TEARDOWN1")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_TEARDOWN1")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$503, DW_AT_name("TEARDOWN2")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_TEARDOWN2")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$504, DW_AT_name("RSVD7")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$505, DW_AT_name("INTSRCR1")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_INTSRCR1")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$506, DW_AT_name("INTSRCR2")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_INTSRCR2")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$507, DW_AT_name("RSVD8")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$508, DW_AT_name("INTSETR1")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_INTSETR1")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$509, DW_AT_name("INTSETR2")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_INTSETR2")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$510, DW_AT_name("RSVD9")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$511, DW_AT_name("INTCLRR1")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_INTCLRR1")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$512, DW_AT_name("INTCLRR2")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_INTCLRR2")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$513, DW_AT_name("RSVD10")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$514, DW_AT_name("INTMSKR1")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_INTMSKR1")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$515, DW_AT_name("INTMSKR2")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_INTMSKR2")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$516, DW_AT_name("RSVD11")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$517, DW_AT_name("INTMSKSETR1")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_INTMSKSETR1")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$518, DW_AT_name("INTMSKSETR2")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_INTMSKSETR2")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$519, DW_AT_name("RSVD12")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$520, DW_AT_name("INTMSKCLRR1")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_INTMSKCLRR1")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$521, DW_AT_name("INTMSKCLRR2")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_INTMSKCLRR2")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$522, DW_AT_name("RSVD13")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$523, DW_AT_name("INTMASKEDR1")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_INTMASKEDR1")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$524, DW_AT_name("INTMASKEDR2")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_INTMASKEDR2")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$525, DW_AT_name("RSVD14")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_RSVD14")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$526, DW_AT_name("EOIR")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_EOIR")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$527, DW_AT_name("RSVD15")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_RSVD15")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$528, DW_AT_name("INTVECTR1")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_INTVECTR1")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$529, DW_AT_name("INTVECTR2")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_INTVECTR2")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$530, DW_AT_name("RSVD16")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_RSVD16")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$531, DW_AT_name("GREP1SZR1")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_GREP1SZR1")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$532, DW_AT_name("GREP1SZR2")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_GREP1SZR2")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$533, DW_AT_name("RSVD17")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_RSVD17")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$534, DW_AT_name("GREP2SZR1")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_GREP2SZR1")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$535, DW_AT_name("GREP2SZR2")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_GREP2SZR2")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$536, DW_AT_name("RSVD18")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_RSVD18")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$537, DW_AT_name("GREP3SZR1")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_GREP3SZR1")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$538, DW_AT_name("GREP3SZR2")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_GREP3SZR2")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$539, DW_AT_name("RSVD19")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_RSVD19")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$540, DW_AT_name("GREP4SZR1")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_GREP4SZR1")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$541, DW_AT_name("GREP4SZR2")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_GREP4SZR2")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$542, DW_AT_name("RSVD20")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_RSVD20")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$543, DW_AT_name("FADDR_POWER")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_FADDR_POWER")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x401]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$544, DW_AT_name("INTRTX")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_INTRTX")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x402]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$545, DW_AT_name("RSVD21")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_RSVD21")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x403]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$546, DW_AT_name("INTRRX")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_INTRRX")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$547, DW_AT_name("INTRTXE")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_INTRTXE")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$548, DW_AT_name("RSVD22")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_RSVD22")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$549, DW_AT_name("INTRRXE")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_INTRRXE")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x409]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$550, DW_AT_name("INTRUSB_INTRUSBE")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_INTRUSB_INTRUSBE")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x40a]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$551, DW_AT_name("RSVD23")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_RSVD23")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x40b]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$552, DW_AT_name("FRAME")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_FRAME")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x40d]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$553, DW_AT_name("INDEX_TESTMODE")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_INDEX_TESTMODE")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x40e]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$554, DW_AT_name("RSVD24")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_RSVD24")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x40f]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$555, DW_AT_name("TXMAXP_INDX")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_TXMAXP_INDX")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x411]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$556, DW_AT_name("PERI_CSR0_INDX")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_PERI_CSR0_INDX")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x412]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$557, DW_AT_name("RSVD25")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_RSVD25")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x413]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$558, DW_AT_name("RXMAXP_INDX")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_RXMAXP_INDX")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x415]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$559, DW_AT_name("PERI_RXCSR_INDX")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_PERI_RXCSR_INDX")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x416]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$560, DW_AT_name("RSVD26")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_RSVD26")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x417]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$561, DW_AT_name("COUNT0_INDX")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_COUNT0_INDX")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x419]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$562, DW_AT_name("RSVD27")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_RSVD27")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x41a]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$563, DW_AT_name("CONFIGDATA_INDX")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_CONFIGDATA_INDX")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x41e]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$564, DW_AT_name("RSVD28")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_RSVD28")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x41f]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$565, DW_AT_name("FIFO0R1")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_FIFO0R1")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x421]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$566, DW_AT_name("FIFO0R2")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_FIFO0R2")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x422]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$567, DW_AT_name("RSVD29")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_RSVD29")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x423]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$568, DW_AT_name("FIFO1R1")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_FIFO1R1")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x425]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$569, DW_AT_name("FIFO1R2")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("_FIFO1R2")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x426]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$570, DW_AT_name("RSVD30")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("_RSVD30")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x427]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$571, DW_AT_name("FIFO2R1")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_FIFO2R1")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x429]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$572, DW_AT_name("FIFO2R2")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_FIFO2R2")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x42a]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$573, DW_AT_name("RSVD31")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_RSVD31")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x42b]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$574, DW_AT_name("FIFO3R1")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_FIFO3R1")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x42d]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$575, DW_AT_name("FIFO3R2")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_FIFO3R2")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x42e]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$576, DW_AT_name("RSVD32")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_RSVD32")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x42f]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$577, DW_AT_name("FIFO4R1")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_FIFO4R1")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x431]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$578, DW_AT_name("FIFO4R2")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_FIFO4R2")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x432]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$579, DW_AT_name("RSVD33")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_RSVD33")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x433]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$580, DW_AT_name("DEVCTL")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_DEVCTL")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x461]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$581, DW_AT_name("TXFIFOSZ_RXFIFOSZ")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_TXFIFOSZ_RXFIFOSZ")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x462]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$582, DW_AT_name("RSVD34")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_RSVD34")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x463]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$583, DW_AT_name("TXFIFOADDR")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("_TXFIFOADDR")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x465]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$584, DW_AT_name("RXFIFOADDR")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("_RXFIFOADDR")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x466]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$585, DW_AT_name("RSVD35")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("_RSVD35")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x467]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$586, DW_AT_name("HWVERS")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("_HWVERS")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x46d]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$587, DW_AT_name("RSVD37")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("_RSVD37")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$588, DW_AT_name("EPTRG")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("_EPTRG")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x481]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$589, DW_AT_name("RSVD38")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("_RSVD38")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a9]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$590, DW_AT_name("PERI_CSR0")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("_PERI_CSR0")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x502]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$591, DW_AT_name("RSVD39")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("_RSVD39")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x503]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$592, DW_AT_name("COUNT0")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("_COUNT0")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x509]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$593, DW_AT_name("RSVD40")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("_RSVD40")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x50a]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$594, DW_AT_name("CONFIGDATA")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("_CONFIGDATA")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x50e]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$595, DW_AT_name("RSVD42")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("_RSVD42")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x50f]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$596, DW_AT_name("EPCSR")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("_EPCSR")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x511]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$597, DW_AT_name("RSVD43")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("_RSVD43")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x551]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$598, DW_AT_name("DMAREVID1")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("_DMAREVID1")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x1000]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$599, DW_AT_name("DMAREVID2")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("_DMAREVID2")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x1001]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$600, DW_AT_name("RSVD44")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("_RSVD44")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x1002]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$601, DW_AT_name("TDFDQ")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("_TDFDQ")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x1004]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$602, DW_AT_name("RSVD45")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("_RSVD45")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x1005]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$603, DW_AT_name("DMAEMU")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("_DMAEMU")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x1008]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$604, DW_AT_name("RSVD47")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("_RSVD47")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x1009]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$605, DW_AT_name("CHANNEL")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("_CHANNEL")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x1800]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$606, DW_AT_name("RSVD48")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("_RSVD48")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x1880]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$607, DW_AT_name("DMA_SCHED_CTRL1")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL1")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x2000]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$608, DW_AT_name("DMA_SCHED_CTRL2")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL2")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x2001]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$609, DW_AT_name("RSVD50")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("_RSVD50")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x2002]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$610, DW_AT_name("CDMASCHETBLWORD")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("_CDMASCHETBLWORD")
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x2800]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$611, DW_AT_name("RSVD51")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("_RSVD51")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x2900]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$612, DW_AT_name("QMGRREVID1")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("_QMGRREVID1")
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x4000]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$613, DW_AT_name("QMGRREVID2")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("_QMGRREVID2")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x4001]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$614, DW_AT_name("RSVD52")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("_RSVD52")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x4002]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$615, DW_AT_name("DIVERSION1")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("_DIVERSION1")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x4008]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$616, DW_AT_name("DIVERSION2")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("_DIVERSION2")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x4009]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$617, DW_AT_name("RSVD53")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("_RSVD53")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x400a]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$618, DW_AT_name("FDBSC0")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("_FDBSC0")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x4020]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$619, DW_AT_name("FDBSC1")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("_FDBSC1")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x4021]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$620, DW_AT_name("RSVD54")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("_RSVD54")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x4022]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$621, DW_AT_name("FDBSC2")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("_FDBSC2")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x4024]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$622, DW_AT_name("FDBSC3")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("_FDBSC3")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x4025]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$623, DW_AT_name("RSVD55")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("_RSVD55")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4026]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$624, DW_AT_name("FDBSC4")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("_FDBSC4")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x4028]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$625, DW_AT_name("FDBSC5")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("_FDBSC5")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x4029]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$626, DW_AT_name("RSVD56")
	.dwattr $C$DW$626, DW_AT_TI_symbol_name("_RSVD56")
	.dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x402a]
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$627	.dwtag  DW_TAG_member
	.dwattr $C$DW$627, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$627, DW_AT_name("FDBSC6")
	.dwattr $C$DW$627, DW_AT_TI_symbol_name("_FDBSC6")
	.dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x402c]
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$628	.dwtag  DW_TAG_member
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$628, DW_AT_name("FDBSC7")
	.dwattr $C$DW$628, DW_AT_TI_symbol_name("_FDBSC7")
	.dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x402d]
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$629	.dwtag  DW_TAG_member
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$629, DW_AT_name("RSVD57")
	.dwattr $C$DW$629, DW_AT_TI_symbol_name("_RSVD57")
	.dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x402e]
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$630, DW_AT_name("LRAM0BASE1")
	.dwattr $C$DW$630, DW_AT_TI_symbol_name("_LRAM0BASE1")
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x4080]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$631, DW_AT_name("LRAM0BASE2")
	.dwattr $C$DW$631, DW_AT_TI_symbol_name("_LRAM0BASE2")
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x4081]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$632, DW_AT_name("RSVD58")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("_RSVD58")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x4082]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$633, DW_AT_name("LRAM0SIZE")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("_LRAM0SIZE")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x4084]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$634, DW_AT_name("RSVD59")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("_RSVD59")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x4085]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$635, DW_AT_name("LRAM1BASE1")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("_LRAM1BASE1")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x4088]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$636, DW_AT_name("LRAM1BASE2")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("_LRAM1BASE2")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x4089]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$637, DW_AT_name("RSVD60")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("_RSVD60")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x408a]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$638, DW_AT_name("PEND0")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("_PEND0")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4090]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$639, DW_AT_name("PEND1")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("_PEND1")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x4091]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$640, DW_AT_name("RSVD61")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("_RSVD61")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4092]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$641, DW_AT_name("PEND2")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("_PEND2")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x4094]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$642, DW_AT_name("PEND3")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("_PEND3")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x4095]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$643, DW_AT_name("RSVD62")
	.dwattr $C$DW$643, DW_AT_TI_symbol_name("_RSVD62")
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x4096]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$644, DW_AT_name("PEND4")
	.dwattr $C$DW$644, DW_AT_TI_symbol_name("_PEND4")
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x4098]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$645, DW_AT_name("PEND5")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("_PEND5")
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x4099]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$646, DW_AT_name("RSVD64")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("_RSVD64")
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x409a]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$647, DW_AT_name("QMMEMREGR")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("_QMMEMREGR")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x5000]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$648, DW_AT_name("RSVD66")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("_RSVD66")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x5100]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$649, DW_AT_name("QMQN")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("_QMQN")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x6000]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$650, DW_AT_name("RSVD68")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("_RSVD68")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x6400]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$651, DW_AT_name("QMQNS")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("_QMQNS")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6800]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$64

$C$DW$T$130	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbRegs")
	.dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
$C$DW$652	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$130)
$C$DW$653	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$652)
$C$DW$T$131	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$131, DW_AT_type(*$C$DW$653)
$C$DW$T$132	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$T$132, DW_AT_address_class(0x10)
$C$DW$T$133	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbRegsOvly")
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)

$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x48)
$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$654, DW_AT_name("EBSR")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("_EBSR")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$655, DW_AT_name("RSVD0")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$656, DW_AT_name("PCGCR1")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("_PCGCR1")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$657, DW_AT_name("PCGCR2")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("_PCGCR2")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$658, DW_AT_name("PSRCR")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("_PSRCR")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$659, DW_AT_name("PRCR")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("_PRCR")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$660, DW_AT_name("RSVD1")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$661, DW_AT_name("TIAFR")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("_TIAFR")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$662, DW_AT_name("RSVD2")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$663, DW_AT_name("ODSCR")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("_ODSCR")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$664, DW_AT_name("PDINHIBR1")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("_PDINHIBR1")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$665, DW_AT_name("PDINHIBR2")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("_PDINHIBR2")
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$666, DW_AT_name("PDINHIBR3")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("_PDINHIBR3")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$667, DW_AT_name("DMA0CESR1")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("_DMA0CESR1")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$668, DW_AT_name("DMA0CESR2")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("_DMA0CESR2")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$669, DW_AT_name("DMA1CESR1")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("_DMA1CESR1")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$670, DW_AT_name("DMA1CESR2")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("_DMA1CESR2")
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$671, DW_AT_name("SDRAMCCR")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("_SDRAMCCR")
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$672, DW_AT_name("CCR2")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("_CCR2")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$673, DW_AT_name("CGCR1")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("_CGCR1")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$674, DW_AT_name("CGICR")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("_CGICR")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$675, DW_AT_name("CGCR2")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("_CGCR2")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$676, DW_AT_name("CGOCR")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("_CGOCR")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$677, DW_AT_name("CCSSR")
	.dwattr $C$DW$677, DW_AT_TI_symbol_name("_CCSSR")
	.dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$678, DW_AT_name("RSVD3")
	.dwattr $C$DW$678, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$679	.dwtag  DW_TAG_member
	.dwattr $C$DW$679, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$679, DW_AT_name("ECDR")
	.dwattr $C$DW$679, DW_AT_TI_symbol_name("_ECDR")
	.dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$680	.dwtag  DW_TAG_member
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$680, DW_AT_name("RSVD4")
	.dwattr $C$DW$680, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$681	.dwtag  DW_TAG_member
	.dwattr $C$DW$681, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$681, DW_AT_name("RAMSLPMDCNTLR1")
	.dwattr $C$DW$681, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
	.dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$682	.dwtag  DW_TAG_member
	.dwattr $C$DW$682, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$682, DW_AT_name("RSVD5")
	.dwattr $C$DW$682, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$683	.dwtag  DW_TAG_member
	.dwattr $C$DW$683, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$683, DW_AT_name("RAMSLPMDCNTLR2")
	.dwattr $C$DW$683, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
	.dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$684	.dwtag  DW_TAG_member
	.dwattr $C$DW$684, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$684, DW_AT_name("RAMSLPMDCNTLR3")
	.dwattr $C$DW$684, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
	.dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$685	.dwtag  DW_TAG_member
	.dwattr $C$DW$685, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$685, DW_AT_name("RAMSLPMDCNTLR4")
	.dwattr $C$DW$685, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
	.dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$686	.dwtag  DW_TAG_member
	.dwattr $C$DW$686, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$686, DW_AT_name("RAMSLPMDCNTLR5")
	.dwattr $C$DW$686, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
	.dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$687	.dwtag  DW_TAG_member
	.dwattr $C$DW$687, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$687, DW_AT_name("RSVD6")
	.dwattr $C$DW$687, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$688	.dwtag  DW_TAG_member
	.dwattr $C$DW$688, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$688, DW_AT_name("DMAIFR")
	.dwattr $C$DW$688, DW_AT_TI_symbol_name("_DMAIFR")
	.dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$689	.dwtag  DW_TAG_member
	.dwattr $C$DW$689, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$689, DW_AT_name("DMAIER")
	.dwattr $C$DW$689, DW_AT_TI_symbol_name("_DMAIER")
	.dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$690	.dwtag  DW_TAG_member
	.dwattr $C$DW$690, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$690, DW_AT_name("USBSCR")
	.dwattr $C$DW$690, DW_AT_TI_symbol_name("_USBSCR")
	.dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$691	.dwtag  DW_TAG_member
	.dwattr $C$DW$691, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$691, DW_AT_name("ESCR")
	.dwattr $C$DW$691, DW_AT_TI_symbol_name("_ESCR")
	.dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$692	.dwtag  DW_TAG_member
	.dwattr $C$DW$692, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$692, DW_AT_name("RSVD7")
	.dwattr $C$DW$692, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$693	.dwtag  DW_TAG_member
	.dwattr $C$DW$693, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$693, DW_AT_name("DMA2CESR1")
	.dwattr $C$DW$693, DW_AT_TI_symbol_name("_DMA2CESR1")
	.dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$694	.dwtag  DW_TAG_member
	.dwattr $C$DW$694, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$694, DW_AT_name("DMA2CESR2")
	.dwattr $C$DW$694, DW_AT_TI_symbol_name("_DMA2CESR2")
	.dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$695	.dwtag  DW_TAG_member
	.dwattr $C$DW$695, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$695, DW_AT_name("DMA3CESR1")
	.dwattr $C$DW$695, DW_AT_TI_symbol_name("_DMA3CESR1")
	.dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$696	.dwtag  DW_TAG_member
	.dwattr $C$DW$696, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$696, DW_AT_name("DMA3CESR2")
	.dwattr $C$DW$696, DW_AT_TI_symbol_name("_DMA3CESR2")
	.dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$697	.dwtag  DW_TAG_member
	.dwattr $C$DW$697, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$697, DW_AT_name("CLKSTOP")
	.dwattr $C$DW$697, DW_AT_TI_symbol_name("_CLKSTOP")
	.dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$698	.dwtag  DW_TAG_member
	.dwattr $C$DW$698, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$698, DW_AT_name("RSVD8")
	.dwattr $C$DW$698, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$699	.dwtag  DW_TAG_member
	.dwattr $C$DW$699, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$699, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$699, DW_AT_TI_symbol_name("_DIEIDR0")
	.dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$700	.dwtag  DW_TAG_member
	.dwattr $C$DW$700, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$700, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$700, DW_AT_TI_symbol_name("_DIEIDR1")
	.dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$701	.dwtag  DW_TAG_member
	.dwattr $C$DW$701, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$701, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$701, DW_AT_TI_symbol_name("_DIEIDR2")
	.dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$702	.dwtag  DW_TAG_member
	.dwattr $C$DW$702, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$702, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$702, DW_AT_TI_symbol_name("_DIEIDR3")
	.dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$703	.dwtag  DW_TAG_member
	.dwattr $C$DW$703, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$703, DW_AT_name("DIEIDR4")
	.dwattr $C$DW$703, DW_AT_TI_symbol_name("_DIEIDR4")
	.dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$704	.dwtag  DW_TAG_member
	.dwattr $C$DW$704, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$704, DW_AT_name("DIEIDR5")
	.dwattr $C$DW$704, DW_AT_TI_symbol_name("_DIEIDR5")
	.dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$705	.dwtag  DW_TAG_member
	.dwattr $C$DW$705, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$705, DW_AT_name("DIEIDR6")
	.dwattr $C$DW$705, DW_AT_TI_symbol_name("_DIEIDR6")
	.dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$706	.dwtag  DW_TAG_member
	.dwattr $C$DW$706, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$706, DW_AT_name("DIEIDR7")
	.dwattr $C$DW$706, DW_AT_TI_symbol_name("_DIEIDR7")
	.dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$66

$C$DW$T$134	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
	.dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
$C$DW$707	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$707, DW_AT_type(*$C$DW$T$134)
$C$DW$708	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$708, DW_AT_type(*$C$DW$707)
$C$DW$T$135	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$708)
$C$DW$T$136	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
	.dwattr $C$DW$T$136, DW_AT_address_class(0x10)
$C$DW$T$137	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)

$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_name("CSL_UsbConfig")
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x0c)
$C$DW$709	.dwtag  DW_TAG_member
	.dwattr $C$DW$709, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$709, DW_AT_name("devNum")
	.dwattr $C$DW$709, DW_AT_TI_symbol_name("_devNum")
	.dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$710	.dwtag  DW_TAG_member
	.dwattr $C$DW$710, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$710, DW_AT_name("opMode")
	.dwattr $C$DW$710, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$711	.dwtag  DW_TAG_member
	.dwattr $C$DW$711, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$711, DW_AT_name("maxCurrent")
	.dwattr $C$DW$711, DW_AT_TI_symbol_name("_maxCurrent")
	.dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$712	.dwtag  DW_TAG_member
	.dwattr $C$DW$712, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$712, DW_AT_name("appSuspendCallBack")
	.dwattr $C$DW$712, DW_AT_TI_symbol_name("_appSuspendCallBack")
	.dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$713	.dwtag  DW_TAG_member
	.dwattr $C$DW$713, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$713, DW_AT_name("appWakeupCallBack")
	.dwattr $C$DW$713, DW_AT_TI_symbol_name("_appWakeupCallBack")
	.dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$714	.dwtag  DW_TAG_member
	.dwattr $C$DW$714, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$714, DW_AT_name("startTransferCallback")
	.dwattr $C$DW$714, DW_AT_TI_symbol_name("_startTransferCallback")
	.dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$715	.dwtag  DW_TAG_member
	.dwattr $C$DW$715, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$715, DW_AT_name("completeTransferCallback")
	.dwattr $C$DW$715, DW_AT_TI_symbol_name("_completeTransferCallback")
	.dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$79

$C$DW$T$138	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbConfig")
	.dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
$C$DW$T$139	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$139, DW_AT_address_class(0x17)

$C$DW$T$104	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$104, DW_AT_name("CSL_UsbContext")
	.dwattr $C$DW$T$104, DW_AT_byte_size(0xc8)
$C$DW$716	.dwtag  DW_TAG_member
	.dwattr $C$DW$716, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$716, DW_AT_name("opMode")
	.dwattr $C$DW$716, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$717	.dwtag  DW_TAG_member
	.dwattr $C$DW$717, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$717, DW_AT_name("maxCurrent")
	.dwattr $C$DW$717, DW_AT_TI_symbol_name("_maxCurrent")
	.dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$718	.dwtag  DW_TAG_member
	.dwattr $C$DW$718, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$718, DW_AT_name("fInitialized")
	.dwattr $C$DW$718, DW_AT_TI_symbol_name("_fInitialized")
	.dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$719	.dwtag  DW_TAG_member
	.dwattr $C$DW$719, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$719, DW_AT_name("fSetupPktCmd")
	.dwattr $C$DW$719, DW_AT_TI_symbol_name("_fSetupPktCmd")
	.dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$720	.dwtag  DW_TAG_member
	.dwattr $C$DW$720, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$720, DW_AT_name("fOutPhaseCmd")
	.dwattr $C$DW$720, DW_AT_TI_symbol_name("_fOutPhaseCmd")
	.dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$721	.dwtag  DW_TAG_member
	.dwattr $C$DW$721, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$721, DW_AT_name("fWaitingOnFlagA")
	.dwattr $C$DW$721, DW_AT_TI_symbol_name("_fWaitingOnFlagA")
	.dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$722	.dwtag  DW_TAG_member
	.dwattr $C$DW$722, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$722, DW_AT_name("fWaitingOnFlagB")
	.dwattr $C$DW$722, DW_AT_TI_symbol_name("_fWaitingOnFlagB")
	.dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$723	.dwtag  DW_TAG_member
	.dwattr $C$DW$723, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$723, DW_AT_name("fWaitingOnEP0BUFAvail")
	.dwattr $C$DW$723, DW_AT_TI_symbol_name("_fWaitingOnEP0BUFAvail")
	.dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$724	.dwtag  DW_TAG_member
	.dwattr $C$DW$724, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$724, DW_AT_name("fWaitingOnEP1InBUFAvail")
	.dwattr $C$DW$724, DW_AT_TI_symbol_name("_fWaitingOnEP1InBUFAvail")
	.dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$725	.dwtag  DW_TAG_member
	.dwattr $C$DW$725, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$725, DW_AT_name("rgbDescriptors")
	.dwattr $C$DW$725, DW_AT_TI_symbol_name("_rgbDescriptors")
	.dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$726	.dwtag  DW_TAG_member
	.dwattr $C$DW$726, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$726, DW_AT_name("cbDescriptors")
	.dwattr $C$DW$726, DW_AT_TI_symbol_name("_cbDescriptors")
	.dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$727	.dwtag  DW_TAG_member
	.dwattr $C$DW$727, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$727, DW_AT_name("dwFlagAEndpointAssigned")
	.dwattr $C$DW$727, DW_AT_TI_symbol_name("_dwFlagAEndpointAssigned")
	.dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$728	.dwtag  DW_TAG_member
	.dwattr $C$DW$728, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$728, DW_AT_name("dwFlagBEndpointAssigned")
	.dwattr $C$DW$728, DW_AT_TI_symbol_name("_dwFlagBEndpointAssigned")
	.dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$729	.dwtag  DW_TAG_member
	.dwattr $C$DW$729, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$729, DW_AT_name("pFIFOBaseAddress")
	.dwattr $C$DW$729, DW_AT_TI_symbol_name("_pFIFOBaseAddress")
	.dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
