;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Sat Sep 22 03:36:32 2018                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_msc.c")

	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)

$C$DW$T$51	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
$C$DW$627	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_MEDIACCESS_OVERFLOW"), DW_AT_const_value(0x00)
$C$DW$628	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_MEDIACCESS_SUCCESS"), DW_AT_const_value(0x01)
$C$DW$629	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_MEDIACCESS_NOTPRESENT"), DW_AT_const_value(0x02)
$C$DW$630	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_MEDIACCESS_WRITEPROTECT"), DW_AT_const_value(0x03)
$C$DW$631	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_MEDIACCESS_BADMEDIA"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$51

$C$DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscMediaStatus")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)

$C$DW$T$54	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
$C$DW$632	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$25)
$C$DW$633	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$47)
$C$DW$634	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$53)
$C$DW$635	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$25)
	.dwendtag $C$DW$T$54

$C$DW$T$55	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$55, DW_AT_address_class(0x20)

$C$DW$T$56	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
$C$DW$636	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$25)
	.dwendtag $C$DW$T$56

$C$DW$T$57	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$57, DW_AT_address_class(0x20)

$C$DW$T$60	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
$C$DW$637	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$25)
$C$DW$638	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$59)
	.dwendtag $C$DW$T$60

$C$DW$T$61	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$61, DW_AT_address_class(0x20)

$C$DW$T$58	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
$C$DW$639	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_UNLOCK"), DW_AT_const_value(0x00)
$C$DW$640	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_LOCK"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$58

$C$DW$T$59	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscMediaLockStatus")
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)

$C$DW$T$78	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x01)
$C$DW$641	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
$C$DW$642	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
$C$DW$643	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
$C$DW$644	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
$C$DW$645	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
$C$DW$646	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
$C$DW$647	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
$C$DW$648	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
$C$DW$649	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
$C$DW$650	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
$C$DW$651	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
$C$DW$652	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
$C$DW$653	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
$C$DW$654	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
$C$DW$655	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
$C$DW$656	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
	.dwendtag $C$DW$T$78

$C$DW$T$79	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)

$C$DW$T$80	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
$C$DW$657	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
$C$DW$658	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
$C$DW$659	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
$C$DW$660	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
$C$DW$661	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$80

$C$DW$T$81	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)

$C$DW$T$86	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
$C$DW$662	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_FALSE"), DW_AT_const_value(0x00)
$C$DW$663	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_TRUE"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$86

$C$DW$T$87	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBoolean")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("CSL_MscClassStruct")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x220)
$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$664, DW_AT_name("ctrlHandle")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("_ctrlHandle")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$665, DW_AT_name("mscHandle")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("_mscHandle")
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$21

$C$DW$T$96	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscClassStruct")
	.dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
$C$DW$T$97	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$97, DW_AT_address_class(0x17)
$C$DW$T$98	.dwtag  DW_TAG_typedef, DW_AT_name("pMscClassHandle")
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)

$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_name("CSL_MscCtrlObject")
	.dwattr $C$DW$T$48, DW_AT_byte_size(0xb6)
$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$666, DW_AT_name("ctrlInEpObj")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("_ctrlInEpObj")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$667, DW_AT_name("devNum")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("_devNum")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$668, DW_AT_name("ctrlOutEpObj")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("_ctrlOutEpObj")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$669, DW_AT_name("suspendFlag")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("_suspendFlag")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$670, DW_AT_name("hEpObjArray")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("_hEpObjArray")
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$671, DW_AT_name("usbSetup")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("_usbSetup")
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$672, DW_AT_name("highSpeedCfgDescr")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("_highSpeedCfgDescr")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$673, DW_AT_name("fullSpeedCfgDescr")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("_fullSpeedCfgDescr")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$674, DW_AT_name("deviceDescr")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("_deviceDescr")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$675, DW_AT_name("deviceQualDescr")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("_deviceQualDescr")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$676, DW_AT_name("confDescr")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("_confDescr")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$677, DW_AT_name("massStorageIntDescr")
	.dwattr $C$DW$677, DW_AT_TI_symbol_name("_massStorageIntDescr")
	.dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$678, DW_AT_name("massStorageBulkOutEndptDescr")
	.dwattr $C$DW$678, DW_AT_TI_symbol_name("_massStorageBulkOutEndptDescr")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$679	.dwtag  DW_TAG_member
	.dwattr $C$DW$679, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$679, DW_AT_name("massStorageInterfcLnk")
	.dwattr $C$DW$679, DW_AT_TI_symbol_name("_massStorageInterfcLnk")
	.dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$680	.dwtag  DW_TAG_member
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$680, DW_AT_name("massStorageBulkInEndptDescr")
	.dwattr $C$DW$680, DW_AT_TI_symbol_name("_massStorageBulkInEndptDescr")
	.dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$681	.dwtag  DW_TAG_member
	.dwattr $C$DW$681, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$681, DW_AT_name("massStorageBulkOutEndptLnk")
	.dwattr $C$DW$681, DW_AT_TI_symbol_name("_massStorageBulkOutEndptLnk")
	.dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$682	.dwtag  DW_TAG_member
	.dwattr $C$DW$682, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$682, DW_AT_name("stringDescrLangid")
	.dwattr $C$DW$682, DW_AT_TI_symbol_name("_stringDescrLangid")
	.dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
	.dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$683	.dwtag  DW_TAG_member
	.dwattr $C$DW$683, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$683, DW_AT_name("curConfigStat")
	.dwattr $C$DW$683, DW_AT_TI_symbol_name("_curConfigStat")
	.dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
	.dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$684	.dwtag  DW_TAG_member
	.dwattr $C$DW$684, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$684, DW_AT_name("massStorageBulkInEndptLnk")
	.dwattr $C$DW$684, DW_AT_TI_symbol_name("_massStorageBulkInEndptLnk")
	.dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$685	.dwtag  DW_TAG_member
	.dwattr $C$DW$685, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$685, DW_AT_name("ctrlBuffer")
	.dwattr $C$DW$685, DW_AT_TI_symbol_name("_ctrlBuffer")
	.dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$686	.dwtag  DW_TAG_member
	.dwattr $C$DW$686, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$686, DW_AT_name("configDescrLnk")
	.dwattr $C$DW$686, DW_AT_TI_symbol_name("_configDescrLnk")
	.dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$687	.dwtag  DW_TAG_member
	.dwattr $C$DW$687, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$687, DW_AT_name("strDescr")
	.dwattr $C$DW$687, DW_AT_TI_symbol_name("_strDescr")
	.dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$688	.dwtag  DW_TAG_member
	.dwattr $C$DW$688, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$688, DW_AT_name("mscReqTable")
	.dwattr $C$DW$688, DW_AT_TI_symbol_name("_mscReqTable")
	.dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$689	.dwtag  DW_TAG_member
	.dwattr $C$DW$689, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$689, DW_AT_name("fpRequestHandler")
	.dwattr $C$DW$689, DW_AT_TI_symbol_name("_fpRequestHandler")
	.dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
	.dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$690	.dwtag  DW_TAG_member
	.dwattr $C$DW$690, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$690, DW_AT_name("usbSpeedCfg")
	.dwattr $C$DW$690, DW_AT_TI_symbol_name("_usbSpeedCfg")
	.dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$691	.dwtag  DW_TAG_member
	.dwattr $C$DW$691, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$691, DW_AT_name("pCfgDescr")
	.dwattr $C$DW$691, DW_AT_TI_symbol_name("_pCfgDescr")
	.dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
	.dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$692	.dwtag  DW_TAG_member
	.dwattr $C$DW$692, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$692, DW_AT_name("pOtherSpeedCfgDescr")
	.dwattr $C$DW$692, DW_AT_TI_symbol_name("_pOtherSpeedCfgDescr")
	.dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$48

$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscCtrlObject")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$T$99	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$99, DW_AT_address_class(0x17)

$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_name("CSL_MscInitStructApp")
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x1e)
$C$DW$693	.dwtag  DW_TAG_member
	.dwattr $C$DW$693, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$693, DW_AT_name("pMscObj")
	.dwattr $C$DW$693, DW_AT_TI_symbol_name("_pMscObj")
	.dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$694	.dwtag  DW_TAG_member
	.dwattr $C$DW$694, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$694, DW_AT_name("pId")
	.dwattr $C$DW$694, DW_AT_TI_symbol_name("_pId")
	.dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$695	.dwtag  DW_TAG_member
	.dwattr $C$DW$695, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$695, DW_AT_name("vId")
	.dwattr $C$DW$695, DW_AT_TI_symbol_name("_vId")
	.dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$696	.dwtag  DW_TAG_member
	.dwattr $C$DW$696, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$696, DW_AT_name("numLun")
	.dwattr $C$DW$696, DW_AT_TI_symbol_name("_numLun")
	.dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$697	.dwtag  DW_TAG_member
	.dwattr $C$DW$697, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$697, DW_AT_name("strDescrApp")
	.dwattr $C$DW$697, DW_AT_TI_symbol_name("_strDescrApp")
	.dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$698	.dwtag  DW_TAG_member
	.dwattr $C$DW$698, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$698, DW_AT_name("lbaBufferApp")
	.dwattr $C$DW$698, DW_AT_TI_symbol_name("_lbaBufferApp")
	.dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$699	.dwtag  DW_TAG_member
	.dwattr $C$DW$699, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$699, DW_AT_name("mscReqTableApp")
	.dwattr $C$DW$699, DW_AT_TI_symbol_name("_mscReqTableApp")
	.dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$700	.dwtag  DW_TAG_member
	.dwattr $C$DW$700, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$700, DW_AT_name("bulkHandler")
	.dwattr $C$DW$700, DW_AT_TI_symbol_name("_bulkHandler")
	.dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$701	.dwtag  DW_TAG_member
	.dwattr $C$DW$701, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$701, DW_AT_name("ctrlHandler")
	.dwattr $C$DW$701, DW_AT_TI_symbol_name("_ctrlHandler")
	.dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$702	.dwtag  DW_TAG_member
	.dwattr $C$DW$702, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$702, DW_AT_name("readMediaApp")
	.dwattr $C$DW$702, DW_AT_TI_symbol_name("_readMediaApp")
	.dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$703	.dwtag  DW_TAG_member
	.dwattr $C$DW$703, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$703, DW_AT_name("writeMediaApp")
	.dwattr $C$DW$703, DW_AT_TI_symbol_name("_writeMediaApp")
	.dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$704	.dwtag  DW_TAG_member
	.dwattr $C$DW$704, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$704, DW_AT_name("mediaGetPresentStateApp")
	.dwattr $C$DW$704, DW_AT_TI_symbol_name("_mediaGetPresentStateApp")
	.dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$705	.dwtag  DW_TAG_member
	.dwattr $C$DW$705, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$705, DW_AT_name("mediaInitApp")
	.dwattr $C$DW$705, DW_AT_TI_symbol_name("_mediaInitApp")
	.dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$706	.dwtag  DW_TAG_member
	.dwattr $C$DW$706, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$706, DW_AT_name("mediaEjectApp")
	.dwattr $C$DW$706, DW_AT_TI_symbol_name("_mediaEjectApp")
	.dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$707	.dwtag  DW_TAG_member
	.dwattr $C$DW$707, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$707, DW_AT_name("mediaLockUnitApp")
	.dwattr $C$DW$707, DW_AT_TI_symbol_name("_mediaLockUnitApp")
	.dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$708	.dwtag  DW_TAG_member
	.dwattr $C$DW$708, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$708, DW_AT_name("getMediaSizeApp")
	.dwattr $C$DW$708, DW_AT_TI_symbol_name("_getMediaSizeApp")
	.dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$64

$C$DW$T$100	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscInitStructApp")
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
$C$DW$T$101	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$T$101, DW_AT_address_class(0x17)
$C$DW$T$102	.dwtag  DW_TAG_typedef, DW_AT_name("pMscAppClassHandle")
	.dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)

$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_name("CSL_MscLogicalUnit")
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x3e)
$C$DW$709	.dwtag  DW_TAG_member
	.dwattr $C$DW$709, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$709, DW_AT_name("scsiInquiryData")
	.dwattr $C$DW$709, DW_AT_TI_symbol_name("_scsiInquiryData")
	.dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$710	.dwtag  DW_TAG_member
	.dwattr $C$DW$710, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$710, DW_AT_name("mediaSize")
	.dwattr $C$DW$710, DW_AT_TI_symbol_name("_mediaSize")
	.dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$711	.dwtag  DW_TAG_member
	.dwattr $C$DW$711, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$711, DW_AT_name("currLba")
	.dwattr $C$DW$711, DW_AT_TI_symbol_name("_currLba")
	.dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$712	.dwtag  DW_TAG_member
	.dwattr $C$DW$712, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$712, DW_AT_name("lbaSize")
	.dwattr $C$DW$712, DW_AT_TI_symbol_name("_lbaSize")
	.dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$713	.dwtag  DW_TAG_member
	.dwattr $C$DW$713, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$713, DW_AT_name("removeable")
	.dwattr $C$DW$713, DW_AT_TI_symbol_name("_removeable")
	.dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$714	.dwtag  DW_TAG_member
	.dwattr $C$DW$714, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$714, DW_AT_name("mediaState")
	.dwattr $C$DW$714, DW_AT_TI_symbol_name("_mediaState")
	.dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$715	.dwtag  DW_TAG_member
	.dwattr $C$DW$715, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$715, DW_AT_name("readwrite")
	.dwattr $C$DW$715, DW_AT_TI_symbol_name("_readwrite")
	.dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$716	.dwtag  DW_TAG_member
	.dwattr $C$DW$716, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$716, DW_AT_name("lbaCnt")
	.dwattr $C$DW$716, DW_AT_TI_symbol_name("_lbaCnt")
	.dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$717	.dwtag  DW_TAG_member
	.dwattr $C$DW$717, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$717, DW_AT_name("verifyFlag")
	.dwattr $C$DW$717, DW_AT_TI_symbol_name("_verifyFlag")
	.dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$66

$C$DW$T$69	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscLogicalUnit")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)

$C$DW$T$70	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$70, DW_AT_byte_size(0xf8)
$C$DW$718	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$718, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$70


$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_name("CSL_MscLunAttribApp")
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x20)
$C$DW$719	.dwtag  DW_TAG_member
	.dwattr $C$DW$719, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$719, DW_AT_name("lbaSizeApp")
	.dwattr $C$DW$719, DW_AT_TI_symbol_name("_lbaSizeApp")
	.dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$720	.dwtag  DW_TAG_member
	.dwattr $C$DW$720, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$720, DW_AT_name("mediaSizeApp")
	.dwattr $C$DW$720, DW_AT_TI_symbol_name("_mediaSizeApp")
	.dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$721	.dwtag  DW_TAG_member
	.dwattr $C$DW$721, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$721, DW_AT_name("removeableApp")
	.dwattr $C$DW$721, DW_AT_TI_symbol_name("_removeableApp")
	.dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$722	.dwtag  DW_TAG_member
	.dwattr $C$DW$722, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$722, DW_AT_name("scsiInquiryConfData")
	.dwattr $C$DW$722, DW_AT_TI_symbol_name("_scsiInquiryConfData")
	.dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$723	.dwtag  DW_TAG_member
	.dwattr $C$DW$723, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$723, DW_AT_name("mediaStateApp")
	.dwattr $C$DW$723, DW_AT_TI_symbol_name("_mediaStateApp")
	.dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$724	.dwtag  DW_TAG_member
	.dwattr $C$DW$724, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$724, DW_AT_name("readwriteApp")
	.dwattr $C$DW$724, DW_AT_TI_symbol_name("_readwriteApp")
	.dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$68

$C$DW$T$105	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscLunAttribApp")
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
$C$DW$T$106	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$T$106, DW_AT_address_class(0x17)

$C$DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$73, DW_AT_name("CSL_MscObject")
	.dwattr $C$DW$T$73, DW_AT_byte_size(0x16a)
$C$DW$725	.dwtag  DW_TAG_member
	.dwattr $C$DW$725, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$725, DW_AT_name("readMedia")
	.dwattr $C$DW$725, DW_AT_TI_symbol_name("_readMedia")
	.dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$726	.dwtag  DW_TAG_member
	.dwattr $C$DW$726, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$726, DW_AT_name("writeMedia")
	.dwattr $C$DW$726, DW_AT_TI_symbol_name("_writeMedia")
	.dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$727	.dwtag  DW_TAG_member
	.dwattr $C$DW$727, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$727, DW_AT_name("mediaGetPresentState")
	.dwattr $C$DW$727, DW_AT_TI_symbol_name("_mediaGetPresentState")
	.dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$728	.dwtag  DW_TAG_member
	.dwattr $C$DW$728, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$728, DW_AT_name("mediaInit")
	.dwattr $C$DW$728, DW_AT_TI_symbol_name("_mediaInit")
	.dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$729	.dwtag  DW_TAG_member
	.dwattr $C$DW$729, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$729, DW_AT_name("mediaEject")
	.dwattr $C$DW$729, DW_AT_TI_symbol_name("_mediaEject")
	.dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$730	.dwtag  DW_TAG_member
	.dwattr $C$DW$730, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$730, DW_AT_name("mediaLockUnit")
	.dwattr $C$DW$730, DW_AT_TI_symbol_name("_mediaLockUnit")
	.dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$731	.dwtag  DW_TAG_member
	.dwattr $C$DW$731, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$731, DW_AT_name("getMediaSize")
	.dwattr $C$DW$731, DW_AT_TI_symbol_name("_getMediaSize")
	.dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$732	.dwtag  DW_TAG_member
	.dwattr $C$DW$732, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$732, DW_AT_name("lbaBuffer")
	.dwattr $C$DW$732, DW_AT_TI_symbol_name("_lbaBuffer")
	.dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$733	.dwtag  DW_TAG_member
	.dwattr $C$DW$733, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$733, DW_AT_name("cbwDataTransferLength")
	.dwattr $C$DW$733, DW_AT_TI_symbol_name("_cbwDataTransferLength")
	.dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$734	.dwtag  DW_TAG_member
	.dwattr $C$DW$734, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$734, DW_AT_name("lun")
	.dwattr $C$DW$734, DW_AT_TI_symbol_name("_lun")
	.dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$735	.dwtag  DW_TAG_member
	.dwattr $C$DW$735, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$735, DW_AT_name("senseData")
	.dwattr $C$DW$735, DW_AT_TI_symbol_name("_senseData")
	.dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
	.dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$736	.dwtag  DW_TAG_member
	.dwattr $C$DW$736, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$736, DW_AT_name("activityPresentFlag")
	.dwattr $C$DW$736, DW_AT_TI_symbol_name("_activityPresentFlag")
	.dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x119]
	.dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$737	.dwtag  DW_TAG_member
	.dwattr $C$DW$737, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$737, DW_AT_name("csw")
	.dwattr $C$DW$737, DW_AT_TI_symbol_name("_csw")
	.dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
	.dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$738	.dwtag  DW_TAG_member
	.dwattr $C$DW$738, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$738, DW_AT_name("readCapacity")
	.dwattr $C$DW$738, DW_AT_TI_symbol_name("_readCapacity")
	.dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x122]
	.dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$739	.dwtag  DW_TAG_member
	.dwattr $C$DW$739, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$739, DW_AT_name("cbw")
	.dwattr $C$DW$739, DW_AT_TI_symbol_name("_cbw")
	.dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$740	.dwtag  DW_TAG_member
	.dwattr $C$DW$740, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$740, DW_AT_name("bulkInEpObj")
	.dwattr $C$DW$740, DW_AT_TI_symbol_name("_bulkInEpObj")
	.dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
	.dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$741	.dwtag  DW_TAG_member
	.dwattr $C$DW$741, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$741, DW_AT_name("bulkOutEpObj")
	.dwattr $C$DW$741, DW_AT_TI_symbol_name("_bulkOutEpObj")
	.dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x14e]
	.dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$742	.dwtag  DW_TAG_member
	.dwattr $C$DW$742, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$742, DW_AT_name("noOfLun")
	.dwattr $C$DW$742, DW_AT_TI_symbol_name("_noOfLun")
	.dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x162]
	.dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$743	.dwtag  DW_TAG_member
	.dwattr $C$DW$743, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$743, DW_AT_name("storageState")
	.dwattr $C$DW$743, DW_AT_TI_symbol_name("_storageState")
	.dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x163]
	.dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$744	.dwtag  DW_TAG_member
	.dwattr $C$DW$744, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$744, DW_AT_name("modeSenseData")
	.dwattr $C$DW$744, DW_AT_TI_symbol_name("_modeSenseData")
	.dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
	.dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$745	.dwtag  DW_TAG_member
	.dwattr $C$DW$745, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$745, DW_AT_name("writeToMedia")
	.dwattr $C$DW$745, DW_AT_TI_symbol_name("_writeToMedia")
	.dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x169]
	.dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$73

$C$DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscObject")
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
$C$DW$T$107	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$107, DW_AT_address_class(0x17)

$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_name("CSL_MscRequestStruct")
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x04)
$C$DW$746	.dwtag  DW_TAG_member
	.dwattr $C$DW$746, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$746, DW_AT_name("request")
	.dwattr $C$DW$746, DW_AT_TI_symbol_name("_request")
	.dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$747	.dwtag  DW_TAG_member
	.dwattr $C$DW$747, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$747, DW_AT_name("fpRequestHandler")
	.dwattr $C$DW$747, DW_AT_TI_symbol_name("_fpRequestHandler")
	.dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$75

$C$DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscRequestStruct")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
$C$DW$T$40	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$40, DW_AT_address_class(0x17)

$C$DW$T$77	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$77, DW_AT_name("CSL_UsbDataStruct")
	.dwattr $C$DW$T$77, DW_AT_byte_size(0x06)
$C$DW$748	.dwtag  DW_TAG_member
	.dwattr $C$DW$748, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$748, DW_AT_name("bytes")
	.dwattr $C$DW$748, DW_AT_TI_symbol_name("_bytes")
	.dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$749	.dwtag  DW_TAG_member
	.dwattr $C$DW$749, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$749, DW_AT_name("pBuffer")
	.dwattr $C$DW$749, DW_AT_TI_symbol_name("_pBuffer")
	.dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$750	.dwtag  DW_TAG_member
	.dwattr $C$DW$750, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$750, DW_AT_name("pNextBuffer")
	.dwattr $C$DW$750, DW_AT_TI_symbol_name("_pNextBuffer")
	.dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$77

$C$DW$T$34	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDataStruct")
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
$C$DW$T$83	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$83, DW_AT_address_class(0x17)
$C$DW$T$76	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$76, DW_AT_address_class(0x17)

$C$DW$T$84	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$84, DW_AT_name("CSL_UsbEpObj")
	.dwattr $C$DW$T$84, DW_AT_byte_size(0x14)
$C$DW$751	.dwtag  DW_TAG_member
	.dwattr $C$DW$751, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$751, DW_AT_name("epNum")
	.dwattr $C$DW$751, DW_AT_TI_symbol_name("_epNum")
	.dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$752	.dwtag  DW_TAG_member
	.dwattr $C$DW$752, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$752, DW_AT_name("xferType")
	.dwattr $C$DW$752, DW_AT_TI_symbol_name("_xferType")
	.dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$753	.dwtag  DW_TAG_member
	.dwattr $C$DW$753, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$753, DW_AT_name("maxPktSiz")
	.dwattr $C$DW$753, DW_AT_TI_symbol_name("_maxPktSiz")
	.dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$754	.dwtag  DW_TAG_member
	.dwattr $C$DW$754, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$754, DW_AT_name("eventMask")
	.dwattr $C$DW$754, DW_AT_TI_symbol_name("_eventMask")
	.dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$755	.dwtag  DW_TAG_member
	.dwattr $C$DW$755, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$755, DW_AT_name("fxn")
	.dwattr $C$DW$755, DW_AT_TI_symbol_name("_fxn")
	.dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$756	.dwtag  DW_TAG_member
	.dwattr $C$DW$756, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$756, DW_AT_name("dataFlags")
	.dwattr $C$DW$756, DW_AT_TI_symbol_name("_dataFlags")
	.dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$757	.dwtag  DW_TAG_member
	.dwattr $C$DW$757, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$757, DW_AT_name("status")
	.dwattr $C$DW$757, DW_AT_TI_symbol_name("_status")
	.dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$758	.dwtag  DW_TAG_member
	.dwattr $C$DW$758, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$758, DW_AT_name("epDescRegSAddr")
	.dwattr $C$DW$758, DW_AT_TI_symbol_name("_epDescRegSAddr")
	.dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$759	.dwtag  DW_TAG_member
	.dwattr $C$DW$759, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$759, DW_AT_name("dmaRegSAddr")
	.dwattr $C$DW$759, DW_AT_TI_symbol_name("_dmaRegSAddr")
	.dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$760	.dwtag  DW_TAG_member
	.dwattr $C$DW$760, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$760, DW_AT_name("totByteCnt")
	.dwattr $C$DW$760, DW_AT_TI_symbol_name("_totByteCnt")
	.dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$761	.dwtag  DW_TAG_member
	.dwattr $C$DW$761, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$761, DW_AT_name("byteInThisSeg")
	.dwattr $C$DW$761, DW_AT_TI_symbol_name("_byteInThisSeg")
	.dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$762	.dwtag  DW_TAG_member
	.dwattr $C$DW$762, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$762, DW_AT_name("xferBytCnt")
	.dwattr $C$DW$762, DW_AT_TI_symbol_name("_xferBytCnt")
	.dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$763	.dwtag  DW_TAG_member
	.dwattr $C$DW$763, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$763, DW_AT_name("pBuffer")
	.dwattr $C$DW$763, DW_AT_TI_symbol_name("_pBuffer")
	.dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$764	.dwtag  DW_TAG_member
	.dwattr $C$DW$764, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$764, DW_AT_name("pNextBuffer")
	.dwattr $C$DW$764, DW_AT_TI_symbol_name("_pNextBuffer")
	.dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$765	.dwtag  DW_TAG_member
	.dwattr $C$DW$765, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$765, DW_AT_name("eventFlag")
	.dwattr $C$DW$765, DW_AT_TI_symbol_name("_eventFlag")
	.dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$84

$C$DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpObj")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x17)
$C$DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("pUsbEpHandle")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)

$C$DW$T$28	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
$C$DW$766	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$766, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$28

$C$DW$T$108	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$108, DW_AT_address_class(0x17)

$C$DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$85, DW_AT_name("CSL_UsbSetupStruct")
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x06)
$C$DW$767	.dwtag  DW_TAG_member
	.dwattr $C$DW$767, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$767, DW_AT_name("newPacket")
	.dwattr $C$DW$767, DW_AT_TI_symbol_name("_newPacket")
	.dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$768	.dwtag  DW_TAG_member
	.dwattr $C$DW$768, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$768, DW_AT_name("bmRequestType")
	.dwattr $C$DW$768, DW_AT_TI_symbol_name("_bmRequestType")
	.dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$769	.dwtag  DW_TAG_member
	.dwattr $C$DW$769, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$769, DW_AT_name("bRequest")
	.dwattr $C$DW$769, DW_AT_TI_symbol_name("_bRequest")
	.dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$770	.dwtag  DW_TAG_member
	.dwattr $C$DW$770, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$770, DW_AT_name("wValue")
	.dwattr $C$DW$770, DW_AT_TI_symbol_name("_wValue")
	.dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$771	.dwtag  DW_TAG_member
	.dwattr $C$DW$771, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$771, DW_AT_name("wIndex")
	.dwattr $C$DW$771, DW_AT_TI_symbol_name("_wIndex")
	.dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$772	.dwtag  DW_TAG_member
	.dwattr $C$DW$772, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$772, DW_AT_name("wLength")
	.dwattr $C$DW$772, DW_AT_TI_symbol_name("_wLength")
	.dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$85

$C$DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbSetupStruct")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
$C$DW$T$43	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$43, DW_AT_address_class(0x17)
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)

$C$DW$T$49	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
$C$DW$T$50	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$50, DW_AT_address_class(0x20)
$C$DW$T$82	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_EVENT_ISR")
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
$C$DW$773	.dwtag  DW_TAG_TI_far_type
$C$DW$T$110	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$773)
$C$DW$T$111	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$111, DW_AT_address_class(0x17)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$88	.dwtag  DW_TAG_typedef, DW_AT_name("Int16")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
$C$DW$T$89	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
$C$DW$T$90	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$T$90, DW_AT_address_class(0x17)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
$C$DW$T$150	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEventMask")
	.dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
$C$DW$T$122	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbIoFlags")
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
$C$DW$T$74	.dwtag  DW_TAG_typedef, DW_AT_name("WORD")
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)

$C$DW$T$30	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x11)
$C$DW$774	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$774, DW_AT_upper_bound(0x10)
	.dwendtag $C$DW$T$30


$C$DW$T$31	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
$C$DW$775	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$775, DW_AT_upper_bound(0x09)
	.dwendtag $C$DW$T$31


$C$DW$T$32	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x06)
$C$DW$776	.dwtag  DW_TAG_subrange_type
