;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Mon Sep 17 00:34:40 2018                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_audioClass.c")

	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)

$C$DW$T$54	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
$C$DW$326	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$25)
$C$DW$327	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$49)
$C$DW$328	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$49)
$C$DW$329	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$54

$C$DW$T$55	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$55, DW_AT_address_class(0x20)

$C$DW$T$56	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
$C$DW$330	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$25)
$C$DW$331	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$56

$C$DW$T$57	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$57, DW_AT_address_class(0x20)

$C$DW$T$58	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
$C$DW$332	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$25)
	.dwendtag $C$DW$T$58

$C$DW$T$59	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$59, DW_AT_address_class(0x20)

$C$DW$T$62	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
$C$DW$333	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$25)
$C$DW$334	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$61)
	.dwendtag $C$DW$T$62

$C$DW$T$63	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$63, DW_AT_address_class(0x20)

$C$DW$T$60	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
$C$DW$335	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_UNLOCK"), DW_AT_const_value(0x00)
$C$DW$336	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_LOCK"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$60

$C$DW$T$61	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcMediaLockStatus")
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)

$C$DW$T$80	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
$C$DW$337	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
$C$DW$338	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
$C$DW$339	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
$C$DW$340	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
$C$DW$341	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
$C$DW$342	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
$C$DW$343	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
$C$DW$344	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
$C$DW$345	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
$C$DW$346	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
$C$DW$347	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
$C$DW$348	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
$C$DW$349	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
$C$DW$350	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
$C$DW$351	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
$C$DW$352	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
	.dwendtag $C$DW$T$80

$C$DW$T$81	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)

$C$DW$T$82	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
$C$DW$353	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
$C$DW$354	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
$C$DW$355	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
$C$DW$356	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
$C$DW$357	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$82

$C$DW$T$83	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)

$C$DW$T$91	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
$C$DW$358	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_DEVICE_DESCR"), DW_AT_const_value(0x00)
$C$DW$359	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_DEVICE_QUAL_DESCR"), DW_AT_const_value(0x01)
$C$DW$360	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_CONFIG_DESCR"), DW_AT_const_value(0x02)
$C$DW$361	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_INTERFACE_DESCR"), DW_AT_const_value(0x03)
$C$DW$362	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_STRING_LANGID_DESC"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$91

$C$DW$T$92	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcDescrId")
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("CSL_AcClassStruct")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x2f6)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$363, DW_AT_name("ctrlHandle")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_ctrlHandle")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$364, DW_AT_name("acHandle")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_acHandle")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x18a]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$21

$C$DW$T$93	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcClassStruct")
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
$C$DW$T$94	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$T$94, DW_AT_address_class(0x17)
$C$DW$T$95	.dwtag  DW_TAG_typedef, DW_AT_name("pAcClassHandle")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)

$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_name("CSL_AcCtrlObject")
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x18a)
$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$365, DW_AT_name("ctrlInEpObj")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_ctrlInEpObj")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$366, DW_AT_name("devNum")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_devNum")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$367, DW_AT_name("ctrlOutEpObj")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_ctrlOutEpObj")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$368, DW_AT_name("suspendFlag")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_suspendFlag")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$369, DW_AT_name("hEpObjArray")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_hEpObjArray")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$370, DW_AT_name("usbSetup")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_usbSetup")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$371, DW_AT_name("leftVolBuf")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_leftVolBuf")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$372, DW_AT_name("rightVolBuf")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_rightVolBuf")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$373, DW_AT_name("leftRightVolBuf")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_leftRightVolBuf")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$374, DW_AT_name("muteCtrlBuf")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_muteCtrlBuf")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$375, DW_AT_name("getMinBuffer")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_getMinBuffer")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$376, DW_AT_name("getMaxBuffer")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_getMaxBuffer")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$377, DW_AT_name("getResBuffer")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_getResBuffer")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$378, DW_AT_name("dummydesc")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_dummydesc")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$379, DW_AT_name("deviceQualifierDescr")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_deviceQualifierDescr")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xa5]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$380, DW_AT_name("deviceDescr")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_deviceDescr")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$381, DW_AT_name("confDescr")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_confDescr")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$382, DW_AT_name("audioClassIntDescr")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_audioClassIntDescr")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x141]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$383, DW_AT_name("audioClassIsoOutEndptDescr")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_audioClassIsoOutEndptDescr")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x14d]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$384, DW_AT_name("audioClassInterfcLnk")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_audioClassInterfcLnk")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x152]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$385, DW_AT_name("audioClassIsoInEndptDescr")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_audioClassIsoInEndptDescr")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$386, DW_AT_name("audioClassIsoOutEndptLnk")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_audioClassIsoOutEndptLnk")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x15e]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$387, DW_AT_name("stringDescrLangid")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_stringDescrLangid")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$388, DW_AT_name("curConfigStat")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_curConfigStat")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$389, DW_AT_name("audioClassIsoInEndptLnk")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_audioClassIsoInEndptLnk")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x172]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$390, DW_AT_name("ctrlBuffer")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_ctrlBuffer")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$391, DW_AT_name("configDescrLnk")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_configDescrLnk")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x17e]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$392, DW_AT_name("strDescr")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_strDescr")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$393, DW_AT_name("acReqTable")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_acReqTable")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x186]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$394, DW_AT_name("fpRequestHandler")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_fpRequestHandler")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$48

$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcCtrlObject")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$T$96	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$96, DW_AT_address_class(0x17)

$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_name("CSL_AcInitStructApp")
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x22)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$395, DW_AT_name("pAcObj")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_pAcObj")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$396, DW_AT_name("pId")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_pId")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$397, DW_AT_name("vId")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_vId")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$398, DW_AT_name("numLun")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_numLun")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$399, DW_AT_name("txPktSize")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_txPktSize")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$400, DW_AT_name("rxPktSize")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_rxPktSize")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$401, DW_AT_name("strDescrApp")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_strDescrApp")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$402, DW_AT_name("lbaBufferApp")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_lbaBufferApp")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$403, DW_AT_name("acReqTableApp")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_acReqTableApp")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$404, DW_AT_name("isoHandler")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_isoHandler")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$405, DW_AT_name("ctrlHandler")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_ctrlHandler")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$406, DW_AT_name("playAudioApp")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_playAudioApp")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$407, DW_AT_name("stopAudioApp")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_stopAudioApp")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$408, DW_AT_name("recordAudioApp")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_recordAudioApp")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$409, DW_AT_name("mediaGetPresentStateApp")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_mediaGetPresentStateApp")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$410, DW_AT_name("mediaInitApp")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_mediaInitApp")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$411, DW_AT_name("mediaEjectApp")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_mediaEjectApp")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$412, DW_AT_name("mediaLockUnitApp")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_mediaLockUnitApp")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$413, DW_AT_name("getMediaSizeApp")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_getMediaSizeApp")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$67

$C$DW$T$97	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcInitStructApp")
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
$C$DW$T$98	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$T$98, DW_AT_address_class(0x17)
$C$DW$T$99	.dwtag  DW_TAG_typedef, DW_AT_name("pAcAppClassHandle")
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)

$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_name("CSL_AcLogicalUnit")
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x3e)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$414, DW_AT_name("scsiInquiryData")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_scsiInquiryData")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$415, DW_AT_name("mediaSize")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_mediaSize")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$416, DW_AT_name("currLba")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_currLba")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$417, DW_AT_name("lbaSize")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_lbaSize")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$418, DW_AT_name("removeable")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_removeable")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$419, DW_AT_name("mediaState")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_mediaState")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$420, DW_AT_name("readwrite")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_readwrite")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$421, DW_AT_name("lbaCnt")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_lbaCnt")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$422, DW_AT_name("verifyFlag")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_verifyFlag")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$69

$C$DW$T$70	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcLogicalUnit")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)

$C$DW$T$71	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$71, DW_AT_byte_size(0xf8)
$C$DW$423	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$423, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$71


$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_name("CSL_AcObject")
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x16c)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$424, DW_AT_name("recordAudio")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_recordAudio")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$425, DW_AT_name("playAudio")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_playAudio")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$426, DW_AT_name("stopAudio")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_stopAudio")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$427, DW_AT_name("mediaGetPresentState")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_mediaGetPresentState")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$428, DW_AT_name("mediaInit")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_mediaInit")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$429, DW_AT_name("mediaEject")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_mediaEject")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$430, DW_AT_name("mediaLockUnit")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_mediaLockUnit")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$431, DW_AT_name("getMediaSize")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_getMediaSize")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$432, DW_AT_name("lbaBuffer")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_lbaBuffer")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$433, DW_AT_name("cbwDataTransferLength")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_cbwDataTransferLength")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$434, DW_AT_name("lun")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_lun")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$435, DW_AT_name("senseData")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_senseData")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$436, DW_AT_name("activityPresentFlag")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_activityPresentFlag")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x11b]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$437, DW_AT_name("csw")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_csw")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$438, DW_AT_name("readCapacity")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_readCapacity")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$439, DW_AT_name("cbw")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_cbw")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x12a]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$440, DW_AT_name("isoInEpObj")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_isoInEpObj")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$441, DW_AT_name("isoOutEpObj")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_isoOutEpObj")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$442, DW_AT_name("noOfLun")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_noOfLun")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$443, DW_AT_name("mediaState")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_mediaState")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x165]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$444, DW_AT_name("playBackActive")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_playBackActive")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x166]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$445, DW_AT_name("mediaInitDone")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_mediaInitDone")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x167]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$446, DW_AT_name("tempBuffer")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_tempBuffer")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$75

$C$DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcObject")
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
$C$DW$T$100	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$100, DW_AT_address_class(0x17)

$C$DW$T$77	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$77, DW_AT_name("CSL_AcRequestStruct")
	.dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$447, DW_AT_name("request")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_request")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$448, DW_AT_name("fpRequestHandler")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_fpRequestHandler")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$77

$C$DW$T$41	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcRequestStruct")
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
$C$DW$T$42	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$42, DW_AT_address_class(0x17)

$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_name("CSL_UsbDataStruct")
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x06)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$449, DW_AT_name("bytes")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_bytes")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$450, DW_AT_name("pBuffer")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_pBuffer")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$451, DW_AT_name("pNextBuffer")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_pNextBuffer")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$79

$C$DW$T$37	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDataStruct")
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
$C$DW$T$85	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$85, DW_AT_address_class(0x17)
$C$DW$T$78	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$78, DW_AT_address_class(0x17)

$C$DW$T$86	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$86, DW_AT_name("CSL_UsbEpObj")
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x14)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$452, DW_AT_name("epNum")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_epNum")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$453, DW_AT_name("xferType")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_xferType")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$454, DW_AT_name("maxPktSiz")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_maxPktSiz")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$455, DW_AT_name("eventMask")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_eventMask")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$456, DW_AT_name("fxn")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_fxn")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$457, DW_AT_name("dataFlags")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_dataFlags")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$458, DW_AT_name("status")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_status")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$459, DW_AT_name("epDescRegSAddr")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_epDescRegSAddr")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$460, DW_AT_name("dmaRegSAddr")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_dmaRegSAddr")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$461, DW_AT_name("totByteCnt")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_totByteCnt")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$462, DW_AT_name("byteInThisSeg")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_byteInThisSeg")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$463, DW_AT_name("xferBytCnt")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_xferBytCnt")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$464, DW_AT_name("pBuffer")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_pBuffer")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$465, DW_AT_name("pNextBuffer")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_pNextBuffer")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$466, DW_AT_name("eventFlag")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_eventFlag")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$86

$C$DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpObj")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x17)
$C$DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("pUsbEpHandle")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)

$C$DW$T$28	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
$C$DW$467	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$467, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$28

$C$DW$T$101	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$101, DW_AT_address_class(0x17)

$C$DW$T$87	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$87, DW_AT_name("CSL_UsbSetupStruct")
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x06)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$468, DW_AT_name("newPacket")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_newPacket")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$469, DW_AT_name("bmRequestType")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_bmRequestType")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$470, DW_AT_name("bRequest")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_bRequest")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$471, DW_AT_name("wValue")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_wValue")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$472, DW_AT_name("wIndex")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_wIndex")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$473, DW_AT_name("wLength")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_wLength")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$87

$C$DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbSetupStruct")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
$C$DW$T$45	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$45, DW_AT_address_class(0x17)
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)

$C$DW$T$50	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
$C$DW$T$51	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_address_class(0x20)
$C$DW$T$84	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_EVENT_ISR")
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
$C$DW$474	.dwtag  DW_TAG_TI_far_type
$C$DW$T$103	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$474)
$C$DW$T$104	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$104, DW_AT_address_class(0x17)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$107	.dwtag  DW_TAG_typedef, DW_AT_name("Int16")
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
$C$DW$T$108	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
$C$DW$T$111	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$T$111, DW_AT_address_class(0x17)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
$C$DW$T$129	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEventMask")
	.dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
$C$DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbIoFlags")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
$C$DW$T$76	.dwtag  DW_TAG_typedef, DW_AT_name("WORD")
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)

$C$DW$T$30	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x06)
$C$DW$475	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$475, DW_AT_upper_bound(0x05)
	.dwendtag $C$DW$T$30


$C$DW$T$31	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x0c)
$C$DW$476	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$476, DW_AT_upper_bound(0x0b)
	.dwendtag $C$DW$T$31


$C$DW$T$32	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
