TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE    1

    1392              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 16 02:57:24 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     432              $C$DW$48        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN3"), DW_AT_const_value(0x03)
     433              $C$DW$49        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN4"), DW_AT_const_value(0x04)
     434              $C$DW$50        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN5"), DW_AT_const_value(0x05)
     435              $C$DW$51        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN6"), DW_AT_const_value(0x06)
     436              $C$DW$52        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN7"), DW_AT_const_value(0x07)
     437              $C$DW$53        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN8"), DW_AT_const_value(0x08)
     438              $C$DW$54        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN9"), DW_AT_const_value(0x09)
     439              $C$DW$55        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN10"), DW_AT_const_value(0x0a)
     440              $C$DW$56        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN11"), DW_AT_const_value(0x0b)
     441              $C$DW$57        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN12"), DW_AT_const_value(0x0c)
     442              $C$DW$58        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN13"), DW_AT_const_value(0x0d)
     443              $C$DW$59        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN14"), DW_AT_const_value(0x0e)
     444              $C$DW$60        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN15"), DW_AT_const_value(0x0f)
     445              $C$DW$61        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN16"), DW_AT_const_value(0x10)
     446              $C$DW$62        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN17"), DW_AT_const_value(0x11)
     447              $C$DW$63        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN18"), DW_AT_const_value(0x12)
     448              $C$DW$64        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN19"), DW_AT_const_value(0x13)
     449              $C$DW$65        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN20"), DW_AT_const_value(0x14)
     450              $C$DW$66        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN21"), DW_AT_const_value(0x15)
     451              $C$DW$67        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN22"), DW_AT_const_value(0x16)
     452              $C$DW$68        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN23"), DW_AT_const_value(0x17)
     453              $C$DW$69        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN24"), DW_AT_const_value(0x18)
     454              $C$DW$70        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN25"), DW_AT_const_value(0x19)
     455              $C$DW$71        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN26"), DW_AT_const_value(0x1a)
     456              $C$DW$72        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN27"), DW_AT_const_value(0x1b)
     457              $C$DW$73        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN28"), DW_AT_const_value(0x1c)
     458              $C$DW$74        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN29"), DW_AT_const_value(0x1d)
     459              $C$DW$75        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN30"), DW_AT_const_value(0x1e)
     460              $C$DW$76        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN31"), DW_AT_const_value(0x1f)
     461                      .dwendtag $C$DW$T$29
     462              
     463              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioPinNum")
     464                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
     465                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     466              
     467              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
     468                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     469              $C$DW$77        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_DIR_INPUT"), DW_AT_const_value(0x00)
     470              $C$DW$78        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_DIR_OUTPUT"), DW_AT_const_value(0x01)
     471                      .dwendtag $C$DW$T$31
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE   10

     472              
     473              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioDirection")
     474                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
     475                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     476              
     477              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
     478                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     479              $C$DW$79        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_RISING_EDGE"), DW_AT_const_value(0x00)
     480              $C$DW$80        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_FALLING_EDGE"), DW_AT_const_value(0x01)
     481              $C$DW$81        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_CLEAR_EDGE"), DW_AT_const_value(0x02)
     482                      .dwendtag $C$DW$T$33
     483              
     484              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioTriggerType")
     485                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
     486                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     487              
     488              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     489                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x12)
     490              $C$DW$82        .dwtag  DW_TAG_member
     491                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
     492                      .dwattr $C$DW$82, DW_AT_name("RSVD0")
     493                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_RSVD0")
     494                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     495                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     496              $C$DW$83        .dwtag  DW_TAG_member
     497                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
     498                      .dwattr $C$DW$83, DW_AT_name("IODIR1")
     499                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_IODIR1")
     500                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     501                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     502              $C$DW$84        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
     504                      .dwattr $C$DW$84, DW_AT_name("IODIR2")
     505                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_IODIR2")
     506                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     507                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     508              $C$DW$85        .dwtag  DW_TAG_member
     509                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
     510                      .dwattr $C$DW$85, DW_AT_name("IOINDATA1")
     511                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_IOINDATA1")
     512                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     513                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     514              $C$DW$86        .dwtag  DW_TAG_member
     515                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
     516                      .dwattr $C$DW$86, DW_AT_name("IOINDATA2")
     517                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_IOINDATA2")
     518                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     519                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     520              $C$DW$87        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
     522                      .dwattr $C$DW$87, DW_AT_name("IOOUTDATA1")
     523                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_IOOUTDATA1")
     524                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     525                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     526              $C$DW$88        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE   11

     527                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
     528                      .dwattr $C$DW$88, DW_AT_name("IOOUTDATA2")
     529                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_IOOUTDATA2")
     530                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     531                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     532              $C$DW$89        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
     534                      .dwattr $C$DW$89, DW_AT_name("IOINTEDG1")
     535                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_IOINTEDG1")
     536                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     537                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     538              $C$DW$90        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
     540                      .dwattr $C$DW$90, DW_AT_name("IOINTEDG2")
     541                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_IOINTEDG2")
     542                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     543                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     544              $C$DW$91        .dwtag  DW_TAG_member
     545                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
     546                      .dwattr $C$DW$91, DW_AT_name("IOINTEN1")
     547                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_IOINTEN1")
     548                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     549                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     550              $C$DW$92        .dwtag  DW_TAG_member
     551                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
     552                      .dwattr $C$DW$92, DW_AT_name("IOINTEN2")
     553                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_IOINTEN2")
     554                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     555                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     556              $C$DW$93        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
     558                      .dwattr $C$DW$93, DW_AT_name("IOINTFLG1")
     559                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_IOINTFLG1")
     560                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     561                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     562              $C$DW$94        .dwtag  DW_TAG_member
     563                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
     564                      .dwattr $C$DW$94, DW_AT_name("IOINTFLG2")
     565                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_IOINTFLG2")
     566                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     567                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     568                      .dwendtag $C$DW$T$22
     569              
     570              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
     571                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     572                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     573              $C$DW$95        .dwtag  DW_TAG_TI_far_type
     574                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$23)
     575              $C$DW$96        .dwtag  DW_TAG_TI_ioport_type
     576                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$95)
     577              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
     578                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$96)
     579              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
     580                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     581                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE   12

     582              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
     583                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
     584                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     585              
     586              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     587                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     588              $C$DW$97        .dwtag  DW_TAG_member
     589                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$26)
     590                      .dwattr $C$DW$97, DW_AT_name("baseAddr")
     591                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_baseAddr")
     592                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     594              $C$DW$98        .dwtag  DW_TAG_member
     595                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$27)
     596                      .dwattr $C$DW$98, DW_AT_name("numPins")
     597                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_numPins")
     598                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     599                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     600                      .dwendtag $C$DW$T$28
     601              
     602              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioObj")
     603                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$28)
     604                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     605              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
     606                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
     607                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
     608              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
     609                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
     610                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
     611              
     612              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     613                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x03)
     614              $C$DW$99        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$30)
     616                      .dwattr $C$DW$99, DW_AT_name("pinNum")
     617                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_pinNum")
     618                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     619                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     620              $C$DW$100       .dwtag  DW_TAG_member
     621                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$32)
     622                      .dwattr $C$DW$100, DW_AT_name("direction")
     623                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_direction")
     624                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     625                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     626              $C$DW$101       .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$34)
     628                      .dwattr $C$DW$101, DW_AT_name("trigger")
     629                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_trigger")
     630                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     631                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     632                      .dwendtag $C$DW$T$35
     633              
     634              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioPinConfig")
     635                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$35)
     636                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE   13

     637              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
     638                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
     639                      .dwattr $C$DW$T$49, DW_AT_address_class(0x17)
     640              
     641              $C$DW$T$39      .dwtag  DW_TAG_structure_type
     642                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x48)
     643              $C$DW$102       .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
     645                      .dwattr $C$DW$102, DW_AT_name("EBSR")
     646                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_EBSR")
     647                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     649              $C$DW$103       .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
     651                      .dwattr $C$DW$103, DW_AT_name("RSVD0")
     652                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_RSVD0")
     653                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     654                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     655              $C$DW$104       .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
     657                      .dwattr $C$DW$104, DW_AT_name("PCGCR1")
     658                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PCGCR1")
     659                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     660                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     661              $C$DW$105       .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
     663                      .dwattr $C$DW$105, DW_AT_name("PCGCR2")
     664                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_PCGCR2")
     665                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     666                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     667              $C$DW$106       .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
     669                      .dwattr $C$DW$106, DW_AT_name("PSRCR")
     670                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_PSRCR")
     671                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     672                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     673              $C$DW$107       .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
     675                      .dwattr $C$DW$107, DW_AT_name("PRCR")
     676                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PRCR")
     677                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     678                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     679              $C$DW$108       .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$36)
     681                      .dwattr $C$DW$108, DW_AT_name("RSVD1")
     682                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_RSVD1")
     683                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     684                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     685              $C$DW$109       .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
     687                      .dwattr $C$DW$109, DW_AT_name("TIAFR")
     688                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_TIAFR")
     689                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     690                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     691              $C$DW$110       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE   14

     692                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
     693                      .dwattr $C$DW$110, DW_AT_name("RSVD2")
     694                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_RSVD2")
     695                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     696                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     697              $C$DW$111       .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
     699                      .dwattr $C$DW$111, DW_AT_name("ODSCR")
     700                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ODSCR")
     701                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     702                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     703              $C$DW$112       .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
     705                      .dwattr $C$DW$112, DW_AT_name("PDINHIBR1")
     706                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PDINHIBR1")
     707                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     708                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     709              $C$DW$113       .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
     711                      .dwattr $C$DW$113, DW_AT_name("PDINHIBR2")
     712                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PDINHIBR2")
     713                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     714                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     715              $C$DW$114       .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
     717                      .dwattr $C$DW$114, DW_AT_name("PDINHIBR3")
     718                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PDINHIBR3")
     719                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     720                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     721              $C$DW$115       .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
     723                      .dwattr $C$DW$115, DW_AT_name("DMA0CESR1")
     724                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_DMA0CESR1")
     725                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     726                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     727              $C$DW$116       .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
     729                      .dwattr $C$DW$116, DW_AT_name("DMA0CESR2")
     730                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_DMA0CESR2")
     731                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     732                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     733              $C$DW$117       .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
     735                      .dwattr $C$DW$117, DW_AT_name("DMA1CESR1")
     736                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_DMA1CESR1")
     737                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     738                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     739              $C$DW$118       .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
     741                      .dwattr $C$DW$118, DW_AT_name("DMA1CESR2")
     742                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_DMA1CESR2")
     743                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     744                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     745              $C$DW$119       .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE   15

     747                      .dwattr $C$DW$119, DW_AT_name("SDRAMCCR")
     748                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_SDRAMCCR")
     749                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     750                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     751              $C$DW$120       .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
     753                      .dwattr $C$DW$120, DW_AT_name("CCR2")
     754                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CCR2")
     755                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     756                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     757              $C$DW$121       .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
     759                      .dwattr $C$DW$121, DW_AT_name("CGCR1")
     760                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_CGCR1")
     761                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     762                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     763              $C$DW$122       .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
     765                      .dwattr $C$DW$122, DW_AT_name("CGICR")
     766                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_CGICR")
     767                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
     768                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     769              $C$DW$123       .dwtag  DW_TAG_member
     770                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
     771                      .dwattr $C$DW$123, DW_AT_name("CGCR2")
     772                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_CGCR2")
     773                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     774                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     775              $C$DW$124       .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
     777                      .dwattr $C$DW$124, DW_AT_name("CGOCR")
     778                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_CGOCR")
     779                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
     780                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     781              $C$DW$125       .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
     783                      .dwattr $C$DW$125, DW_AT_name("CCSSR")
     784                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_CCSSR")
     785                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     786                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     787              $C$DW$126       .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
     789                      .dwattr $C$DW$126, DW_AT_name("RSVD3")
     790                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_RSVD3")
     791                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
     792                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     793              $C$DW$127       .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
     795                      .dwattr $C$DW$127, DW_AT_name("ECDR")
     796                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ECDR")
     797                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     798                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     799              $C$DW$128       .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
     801                      .dwattr $C$DW$128, DW_AT_name("RSVD4")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE   16

     802                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_RSVD4")
     803                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
     804                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     805              $C$DW$129       .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
     807                      .dwattr $C$DW$129, DW_AT_name("RAMSLPMDCNTLR1")
     808                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
     809                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     810                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$130       .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
     813                      .dwattr $C$DW$130, DW_AT_name("RSVD5")
     814                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_RSVD5")
     815                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
     816                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
     817              $C$DW$131       .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
     819                      .dwattr $C$DW$131, DW_AT_name("RAMSLPMDCNTLR2")
     820                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
     821                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     822                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
     823              $C$DW$132       .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
     825                      .dwattr $C$DW$132, DW_AT_name("RAMSLPMDCNTLR3")
     826                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
     827                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
     828                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
     829              $C$DW$133       .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
     831                      .dwattr $C$DW$133, DW_AT_name("RAMSLPMDCNTLR4")
     832                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
     833                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     834                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
     835              $C$DW$134       .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
     837                      .dwattr $C$DW$134, DW_AT_name("RAMSLPMDCNTLR5")
     838                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
     839                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
     840                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
     841              $C$DW$135       .dwtag  DW_TAG_member
     842                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$37)
     843                      .dwattr $C$DW$135, DW_AT_name("RSVD6")
     844                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_RSVD6")
     845                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     846                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
     847              $C$DW$136       .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
     849                      .dwattr $C$DW$136, DW_AT_name("DMAIFR")
     850                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_DMAIFR")
     851                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     852                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$137       .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
     855                      .dwattr $C$DW$137, DW_AT_name("DMAIER")
     856                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_DMAIER")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE   17

     857                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
     858                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
     859              $C$DW$138       .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
     861                      .dwattr $C$DW$138, DW_AT_name("USBSCR")
     862                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_USBSCR")
     863                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     864                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
     865              $C$DW$139       .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
     867                      .dwattr $C$DW$139, DW_AT_name("ESCR")
     868                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ESCR")
     869                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
     870                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
     871              $C$DW$140       .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$37)
     873                      .dwattr $C$DW$140, DW_AT_name("RSVD7")
     874                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_RSVD7")
     875                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     876                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$141       .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
     879                      .dwattr $C$DW$141, DW_AT_name("DMA2CESR1")
     880                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_DMA2CESR1")
     881                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     882                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$142       .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
     885                      .dwattr $C$DW$142, DW_AT_name("DMA2CESR2")
     886                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_DMA2CESR2")
     887                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
     888                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$143       .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
     891                      .dwattr $C$DW$143, DW_AT_name("DMA3CESR1")
     892                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_DMA3CESR1")
     893                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     894                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
     895              $C$DW$144       .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
     897                      .dwattr $C$DW$144, DW_AT_name("DMA3CESR2")
     898                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_DMA3CESR2")
     899                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
     900                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$145       .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
     903                      .dwattr $C$DW$145, DW_AT_name("CLKSTOP")
     904                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_CLKSTOP")
     905                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     906                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
     907              $C$DW$146       .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$38)
     909                      .dwattr $C$DW$146, DW_AT_name("RSVD8")
     910                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_RSVD8")
     911                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE   18

     912                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
     913              $C$DW$147       .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
     915                      .dwattr $C$DW$147, DW_AT_name("DIEIDR0")
     916                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_DIEIDR0")
     917                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     918                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
     919              $C$DW$148       .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
     921                      .dwattr $C$DW$148, DW_AT_name("DIEIDR1")
     922                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_DIEIDR1")
     923                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
     924                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
     925              $C$DW$149       .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
     927                      .dwattr $C$DW$149, DW_AT_name("DIEIDR2")
     928                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_DIEIDR2")
     929                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     930                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
     931              $C$DW$150       .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
     933                      .dwattr $C$DW$150, DW_AT_name("DIEIDR3")
     934                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_DIEIDR3")
     935                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
     936                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
     937              $C$DW$151       .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
     939                      .dwattr $C$DW$151, DW_AT_name("DIEIDR4")
     940                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_DIEIDR4")
     941                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     942                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
     943              $C$DW$152       .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
     945                      .dwattr $C$DW$152, DW_AT_name("DIEIDR5")
     946                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_DIEIDR5")
     947                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
     948                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$153       .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
     951                      .dwattr $C$DW$153, DW_AT_name("DIEIDR6")
     952                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_DIEIDR6")
     953                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     954                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
     955              $C$DW$154       .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
     957                      .dwattr $C$DW$154, DW_AT_name("DIEIDR7")
     958                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_DIEIDR7")
     959                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
     960                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
     961                      .dwendtag $C$DW$T$39
     962              
     963              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
     964                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
     965                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
     966              $C$DW$155       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:24 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_gpio.asm                                                   PAGE   19

     967                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$50)
     968              $C$DW$156       .dwtag  DW_TAG_TI_ioport_type
     969                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$155)
     970              $C$DW$T$51      .dwtag  DW_TAG_volatile_type
     971                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$156)
     972              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
     973                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
     974                      .dwattr $C$DW$T$52, DW_AT_address_class(0x10)
     975              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
     976                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
     977                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     978              $C$DW$T$4       .dwtag  DW_TAG_base_type
     979                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     980                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     981                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     982              $C$DW$T$5       .dwtag  DW_TAG_base_type
     983                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     984                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     985                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     986              $C$DW$T$6       .dwtag  DW_TAG_base_type
     987                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     988                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     989                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     990              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
     991                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
     992                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     993              $C$DW$T$7       .dwtag  DW_TAG_base_type
     994                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     995                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     996                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     997              $C$DW$T$8       .dwtag  DW_TAG_base_type
     998                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     999                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1000                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1001              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1002                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$8)
    1003                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1004              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1005                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1006                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1007              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    1008                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1009                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    1010              $C$DW$T$9       .dwtag  DW_TAG_base_type
