TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE    1

    3467              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 15 12:23:51 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1574              $C$DW$198       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
    1575              $C$DW$199       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
    1576              $C$DW$200       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
    1577              $C$DW$201       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
    1578              $C$DW$202       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
    1579              $C$DW$203       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
    1580              $C$DW$204       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
    1581              $C$DW$205       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
    1582              $C$DW$206       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    1583              $C$DW$207       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
    1584              $C$DW$208       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
    1585              $C$DW$209       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    1586              $C$DW$210       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   51

    1587              $C$DW$211       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    1588              $C$DW$212       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
    1589              $C$DW$213       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    1590              $C$DW$214       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    1591              $C$DW$215       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    1592              $C$DW$216       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    1593              $C$DW$217       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    1594                      .dwendtag $C$DW$T$72
    1595              
    1596              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    1597                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    1598                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1599              
    1600              $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
    1601                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
    1602              $C$DW$218       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_POLLED"), DW_AT_const_value(0x00)
    1603              $C$DW$219       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_INTERRUPT"), DW_AT_const_value(0x01)
    1604              $C$DW$220       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_DMA"), DW_AT_const_value(0x02)
    1605              $C$DW$221       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_NONE"), DW_AT_const_value(0x03)
    1606                      .dwendtag $C$DW$T$85
    1607              
    1608              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDOpMode")
    1609                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    1610                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1611              
    1612              $C$DW$T$96      .dwtag  DW_TAG_enumeration_type
    1613                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
    1614              $C$DW$222       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
    1615              $C$DW$223       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_BIG"), DW_AT_const_value(0x01)
    1616                      .dwendtag $C$DW$T$96
    1617              
    1618              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdEndianMode")
    1619                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    1620                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1621              
    1622              $C$DW$T$99      .dwtag  DW_TAG_enumeration_type
    1623                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x01)
    1624              $C$DW$224       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD0_INST"), DW_AT_const_value(0x00)
    1625              $C$DW$225       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD1_INST"), DW_AT_const_value(0x01)
    1626              $C$DW$226       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INST_INV"), DW_AT_const_value(0x02)
    1627                      .dwendtag $C$DW$T$99
    1628              
    1629              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdInstId")
    1630                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    1631                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    1632              
    1633              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1634                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x75)
    1635              $C$DW$227       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    1637                      .dwattr $C$DW$227, DW_AT_name("MMCCTL")
    1638                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_MMCCTL")
    1639                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1640                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1641              $C$DW$228       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   52

    1642                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$21)
    1643                      .dwattr $C$DW$228, DW_AT_name("RSVD0")
    1644                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_RSVD0")
    1645                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1646                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1647              $C$DW$229       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    1649                      .dwattr $C$DW$229, DW_AT_name("MMCCLK")
    1650                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_MMCCLK")
    1651                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1652                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1653              $C$DW$230       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$21)
    1655                      .dwattr $C$DW$230, DW_AT_name("RSVD1")
    1656                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_RSVD1")
    1657                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1658                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1659              $C$DW$231       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    1661                      .dwattr $C$DW$231, DW_AT_name("MMCST0")
    1662                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_MMCST0")
    1663                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1664                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1665              $C$DW$232       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$21)
    1667                      .dwattr $C$DW$232, DW_AT_name("RSVD2")
    1668                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RSVD2")
    1669                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1670                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$233       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    1673                      .dwattr $C$DW$233, DW_AT_name("MMCST1")
    1674                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_MMCST1")
    1675                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1676                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1677              $C$DW$234       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$21)
    1679                      .dwattr $C$DW$234, DW_AT_name("RSVD3")
    1680                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_RSVD3")
    1681                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1682                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1683              $C$DW$235       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    1685                      .dwattr $C$DW$235, DW_AT_name("MMCIM")
    1686                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_MMCIM")
    1687                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1688                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1689              $C$DW$236       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$21)
    1691                      .dwattr $C$DW$236, DW_AT_name("RSVD4")
    1692                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_RSVD4")
    1693                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1694                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1695              $C$DW$237       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   53

    1697                      .dwattr $C$DW$237, DW_AT_name("MMCTOR")
    1698                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_MMCTOR")
    1699                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1700                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1701              $C$DW$238       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$21)
    1703                      .dwattr $C$DW$238, DW_AT_name("RSVD5")
    1704                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_RSVD5")
    1705                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1706                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$239       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    1709                      .dwattr $C$DW$239, DW_AT_name("MMCTOD")
    1710                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_MMCTOD")
    1711                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1712                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1713              $C$DW$240       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$21)
    1715                      .dwattr $C$DW$240, DW_AT_name("RSVD6")
    1716                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_RSVD6")
    1717                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1718                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1719              $C$DW$241       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    1721                      .dwattr $C$DW$241, DW_AT_name("MMCBLEN")
    1722                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_MMCBLEN")
    1723                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1724                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1725              $C$DW$242       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$21)
    1727                      .dwattr $C$DW$242, DW_AT_name("RSVD7")
    1728                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_RSVD7")
    1729                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1730                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1731              $C$DW$243       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    1733                      .dwattr $C$DW$243, DW_AT_name("MMCNBLK")
    1734                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_MMCNBLK")
    1735                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1736                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$244       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$21)
    1739                      .dwattr $C$DW$244, DW_AT_name("RSVD8")
    1740                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_RSVD8")
    1741                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1742                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1743              $C$DW$245       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    1745                      .dwattr $C$DW$245, DW_AT_name("MMCNBLC")
    1746                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_MMCNBLC")
    1747                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1748                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1749              $C$DW$246       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$21)
    1751                      .dwattr $C$DW$246, DW_AT_name("RSVD9")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   54

    1752                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_RSVD9")
    1753                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1754                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1755              $C$DW$247       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    1757                      .dwattr $C$DW$247, DW_AT_name("MMCDRR1")
    1758                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_MMCDRR1")
    1759                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1760                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1761              $C$DW$248       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    1763                      .dwattr $C$DW$248, DW_AT_name("MMCDRR2")
    1764                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_MMCDRR2")
    1765                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1766                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1767              $C$DW$249       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    1769                      .dwattr $C$DW$249, DW_AT_name("RSVD10")
    1770                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_RSVD10")
    1771                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1772                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    1773              $C$DW$250       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    1775                      .dwattr $C$DW$250, DW_AT_name("MMCDXR1")
    1776                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_MMCDXR1")
    1777                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1778                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$251       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    1781                      .dwattr $C$DW$251, DW_AT_name("MMCDXR2")
    1782                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_MMCDXR2")
    1783                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1784                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    1785              $C$DW$252       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    1787                      .dwattr $C$DW$252, DW_AT_name("RSVD11")
    1788                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_RSVD11")
    1789                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1790                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1791              $C$DW$253       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    1793                      .dwattr $C$DW$253, DW_AT_name("MMCCMD1")
    1794                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_MMCCMD1")
    1795                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1796                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1797              $C$DW$254       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    1799                      .dwattr $C$DW$254, DW_AT_name("MMCCMD2")
    1800                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_MMCCMD2")
    1801                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1802                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1803              $C$DW$255       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$22)
    1805                      .dwattr $C$DW$255, DW_AT_name("RSVD12")
    1806                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_RSVD12")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   55

    1807                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1808                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$256       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    1811                      .dwattr $C$DW$256, DW_AT_name("MMCARG1")
    1812                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_MMCARG1")
    1813                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1814                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1815              $C$DW$257       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    1817                      .dwattr $C$DW$257, DW_AT_name("MMCARG2")
    1818                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_MMCARG2")
    1819                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    1820                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1821              $C$DW$258       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$22)
    1823                      .dwattr $C$DW$258, DW_AT_name("RSVD13")
    1824                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_RSVD13")
    1825                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1826                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1827              $C$DW$259       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    1829                      .dwattr $C$DW$259, DW_AT_name("MMCRSP0")
    1830                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_MMCRSP0")
    1831                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1832                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1833              $C$DW$260       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    1835                      .dwattr $C$DW$260, DW_AT_name("MMCRSP1")
    1836                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_MMCRSP1")
    1837                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1838                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1839              $C$DW$261       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$22)
    1841                      .dwattr $C$DW$261, DW_AT_name("RSVD14")
    1842                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_RSVD14")
    1843                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1844                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1845              $C$DW$262       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    1847                      .dwattr $C$DW$262, DW_AT_name("MMCRSP2")
    1848                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_MMCRSP2")
    1849                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1850                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1851              $C$DW$263       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    1853                      .dwattr $C$DW$263, DW_AT_name("MMCRSP3")
    1854                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_MMCRSP3")
    1855                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    1856                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    1857              $C$DW$264       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$22)
    1859                      .dwattr $C$DW$264, DW_AT_name("RSVD15")
    1860                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_RSVD15")
    1861                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   56

    1862                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    1863              $C$DW$265       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    1865                      .dwattr $C$DW$265, DW_AT_name("MMCRSP4")
    1866                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_MMCRSP4")
    1867                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1868                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1869              $C$DW$266       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    1871                      .dwattr $C$DW$266, DW_AT_name("MMCRSP5")
    1872                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_MMCRSP5")
    1873                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1874                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$267       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$22)
    1877                      .dwattr $C$DW$267, DW_AT_name("RSVD16")
    1878                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_RSVD16")
    1879                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1880                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$268       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    1883                      .dwattr $C$DW$268, DW_AT_name("MMCRSP6")
    1884                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_MMCRSP6")
    1885                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1886                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1887              $C$DW$269       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    1889                      .dwattr $C$DW$269, DW_AT_name("MMCRSP7")
    1890                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_MMCRSP7")
    1891                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1892                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1893              $C$DW$270       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$22)
    1895                      .dwattr $C$DW$270, DW_AT_name("RSVD17")
    1896                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_RSVD17")
    1897                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1898                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1899              $C$DW$271       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    1901                      .dwattr $C$DW$271, DW_AT_name("MMCDRSP")
    1902                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_MMCDRSP")
    1903                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1904                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1905              $C$DW$272       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$23)
    1907                      .dwattr $C$DW$272, DW_AT_name("RSVD18")
    1908                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_RSVD18")
    1909                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    1910                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1911              $C$DW$273       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    1913                      .dwattr $C$DW$273, DW_AT_name("MMCCIDX")
    1914                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_MMCCIDX")
    1915                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1916                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   57

    1917              $C$DW$274       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$24)
    1919                      .dwattr $C$DW$274, DW_AT_name("RSVD19")
    1920                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_RSVD19")
    1921                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    1922                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$275       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    1925                      .dwattr $C$DW$275, DW_AT_name("SDIOCTL")
    1926                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_SDIOCTL")
    1927                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1928                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$276       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$21)
    1931                      .dwattr $C$DW$276, DW_AT_name("RSVD20")
    1932                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_RSVD20")
    1933                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    1934                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    1935              $C$DW$277       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    1937                      .dwattr $C$DW$277, DW_AT_name("SDIOST0")
    1938                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_SDIOST0")
    1939                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1940                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    1941              $C$DW$278       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    1943                      .dwattr $C$DW$278, DW_AT_name("RSVD21")
    1944                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_RSVD21")
    1945                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    1946                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    1947              $C$DW$279       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    1949                      .dwattr $C$DW$279, DW_AT_name("SDIOIEN")
    1950                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_SDIOIEN")
    1951                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1952                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$280       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
    1955                      .dwattr $C$DW$280, DW_AT_name("RSVD22")
    1956                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_RSVD22")
    1957                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
    1958                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    1959              $C$DW$281       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    1961                      .dwattr $C$DW$281, DW_AT_name("SDIOIST")
    1962                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_SDIOIST")
    1963                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1964                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    1965              $C$DW$282       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    1967                      .dwattr $C$DW$282, DW_AT_name("RSVD23")
    1968                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_RSVD23")
    1969                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    1970                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$283       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   58

    1972                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    1973                      .dwattr $C$DW$283, DW_AT_name("MMCFIFOCTL")
    1974                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_MMCFIFOCTL")
    1975                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1976                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    1977                      .dwendtag $C$DW$T$25
    1978              
    1979              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
    1980                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$25)
    1981                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1982              $C$DW$284       .dwtag  DW_TAG_TI_far_type
    1983                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$77)
    1984              $C$DW$285       .dwtag  DW_TAG_TI_ioport_type
    1985                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$284)
    1986              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
    1987                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$285)
    1988              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    1989                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    1990                      .dwattr $C$DW$T$79, DW_AT_address_class(0x10)
    1991              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
    1992                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    1993                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1994              
    1995              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1996                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    1997              $C$DW$286       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    1999                      .dwattr $C$DW$286, DW_AT_name("mfgId")
    2000                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_mfgId")
    2001                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2003              $C$DW$287       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$287, DW_AT_name("oemAppId")
    2006                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_oemAppId")
    2007                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2008                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2009              $C$DW$288       .dwtag  DW_TAG_member
    2010                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$27)
    2011                      .dwattr $C$DW$288, DW_AT_name("productName")
    2012                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_productName")
    2013                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2014                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2015              $C$DW$289       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    2017                      .dwattr $C$DW$289, DW_AT_name("productRev")
    2018                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_productRev")
    2019                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2020                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2021              $C$DW$290       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$28)
    2023                      .dwattr $C$DW$290, DW_AT_name("serialNumber")
    2024                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_serialNumber")
    2025                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2026                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   59

    2027              $C$DW$291       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    2029                      .dwattr $C$DW$291, DW_AT_name("month")
    2030                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_month")
    2031                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2032                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2033              $C$DW$292       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    2035                      .dwattr $C$DW$292, DW_AT_name("year")
    2036                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_year")
    2037                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2038                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2039              $C$DW$293       .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    2041                      .dwattr $C$DW$293, DW_AT_name("checksum")
    2042                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_checksum")
    2043                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2044                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2045                      .dwendtag $C$DW$T$29
    2046              
    2047              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardIdObj")
    2048                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$29)
    2049                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2050              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    2051                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2052                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    2053              
    2054              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2055                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x22)
    2056              $C$DW$294       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    2058                      .dwattr $C$DW$294, DW_AT_name("csdStruct")
    2059                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_csdStruct")
    2060                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2061                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2062              $C$DW$295       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    2064                      .dwattr $C$DW$295, DW_AT_name("mmcProt")
    2065                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_mmcProt")
    2066                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2067                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2068              $C$DW$296       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    2070                      .dwattr $C$DW$296, DW_AT_name("taac")
    2071                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_taac")
    2072                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2073                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2074              $C$DW$297       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    2076                      .dwattr $C$DW$297, DW_AT_name("nsac")
    2077                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_nsac")
    2078                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2079                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2080              $C$DW$298       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   60

    2082                      .dwattr $C$DW$298, DW_AT_name("tranSpeed")
    2083                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_tranSpeed")
    2084                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2085                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2086              $C$DW$299       .dwtag  DW_TAG_member
    2087                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    2088                      .dwattr $C$DW$299, DW_AT_name("ccc")
    2089                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_ccc")
    2090                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2091                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2092              $C$DW$300       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    2094                      .dwattr $C$DW$300, DW_AT_name("readBlLen")
    2095                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_readBlLen")
    2096                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2097                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2098              $C$DW$301       .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    2100                      .dwattr $C$DW$301, DW_AT_name("readBlPartial")
    2101                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_readBlPartial")
    2102                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2103                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2104              $C$DW$302       .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    2106                      .dwattr $C$DW$302, DW_AT_name("writeBlkMisalign")
    2107                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_writeBlkMisalign")
    2108                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2109                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2110              $C$DW$303       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    2112                      .dwattr $C$DW$303, DW_AT_name("readBlkMisalign")
    2113                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_readBlkMisalign")
    2114                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2115                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2116              $C$DW$304       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    2118                      .dwattr $C$DW$304, DW_AT_name("dsrImp")
    2119                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_dsrImp")
    2120                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2121                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2122              $C$DW$305       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    2124                      .dwattr $C$DW$305, DW_AT_name("cSize")
    2125                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_cSize")
    2126                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2127                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2128              $C$DW$306       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$306, DW_AT_name("vddRCurrMin")
    2131                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_vddRCurrMin")
    2132                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2133                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2134              $C$DW$307       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
    2136                      .dwattr $C$DW$307, DW_AT_name("vddRCurrMax")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   61

    2137                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_vddRCurrMax")
    2138                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2139                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2140              $C$DW$308       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$19)
    2142                      .dwattr $C$DW$308, DW_AT_name("vddWCurrMin")
    2143                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_vddWCurrMin")
    2144                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2145                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2146              $C$DW$309       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
    2148                      .dwattr $C$DW$309, DW_AT_name("vddWCurrMax")
    2149                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_vddWCurrMax")
    2150                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2151                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2152              $C$DW$310       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$19)
    2154                      .dwattr $C$DW$310, DW_AT_name("cSizeMult")
    2155                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_cSizeMult")
    2156                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2157                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2158              $C$DW$311       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    2160                      .dwattr $C$DW$311, DW_AT_name("eraseBlkEnable")
    2161                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_eraseBlkEnable")
    2162                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2163                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$312       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$312, DW_AT_name("eraseGrpSize")
    2167                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_eraseGrpSize")
    2168                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2169                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2170              $C$DW$313       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    2172                      .dwattr $C$DW$313, DW_AT_name("eraseGrpMult")
    2173                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_eraseGrpMult")
    2174                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2175                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2176              $C$DW$314       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    2178                      .dwattr $C$DW$314, DW_AT_name("wpGrpSize")
    2179                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_wpGrpSize")
    2180                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2181                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2182              $C$DW$315       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    2184                      .dwattr $C$DW$315, DW_AT_name("wpGrpEnable")
    2185                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_wpGrpEnable")
    2186                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2187                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$316       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    2190                      .dwattr $C$DW$316, DW_AT_name("defaultEcc")
    2191                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_defaultEcc")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   62

    2192                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2193                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$317       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    2196                      .dwattr $C$DW$317, DW_AT_name("r2wFactor")
    2197                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_r2wFactor")
    2198                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2199                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$318       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$318, DW_AT_name("writeBlLen")
    2203                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_writeBlLen")
    2204                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2205                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$319       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$319, DW_AT_name("writeBlPartial")
    2209                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_writeBlPartial")
    2210                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2211                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2212              $C$DW$320       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    2214                      .dwattr $C$DW$320, DW_AT_name("contProtApp")
    2215                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_contProtApp")
    2216                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2217                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2218              $C$DW$321       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    2220                      .dwattr $C$DW$321, DW_AT_name("fileFmtGrp")
    2221                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_fileFmtGrp")
    2222                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2223                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2224              $C$DW$322       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    2226                      .dwattr $C$DW$322, DW_AT_name("copyFlag")
    2227                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_copyFlag")
    2228                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2229                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$323       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    2232                      .dwattr $C$DW$323, DW_AT_name("permWriteProtect")
    2233                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_permWriteProtect")
    2234                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2235                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$324       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$324, DW_AT_name("tmpWriteProtect")
    2239                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_tmpWriteProtect")
    2240                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2241                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2242              $C$DW$325       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    2244                      .dwattr $C$DW$325, DW_AT_name("fileFmt")
    2245                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_fileFmt")
    2246                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   63

    2247                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2248              $C$DW$326       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    2250                      .dwattr $C$DW$326, DW_AT_name("ecc")
    2251                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_ecc")
    2252                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2253                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2254              $C$DW$327       .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    2256                      .dwattr $C$DW$327, DW_AT_name("crc")
    2257                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_crc")
    2258                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2259                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2260                      .dwendtag $C$DW$T$30
    2261              
    2262              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardCsdObj")
    2263                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$30)
    2264                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2265              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2266                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2267                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    2268              
    2269              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2270                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x06)
    2271              $C$DW$328       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$328, DW_AT_name("securitySysId")
    2274                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_securitySysId")
    2275                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2276                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2277              $C$DW$329       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    2279                      .dwattr $C$DW$329, DW_AT_name("securitySysVers")
    2280                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_securitySysVers")
    2281                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2282                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2283              $C$DW$330       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    2285                      .dwattr $C$DW$330, DW_AT_name("maxLicenses")
    2286                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_maxLicenses")
    2287                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2288                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2289              $C$DW$331       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$28)
    2291                      .dwattr $C$DW$331, DW_AT_name("xStatus")
    2292                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_xStatus")
    2293                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2294                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2295                      .dwendtag $C$DW$T$31
    2296              
    2297              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardXCsdObj")
    2298                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
    2299                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2300              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    2301                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   64

    2302                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    2303              
    2304              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2305                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x1e)
    2306              $C$DW$332       .dwtag  DW_TAG_member
    2307                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    2308                      .dwattr $C$DW$332, DW_AT_name("rca")
    2309                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_rca")
    2310                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2311                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2312              $C$DW$333       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    2314                      .dwattr $C$DW$333, DW_AT_name("ST0")
    2315                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_ST0")
    2316                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2317                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2318              $C$DW$334       .dwtag  DW_TAG_member
    2319                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    2320                      .dwattr $C$DW$334, DW_AT_name("ST1")
    2321                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_ST1")
    2322                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2323                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2324              $C$DW$335       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    2326                      .dwattr $C$DW$335, DW_AT_name("cardIndex")
    2327                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_cardIndex")
    2328                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2329                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2330              $C$DW$336       .dwtag  DW_TAG_member
    2331                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$28)
    2332                      .dwattr $C$DW$336, DW_AT_name("maxXfrRate")
    2333                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_maxXfrRate")
    2334                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2335                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2336              $C$DW$337       .dwtag  DW_TAG_member
    2337                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$28)
    2338                      .dwattr $C$DW$337, DW_AT_name("readAccessTime")
    2339                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_readAccessTime")
    2340                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2341                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2342              $C$DW$338       .dwtag  DW_TAG_member
    2343                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$28)
    2344                      .dwattr $C$DW$338, DW_AT_name("cardCapacity")
    2345                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_cardCapacity")
    2346                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2347                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2348              $C$DW$339       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$28)
    2350                      .dwattr $C$DW$339, DW_AT_name("blockLength")
    2351                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_blockLength")
    2352                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2353                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2354              $C$DW$340       .dwtag  DW_TAG_member
    2355                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$28)
    2356                      .dwattr $C$DW$340, DW_AT_name("totalSectors")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   65

    2357                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_totalSectors")
    2358                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2359                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2360              $C$DW$341       .dwtag  DW_TAG_member
    2361                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$28)
    2362                      .dwattr $C$DW$341, DW_AT_name("lastAddrRead")
    2363                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_lastAddrRead")
    2364                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2365                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2366              $C$DW$342       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$28)
    2368                      .dwattr $C$DW$342, DW_AT_name("lastAddrWritten")
    2369                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_lastAddrWritten")
    2370                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2371                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2372              $C$DW$343       .dwtag  DW_TAG_member
    2373                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$33)
    2374                      .dwattr $C$DW$343, DW_AT_name("cardType")
    2375                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_cardType")
    2376                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2377                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2378              $C$DW$344       .dwtag  DW_TAG_member
    2379                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$35)
    2380                      .dwattr $C$DW$344, DW_AT_name("cid")
    2381                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_cid")
    2382                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2383                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2384              $C$DW$345       .dwtag  DW_TAG_member
    2385                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$37)
    2386                      .dwattr $C$DW$345, DW_AT_name("csd")
    2387                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_csd")
    2388                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2389                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2390              $C$DW$346       .dwtag  DW_TAG_member
    2391                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$39)
    2392                      .dwattr $C$DW$346, DW_AT_name("xcsd")
    2393                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_xcsd")
    2394                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2395                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2396              $C$DW$347       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$40)
    2398                      .dwattr $C$DW$347, DW_AT_name("sdHcDetected")
    2399                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_sdHcDetected")
    2400                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2401                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2402              $C$DW$348       .dwtag  DW_TAG_member
    2403                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$40)
    2404                      .dwattr $C$DW$348, DW_AT_name("cardAtaFsOpen")
    2405                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_cardAtaFsOpen")
    2406                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2407                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2408              $C$DW$349       .dwtag  DW_TAG_member
    2409                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    2410                      .dwattr $C$DW$349, DW_AT_name("cardMscStatus")
    2411                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_cardMscStatus")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   66

    2412                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2413                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2414                      .dwendtag $C$DW$T$41
    2415              
    2416              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardObj")
    2417                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$41)
    2418                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2419              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    2420                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    2421                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    2422              
    2423              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2424                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    2425              $C$DW$350       .dwtag  DW_TAG_member
    2426                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$45)
    2427                      .dwattr $C$DW$350, DW_AT_name("isr")
    2428                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_isr")
    2429                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2430                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2431                      .dwendtag $C$DW$T$46
    2432              
    2433              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackObj")
    2434                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$46)
    2435                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2436              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    2437                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    2438                      .dwattr $C$DW$T$84, DW_AT_address_class(0x17)
    2439              
    2440              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2441                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x66)
    2442              $C$DW$351       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    2444                      .dwattr $C$DW$351, DW_AT_name("DMACH0SSAL")
    2445                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_DMACH0SSAL")
    2446                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2448              $C$DW$352       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    2450                      .dwattr $C$DW$352, DW_AT_name("DMACH0SSAU")
    2451                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_DMACH0SSAU")
    2452                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2453                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$353       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    2456                      .dwattr $C$DW$353, DW_AT_name("DMACH0DSAL")
    2457                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_DMACH0DSAL")
    2458                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2459                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2460              $C$DW$354       .dwtag  DW_TAG_member
    2461                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    2462                      .dwattr $C$DW$354, DW_AT_name("DMACH0DSAU")
    2463                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_DMACH0DSAU")
    2464                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2465                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2466              $C$DW$355       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   67

    2467                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    2468                      .dwattr $C$DW$355, DW_AT_name("DMACH0TCR1")
    2469                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_DMACH0TCR1")
    2470                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2471                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2472              $C$DW$356       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    2474                      .dwattr $C$DW$356, DW_AT_name("DMACH0TCR2")
    2475                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_DMACH0TCR2")
    2476                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2477                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2478              $C$DW$357       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$47)
    2480                      .dwattr $C$DW$357, DW_AT_name("RSVD0")
    2481                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_RSVD0")
    2482                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2483                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2484              $C$DW$358       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    2486                      .dwattr $C$DW$358, DW_AT_name("DMACH1SSAL")
    2487                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_DMACH1SSAL")
    2488                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2489                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2490              $C$DW$359       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    2492                      .dwattr $C$DW$359, DW_AT_name("DMACH1SSAU")
    2493                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_DMACH1SSAU")
    2494                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2495                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2496              $C$DW$360       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    2498                      .dwattr $C$DW$360, DW_AT_name("DMACH1DSAL")
    2499                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_DMACH1DSAL")
    2500                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2501                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2502              $C$DW$361       .dwtag  DW_TAG_member
    2503                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    2504                      .dwattr $C$DW$361, DW_AT_name("DMACH1DSAU")
    2505                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_DMACH1DSAU")
    2506                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2507                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2508              $C$DW$362       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    2510                      .dwattr $C$DW$362, DW_AT_name("DMACH1TCR1")
    2511                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_DMACH1TCR1")
    2512                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2513                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2514              $C$DW$363       .dwtag  DW_TAG_member
    2515                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    2516                      .dwattr $C$DW$363, DW_AT_name("DMACH1TCR2")
    2517                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_DMACH1TCR2")
    2518                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2519                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2520              $C$DW$364       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$47)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   68

    2522                      .dwattr $C$DW$364, DW_AT_name("RSVD1")
    2523                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_RSVD1")
    2524                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2525                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2526              $C$DW$365       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    2528                      .dwattr $C$DW$365, DW_AT_name("DMACH2SSAL")
    2529                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_DMACH2SSAL")
    2530                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2531                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2532              $C$DW$366       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    2534                      .dwattr $C$DW$366, DW_AT_name("DMACH2SSAU")
    2535                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_DMACH2SSAU")
    2536                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2537                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2538              $C$DW$367       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2540                      .dwattr $C$DW$367, DW_AT_name("DMACH2DSAL")
    2541                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_DMACH2DSAL")
    2542                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2543                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2544              $C$DW$368       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2546                      .dwattr $C$DW$368, DW_AT_name("DMACH2DSAU")
    2547                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_DMACH2DSAU")
    2548                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2549                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2550              $C$DW$369       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2552                      .dwattr $C$DW$369, DW_AT_name("DMACH2TCR1")
    2553                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_DMACH2TCR1")
    2554                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2555                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2556              $C$DW$370       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    2558                      .dwattr $C$DW$370, DW_AT_name("DMACH2TCR2")
    2559                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_DMACH2TCR2")
    2560                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2561                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2562              $C$DW$371       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$47)
    2564                      .dwattr $C$DW$371, DW_AT_name("RSVD2")
    2565                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_RSVD2")
    2566                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2567                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2568              $C$DW$372       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    2570                      .dwattr $C$DW$372, DW_AT_name("DMACH3SSAL")
    2571                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_DMACH3SSAL")
    2572                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2573                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2574              $C$DW$373       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    2576                      .dwattr $C$DW$373, DW_AT_name("DMACH3SSAU")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   69

    2577                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_DMACH3SSAU")
    2578                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    2579                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2580              $C$DW$374       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    2582                      .dwattr $C$DW$374, DW_AT_name("DMACH3DSAL")
    2583                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_DMACH3DSAL")
    2584                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2585                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2586              $C$DW$375       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    2588                      .dwattr $C$DW$375, DW_AT_name("DMACH3DSAU")
    2589                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_DMACH3DSAU")
    2590                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2591                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2592              $C$DW$376       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    2594                      .dwattr $C$DW$376, DW_AT_name("DMACH3TCR1")
    2595                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_DMACH3TCR1")
    2596                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2597                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2598              $C$DW$377       .dwtag  DW_TAG_member
    2599                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    2600                      .dwattr $C$DW$377, DW_AT_name("DMACH3TCR2")
    2601                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_DMACH3TCR2")
    2602                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    2603                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2604                      .dwendtag $C$DW$T$48
    2605              
    2606              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    2607                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2608                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2609              $C$DW$378       .dwtag  DW_TAG_TI_far_type
    2610                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$49)
    2611              $C$DW$379       .dwtag  DW_TAG_TI_ioport_type
    2612                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$378)
    2613              $C$DW$T$50      .dwtag  DW_TAG_volatile_type
    2614                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$379)
    2615              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    2616                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2617                      .dwattr $C$DW$T$51, DW_AT_address_class(0x10)
    2618              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    2619                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2620                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2621              
    2622              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    2623                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x09)
    2624              $C$DW$380       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$52)
    2626                      .dwattr $C$DW$380, DW_AT_name("dmaRegs")
    2627                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_dmaRegs")
    2628                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2630              $C$DW$381       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$54)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   70

    2632                      .dwattr $C$DW$381, DW_AT_name("chanNum")
    2633                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_chanNum")
    2634                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2635                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2636              $C$DW$382       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$56)
    2638                      .dwattr $C$DW$382, DW_AT_name("dmaInstNum")
    2639                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_dmaInstNum")
    2640                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2641                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2642              $C$DW$383       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$40)
    2644                      .dwattr $C$DW$383, DW_AT_name("isChanFree")
    2645                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_isChanFree")
    2646                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2647                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2648              $C$DW$384       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$58)
    2650                      .dwattr $C$DW$384, DW_AT_name("chanDir")
    2651                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_chanDir")
    2652                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2653                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2654              $C$DW$385       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$60)
    2656                      .dwattr $C$DW$385, DW_AT_name("trigger")
    2657                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_trigger")
    2658                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2659                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$386       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$62)
    2662                      .dwattr $C$DW$386, DW_AT_name("trfType")
    2663                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_trfType")
    2664                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2665                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2666              $C$DW$387       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$64)
    2668                      .dwattr $C$DW$387, DW_AT_name("dmaInt")
    2669                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_dmaInt")
    2670                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2671                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2672              $C$DW$388       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$40)
    2674                      .dwattr $C$DW$388, DW_AT_name("pingPongEnabled")
    2675                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_pingPongEnabled")
    2676                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2677                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2678                      .dwendtag $C$DW$T$65
    2679              
    2680              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    2681                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$65)
    2682                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2683              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    2684                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    2685                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
    2686              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   71

    2687                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    2688                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2689              
    2690              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    2691                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0e)
    2692              $C$DW$389       .dwtag  DW_TAG_member
    2693                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$67)
    2694                      .dwattr $C$DW$389, DW_AT_name("pingPongMode")
    2695                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_pingPongMode")
    2696                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2697                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2698              $C$DW$390       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$69)
    2700                      .dwattr $C$DW$390, DW_AT_name("autoMode")
    2701                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_autoMode")
    2702                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2703                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2704              $C$DW$391       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$71)
    2706                      .dwattr $C$DW$391, DW_AT_name("burstLen")
    2707                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_burstLen")
    2708                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2709                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2710              $C$DW$392       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$60)
    2712                      .dwattr $C$DW$392, DW_AT_name("trigger")
    2713                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_trigger")
    2714                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2715                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2716              $C$DW$393       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$73)
    2718                      .dwattr $C$DW$393, DW_AT_name("dmaEvt")
    2719                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_dmaEvt")
    2720                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2721                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2722              $C$DW$394       .dwtag  DW_TAG_member
    2723                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$64)
    2724                      .dwattr $C$DW$394, DW_AT_name("dmaInt")
    2725                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_dmaInt")
    2726                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2727                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2728              $C$DW$395       .dwtag  DW_TAG_member
    2729                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$58)
    2730                      .dwattr $C$DW$395, DW_AT_name("chanDir")
    2731                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_chanDir")
    2732                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2733                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2734              $C$DW$396       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$62)
    2736                      .dwattr $C$DW$396, DW_AT_name("trfType")
    2737                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_trfType")
    2738                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2739                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    2740              $C$DW$397       .dwtag  DW_TAG_member
    2741                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sdcard.asm                                                 PAGE   72

    2742                      .dwattr $C$DW$397, DW_AT_name("dataLen")
    2743                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_dataLen")
    2744                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2745                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2746              $C$DW$398       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$28)
    2748                      .dwattr $C$DW$398, DW_AT_name("srcAddr")
    2749                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_srcAddr")
    2750                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2751                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2752              $C$DW$399       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$28)
    2754                      .dwattr $C$DW$399, DW_AT_name("destAddr")
    2755                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_destAddr")
    2756                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2757                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2758                      .dwendtag $C$DW$T$74
    2759              
    2760              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    2761                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$74)
    2762                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2763              
    2764              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    2765                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    2766              $C$DW$400       .dwtag  DW_TAG_member
    2767                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    2768                      .dwattr $C$DW$400, DW_AT_name("slice127_112")
    2769                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_slice127_112")
    2770                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2771                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2772              $C$DW$401       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
    2774                      .dwattr $C$DW$401, DW_AT_name("slice111_96")
