TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535.asm                                                        PAGE    1

     983              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 15 12:23:48 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     174              $C$DW$11        .dwtag  DW_TAG_TI_branch
     175                      .dwattr $C$DW$11, DW_AT_low_pc(0x00)
     176                      .dwattr $C$DW$11, DW_AT_name("_EZDSP5535_wait")
     177                      .dwattr $C$DW$11, DW_AT_TI_call
     178 00003f 08FF          CALL #_EZDSP5535_wait ; |66| 
         000041 BE   
     179                                                      ; call occurs [#_EZDSP5535_wait] ; |66| 
     180                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535.c",line 67,column 1,is_stmt
     181 000042 4E03          AADD #3, SP
     182                      .dwcfi  cfa_offset, 1
     183              $C$DW$12        .dwtag  DW_TAG_TI_branch
     184                      .dwattr $C$DW$12, DW_AT_low_pc(0x00)
     185                      .dwattr $C$DW$12, DW_AT_TI_return
     186 000044 4804          RET
     187                                                      ; return occurs
     188                      .dwattr $C$DW$8, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535.c")
     189                      .dwattr $C$DW$8, DW_AT_TI_end_line(0x43)
     190                      .dwattr $C$DW$8, DW_AT_TI_end_column(0x01)
     191                      .dwendentry
     192                      .dwendtag $C$DW$8
     193              
     194 000046               .sect   ".text"
     195                      .align 4
     196                      .global _EZDSP5535_init
     197              
     198              $C$DW$13        .dwtag  DW_TAG_subprogram, DW_AT_name("EZDSP5535_init")
     199                      .dwattr $C$DW$13, DW_AT_low_pc(_EZDSP5535_init)
     200                      .dwattr $C$DW$13, DW_AT_high_pc(0x00)
     201                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_EZDSP5535_init")
     202                      .dwattr $C$DW$13, DW_AT_external
     203                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$32)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535.asm                                                        PAGE    5

     204                      .dwattr $C$DW$13, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535.c")
     205                      .dwattr $C$DW$13, DW_AT_TI_begin_line(0x4a)
     206                      .dwattr $C$DW$13, DW_AT_TI_begin_column(0x07)
     207                      .dwattr $C$DW$13, DW_AT_TI_max_frame_size(0x01)
     208                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535.c",line 75,column 1,is_stmt,address _E
     209              
     210                      .dwfde $C$DW$CIE, _EZDSP5535_init
     211              ;*******************************************************************************
     212              ;* FUNCTION NAME: EZDSP5535_init                                               *
     213              ;*                                                                             *
     214              ;*   Function Uses Regs : T0,SP,M40,SATA,SATD,RDM,FRCT,SMUL                    *
     215              ;*   Stack Frame        : Compact (No Frame Pointer, w/ debug)                 *
     216              ;*   Total Frame Size   : 1 word                                               *
     217              ;*                        (1 return address/alignment)                         *
     218              ;*   Min System Stack   : 1 word                                               *
     219              ;*******************************************************************************
     220 000048       _EZDSP5535_init:
     221                      .dwcfi  cfa_offset, 1
     222                      .dwcfi  save_reg_to_mem, 91, -1
     223                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535.c",line 77,column 5,is_stmt
     224 000048 E651          MOV #0, *port(#7170) ; |77| 
         00004a 001C 
         00004c 02   
     225                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535.c",line 78,column 5,is_stmt
     226 00004d E651          MOV #0, *port(#7171) ; |78| 
         00004f 001C 
         000051 03   
     227                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535.c",line 80,column 5,is_stmt
     228 000052 3C04          MOV #0, T0
     229                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535.c",line 81,column 1,is_stmt
     230              $C$DW$14        .dwtag  DW_TAG_TI_branch
     231                      .dwattr $C$DW$14, DW_AT_low_pc(0x00)
     232                      .dwattr $C$DW$14, DW_AT_TI_return
     233 000054 4804          RET
     234                                                      ; return occurs
     235                      .dwattr $C$DW$13, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535.c")
     236                      .dwattr $C$DW$13, DW_AT_TI_end_line(0x51)
     237                      .dwattr $C$DW$13, DW_AT_TI_end_column(0x01)
     238                      .dwendentry
     239                      .dwendtag $C$DW$13
     240              
     241              
     242              ;*******************************************************************************
     243              ;* TYPE INFORMATION                                                            *
     244              ;*******************************************************************************
     245              
     246              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     247                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x48)
     248              $C$DW$15        .dwtag  DW_TAG_member
     249                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     250                      .dwattr $C$DW$15, DW_AT_name("EBSR")
     251                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_EBSR")
     252                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     253                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     254              $C$DW$16        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535.asm                                                        PAGE    6

     255                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
     256                      .dwattr $C$DW$16, DW_AT_name("RSVD0")
     257                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_RSVD0")
     258                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     259                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     260              $C$DW$17        .dwtag  DW_TAG_member
     261                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$20)
     262                      .dwattr $C$DW$17, DW_AT_name("PCGCR1")
     263                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_PCGCR1")
     264                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     265                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     266              $C$DW$18        .dwtag  DW_TAG_member
     267                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$20)
     268                      .dwattr $C$DW$18, DW_AT_name("PCGCR2")
     269                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_PCGCR2")
     270                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     271                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     272              $C$DW$19        .dwtag  DW_TAG_member
     273                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
     274                      .dwattr $C$DW$19, DW_AT_name("PSRCR")
     275                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_PSRCR")
     276                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     277                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     278              $C$DW$20        .dwtag  DW_TAG_member
     279                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
     280                      .dwattr $C$DW$20, DW_AT_name("PRCR")
     281                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_PRCR")
     282                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     283                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     284              $C$DW$21        .dwtag  DW_TAG_member
     285                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$21)
     286                      .dwattr $C$DW$21, DW_AT_name("RSVD1")
     287                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_RSVD1")
     288                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     289                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     290              $C$DW$22        .dwtag  DW_TAG_member
     291                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
     292                      .dwattr $C$DW$22, DW_AT_name("TIAFR")
     293                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_TIAFR")
     294                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     295                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     296              $C$DW$23        .dwtag  DW_TAG_member
     297                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
     298                      .dwattr $C$DW$23, DW_AT_name("RSVD2")
     299                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_RSVD2")
     300                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     301                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     302              $C$DW$24        .dwtag  DW_TAG_member
     303                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     304                      .dwattr $C$DW$24, DW_AT_name("ODSCR")
     305                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_ODSCR")
     306                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     307                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     308              $C$DW$25        .dwtag  DW_TAG_member
     309                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535.asm                                                        PAGE    7

     310                      .dwattr $C$DW$25, DW_AT_name("PDINHIBR1")
     311                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_PDINHIBR1")
     312                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     313                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     314              $C$DW$26        .dwtag  DW_TAG_member
     315                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
     316                      .dwattr $C$DW$26, DW_AT_name("PDINHIBR2")
     317                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_PDINHIBR2")
     318                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     319                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     320              $C$DW$27        .dwtag  DW_TAG_member
     321                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$20)
     322                      .dwattr $C$DW$27, DW_AT_name("PDINHIBR3")
     323                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_PDINHIBR3")
     324                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     325                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     326              $C$DW$28        .dwtag  DW_TAG_member
     327                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
     328                      .dwattr $C$DW$28, DW_AT_name("DMA0CESR1")
     329                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_DMA0CESR1")
     330                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     331                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     332              $C$DW$29        .dwtag  DW_TAG_member
     333                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$20)
     334                      .dwattr $C$DW$29, DW_AT_name("DMA0CESR2")
     335                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_DMA0CESR2")
     336                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     337                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     338              $C$DW$30        .dwtag  DW_TAG_member
     339                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$20)
     340                      .dwattr $C$DW$30, DW_AT_name("DMA1CESR1")
     341                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_DMA1CESR1")
     342                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     343                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     344              $C$DW$31        .dwtag  DW_TAG_member
     345                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
     346                      .dwattr $C$DW$31, DW_AT_name("DMA1CESR2")
     347                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_DMA1CESR2")
     348                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     349                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     350              $C$DW$32        .dwtag  DW_TAG_member
     351                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$20)
     352                      .dwattr $C$DW$32, DW_AT_name("SDRAMCCR")
     353                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_SDRAMCCR")
     354                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     355                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     356              $C$DW$33        .dwtag  DW_TAG_member
     357                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
     358                      .dwattr $C$DW$33, DW_AT_name("CCR2")
     359                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_CCR2")
     360                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     361                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     362              $C$DW$34        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$20)
     364                      .dwattr $C$DW$34, DW_AT_name("CGCR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535.asm                                                        PAGE    8

     365                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_CGCR1")
     366                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     367                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     368              $C$DW$35        .dwtag  DW_TAG_member
     369                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$20)
     370                      .dwattr $C$DW$35, DW_AT_name("CGICR")
     371                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_CGICR")
     372                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
     373                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     374              $C$DW$36        .dwtag  DW_TAG_member
     375                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$20)
     376                      .dwattr $C$DW$36, DW_AT_name("CGCR2")
     377                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_CGCR2")
     378                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     379                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     380              $C$DW$37        .dwtag  DW_TAG_member
     381                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$20)
     382                      .dwattr $C$DW$37, DW_AT_name("CGOCR")
     383                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_CGOCR")
     384                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
     385                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     386              $C$DW$38        .dwtag  DW_TAG_member
     387                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$20)
     388                      .dwattr $C$DW$38, DW_AT_name("CCSSR")
     389                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_CCSSR")
     390                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     391                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     392              $C$DW$39        .dwtag  DW_TAG_member
     393                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$20)
     394                      .dwattr $C$DW$39, DW_AT_name("RSVD3")
     395                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_RSVD3")
     396                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
     397                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     398              $C$DW$40        .dwtag  DW_TAG_member
     399                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$20)
     400                      .dwattr $C$DW$40, DW_AT_name("ECDR")
     401                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_ECDR")
     402                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     403                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     404              $C$DW$41        .dwtag  DW_TAG_member
     405                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$20)
     406                      .dwattr $C$DW$41, DW_AT_name("RSVD4")
     407                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_RSVD4")
     408                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
     409                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     410              $C$DW$42        .dwtag  DW_TAG_member
     411                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$20)
     412                      .dwattr $C$DW$42, DW_AT_name("RAMSLPMDCNTLR1")
     413                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
     414                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     415                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     416              $C$DW$43        .dwtag  DW_TAG_member
     417                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$20)
     418                      .dwattr $C$DW$43, DW_AT_name("RSVD5")
     419                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_RSVD5")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535.asm                                                        PAGE    9

     420                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
     421                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     422              $C$DW$44        .dwtag  DW_TAG_member
     423                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$20)
     424                      .dwattr $C$DW$44, DW_AT_name("RAMSLPMDCNTLR2")
     425                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
     426                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     427                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     428              $C$DW$45        .dwtag  DW_TAG_member
     429                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$20)
     430                      .dwattr $C$DW$45, DW_AT_name("RAMSLPMDCNTLR3")
     431                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
     432                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
     433                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     434              $C$DW$46        .dwtag  DW_TAG_member
     435                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$20)
     436                      .dwattr $C$DW$46, DW_AT_name("RAMSLPMDCNTLR4")
     437                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
     438                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     439                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     440              $C$DW$47        .dwtag  DW_TAG_member
     441                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$20)
     442                      .dwattr $C$DW$47, DW_AT_name("RAMSLPMDCNTLR5")
     443                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
     444                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
     445                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     446              $C$DW$48        .dwtag  DW_TAG_member
     447                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
     448                      .dwattr $C$DW$48, DW_AT_name("RSVD6")
     449                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_RSVD6")
     450                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     451                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     452              $C$DW$49        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$20)
     454                      .dwattr $C$DW$49, DW_AT_name("DMAIFR")
     455                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_DMAIFR")
     456                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     457                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     458              $C$DW$50        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$20)
     460                      .dwattr $C$DW$50, DW_AT_name("DMAIER")
     461                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_DMAIER")
     462                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
     463                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     464              $C$DW$51        .dwtag  DW_TAG_member
     465                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$20)
     466                      .dwattr $C$DW$51, DW_AT_name("USBSCR")
     467                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_USBSCR")
     468                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     469                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     470              $C$DW$52        .dwtag  DW_TAG_member
     471                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$20)
     472                      .dwattr $C$DW$52, DW_AT_name("ESCR")
     473                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_ESCR")
     474                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535.asm                                                        PAGE   10

     475                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     476              $C$DW$53        .dwtag  DW_TAG_member
     477                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$22)
     478                      .dwattr $C$DW$53, DW_AT_name("RSVD7")
     479                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_RSVD7")
     480                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     481                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     482              $C$DW$54        .dwtag  DW_TAG_member
     483                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
     484                      .dwattr $C$DW$54, DW_AT_name("DMA2CESR1")
     485                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_DMA2CESR1")
     486                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     487                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     488              $C$DW$55        .dwtag  DW_TAG_member
     489                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$20)
     490                      .dwattr $C$DW$55, DW_AT_name("DMA2CESR2")
     491                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_DMA2CESR2")
     492                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
     493                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     494              $C$DW$56        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$20)
     496                      .dwattr $C$DW$56, DW_AT_name("DMA3CESR1")
     497                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_DMA3CESR1")
     498                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     499                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     500              $C$DW$57        .dwtag  DW_TAG_member
     501                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
     502                      .dwattr $C$DW$57, DW_AT_name("DMA3CESR2")
     503                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_DMA3CESR2")
     504                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
     505                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     506              $C$DW$58        .dwtag  DW_TAG_member
     507                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     508                      .dwattr $C$DW$58, DW_AT_name("CLKSTOP")
     509                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_CLKSTOP")
     510                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     511                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     512              $C$DW$59        .dwtag  DW_TAG_member
     513                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$23)
     514                      .dwattr $C$DW$59, DW_AT_name("RSVD8")
     515                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_RSVD8")
     516                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
     517                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     518              $C$DW$60        .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
     520                      .dwattr $C$DW$60, DW_AT_name("DIEIDR0")
     521                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_DIEIDR0")
     522                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     523                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     524              $C$DW$61        .dwtag  DW_TAG_member
     525                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$20)
     526                      .dwattr $C$DW$61, DW_AT_name("DIEIDR1")
     527                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_DIEIDR1")
     528                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
     529                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535.asm                                                        PAGE   11

     530              $C$DW$62        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
     532                      .dwattr $C$DW$62, DW_AT_name("DIEIDR2")
     533                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_DIEIDR2")
     534                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     535                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     536              $C$DW$63        .dwtag  DW_TAG_member
     537                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$20)
     538                      .dwattr $C$DW$63, DW_AT_name("DIEIDR3")
     539                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_DIEIDR3")
     540                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
     541                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     542              $C$DW$64        .dwtag  DW_TAG_member
     543                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
     544                      .dwattr $C$DW$64, DW_AT_name("DIEIDR4")
     545                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_DIEIDR4")
     546                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     547                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     548              $C$DW$65        .dwtag  DW_TAG_member
     549                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$20)
     550                      .dwattr $C$DW$65, DW_AT_name("DIEIDR5")
     551                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_DIEIDR5")
     552                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
     553                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     554              $C$DW$66        .dwtag  DW_TAG_member
     555                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
     556                      .dwattr $C$DW$66, DW_AT_name("DIEIDR6")
     557                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_DIEIDR6")
     558                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     559                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     560              $C$DW$67        .dwtag  DW_TAG_member
     561                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
     562                      .dwattr $C$DW$67, DW_AT_name("DIEIDR7")
     563                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_DIEIDR7")
     564                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
     565                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     566                      .dwendtag $C$DW$T$24
     567              
     568              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
     569                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     570                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     571              $C$DW$68        .dwtag  DW_TAG_TI_far_type
     572                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$25)
     573              $C$DW$69        .dwtag  DW_TAG_TI_ioport_type
     574                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$68)
     575              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
     576                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$69)
     577              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
     578                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     579                      .dwattr $C$DW$T$27, DW_AT_address_class(0x10)
     580              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
     581                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
     582                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     583              $C$DW$T$4       .dwtag  DW_TAG_base_type
     584                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535.asm                                                        PAGE   12

     585                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     586                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     587              $C$DW$T$5       .dwtag  DW_TAG_base_type
     588                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     589                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     590                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     591              $C$DW$T$6       .dwtag  DW_TAG_base_type
     592                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     593                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     594                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     595              $C$DW$T$7       .dwtag  DW_TAG_base_type
     596                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     597                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     598                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     599              $C$DW$T$8       .dwtag  DW_TAG_base_type
     600                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     601                      .dwattr $C$DW$T$8, DW_AT_name("short")
     602                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     603              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
     604                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$8)
     605                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     606              $C$DW$T$9       .dwtag  DW_TAG_base_type
     607                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     608                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     609                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     610              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
     611                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
     612                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     613              $C$DW$70        .dwtag  DW_TAG_TI_far_type
     614                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     615              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
     616                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$70)
