TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2c.asm                                                    PAGE    1

     894              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 09 04:49:46 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     381              ;*******************************************************************************
     382 00006c       _EZDSP5535_I2C_read:
     383                      .dwcfi  cfa_offset, 1
     384                      .dwcfi  save_reg_to_mem, 91, -1
     385 00006c 4EF9          AADD #-7, SP
     386                      .dwcfi  cfa_offset, 8
     387              $C$DW$44        .dwtag  DW_TAG_variable, DW_AT_name("i2c_addr")
     388                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_i2c_addr")
     389                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     390                      .dwattr $C$DW$44, DW_AT_location[DW_OP_bregx 0x24 0]
     391              $C$DW$45        .dwtag  DW_TAG_variable, DW_AT_name("data")
     392                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_data")
     393                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$29)
     394                      .dwattr $C$DW$45, DW_AT_location[DW_OP_bregx 0x24 2]
     395              $C$DW$46        .dwtag  DW_TAG_variable, DW_AT_name("len")
     396                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_len")
     397                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     398                      .dwattr $C$DW$46, DW_AT_location[DW_OP_bregx 0x24 4]
     399              $C$DW$47        .dwtag  DW_TAG_variable, DW_AT_name("startStop")
     400                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_startStop")
     401                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     402                      .dwattr $C$DW$47, DW_AT_location[DW_OP_bregx 0x24 5]
     403              $C$DW$48        .dwtag  DW_TAG_variable, DW_AT_name("status")
     404                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_status")
     405                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$24)
     406                      .dwattr $C$DW$48, DW_AT_location[DW_OP_bregx 0x24 6]
     407 00006e C508          MOV T1, *SP(#4) ; |116| 
     408 000070 EB04          MOV XAR0, dbl(*SP(#2))
         000072 85   
     409 000073 C400          MOV T0, *SP(#0) ; |116| 
     410                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_i2c.c",line 117,column 12,is_stmt
     411 000075 FB0A          MOV #768, *SP(#5) ; |117| 
         000077 0300 
     412                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_i2c.c",line 121,column 5,is_stmt
     413 000079 76FF          MOV #65535, AR3 ; |121| 
         00007b FFB8 
     414 00007d AA0A          MOV *SP(#5), AR2 ; |121| 
     415 00007f A408          MOV *SP(#4), T0 ; |121| 
     416              
     417 000081 A500          MOV *SP(#0), T1 ; |121| 
     418 000083 3D19  ||      MOV #1, AR1
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2c.asm                                                    PAGE    9

     419              
     420 000085 ED04          MOV dbl(*SP(#2)), XAR0
         000087 8F   
     421              $C$DW$49        .dwtag  DW_TAG_TI_branch
     422                      .dwattr $C$DW$49, DW_AT_low_pc(0x00)
     423                      .dwattr $C$DW$49, DW_AT_name("_I2C_read")
     424                      .dwattr $C$DW$49, DW_AT_TI_call
     425              
     426 000088 6C00          CALL #_I2C_read ; |121| 
         00008a 0000!
     427 00008c 3D0C  ||      MOV #0, AR4
     428              
     429                                                      ; call occurs [#_I2C_read] ; |121| 
     430 00008e C40C          MOV T0, *SP(#6) ; |121| 
     431                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_i2c.c",line 123,column 5,is_stmt
     432                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_i2c.c",line 124,column 1,is_stmt
     433 000090 4E07          AADD #7, SP
     434                      .dwcfi  cfa_offset, 1
     435              $C$DW$50        .dwtag  DW_TAG_TI_branch
     436                      .dwattr $C$DW$50, DW_AT_low_pc(0x00)
     437                      .dwattr $C$DW$50, DW_AT_TI_return
     438 000092 4804          RET
     439                                                      ; return occurs
     440                      .dwattr $C$DW$40, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_i2c.c")
     441                      .dwattr $C$DW$40, DW_AT_TI_end_line(0x7c)
     442                      .dwattr $C$DW$40, DW_AT_TI_end_column(0x01)
     443                      .dwendentry
     444                      .dwendtag $C$DW$40
     445              
     446              ;******************************************************************************
     447              ;* UNDEFINED EXTERNAL REFERENCES                                              *
     448              ;******************************************************************************
     449                      .global _I2C_init
     450                      .global _I2C_config
     451                      .global _I2C_write
     452                      .global _I2C_read
     453              
     454              ;*******************************************************************************
     455              ;* TYPE INFORMATION                                                            *
     456              ;*******************************************************************************
     457              
     458              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     459                      .dwattr $C$DW$T$20, DW_AT_name("CSL_I2cConfig")
     460                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x09)
     461              $C$DW$51        .dwtag  DW_TAG_member
     462                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     463                      .dwattr $C$DW$51, DW_AT_name("icoar")
     464                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_icoar")
     465                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     466                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     467              $C$DW$52        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     469                      .dwattr $C$DW$52, DW_AT_name("icimr")
     470                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_icimr")
     471                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2c.asm                                                    PAGE   10

     472                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     473              $C$DW$53        .dwtag  DW_TAG_member
     474                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     475                      .dwattr $C$DW$53, DW_AT_name("icclkl")
     476                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_icclkl")
     477                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     478                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     479              $C$DW$54        .dwtag  DW_TAG_member
     480                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     481                      .dwattr $C$DW$54, DW_AT_name("icclkh")
     482                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_icclkh")
     483                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     484                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     485              $C$DW$55        .dwtag  DW_TAG_member
     486                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     487                      .dwattr $C$DW$55, DW_AT_name("iccnt")
     488                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_iccnt")
     489                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     490                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     491              $C$DW$56        .dwtag  DW_TAG_member
     492                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     493                      .dwattr $C$DW$56, DW_AT_name("icsar")
     494                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_icsar")
     495                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     496                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     497              $C$DW$57        .dwtag  DW_TAG_member
     498                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     499                      .dwattr $C$DW$57, DW_AT_name("icmdr")
     500                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_icmdr")
     501                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     502                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     503              $C$DW$58        .dwtag  DW_TAG_member
     504                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     505                      .dwattr $C$DW$58, DW_AT_name("icemdr")
     506                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_icemdr")
     507                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     508                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     509              $C$DW$59        .dwtag  DW_TAG_member
     510                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     511                      .dwattr $C$DW$59, DW_AT_name("icpsc")
     512                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_icpsc")
     513                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     514                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     515                      .dwendtag $C$DW$T$20
     516              
     517              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cConfig")
     518                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     519                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     520              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     521                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     522                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
     523              $C$DW$T$4       .dwtag  DW_TAG_base_type
     524                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     525                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     526                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2c.asm                                                    PAGE   11

     527              $C$DW$T$5       .dwtag  DW_TAG_base_type
     528                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     529                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     530                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     531              $C$DW$T$6       .dwtag  DW_TAG_base_type
     532                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     533                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     534                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     535              $C$DW$T$7       .dwtag  DW_TAG_base_type
     536                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     537                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     538                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     539              $C$DW$T$8       .dwtag  DW_TAG_base_type
     540                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     541                      .dwattr $C$DW$T$8, DW_AT_name("short")
     542                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     543              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
     544                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$8)
     545                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     546              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
     547                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     548                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     549              $C$DW$T$9       .dwtag  DW_TAG_base_type
     550                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     551                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     552                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     553              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
     554                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
     555                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     556              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
     557                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
     559              $C$DW$T$10      .dwtag  DW_TAG_base_type
     560                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     561                      .dwattr $C$DW$T$10, DW_AT_name("int")
     562                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     563              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("Bool")
     564                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$10)
