TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE    1

    1398              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 09 04:49:50 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     330              ;*   Function Uses Regs : AC0,AC0,T0,AR0,XAR0,AR1,XAR1,SP,M40,SATA,SATD,RDM,   *
     331              ;*                        FRCT,SMUL                                            *
     332              ;*   Stack Frame        : Compact (No Frame Pointer, w/ debug)                 *
     333              ;*   Total Frame Size   : 4 words                                              *
     334              ;*                        (2 return address/alignment)                         *
     335              ;*                        (2 local values)                                     *
     336              ;*   Min System Stack   : 1 word                                               *
     337              ;*******************************************************************************
     338 000088       _EVM5515_UART_getChar:
     339                      .dwcfi  cfa_offset, 1
     340                      .dwcfi  save_reg_to_mem, 91, -1
     341 000088 4EFD          AADD #-3, SP
     342                      .dwcfi  cfa_offset, 4
     343              $C$DW$37        .dwtag  DW_TAG_variable, DW_AT_name("data")
     344                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_data")
     345                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$64)
     346                      .dwattr $C$DW$37, DW_AT_location[DW_OP_bregx 0x24 0]
     347 00008a EB00          MOV XAR0, dbl(*SP(#0))
         00008c 85   
     348                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_uart.c",line 107,column 2,is_stmt
     349 00008d ED31          MOV dbl(*(#_hUart)), XAR0
         00008f 8F00 
         000091 0014-
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE    8

     350 000093 ED00          MOV dbl(*SP(#0)), XAR1
         000095 9F   
     351              $C$DW$38        .dwtag  DW_TAG_TI_branch
     352                      .dwattr $C$DW$38, DW_AT_low_pc(0x00)
     353                      .dwattr $C$DW$38, DW_AT_name("_UART_fgetc")
     354                      .dwattr $C$DW$38, DW_AT_TI_call
     355              
     356 000096 6C00          CALL #_UART_fgetc ; |107| 
         000098 0000!
     357 00009a 3D00  ||      MOV #0, AC0 ; |107| 
     358              
     359                                                      ; call occurs [#_UART_fgetc] ; |107| 
     360                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_uart.c",line 109,column 5,is_stmt
     361 00009c 3C04          MOV #0, T0
     362                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_uart.c",line 110,column 1,is_stmt
     363 00009e 4E03          AADD #3, SP
     364                      .dwcfi  cfa_offset, 1
     365              $C$DW$39        .dwtag  DW_TAG_TI_branch
     366                      .dwattr $C$DW$39, DW_AT_low_pc(0x00)
     367                      .dwattr $C$DW$39, DW_AT_TI_return
     368 0000a0 4804          RET
     369                                                      ; return occurs
     370                      .dwattr $C$DW$35, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_uart.c")
     371                      .dwattr $C$DW$35, DW_AT_TI_end_line(0x6e)
     372                      .dwattr $C$DW$35, DW_AT_TI_end_column(0x01)
     373                      .dwendentry
     374                      .dwendtag $C$DW$35
     375              
     376              ;******************************************************************************
     377              ;* UNDEFINED EXTERNAL REFERENCES                                              *
     378              ;******************************************************************************
     379                      .global _UART_init
     380                      .global _UART_config
     381                      .global _UART_reset
     382                      .global _UART_resetOff
     383                      .global _UART_fgetc
     384                      .global _UART_fputc
     385              
     386              ;*******************************************************************************
     387              ;* TYPE INFORMATION                                                            *
     388              ;*******************************************************************************
     389              
     390              $C$DW$T$36      .dwtag  DW_TAG_enumeration_type
     391                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     392              $C$DW$40        .dwtag  DW_TAG_enumerator, DW_AT_name("UART_POLLED"), DW_AT_const_value(0x00)
     393              $C$DW$41        .dwtag  DW_TAG_enumerator, DW_AT_name("UART_INTERRUPT"), DW_AT_const_value(0x01)
     394              $C$DW$42        .dwtag  DW_TAG_enumerator, DW_AT_name("UART_OPMODE_OTHER"), DW_AT_const_value(0x02)
     395                      .dwendtag $C$DW$T$36
     396              
     397              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartOpmode")
     398                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
     399                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
     400              
     401              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     402                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x19)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE    9

     403              $C$DW$43        .dwtag  DW_TAG_member
     404                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$20)
     405                      .dwattr $C$DW$43, DW_AT_name("THR")
     406                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_THR")
     407                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     408                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     409              $C$DW$44        .dwtag  DW_TAG_member
     410                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$20)
     411                      .dwattr $C$DW$44, DW_AT_name("RSVD0")
     412                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_RSVD0")
     413                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     414                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     415              $C$DW$45        .dwtag  DW_TAG_member
     416                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$20)
     417                      .dwattr $C$DW$45, DW_AT_name("IER")
     418                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_IER")
     419                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     420                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     421              $C$DW$46        .dwtag  DW_TAG_member
     422                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$20)
     423                      .dwattr $C$DW$46, DW_AT_name("RSVD1")
     424                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_RSVD1")
     425                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     426                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     427              $C$DW$47        .dwtag  DW_TAG_member
     428                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$20)
     429                      .dwattr $C$DW$47, DW_AT_name("FCR")
     430                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_FCR")
     431                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     432                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     433              $C$DW$48        .dwtag  DW_TAG_member
     434                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$20)
     435                      .dwattr $C$DW$48, DW_AT_name("RSVD2")
     436                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_RSVD2")
     437                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     438                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     439              $C$DW$49        .dwtag  DW_TAG_member
     440                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$20)
     441                      .dwattr $C$DW$49, DW_AT_name("LCR")
     442                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_LCR")
     443                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     444                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     445              $C$DW$50        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$20)
     447                      .dwattr $C$DW$50, DW_AT_name("RSVD3")
     448                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_RSVD3")
     449                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     450                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     451              $C$DW$51        .dwtag  DW_TAG_member
     452                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$20)
     453                      .dwattr $C$DW$51, DW_AT_name("MCR")
     454                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_MCR")
     455                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     456                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     457              $C$DW$52        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE   10

     458                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$20)
     459                      .dwattr $C$DW$52, DW_AT_name("RSVD4")
     460                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_RSVD4")
     461                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     462                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     463              $C$DW$53        .dwtag  DW_TAG_member
     464                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$20)
     465                      .dwattr $C$DW$53, DW_AT_name("LSR")
     466                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_LSR")
     467                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     468                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     469              $C$DW$54        .dwtag  DW_TAG_member
     470                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
     471                      .dwattr $C$DW$54, DW_AT_name("RSVD5")
     472                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_RSVD5")
     473                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     474                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     475              $C$DW$55        .dwtag  DW_TAG_member
     476                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$20)
     477                      .dwattr $C$DW$55, DW_AT_name("SCR")
     478                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_SCR")
     479                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     480                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     481              $C$DW$56        .dwtag  DW_TAG_member
     482                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$20)
     483                      .dwattr $C$DW$56, DW_AT_name("RSVD6")
     484                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_RSVD6")
     485                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     486                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     487              $C$DW$57        .dwtag  DW_TAG_member
     488                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
     489                      .dwattr $C$DW$57, DW_AT_name("DLL")
     490                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_DLL")
     491                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     492                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     493              $C$DW$58        .dwtag  DW_TAG_member
     494                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     495                      .dwattr $C$DW$58, DW_AT_name("RSVD7")
     496                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_RSVD7")
     497                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     498                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     499              $C$DW$59        .dwtag  DW_TAG_member
     500                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
     501                      .dwattr $C$DW$59, DW_AT_name("DLH")
     502                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_DLH")
     503                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     504                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     505              $C$DW$60        .dwtag  DW_TAG_member
     506                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$22)
     507                      .dwattr $C$DW$60, DW_AT_name("RSVD8")
     508                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_RSVD8")
     509                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     510                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     511              $C$DW$61        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE   11

     513                      .dwattr $C$DW$61, DW_AT_name("PWREMU_MGMT")
     514                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PWREMU_MGMT")
     515                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     516                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     517                      .dwendtag $C$DW$T$23
     518              
     519              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegs")
     520                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
     521                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     522              $C$DW$62        .dwtag  DW_TAG_TI_far_type
     523                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$28)
     524              $C$DW$63        .dwtag  DW_TAG_TI_ioport_type
     525                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$62)
     526              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
     527                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$63)
     528              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
     529                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
     530                      .dwattr $C$DW$T$30, DW_AT_address_class(0x10)
     531              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegsOvly")
     532                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     533                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
     534              
     535              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     536                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
     537              $C$DW$64        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
     539                      .dwattr $C$DW$64, DW_AT_name("EBSR")
     540                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_EBSR")
     541                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     543              $C$DW$65        .dwtag  DW_TAG_member
     544                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$20)
     545                      .dwattr $C$DW$65, DW_AT_name("RSVD0")
     546                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_RSVD0")
     547                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     548                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     549              $C$DW$66        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
     551                      .dwattr $C$DW$66, DW_AT_name("PCGCR1")
     552                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PCGCR1")
     553                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     554                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     555              $C$DW$67        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
     557                      .dwattr $C$DW$67, DW_AT_name("PCGCR2")
     558                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_PCGCR2")
     559                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     560                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     561              $C$DW$68        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
     563                      .dwattr $C$DW$68, DW_AT_name("PSRCR")
     564                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_PSRCR")
     565                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     566                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     567              $C$DW$69        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE   12

     568                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$20)
     569                      .dwattr $C$DW$69, DW_AT_name("PRCR")
     570                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PRCR")
     571                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     572                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     573              $C$DW$70        .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$24)
     575                      .dwattr $C$DW$70, DW_AT_name("RSVD1")
     576                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_RSVD1")
     577                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     578                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     579              $C$DW$71        .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
     581                      .dwattr $C$DW$71, DW_AT_name("TIAFR")
     582                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_TIAFR")
     583                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     584                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     585              $C$DW$72        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
     587                      .dwattr $C$DW$72, DW_AT_name("RSVD2")
     588                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_RSVD2")
     589                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     590                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     591              $C$DW$73        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
     593                      .dwattr $C$DW$73, DW_AT_name("ODSCR")
     594                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ODSCR")
     595                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     596                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     597              $C$DW$74        .dwtag  DW_TAG_member
     598                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
     599                      .dwattr $C$DW$74, DW_AT_name("PDINHIBR1")
     600                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PDINHIBR1")
     601                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     602                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     603              $C$DW$75        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
     605                      .dwattr $C$DW$75, DW_AT_name("PDINHIBR2")
     606                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_PDINHIBR2")
     607                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     608                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     609              $C$DW$76        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
     611                      .dwattr $C$DW$76, DW_AT_name("PDINHIBR3")
     612                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PDINHIBR3")
     613                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     614                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     615              $C$DW$77        .dwtag  DW_TAG_member
     616                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
     617                      .dwattr $C$DW$77, DW_AT_name("DMA0CESR1")
     618                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_DMA0CESR1")
     619                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     620                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     621              $C$DW$78        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE   13

     623                      .dwattr $C$DW$78, DW_AT_name("DMA0CESR2")
     624                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_DMA0CESR2")
     625                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     626                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     627              $C$DW$79        .dwtag  DW_TAG_member
     628                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
     629                      .dwattr $C$DW$79, DW_AT_name("DMA1CESR1")
     630                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_DMA1CESR1")
     631                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     632                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     633              $C$DW$80        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
     635                      .dwattr $C$DW$80, DW_AT_name("DMA1CESR2")
     636                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_DMA1CESR2")
     637                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     638                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     639              $C$DW$81        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
     641                      .dwattr $C$DW$81, DW_AT_name("SDRAMCCR")
     642                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_SDRAMCCR")
     643                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     644                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     645              $C$DW$82        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
     647                      .dwattr $C$DW$82, DW_AT_name("CCR2")
     648                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_CCR2")
     649                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     650                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     651              $C$DW$83        .dwtag  DW_TAG_member
     652                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
     653                      .dwattr $C$DW$83, DW_AT_name("CGCR1")
     654                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_CGCR1")
     655                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     656                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     657              $C$DW$84        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
     659                      .dwattr $C$DW$84, DW_AT_name("CGICR")
     660                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_CGICR")
     661                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
     662                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     663              $C$DW$85        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
     665                      .dwattr $C$DW$85, DW_AT_name("CGCR2")
     666                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_CGCR2")
     667                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     668                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     669              $C$DW$86        .dwtag  DW_TAG_member
     670                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
     671                      .dwattr $C$DW$86, DW_AT_name("CGOCR")
     672                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_CGOCR")
     673                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
     674                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     675              $C$DW$87        .dwtag  DW_TAG_member
     676                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
     677                      .dwattr $C$DW$87, DW_AT_name("CCSSR")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE   14

     678                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_CCSSR")
     679                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     680                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     681              $C$DW$88        .dwtag  DW_TAG_member
     682                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
     683                      .dwattr $C$DW$88, DW_AT_name("RSVD3")
     684                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_RSVD3")
     685                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
     686                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     687              $C$DW$89        .dwtag  DW_TAG_member
     688                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
     689                      .dwattr $C$DW$89, DW_AT_name("ECDR")
     690                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ECDR")
     691                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     692                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     693              $C$DW$90        .dwtag  DW_TAG_member
     694                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
     695                      .dwattr $C$DW$90, DW_AT_name("RSVD4")
     696                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_RSVD4")
     697                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
     698                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     699              $C$DW$91        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
     701                      .dwattr $C$DW$91, DW_AT_name("RAMSLPMDCNTLR1")
     702                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
     703                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     704                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     705              $C$DW$92        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
     707                      .dwattr $C$DW$92, DW_AT_name("RSVD5")
     708                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_RSVD5")
     709                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
     710                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     711              $C$DW$93        .dwtag  DW_TAG_member
     712                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
     713                      .dwattr $C$DW$93, DW_AT_name("RAMSLPMDCNTLR2")
     714                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
     715                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     716                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     717              $C$DW$94        .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
     719                      .dwattr $C$DW$94, DW_AT_name("RAMSLPMDCNTLR3")
     720                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
     721                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
     722                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     723              $C$DW$95        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
     725                      .dwattr $C$DW$95, DW_AT_name("RAMSLPMDCNTLR4")
     726                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
     727                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     728                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     729              $C$DW$96        .dwtag  DW_TAG_member
     730                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
     731                      .dwattr $C$DW$96, DW_AT_name("RAMSLPMDCNTLR5")
     732                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE   15

     733                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
     734                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     735              $C$DW$97        .dwtag  DW_TAG_member
     736                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$25)
     737                      .dwattr $C$DW$97, DW_AT_name("RSVD6")
     738                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_RSVD6")
     739                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     740                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     741              $C$DW$98        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
     743                      .dwattr $C$DW$98, DW_AT_name("DMAIFR")
     744                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_DMAIFR")
     745                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     746                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     747              $C$DW$99        .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
     749                      .dwattr $C$DW$99, DW_AT_name("DMAIER")
     750                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_DMAIER")
     751                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
     752                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     753              $C$DW$100       .dwtag  DW_TAG_member
     754                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
     755                      .dwattr $C$DW$100, DW_AT_name("USBSCR")
     756                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_USBSCR")
     757                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     758                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     759              $C$DW$101       .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
     761                      .dwattr $C$DW$101, DW_AT_name("ESCR")
     762                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_ESCR")
     763                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
     764                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     765              $C$DW$102       .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$25)
     767                      .dwattr $C$DW$102, DW_AT_name("RSVD7")
     768                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_RSVD7")
     769                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     770                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     771              $C$DW$103       .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
     773                      .dwattr $C$DW$103, DW_AT_name("DMA2CESR1")
     774                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_DMA2CESR1")
     775                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     776                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     777              $C$DW$104       .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
     779                      .dwattr $C$DW$104, DW_AT_name("DMA2CESR2")
     780                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_DMA2CESR2")
     781                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
     782                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     783              $C$DW$105       .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
     785                      .dwattr $C$DW$105, DW_AT_name("DMA3CESR1")
     786                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_DMA3CESR1")
     787                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE   16

     788                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     789              $C$DW$106       .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
     791                      .dwattr $C$DW$106, DW_AT_name("DMA3CESR2")
     792                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_DMA3CESR2")
     793                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
     794                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     795              $C$DW$107       .dwtag  DW_TAG_member
     796                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
     797                      .dwattr $C$DW$107, DW_AT_name("CLKSTOP")
     798                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CLKSTOP")
     799                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     800                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     801              $C$DW$108       .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$22)
     803                      .dwattr $C$DW$108, DW_AT_name("RSVD8")
     804                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_RSVD8")
     805                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
     806                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     807              $C$DW$109       .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
     809                      .dwattr $C$DW$109, DW_AT_name("DIEIDR0")
     810                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_DIEIDR0")
     811                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     812                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     813              $C$DW$110       .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
     815                      .dwattr $C$DW$110, DW_AT_name("DIEIDR1")
     816                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_DIEIDR1")
     817                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
     818                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     819              $C$DW$111       .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
     821                      .dwattr $C$DW$111, DW_AT_name("DIEIDR2")
     822                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_DIEIDR2")
     823                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     824                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     825              $C$DW$112       .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
     827                      .dwattr $C$DW$112, DW_AT_name("DIEIDR3")
     828                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_DIEIDR3")
     829                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
     830                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     831              $C$DW$113       .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
     833                      .dwattr $C$DW$113, DW_AT_name("DIEIDR4")
     834                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_DIEIDR4")
     835                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     836                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     837              $C$DW$114       .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
     839                      .dwattr $C$DW$114, DW_AT_name("DIEIDR5")
     840                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_DIEIDR5")
     841                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
     842                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE   17

     843              $C$DW$115       .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
     845                      .dwattr $C$DW$115, DW_AT_name("DIEIDR6")
     846                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_DIEIDR6")
     847                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     848                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     849              $C$DW$116       .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
     851                      .dwattr $C$DW$116, DW_AT_name("DIEIDR7")
     852                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_DIEIDR7")
     853                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
     854                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     855                      .dwendtag $C$DW$T$26
     856              
     857              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
     858                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
     859                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     860              $C$DW$117       .dwtag  DW_TAG_TI_far_type
     861                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$32)
     862              $C$DW$118       .dwtag  DW_TAG_TI_ioport_type
     863                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$117)
     864              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
     865                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$118)
     866              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
     867                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
     868                      .dwattr $C$DW$T$34, DW_AT_address_class(0x10)
     869              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
     870                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
     871                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     872              
     873              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     874                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x05)
     875              $C$DW$119       .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$119, DW_AT_name("DLL")
     878                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_DLL")
     879                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     880                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     881              $C$DW$120       .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
     883                      .dwattr $C$DW$120, DW_AT_name("DLH")
     884                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_DLH")
     885                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     886                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     887              $C$DW$121       .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
     889                      .dwattr $C$DW$121, DW_AT_name("LCR")
     890                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_LCR")
     891                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     892                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     893              $C$DW$122       .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
     895                      .dwattr $C$DW$122, DW_AT_name("FCR")
     896                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_FCR")
     897                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE   18

     898                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     899              $C$DW$123       .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
     901                      .dwattr $C$DW$123, DW_AT_name("MCR")
     902                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_MCR")
     903                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     904                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     905                      .dwendtag $C$DW$T$27
     906              
     907              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartConfig")
     908                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$27)
     909                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     910              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
     911                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
     912                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
     913              
     914              $C$DW$T$40      .dwtag  DW_TAG_structure_type
     915                      .dwattr $C$DW$T$40, DW_AT_name("CSL_UartObj")
     916                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x14)
     917              $C$DW$124       .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$124, DW_AT_name("insId")
     920                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_insId")
     921                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$125       .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$31)
     925                      .dwattr $C$DW$125, DW_AT_name("uartRegs")
     926                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_uartRegs")
     927                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     928                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$126       .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$35)
     931                      .dwattr $C$DW$126, DW_AT_name("sysAddr")
     932                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_sysAddr")
     933                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     934                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$127       .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$37)
     937                      .dwattr $C$DW$127, DW_AT_name("opmode")
     938                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_opmode")
     939                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     940                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     941              $C$DW$128       .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$128, DW_AT_name("trigLevel")
     944                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_trigLevel")
     945                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     946                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     947              $C$DW$129       .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$39)
     949                      .dwattr $C$DW$129, DW_AT_name("UART_isrDispatchTable")
     950                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_UART_isrDispatchTable")
     951                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     952                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:49:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_uart.asm                                                   PAGE   19

     953                      .dwendtag $C$DW$T$40
     954              
     955              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartObj")
     956                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$40)
     957                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     958              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
     959                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
     960                      .dwattr $C$DW$T$44, DW_AT_address_class(0x17)
     961              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartHandle")
     962                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
     963                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
     964              $C$DW$T$4       .dwtag  DW_TAG_base_type
     965                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     966                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     967                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     968              $C$DW$T$5       .dwtag  DW_TAG_base_type
     969                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     970                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     971                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     972              $C$DW$T$6       .dwtag  DW_TAG_base_type
     973                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     974                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     975                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     976              $C$DW$T$7       .dwtag  DW_TAG_base_type
     977                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     978                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     979                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     980              $C$DW$T$8       .dwtag  DW_TAG_base_type
     981                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     982                      .dwattr $C$DW$T$8, DW_AT_name("short")
     983                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     984              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
     985                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$8)
     986                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     987              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
     988                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
     989                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
     990              $C$DW$T$9       .dwtag  DW_TAG_base_type
     991                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     992                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     993                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     994              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
     995                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
     996                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     997              $C$DW$130       .dwtag  DW_TAG_TI_far_type
     998                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
     999              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    1000                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$130)
    1001              
    1002              $C$DW$T$21      .dwtag  DW_TAG_array_type
    1003                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
