TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_led.asm                                                    PAGE    1

    1543              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 16 02:57:26 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     997                      .dwattr $C$DW$71, DW_AT_TI_max_frame_size(0x02)
     998                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_led.c",line 251,column 1,is_stmt,addre
     999              
    1000                      .dwfde $C$DW$CIE, _EZDSP5535_XF_toggle
    1001              ;*******************************************************************************
    1002              ;* FUNCTION NAME: EZDSP5535_XF_toggle                                          *
    1003              ;*                                                                             *
    1004              ;*   Function Uses Regs : AC0,T0,AR1,SP,M40,SATA,SATD,RDM,FRCT,SMUL            *
    1005              ;*   Stack Frame        : Compact (No Frame Pointer, w/ debug)                 *
    1006              ;*   Total Frame Size   : 2 words                                              *
    1007              ;*                        (2 return address/alignment)                         *
    1008              ;*   Min System Stack   : 1 word                                               *
    1009              ;*******************************************************************************
    1010 0001d8       _EZDSP5535_XF_toggle:
    1011                      .dwcfi  cfa_offset, 1
    1012                      .dwcfi  save_reg_to_mem, 91, -1
    1013 0001d8 4EFF          AADD #-1, SP
    1014                      .dwcfi  cfa_offset, 2
    1015                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_led.c",line 252,column 5,is_stmt
    1016 0001da A931          MOV *(#3), AR1 ; |252| 
         0001dc 0000 
         0001de 03   
    1017 0001df 7D20          AND #0x2000, AR1, AC0 ; |252| 
         0001e1 0009 
    1018 0001e3 76E0          BFXTR #0xe000, AC0, AR1 ; |252| 
         0001e5 0090 
    1019 0001e7 6289          BCC $C$L20,AR1 == #0 ; |252| 
    1020                                                      ; branchcc occurs ; |252| 
    1021                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_led.c",line 253,column 9,is_stmt
    1022              $C$DW$72        .dwtag  DW_TAG_TI_branch
    1023                      .dwattr $C$DW$72, DW_AT_low_pc(0x00)
    1024                      .dwattr $C$DW$72, DW_AT_name("_EZDSP5535_XF_off")
    1025                      .dwattr $C$DW$72, DW_AT_TI_call
    1026 0001e9 08FF          CALL #_EZDSP5535_XF_off ; |253| 
         0001eb D0   
    1027                                                      ; call occurs [#_EZDSP5535_XF_off] ; |253| 
    1028 0001ec 4A03          B $C$L21  ; |253| 
    1029                                                      ; branch occurs ; |253| 
    1030 0001ee       $C$L20:    
    1031                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_led.c",line 255,column 9,is_stmt
    1032              $C$DW$73        .dwtag  DW_TAG_TI_branch
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_led.asm                                                    PAGE   21

    1033                      .dwattr $C$DW$73, DW_AT_low_pc(0x00)
    1034                      .dwattr $C$DW$73, DW_AT_name("_EZDSP5535_XF_on")
    1035                      .dwattr $C$DW$73, DW_AT_TI_call
    1036 0001ee 08FF          CALL #_EZDSP5535_XF_on ; |255| 
         0001f0 BF   
    1037                                                      ; call occurs [#_EZDSP5535_XF_on] ; |255| 
    1038 0001f1       $C$L21:    
    1039                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_led.c",line 256,column 5,is_stmt
    1040 0001f1 3C04          MOV #0, T0
    1041                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_led.c",line 257,column 1,is_stmt
    1042 0001f3 4E01          AADD #1, SP
    1043                      .dwcfi  cfa_offset, 1
    1044              $C$DW$74        .dwtag  DW_TAG_TI_branch
    1045                      .dwattr $C$DW$74, DW_AT_low_pc(0x00)
    1046                      .dwattr $C$DW$74, DW_AT_TI_return
    1047 0001f5 4804          RET
    1048                                                      ; return occurs
    1049                      .dwattr $C$DW$71, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/lib/bsl/ezdsp5535_led.c")
    1050                      .dwattr $C$DW$71, DW_AT_TI_end_line(0x101)
    1051                      .dwattr $C$DW$71, DW_AT_TI_end_column(0x01)
    1052                      .dwendentry
    1053                      .dwendtag $C$DW$71
    1054              
    1055              ;******************************************************************************
    1056              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    1057              ;******************************************************************************
    1058                      .global _EZDSP5535_GPIO_init
    1059                      .global _EZDSP5535_GPIO_setDirection
    1060                      .global _EZDSP5535_GPIO_setOutput
    1061                      .global _EZDSP5535_GPIO_getInput
    1062              
    1063              ;*******************************************************************************
    1064              ;* TYPE INFORMATION                                                            *
    1065              ;*******************************************************************************
    1066              
    1067              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1068                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x4c)
    1069              $C$DW$75        .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
    1071                      .dwattr $C$DW$75, DW_AT_name("IER0")
    1072                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_IER0")
    1073                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1075              $C$DW$76        .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1077                      .dwattr $C$DW$76, DW_AT_name("IFR0")
    1078                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_IFR0")
    1079                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1080                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1081              $C$DW$77        .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
    1083                      .dwattr $C$DW$77, DW_AT_name("ST0_55")
    1084                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_ST0_55")
    1085                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1086                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_led.asm                                                    PAGE   22

    1087              $C$DW$78        .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1089                      .dwattr $C$DW$78, DW_AT_name("ST1_55")
    1090                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_ST1_55")
    1091                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1092                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1093              $C$DW$79        .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    1095                      .dwattr $C$DW$79, DW_AT_name("ST3_55")
    1096                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_ST3_55")
    1097                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1098                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$80        .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1101                      .dwattr $C$DW$80, DW_AT_name("RSVD0")
    1102                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_RSVD0")
    1103                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1104                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$81        .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
    1107                      .dwattr $C$DW$81, DW_AT_name("IER1")
    1108                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_IER1")
    1109                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1110                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$82        .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    1113                      .dwattr $C$DW$82, DW_AT_name("IFR1")
    1114                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_IFR1")
    1115                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1116                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$83        .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
    1119                      .dwattr $C$DW$83, DW_AT_name("RSVD1")
    1120                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_RSVD1")
    1121                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1122                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$84        .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    1125                      .dwattr $C$DW$84, DW_AT_name("IVPD")
    1126                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_IVPD")
    1127                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    1128                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1129              $C$DW$85        .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1131                      .dwattr $C$DW$85, DW_AT_name("IVPH")
    1132                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_IVPH")
    1133                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1134                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$86        .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    1137                      .dwattr $C$DW$86, DW_AT_name("ST2_55")
    1138                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ST2_55")
    1139                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4b]
    1140                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1141                      .dwendtag $C$DW$T$23
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:57:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_led.asm                                                    PAGE   23

    1142              
    1143              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CpuRegs")
    1144                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1145                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1146              $C$DW$87        .dwtag  DW_TAG_TI_far_type
    1147                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$24)
    1148              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1149                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$87)
    1150              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1151                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1152                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    1153              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CpuRegsOvly")
    1154                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1155                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1156              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1157                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1158                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1159                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1160              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1161                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1162                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1163                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1164              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1165                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1166                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1167                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1168              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1169                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1170                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1171                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1172              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1173                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1174                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1175                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1176              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1177                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$8)
    1178                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1179              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1180                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1181                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1182                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1183              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1184                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1185                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1186              $C$DW$88        .dwtag  DW_TAG_TI_far_type
    1187                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1188              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    1189                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$88)
    1190              
    1191              $C$DW$T$21      .dwtag  DW_TAG_array_type
