TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:51:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2s.asm                                                    PAGE    1

    1493              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Sep 18 04:51:12 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     720                      .dwendtag $C$DW$T$50
     721              
     722              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_DataDelay")
     723                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
     724                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
     725              
     726              $C$DW$T$52      .dwtag  DW_TAG_enumeration_type
     727                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
     728              $C$DW$91        .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_DISABLE"), DW_AT_const_value(0x00)
     729              $C$DW$92        .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_ENABLE"), DW_AT_const_value(0x01)
     730                      .dwendtag $C$DW$T$52
     731              
     732              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_SignextType")
     733                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
     734                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     735              
     736              $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
     737                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
     738              $C$DW$93        .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SLAVE"), DW_AT_const_value(0x00)
     739              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_MASTER"), DW_AT_const_value(0x01)
     740                      .dwendtag $C$DW$T$54
     741              
     742              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Mode")
     743                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
     744                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
     745              
     746              $C$DW$T$56      .dwtag  DW_TAG_enumeration_type
     747                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
     748              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_LJUST"), DW_AT_const_value(0x00)
     749              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_DSP"), DW_AT_const_value(0x01)
     750                      .dwendtag $C$DW$T$56
     751              
     752              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_DataFormat")
     753                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
     754                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     755              
     756              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
     757                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
     758              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV2"), DW_AT_const_value(0x00)
     759              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV4"), DW_AT_const_value(0x01)
     760              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV8"), DW_AT_const_value(0x02)
     761              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV16"), DW_AT_const_value(0x03)
     762              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV32"), DW_AT_const_value(0x04)
     763              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV64"), DW_AT_const_value(0x05)
     764              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV128"), DW_AT_const_value(0x06)
     765              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV256"), DW_AT_const_value(0x07)
     766                      .dwendtag $C$DW$T$58
     767              
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:51:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2s.asm                                                    PAGE   16

     768              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Clkdiv")
     769                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
     770                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     771              
     772              $C$DW$T$60      .dwtag  DW_TAG_enumeration_type
     773                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
     774              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_DISABLE"), DW_AT_const_value(0x00)
     775              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_ENABLE"), DW_AT_const_value(0x01)
     776                      .dwendtag $C$DW$T$60
     777              
     778              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_FsErr")
     779                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
     780                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     781              
     782              $C$DW$T$62      .dwtag  DW_TAG_enumeration_type
     783                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x01)
     784              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_DISABLE"), DW_AT_const_value(0x00)
     785              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_ENABLE"), DW_AT_const_value(0x01)
     786                      .dwendtag $C$DW$T$62
     787              
     788              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_OuErr")
     789                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
     790                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     791              
     792              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     793                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x2e)
     794              $C$DW$109       .dwtag  DW_TAG_member
     795                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
     796                      .dwattr $C$DW$109, DW_AT_name("I2SSCTRL")
     797                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_I2SSCTRL")
     798                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     800              $C$DW$110       .dwtag  DW_TAG_member
     801                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
     802                      .dwattr $C$DW$110, DW_AT_name("RSVD0")
     803                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_RSVD0")
     804                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     805                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     806              $C$DW$111       .dwtag  DW_TAG_member
     807                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
     808                      .dwattr $C$DW$111, DW_AT_name("I2SSRATE")
     809                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_I2SSRATE")
     810                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     811                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     812              $C$DW$112       .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
     814                      .dwattr $C$DW$112, DW_AT_name("RSVD1")
     815                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_RSVD1")
     816                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     817                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     818              $C$DW$113       .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
     820                      .dwattr $C$DW$113, DW_AT_name("I2STXLT0")
     821                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_I2STXLT0")
     822                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:51:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2s.asm                                                    PAGE   17

     823                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     824              $C$DW$114       .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
     826                      .dwattr $C$DW$114, DW_AT_name("I2STXLT1")
     827                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_I2STXLT1")
     828                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     829                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     830              $C$DW$115       .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
     832                      .dwattr $C$DW$115, DW_AT_name("RSVD2")
     833                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_RSVD2")
     834                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     835                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     836              $C$DW$116       .dwtag  DW_TAG_member
     837                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
     838                      .dwattr $C$DW$116, DW_AT_name("I2STXRT0")
     839                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_I2STXRT0")
     840                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     841                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     842              $C$DW$117       .dwtag  DW_TAG_member
     843                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
     844                      .dwattr $C$DW$117, DW_AT_name("I2STXRT1")
     845                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_I2STXRT1")
     846                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     847                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     848              $C$DW$118       .dwtag  DW_TAG_member
     849                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$22)
     850                      .dwattr $C$DW$118, DW_AT_name("RSVD3")
     851                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_RSVD3")
     852                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     853                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     854              $C$DW$119       .dwtag  DW_TAG_member
     855                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
     856                      .dwattr $C$DW$119, DW_AT_name("I2SINTFL")
     857                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_I2SINTFL")
     858                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     859                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     860              $C$DW$120       .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
     862                      .dwattr $C$DW$120, DW_AT_name("RSVD4")
     863                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_RSVD4")
     864                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     865                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     866              $C$DW$121       .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
     868                      .dwattr $C$DW$121, DW_AT_name("I2SINTMASK")
     869                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_I2SINTMASK")
     870                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     871                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     872              $C$DW$122       .dwtag  DW_TAG_member
     873                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$23)
     874                      .dwattr $C$DW$122, DW_AT_name("RSVD5")
     875                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_RSVD5")
     876                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     877                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:51:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2s.asm                                                    PAGE   18

     878              $C$DW$123       .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
     880                      .dwattr $C$DW$123, DW_AT_name("I2SRXLT0")
     881                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_I2SRXLT0")
     882                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     883                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     884              $C$DW$124       .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
     886                      .dwattr $C$DW$124, DW_AT_name("I2SRXLT1")
     887                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_I2SRXLT1")
     888                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
     889                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     890              $C$DW$125       .dwtag  DW_TAG_member
     891                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$22)
     892                      .dwattr $C$DW$125, DW_AT_name("RSVD6")
     893                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_RSVD6")
     894                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     895                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     896              $C$DW$126       .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
     898                      .dwattr $C$DW$126, DW_AT_name("I2SRXRT0")
     899                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_I2SRXRT0")
     900                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     901                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     902              $C$DW$127       .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
     904                      .dwattr $C$DW$127, DW_AT_name("I2SRXRT1")
     905                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_I2SRXRT1")
     906                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
     907                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     908                      .dwendtag $C$DW$T$24
     909              
     910              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sRegs")
     911                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$24)
     912                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
     913              $C$DW$128       .dwtag  DW_TAG_TI_far_type
     914                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$31)
     915              $C$DW$129       .dwtag  DW_TAG_TI_ioport_type
     916                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$128)
     917              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
     918                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$129)
     919              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
     920                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
     921                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
     922              
     923              $C$DW$T$43      .dwtag  DW_TAG_structure_type
     924                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
     925              $C$DW$130       .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$26)
     927                      .dwattr $C$DW$130, DW_AT_name("i2sNum")
     928                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_i2sNum")
     929                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
     931              $C$DW$131       .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$28)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:51:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2s.asm                                                    PAGE   19

     933                      .dwattr $C$DW$131, DW_AT_name("opMode")
     934                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_opMode")
     935                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     936                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
     937              $C$DW$132       .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$30)
     939                      .dwattr $C$DW$132, DW_AT_name("chType")
     940                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_chType")
     941                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     942                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
     943              $C$DW$133       .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$33)
     945                      .dwattr $C$DW$133, DW_AT_name("hwRegs")
     946                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_hwRegs")
     947                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     948                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$134       .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$134, DW_AT_name("configured")
     952                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_configured")
     953                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     954                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
     955              $C$DW$135       .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$35)
     957                      .dwattr $C$DW$135, DW_AT_name("datapack")
     958                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_datapack")
     959                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     960                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
     961              $C$DW$136       .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$37)
     963                      .dwattr $C$DW$136, DW_AT_name("fsDiv")
     964                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_fsDiv")
     965                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     966                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
     967              $C$DW$137       .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$39)
     969                      .dwattr $C$DW$137, DW_AT_name("wordLen")
     970                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_wordLen")
     971                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     972                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
     973              $C$DW$138       .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$41)
     975                      .dwattr $C$DW$138, DW_AT_name("loopBackMode")
     976                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_loopBackMode")
     977                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     978                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
     979              $C$DW$139       .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$42)
     981                      .dwattr $C$DW$139, DW_AT_name("firstRead")
     982                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_firstRead")
     983                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     984                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
     985                      .dwendtag $C$DW$T$43
     986              
     987              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sObj")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:51:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2s.asm                                                    PAGE   20

     988                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$43)
     989                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     990              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
     991                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
     992                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
     993              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sHandle")
     994                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
     995                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     996              
     997              $C$DW$T$64      .dwtag  DW_TAG_structure_type
     998                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0e)
     999              $C$DW$140       .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$45)
    1001                      .dwattr $C$DW$140, DW_AT_name("dataType")
    1002                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_dataType")
    1003                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1005              $C$DW$141       .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$41)
    1007                      .dwattr $C$DW$141, DW_AT_name("loopBackMode")
    1008                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_loopBackMode")
    1009                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1010                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1011              $C$DW$142       .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$47)
    1013                      .dwattr $C$DW$142, DW_AT_name("fsPol")
    1014                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_fsPol")
    1015                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1016                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$143       .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$49)
    1019                      .dwattr $C$DW$143, DW_AT_name("clkPol")
    1020                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_clkPol")
    1021                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1022                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1023              $C$DW$144       .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$51)
    1025                      .dwattr $C$DW$144, DW_AT_name("datadelay")
    1026                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_datadelay")
    1027                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1028                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1029              $C$DW$145       .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$35)
    1031                      .dwattr $C$DW$145, DW_AT_name("datapack")
    1032                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_datapack")
    1033                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1034                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1035              $C$DW$146       .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$53)
    1037                      .dwattr $C$DW$146, DW_AT_name("signext")
    1038                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_signext")
    1039                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1040                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1041              $C$DW$147       .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$39)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:51:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2s.asm                                                    PAGE   21

    1043                      .dwattr $C$DW$147, DW_AT_name("wordLen")
    1044                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_wordLen")
    1045                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1046                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1047              $C$DW$148       .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$55)
    1049                      .dwattr $C$DW$148, DW_AT_name("i2sMode")
    1050                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_i2sMode")
    1051                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1052                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1053              $C$DW$149       .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$57)
    1055                      .dwattr $C$DW$149, DW_AT_name("dataFormat")
    1056                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_dataFormat")
    1057                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1058                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1059              $C$DW$150       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$37)
    1061                      .dwattr $C$DW$150, DW_AT_name("fsDiv")
    1062                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_fsDiv")
    1063                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1064                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1065              $C$DW$151       .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$59)
    1067                      .dwattr $C$DW$151, DW_AT_name("clkDiv")
    1068                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_clkDiv")
    1069                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1070                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1071              $C$DW$152       .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$61)
    1073                      .dwattr $C$DW$152, DW_AT_name("FError")
    1074                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_FError")
    1075                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1076                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1077              $C$DW$153       .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$63)
    1079                      .dwattr $C$DW$153, DW_AT_name("OuError")
    1080                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_OuError")
    1081                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1082                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1083                      .dwendtag $C$DW$T$64
    1084              
    1085              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Config")
    1086                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$64)
    1087                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1088              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    1089                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    1090                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    1091              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1092                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1093                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1094                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1095              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1096                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1097                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:51:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_i2s.asm                                                    PAGE   22

    1098                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1099              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1100                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1101                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1102                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1103              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1104                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1105                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1106                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1107              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1108                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1109                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1110                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1111              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1112                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$8)
    1113                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1114              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1115                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$72)
    1116                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1117              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    1118                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    1119                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    1120              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1121                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1122                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1123                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1124              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1125                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1126                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1127              $C$DW$154       .dwtag  DW_TAG_TI_far_type
    1128                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1129              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    1130                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$154)
    1131              
    1132              $C$DW$T$21      .dwtag  DW_TAG_array_type
    1133                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
