TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    2789              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 17:55:40 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1871                      .dwcfi  save_reg_to_mem, 91, -1
    1872 000400 4EFB          AADD #-5, SP
    1873                      .dwcfi  cfa_offset, 6
    1874              $C$DW$165       .dwtag  DW_TAG_variable, DW_AT_name("pxTask")
    1875                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_pxTask")
    1876                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$48)
    1877                      .dwattr $C$DW$165, DW_AT_location[DW_OP_bregx 0x24 0]
    1878              $C$DW$166       .dwtag  DW_TAG_variable, DW_AT_name("pcTaskName")
    1879                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_pcTaskName")
    1880                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$50)
    1881                      .dwattr $C$DW$166, DW_AT_location[DW_OP_bregx 0x24 2]
    1882 000402 EB04          MOV XAR1, dbl(*SP(#2))
         000404 95   
    1883 000405 EB00          MOV XAR0, dbl(*SP(#0))
         000407 85   
    1884                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 837,column 2,is_stmt
    1885                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 838,column 2,is_stmt
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   40

    1886                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 843,column 2,is_stmt
    1887 000408 20     nop
    1888 000409 46B3   bset INTM
    1889 00040b       $C$L36:    
    1890 00040b       $C$DW$L$_vApplicationStackOverflowHook$2$B:
    1891                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 844,column 2,is_stmt
    1892 00040b 4A7E          B $C$L36  ; |844| 
    1893                                                      ; branch occurs ; |844| 
    1894 00040d       $C$DW$L$_vApplicationStackOverflowHook$2$E:
    1895                      .dwcfi  cfa_offset, 1
    1896              
    1897              $C$DW$167       .dwtag  DW_TAG_TI_loop
    1898                      .dwattr $C$DW$167, DW_AT_name("F:\eZdsp_C55x_FreeRTOS_Port\eZDSP\eZDSP_5535_Files\ccsws2\test\Debug\m
    1899                      .dwattr $C$DW$167, DW_AT_TI_begin_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    1900                      .dwattr $C$DW$167, DW_AT_TI_begin_line(0x34c)
    1901                      .dwattr $C$DW$167, DW_AT_TI_end_line(0x34c)
    1902              $C$DW$168       .dwtag  DW_TAG_TI_loop_range
    1903                      .dwattr $C$DW$168, DW_AT_low_pc($C$DW$L$_vApplicationStackOverflowHook$2$B)
    1904                      .dwattr $C$DW$168, DW_AT_high_pc($C$DW$L$_vApplicationStackOverflowHook$2$E)
    1905                      .dwendtag $C$DW$167
    1906              
    1907                      .dwattr $C$DW$162, DW_AT_TI_end_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    1908                      .dwattr $C$DW$162, DW_AT_TI_end_line(0x34d)
    1909                      .dwattr $C$DW$162, DW_AT_TI_end_column(0x01)
    1910                      .dwendentry
    1911                      .dwendtag $C$DW$162
    1912              
    1913              ;******************************************************************************
    1914              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    1915              ;******************************************************************************
    1916                      .global _EZDSP5535_init
    1917                      .global _EZDSP5535_waitusec
    1918                      .global _vTaskStartScheduler
    1919                      .global _vStartLEDFlashTasks
    1920                      .global _reset_RTC
    1921                      .global _enable_i2s0
    1922                      .global _set_i2s0_slave
    1923                      .global _set_dma0_ch0_i2s0_Lout
    1924                      .global _set_dma0_ch1_i2s0_Rout
    1925                      .global _set_dma0_ch0_stop
    1926                      .global _set_dma0_ch1_stop
    1927                      .global _EZDSP5535_LED_init
    1928                      .global _EZDSP5535_LED_on
    1929                      .global _EZDSP5535_LED_off
    1930                      .global _EZDSP5535_XF_toggle
    1931                      .global _EZDSP5535_SAR_init
    1932                      .global _EZDSP5535_SAR_getKey
    1933                      .global _PLL_init
    1934                      .global _PLL_config
    1935                      .global _PLL_reset
    1936                      .global _mem_test
    1937                      .global _oled_test
    1938                      .global _spiflash_test
    1939                      .global _RTC_reset
    1940                      .global _fTimer
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   41

    1941                      .global _Flag_RTC
    1942                      .global _Conunt_RTC
    1943                      .global _VECSTART
    1944              
    1945              ;*******************************************************************************
    1946              ;* TYPE INFORMATION                                                            *
    1947              ;*******************************************************************************
    1948              
    1949              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1950                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1951              $C$DW$169       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    1953                      .dwattr $C$DW$169, DW_AT_name("PLLCNTL1")
    1954                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PLLCNTL1")
    1955                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1956                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$170       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    1959                      .dwattr $C$DW$170, DW_AT_name("PLLINCNTL")
    1960                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PLLINCNTL")
    1961                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1962                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$171       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    1965                      .dwattr $C$DW$171, DW_AT_name("PLLCNTL2")
    1966                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PLLCNTL2")
    1967                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1968                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$172       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    1971                      .dwattr $C$DW$172, DW_AT_name("PLLOUTCNTL")
    1972                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    1973                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1974                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1975                      .dwendtag $C$DW$T$21
    1976              
    1977              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    1978                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$21)
    1979                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1980              $C$DW$173       .dwtag  DW_TAG_TI_far_type
    1981                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
    1982              $C$DW$T$35      .dwtag  DW_TAG_const_type
    1983                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$173)
    1984              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1985                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1986                      .dwattr $C$DW$T$28, DW_AT_address_class(0x17)
    1987              
    1988              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1989                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
    1990              $C$DW$174       .dwtag  DW_TAG_member
    1991                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    1992                      .dwattr $C$DW$174, DW_AT_name("EBSR")
    1993                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_EBSR")
    1994                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1995                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   42

    1996              $C$DW$175       .dwtag  DW_TAG_member
    1997                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    1998                      .dwattr $C$DW$175, DW_AT_name("RSVD0")
    1999                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD0")
    2000                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2001                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2002              $C$DW$176       .dwtag  DW_TAG_member
    2003                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    2004                      .dwattr $C$DW$176, DW_AT_name("PCGCR1")
    2005                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PCGCR1")
    2006                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2007                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2008              $C$DW$177       .dwtag  DW_TAG_member
    2009                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    2010                      .dwattr $C$DW$177, DW_AT_name("PCGCR2")
    2011                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PCGCR2")
    2012                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2013                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2014              $C$DW$178       .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    2016                      .dwattr $C$DW$178, DW_AT_name("PSRCR")
    2017                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PSRCR")
    2018                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2019                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2020              $C$DW$179       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$22)
    2022                      .dwattr $C$DW$179, DW_AT_name("PRCR")
    2023                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PRCR")
    2024                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2025                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2026              $C$DW$180       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$23)
    2028                      .dwattr $C$DW$180, DW_AT_name("RSVD1")
    2029                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RSVD1")
    2030                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2031                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2032              $C$DW$181       .dwtag  DW_TAG_member
    2033                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$22)
    2034                      .dwattr $C$DW$181, DW_AT_name("TIAFR")
    2035                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_TIAFR")
    2036                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2037                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2038              $C$DW$182       .dwtag  DW_TAG_member
    2039                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    2040                      .dwattr $C$DW$182, DW_AT_name("RSVD2")
    2041                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_RSVD2")
    2042                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2043                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2044              $C$DW$183       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    2046                      .dwattr $C$DW$183, DW_AT_name("ODSCR")
    2047                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ODSCR")
    2048                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2049                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2050              $C$DW$184       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   43

    2051                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    2052                      .dwattr $C$DW$184, DW_AT_name("PDINHIBR1")
    2053                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PDINHIBR1")
    2054                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2055                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2056              $C$DW$185       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    2058                      .dwattr $C$DW$185, DW_AT_name("PDINHIBR2")
    2059                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_PDINHIBR2")
    2060                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2061                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2062              $C$DW$186       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
    2064                      .dwattr $C$DW$186, DW_AT_name("PDINHIBR3")
    2065                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_PDINHIBR3")
    2066                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2067                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2068              $C$DW$187       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    2070                      .dwattr $C$DW$187, DW_AT_name("DMA0CESR1")
    2071                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_DMA0CESR1")
    2072                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2073                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2074              $C$DW$188       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    2076                      .dwattr $C$DW$188, DW_AT_name("DMA0CESR2")
    2077                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_DMA0CESR2")
    2078                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2079                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2080              $C$DW$189       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2082                      .dwattr $C$DW$189, DW_AT_name("DMA1CESR1")
    2083                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_DMA1CESR1")
    2084                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2085                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2086              $C$DW$190       .dwtag  DW_TAG_member
    2087                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    2088                      .dwattr $C$DW$190, DW_AT_name("DMA1CESR2")
    2089                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DMA1CESR2")
    2090                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2091                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2092              $C$DW$191       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
    2094                      .dwattr $C$DW$191, DW_AT_name("SDRAMCCR")
    2095                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_SDRAMCCR")
    2096                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2097                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2098              $C$DW$192       .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    2100                      .dwattr $C$DW$192, DW_AT_name("CCR2")
    2101                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_CCR2")
    2102                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2103                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2104              $C$DW$193       .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   44

    2106                      .dwattr $C$DW$193, DW_AT_name("CGCR1")
    2107                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_CGCR1")
    2108                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2109                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2110              $C$DW$194       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
    2112                      .dwattr $C$DW$194, DW_AT_name("CGICR")
    2113                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_CGICR")
    2114                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2115                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2116              $C$DW$195       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2118                      .dwattr $C$DW$195, DW_AT_name("CGCR2")
    2119                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_CGCR2")
    2120                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2121                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2122              $C$DW$196       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2124                      .dwattr $C$DW$196, DW_AT_name("CGOCR")
    2125                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_CGOCR")
    2126                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2127                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2128              $C$DW$197       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
    2130                      .dwattr $C$DW$197, DW_AT_name("CCSSR")
    2131                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CCSSR")
    2132                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2133                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2134              $C$DW$198       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    2136                      .dwattr $C$DW$198, DW_AT_name("RSVD3")
    2137                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_RSVD3")
    2138                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2139                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2140              $C$DW$199       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$22)
    2142                      .dwattr $C$DW$199, DW_AT_name("ECDR")
    2143                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_ECDR")
    2144                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2145                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2146              $C$DW$200       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$22)
    2148                      .dwattr $C$DW$200, DW_AT_name("RSVD4")
    2149                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_RSVD4")
    2150                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2151                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2152              $C$DW$201       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    2154                      .dwattr $C$DW$201, DW_AT_name("RAMSLPMDCNTLR1")
    2155                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2156                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2157                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2158              $C$DW$202       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    2160                      .dwattr $C$DW$202, DW_AT_name("RSVD5")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   45

    2161                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_RSVD5")
    2162                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2163                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$203       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$22)
    2166                      .dwattr $C$DW$203, DW_AT_name("RAMSLPMDCNTLR2")
    2167                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2168                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2169                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2170              $C$DW$204       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$22)
    2172                      .dwattr $C$DW$204, DW_AT_name("RAMSLPMDCNTLR3")
    2173                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2174                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2175                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2176              $C$DW$205       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$22)
    2178                      .dwattr $C$DW$205, DW_AT_name("RAMSLPMDCNTLR4")
    2179                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2180                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2181                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2182              $C$DW$206       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$22)
    2184                      .dwattr $C$DW$206, DW_AT_name("RAMSLPMDCNTLR5")
    2185                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2186                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2187                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$207       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$24)
    2190                      .dwattr $C$DW$207, DW_AT_name("RSVD6")
    2191                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_RSVD6")
    2192                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2193                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$208       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$22)
    2196                      .dwattr $C$DW$208, DW_AT_name("DMAIFR")
    2197                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_DMAIFR")
    2198                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2199                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$209       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$22)
    2202                      .dwattr $C$DW$209, DW_AT_name("DMAIER")
    2203                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_DMAIER")
    2204                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2205                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$210       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
    2208                      .dwattr $C$DW$210, DW_AT_name("USBSCR")
    2209                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_USBSCR")
    2210                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2211                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2212              $C$DW$211       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
    2214                      .dwattr $C$DW$211, DW_AT_name("ESCR")
    2215                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_ESCR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   46

    2216                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2217                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2218              $C$DW$212       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$24)
    2220                      .dwattr $C$DW$212, DW_AT_name("RSVD7")
    2221                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_RSVD7")
    2222                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2223                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2224              $C$DW$213       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$22)
    2226                      .dwattr $C$DW$213, DW_AT_name("DMA2CESR1")
    2227                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_DMA2CESR1")
    2228                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2229                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$214       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$22)
    2232                      .dwattr $C$DW$214, DW_AT_name("DMA2CESR2")
    2233                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DMA2CESR2")
    2234                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2235                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$215       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$22)
    2238                      .dwattr $C$DW$215, DW_AT_name("DMA3CESR1")
    2239                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DMA3CESR1")
    2240                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2241                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2242              $C$DW$216       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
    2244                      .dwattr $C$DW$216, DW_AT_name("DMA3CESR2")
    2245                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DMA3CESR2")
    2246                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2247                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2248              $C$DW$217       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$22)
    2250                      .dwattr $C$DW$217, DW_AT_name("CLKSTOP")
    2251                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_CLKSTOP")
    2252                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2253                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2254              $C$DW$218       .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$25)
    2256                      .dwattr $C$DW$218, DW_AT_name("RSVD8")
    2257                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_RSVD8")
    2258                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2259                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2260              $C$DW$219       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
    2262                      .dwattr $C$DW$219, DW_AT_name("DIEIDR0")
    2263                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_DIEIDR0")
    2264                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2265                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2266              $C$DW$220       .dwtag  DW_TAG_member
    2267                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$22)
    2268                      .dwattr $C$DW$220, DW_AT_name("DIEIDR1")
    2269                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_DIEIDR1")
    2270                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   47

    2271                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2272              $C$DW$221       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$22)
    2274                      .dwattr $C$DW$221, DW_AT_name("DIEIDR2")
    2275                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_DIEIDR2")
    2276                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2277                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2278              $C$DW$222       .dwtag  DW_TAG_member
    2279                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$22)
    2280                      .dwattr $C$DW$222, DW_AT_name("DIEIDR3")
    2281                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_DIEIDR3")
    2282                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2283                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2284              $C$DW$223       .dwtag  DW_TAG_member
    2285                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$22)
    2286                      .dwattr $C$DW$223, DW_AT_name("DIEIDR4")
    2287                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_DIEIDR4")
    2288                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2289                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2290              $C$DW$224       .dwtag  DW_TAG_member
    2291                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$22)
    2292                      .dwattr $C$DW$224, DW_AT_name("DIEIDR5")
    2293                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_DIEIDR5")
    2294                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2295                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2296              $C$DW$225       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$22)
    2298                      .dwattr $C$DW$225, DW_AT_name("DIEIDR6")
    2299                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_DIEIDR6")
    2300                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2301                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2302              $C$DW$226       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$22)
    2304                      .dwattr $C$DW$226, DW_AT_name("DIEIDR7")
    2305                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_DIEIDR7")
    2306                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2307                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2308                      .dwendtag $C$DW$T$26
    2309              
    2310              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2311                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$26)
    2312                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2313              $C$DW$227       .dwtag  DW_TAG_TI_far_type
    2314                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$30)
    2315              $C$DW$228       .dwtag  DW_TAG_TI_ioport_type
    2316                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$227)
    2317              $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    2318                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$228)
    2319              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    2320                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    2321                      .dwattr $C$DW$T$32, DW_AT_address_class(0x10)
    2322              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2323                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2324                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2325              
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   48

    2326              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2327                      .dwattr $C$DW$T$34, DW_AT_name("PLL_Obj")
    2328                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    2329              $C$DW$229       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$28)
    2331                      .dwattr $C$DW$229, DW_AT_name("pllConfig")
    2332                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_pllConfig")
    2333                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2334                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2335              $C$DW$230       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$29)
    2337                      .dwattr $C$DW$230, DW_AT_name("instId")
    2338                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_instId")
    2339                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2340                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2341              $C$DW$231       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$33)
    2343                      .dwattr $C$DW$231, DW_AT_name("sysAddr")
    2344                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_sysAddr")
    2345                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2346                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2347                      .dwendtag $C$DW$T$34
    2348              
    2349              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    2350                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    2351                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2352              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2353                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2354                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    2355              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    2356                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$34)
    2357                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    2358              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    2359                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2360                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2361              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2362                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2363                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2364                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2365              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2366                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2367                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2368                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2369              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2370                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2371                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2372                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2373              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    2374                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$6)
    2375                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2376              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2377                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2378                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2379                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2380              $C$DW$T$8       .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   49

    2381                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2382                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2383                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2384              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2385                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$8)
    2386                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2387              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2388                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2389                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2390              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2391                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2392                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2393                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2394              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    2395                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$9)
    2396                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
