TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    2635              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 07 01:41:50 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1735                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 811,column 5,is_stmt
    1736 0003e5 ED14          MOV dbl(*SP(#10)), XAR0
         0003e7 8F   
    1737 0003e8 ED18          MOV dbl(*SP(#12)), XAR1
         0003ea 9F   
    1738              $C$DW$153       .dwtag  DW_TAG_TI_branch
    1739                      .dwattr $C$DW$153, DW_AT_low_pc(0x00)
    1740                      .dwattr $C$DW$153, DW_AT_name("_PLL_config")
    1741                      .dwattr $C$DW$153, DW_AT_TI_call
    1742 0003eb 6C00          CALL #_PLL_config ; |811| 
         0003ed 0000!
    1743                                                      ; call occurs [#_PLL_config] ; |811| 
    1744 0003ef C410          MOV T0, *SP(#8) ; |811| 
    1745                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 812,column 1,is_stmt
    1746 0003f1 4E13          AADD #19, SP
    1747                      .dwcfi  cfa_offset, 1
    1748              $C$DW$154       .dwtag  DW_TAG_TI_branch
    1749                      .dwattr $C$DW$154, DW_AT_low_pc(0x00)
    1750                      .dwattr $C$DW$154, DW_AT_TI_return
    1751 0003f3 4804          RET
    1752                                                      ; return occurs
    1753              
    1754              $C$DW$155       .dwtag  DW_TAG_TI_loop
    1755                      .dwattr $C$DW$155, DW_AT_name("F:\site\eZDSP\eZDSP_5535_Files\ccsws2\test\Debug\main.asm:$C$L33:1:153
    1756                      .dwattr $C$DW$155, DW_AT_TI_begin_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    1757                      .dwattr $C$DW$155, DW_AT_TI_begin_line(0x323)
    1758                      .dwattr $C$DW$155, DW_AT_TI_end_line(0x323)
    1759              $C$DW$156       .dwtag  DW_TAG_TI_loop_range
    1760                      .dwattr $C$DW$156, DW_AT_low_pc($C$DW$L$_systemInit$4$B)
    1761                      .dwattr $C$DW$156, DW_AT_high_pc($C$DW$L$_systemInit$4$E)
    1762                      .dwendtag $C$DW$155
    1763              
    1764              
    1765              $C$DW$157       .dwtag  DW_TAG_TI_loop
    1766                      .dwattr $C$DW$157, DW_AT_name("F:\site\eZDSP\eZDSP_5535_Files\ccsws2\test\Debug\main.asm:$C$L31:1:153
    1767                      .dwattr $C$DW$157, DW_AT_TI_begin_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    1768                      .dwattr $C$DW$157, DW_AT_TI_begin_line(0x318)
    1769                      .dwattr $C$DW$157, DW_AT_TI_end_line(0x318)
    1770              $C$DW$158       .dwtag  DW_TAG_TI_loop_range
    1771                      .dwattr $C$DW$158, DW_AT_low_pc($C$DW$L$_systemInit$2$B)
    1772                      .dwattr $C$DW$158, DW_AT_high_pc($C$DW$L$_systemInit$2$E)
    1773                      .dwendtag $C$DW$157
    1774              
    1775                      .dwattr $C$DW$144, DW_AT_TI_end_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    1776                      .dwattr $C$DW$144, DW_AT_TI_end_line(0x32c)
    1777                      .dwattr $C$DW$144, DW_AT_TI_end_column(0x01)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   38

    1778                      .dwendentry
    1779                      .dwendtag $C$DW$144
    1780              
    1781              ;******************************************************************************
    1782              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    1783              ;******************************************************************************
    1784                      .global _EZDSP5535_init
    1785                      .global _EZDSP5535_waitusec
    1786                      .global _vTaskStartScheduler
    1787                      .global _vStartLEDFlashTasks
    1788                      .global _reset_RTC
    1789                      .global _enable_i2s0
    1790                      .global _set_i2s0_slave
    1791                      .global _set_dma0_ch0_i2s0_Lout
    1792                      .global _set_dma0_ch1_i2s0_Rout
    1793                      .global _set_dma0_ch0_stop
    1794                      .global _set_dma0_ch1_stop
    1795                      .global _EZDSP5535_LED_init
    1796                      .global _EZDSP5535_LED_on
    1797                      .global _EZDSP5535_LED_off
    1798                      .global _EZDSP5535_XF_toggle
    1799                      .global _EZDSP5535_SAR_init
    1800                      .global _EZDSP5535_SAR_getKey
    1801                      .global _PLL_init
    1802                      .global _PLL_config
    1803                      .global _PLL_reset
    1804                      .global _mem_test
    1805                      .global _oled_test
    1806                      .global _spiflash_test
    1807                      .global _RTC_reset
    1808                      .global _fTimer
    1809                      .global _Flag_RTC
    1810                      .global _Conunt_RTC
    1811                      .global _VECSTART
    1812              
    1813              ;*******************************************************************************
    1814              ;* TYPE INFORMATION                                                            *
    1815              ;*******************************************************************************
    1816              
    1817              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1818                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1819              $C$DW$159       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1821                      .dwattr $C$DW$159, DW_AT_name("PLLCNTL1")
    1822                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PLLCNTL1")
    1823                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1824                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$160       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1827                      .dwattr $C$DW$160, DW_AT_name("PLLINCNTL")
    1828                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PLLINCNTL")
    1829                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1830                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$161       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   39

    1833                      .dwattr $C$DW$161, DW_AT_name("PLLCNTL2")
    1834                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PLLCNTL2")
    1835                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1836                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$162       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1839                      .dwattr $C$DW$162, DW_AT_name("PLLOUTCNTL")
    1840                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    1841                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1842                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1843                      .dwendtag $C$DW$T$20
    1844              
    1845              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    1846                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
    1847                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1848              $C$DW$163       .dwtag  DW_TAG_TI_far_type
    1849                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$26)
    1850              $C$DW$T$34      .dwtag  DW_TAG_const_type
    1851                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$163)
    1852              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    1853                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1854                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
    1855              
    1856              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1857                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    1858              $C$DW$164       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    1860                      .dwattr $C$DW$164, DW_AT_name("EBSR")
    1861                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_EBSR")
    1862                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1863                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1864              $C$DW$165       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    1866                      .dwattr $C$DW$165, DW_AT_name("RSVD0")
    1867                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RSVD0")
    1868                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1869                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1870              $C$DW$166       .dwtag  DW_TAG_member
    1871                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    1872                      .dwattr $C$DW$166, DW_AT_name("PCGCR1")
    1873                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PCGCR1")
    1874                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1875                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1876              $C$DW$167       .dwtag  DW_TAG_member
    1877                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    1878                      .dwattr $C$DW$167, DW_AT_name("PCGCR2")
    1879                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PCGCR2")
    1880                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1881                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1882              $C$DW$168       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    1884                      .dwattr $C$DW$168, DW_AT_name("PSRCR")
    1885                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PSRCR")
    1886                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1887                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   40

    1888              $C$DW$169       .dwtag  DW_TAG_member
    1889                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    1890                      .dwattr $C$DW$169, DW_AT_name("PRCR")
    1891                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PRCR")
    1892                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1893                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1894              $C$DW$170       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    1896                      .dwattr $C$DW$170, DW_AT_name("RSVD1")
    1897                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_RSVD1")
    1898                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1899                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1900              $C$DW$171       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    1902                      .dwattr $C$DW$171, DW_AT_name("TIAFR")
    1903                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_TIAFR")
    1904                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1905                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1906              $C$DW$172       .dwtag  DW_TAG_member
    1907                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$21)
    1908                      .dwattr $C$DW$172, DW_AT_name("RSVD2")
    1909                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_RSVD2")
    1910                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1911                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1912              $C$DW$173       .dwtag  DW_TAG_member
    1913                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    1914                      .dwattr $C$DW$173, DW_AT_name("ODSCR")
    1915                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_ODSCR")
    1916                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1917                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1918              $C$DW$174       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    1920                      .dwattr $C$DW$174, DW_AT_name("PDINHIBR1")
    1921                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PDINHIBR1")
    1922                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1923                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1924              $C$DW$175       .dwtag  DW_TAG_member
    1925                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    1926                      .dwattr $C$DW$175, DW_AT_name("PDINHIBR2")
    1927                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PDINHIBR2")
    1928                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1929                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1930              $C$DW$176       .dwtag  DW_TAG_member
    1931                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    1932                      .dwattr $C$DW$176, DW_AT_name("PDINHIBR3")
    1933                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PDINHIBR3")
    1934                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1935                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1936              $C$DW$177       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    1938                      .dwattr $C$DW$177, DW_AT_name("DMA0CESR1")
    1939                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_DMA0CESR1")
    1940                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1941                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1942              $C$DW$178       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   41

    1943                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    1944                      .dwattr $C$DW$178, DW_AT_name("DMA0CESR2")
    1945                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_DMA0CESR2")
    1946                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1947                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1948              $C$DW$179       .dwtag  DW_TAG_member
    1949                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    1950                      .dwattr $C$DW$179, DW_AT_name("DMA1CESR1")
    1951                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_DMA1CESR1")
    1952                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1953                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1954              $C$DW$180       .dwtag  DW_TAG_member
    1955                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
    1956                      .dwattr $C$DW$180, DW_AT_name("DMA1CESR2")
    1957                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_DMA1CESR2")
    1958                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1959                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1960              $C$DW$181       .dwtag  DW_TAG_member
    1961                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$21)
    1962                      .dwattr $C$DW$181, DW_AT_name("SDRAMCCR")
    1963                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_SDRAMCCR")
    1964                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1965                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1966              $C$DW$182       .dwtag  DW_TAG_member
    1967                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    1968                      .dwattr $C$DW$182, DW_AT_name("CCR2")
    1969                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_CCR2")
    1970                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1971                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1972              $C$DW$183       .dwtag  DW_TAG_member
    1973                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    1974                      .dwattr $C$DW$183, DW_AT_name("CGCR1")
    1975                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_CGCR1")
    1976                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1977                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1978              $C$DW$184       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$21)
    1980                      .dwattr $C$DW$184, DW_AT_name("CGICR")
    1981                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_CGICR")
    1982                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1983                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1984              $C$DW$185       .dwtag  DW_TAG_member
    1985                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$21)
    1986                      .dwattr $C$DW$185, DW_AT_name("CGCR2")
    1987                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CGCR2")
    1988                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1989                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1990              $C$DW$186       .dwtag  DW_TAG_member
    1991                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$21)
    1992                      .dwattr $C$DW$186, DW_AT_name("CGOCR")
    1993                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_CGOCR")
    1994                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1995                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1996              $C$DW$187       .dwtag  DW_TAG_member
    1997                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   42

    1998                      .dwattr $C$DW$187, DW_AT_name("CCSSR")
    1999                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_CCSSR")
    2000                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2001                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2002              $C$DW$188       .dwtag  DW_TAG_member
    2003                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$21)
    2004                      .dwattr $C$DW$188, DW_AT_name("RSVD3")
    2005                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_RSVD3")
    2006                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2007                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2008              $C$DW$189       .dwtag  DW_TAG_member
    2009                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$21)
    2010                      .dwattr $C$DW$189, DW_AT_name("ECDR")
    2011                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_ECDR")
    2012                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2013                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2014              $C$DW$190       .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$21)
    2016                      .dwattr $C$DW$190, DW_AT_name("RSVD4")
    2017                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_RSVD4")
    2018                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2019                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2020              $C$DW$191       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$21)
    2022                      .dwattr $C$DW$191, DW_AT_name("RAMSLPMDCNTLR1")
    2023                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2024                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2025                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2026              $C$DW$192       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$21)
    2028                      .dwattr $C$DW$192, DW_AT_name("RSVD5")
    2029                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_RSVD5")
    2030                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2031                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2032              $C$DW$193       .dwtag  DW_TAG_member
    2033                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$21)
    2034                      .dwattr $C$DW$193, DW_AT_name("RAMSLPMDCNTLR2")
    2035                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2036                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2037                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2038              $C$DW$194       .dwtag  DW_TAG_member
    2039                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    2040                      .dwattr $C$DW$194, DW_AT_name("RAMSLPMDCNTLR3")
    2041                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2042                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2043                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2044              $C$DW$195       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    2046                      .dwattr $C$DW$195, DW_AT_name("RAMSLPMDCNTLR4")
    2047                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2048                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2049                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2050              $C$DW$196       .dwtag  DW_TAG_member
    2051                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
    2052                      .dwattr $C$DW$196, DW_AT_name("RAMSLPMDCNTLR5")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   43

    2053                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2054                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2055                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2056              $C$DW$197       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$23)
    2058                      .dwattr $C$DW$197, DW_AT_name("RSVD6")
    2059                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_RSVD6")
    2060                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2061                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2062              $C$DW$198       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$21)
    2064                      .dwattr $C$DW$198, DW_AT_name("DMAIFR")
    2065                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_DMAIFR")
    2066                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2067                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2068              $C$DW$199       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    2070                      .dwattr $C$DW$199, DW_AT_name("DMAIER")
    2071                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_DMAIER")
    2072                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2073                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2074              $C$DW$200       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    2076                      .dwattr $C$DW$200, DW_AT_name("USBSCR")
    2077                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_USBSCR")
    2078                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2079                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2080              $C$DW$201       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    2082                      .dwattr $C$DW$201, DW_AT_name("ESCR")
    2083                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_ESCR")
    2084                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2085                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2086              $C$DW$202       .dwtag  DW_TAG_member
    2087                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$23)
    2088                      .dwattr $C$DW$202, DW_AT_name("RSVD7")
    2089                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_RSVD7")
    2090                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2091                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2092              $C$DW$203       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    2094                      .dwattr $C$DW$203, DW_AT_name("DMA2CESR1")
    2095                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_DMA2CESR1")
    2096                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2097                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2098              $C$DW$204       .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$21)
    2100                      .dwattr $C$DW$204, DW_AT_name("DMA2CESR2")
    2101                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_DMA2CESR2")
    2102                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2103                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2104              $C$DW$205       .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    2106                      .dwattr $C$DW$205, DW_AT_name("DMA3CESR1")
    2107                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_DMA3CESR1")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   44

    2108                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2109                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2110              $C$DW$206       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$21)
    2112                      .dwattr $C$DW$206, DW_AT_name("DMA3CESR2")
    2113                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_DMA3CESR2")
    2114                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2115                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2116              $C$DW$207       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$21)
    2118                      .dwattr $C$DW$207, DW_AT_name("CLKSTOP")
    2119                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_CLKSTOP")
    2120                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2121                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2122              $C$DW$208       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$24)
    2124                      .dwattr $C$DW$208, DW_AT_name("RSVD8")
    2125                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_RSVD8")
    2126                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2127                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2128              $C$DW$209       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$21)
    2130                      .dwattr $C$DW$209, DW_AT_name("DIEIDR0")
    2131                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_DIEIDR0")
    2132                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2133                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2134              $C$DW$210       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$21)
    2136                      .dwattr $C$DW$210, DW_AT_name("DIEIDR1")
    2137                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_DIEIDR1")
    2138                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2139                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2140              $C$DW$211       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$21)
    2142                      .dwattr $C$DW$211, DW_AT_name("DIEIDR2")
    2143                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_DIEIDR2")
    2144                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2145                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2146              $C$DW$212       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$21)
    2148                      .dwattr $C$DW$212, DW_AT_name("DIEIDR3")
    2149                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_DIEIDR3")
    2150                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2151                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2152              $C$DW$213       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    2154                      .dwattr $C$DW$213, DW_AT_name("DIEIDR4")
    2155                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_DIEIDR4")
    2156                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2157                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2158              $C$DW$214       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$21)
    2160                      .dwattr $C$DW$214, DW_AT_name("DIEIDR5")
    2161                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DIEIDR5")
    2162                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   45

    2163                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$215       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$21)
    2166                      .dwattr $C$DW$215, DW_AT_name("DIEIDR6")
    2167                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DIEIDR6")
    2168                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2169                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2170              $C$DW$216       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$21)
    2172                      .dwattr $C$DW$216, DW_AT_name("DIEIDR7")
    2173                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DIEIDR7")
    2174                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2175                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2176                      .dwendtag $C$DW$T$25
    2177              
    2178              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2179                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    2180                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2181              $C$DW$217       .dwtag  DW_TAG_TI_far_type
    2182                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$29)
    2183              $C$DW$218       .dwtag  DW_TAG_TI_ioport_type
    2184                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$217)
    2185              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    2186                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$218)
    2187              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2188                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2189                      .dwattr $C$DW$T$31, DW_AT_address_class(0x10)
    2190              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2191                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    2192                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2193              
    2194              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2195                      .dwattr $C$DW$T$33, DW_AT_name("PLL_Obj")
    2196                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    2197              $C$DW$219       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
    2199                      .dwattr $C$DW$219, DW_AT_name("pllConfig")
    2200                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_pllConfig")
    2201                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2202                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2203              $C$DW$220       .dwtag  DW_TAG_member
    2204                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$28)
    2205                      .dwattr $C$DW$220, DW_AT_name("instId")
    2206                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_instId")
    2207                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2208                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2209              $C$DW$221       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$32)
    2211                      .dwattr $C$DW$221, DW_AT_name("sysAddr")
    2212                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_sysAddr")
    2213                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2214                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2215                      .dwendtag $C$DW$T$33
    2216              
    2217              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:50 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   46

    2218                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$33)
    2219                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2220              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    2221                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    2222                      .dwattr $C$DW$T$36, DW_AT_address_class(0x17)
    2223              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2224                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$33)
    2225                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    2226              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    2227                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2228                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2229              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2230                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2231                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2232                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2233              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2234                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2235                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2236                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2237              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2238                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2239                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2240                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2241              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    2242                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$6)
    2243                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2244              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2245                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2246                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2247                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2248              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2249                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2250                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2251                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2252              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2253                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$8)
    2254                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2255              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2256                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2257                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2258              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2259                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2260                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2261                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2262              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    2263                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2264                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
