TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE    1

    1006              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 07 01:41:52 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     527                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     528                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     529                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     530              $C$DW$T$5       .dwtag  DW_TAG_base_type
     531                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     532                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     533                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     534              $C$DW$T$6       .dwtag  DW_TAG_base_type
     535                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     536                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     537                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     538              $C$DW$T$7       .dwtag  DW_TAG_base_type
     539                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     540                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     541                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     542              $C$DW$T$8       .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   13

     543                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     544                      .dwattr $C$DW$T$8, DW_AT_name("short")
     545                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     546              $C$DW$T$9       .dwtag  DW_TAG_base_type
     547                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     548                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     549                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     550              $C$DW$T$10      .dwtag  DW_TAG_base_type
     551                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     552                      .dwattr $C$DW$T$10, DW_AT_name("int")
     553                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     554              $C$DW$T$11      .dwtag  DW_TAG_base_type
     555                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     556                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     557                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     558              $C$DW$31        .dwtag  DW_TAG_TI_far_type
     559                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     560              $C$DW$T$19      .dwtag  DW_TAG_volatile_type
     561                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$31)
     562              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     563                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$11)
     564                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     565              $C$DW$T$12      .dwtag  DW_TAG_base_type
     566                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     567                      .dwattr $C$DW$T$12, DW_AT_name("long")
     568                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     569              $C$DW$T$13      .dwtag  DW_TAG_base_type
     570                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     571                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     572                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     573              $C$DW$T$14      .dwtag  DW_TAG_base_type
     574                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     575                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     576                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     577                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     578                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     579              $C$DW$T$15      .dwtag  DW_TAG_base_type
     580                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     581                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     582                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     583                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     584                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     585              $C$DW$T$16      .dwtag  DW_TAG_base_type
     586                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     587                      .dwattr $C$DW$T$16, DW_AT_name("float")
     588                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     589              $C$DW$T$17      .dwtag  DW_TAG_base_type
     590                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     591                      .dwattr $C$DW$T$17, DW_AT_name("double")
     592                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     593              $C$DW$T$18      .dwtag  DW_TAG_base_type
     594                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     595                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     596                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     597              
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   14

     598              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     599                      .dwattr $C$DW$T$25, DW_AT_name("xLIST")
     600                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
     601              $C$DW$32        .dwtag  DW_TAG_member
     602                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     603                      .dwattr $C$DW$32, DW_AT_name("uxNumberOfItems")
     604                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_uxNumberOfItems")
     605                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     606                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     607              $C$DW$33        .dwtag  DW_TAG_member
     608                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     609                      .dwattr $C$DW$33, DW_AT_name("pxIndex")
     610                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_pxIndex")
     611                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     612                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     613              $C$DW$34        .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$24)
     615                      .dwattr $C$DW$34, DW_AT_name("xListEnd")
     616                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_xListEnd")
     617                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     618                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     619                      .dwendtag $C$DW$T$25
     620              
     621              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
     622                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$25)
     623                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
     624              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
     625                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
     626                      .dwattr $C$DW$T$32, DW_AT_address_class(0x17)
     627              
     628              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     629                      .dwattr $C$DW$T$29, DW_AT_name("xLIST_ITEM")
     630                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
     631              $C$DW$35        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$26)
     633                      .dwattr $C$DW$35, DW_AT_name("xItemValue")
     634                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_xItemValue")
     635                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     637              $C$DW$36        .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$28)
     639                      .dwattr $C$DW$36, DW_AT_name("pxNext")
     640                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_pxNext")
     641                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     642                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     643              $C$DW$37        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$28)
     645                      .dwattr $C$DW$37, DW_AT_name("pxPrevious")
     646                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_pxPrevious")
     647                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     648                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     649              $C$DW$38        .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$3)
     651                      .dwattr $C$DW$38, DW_AT_name("pvOwner")
     652                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_pvOwner")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   15

     653                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     654                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     655              $C$DW$39        .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$3)
     657                      .dwattr $C$DW$39, DW_AT_name("pvContainer")
     658                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_pvContainer")
     659                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     660                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     661                      .dwendtag $C$DW$T$29
     662              
     663              $C$DW$40        .dwtag  DW_TAG_TI_far_type
     664                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$29)
     665              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
     666                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$40)
     667              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
     668                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
     669                      .dwattr $C$DW$T$28, DW_AT_address_class(0x17)
     670              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     671                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$29)
     672                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     673              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
     674                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$20)
     675                      .dwattr $C$DW$T$34, DW_AT_address_class(0x17)
     676              $C$DW$41        .dwtag  DW_TAG_TI_far_type
     677                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$20)
     678              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
     679                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$41)
     680              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     681                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     682                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
     683              
     684              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     685                      .dwattr $C$DW$T$30, DW_AT_name("xMINI_LIST_ITEM")
     686                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x06)
     687              $C$DW$42        .dwtag  DW_TAG_member
     688                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$26)
     689                      .dwattr $C$DW$42, DW_AT_name("xItemValue")
     690                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_xItemValue")
     691                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     693              $C$DW$43        .dwtag  DW_TAG_member
     694                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$28)
     695                      .dwattr $C$DW$43, DW_AT_name("pxNext")
     696                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_pxNext")
     697                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     698                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     699              $C$DW$44        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$28)
     701                      .dwattr $C$DW$44, DW_AT_name("pxPrevious")
     702                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_pxPrevious")
     703                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     704                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     705                      .dwendtag $C$DW$T$30
     706              
     707              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   16

     708                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$30)
     709                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     710              $C$DW$45        .dwtag  DW_TAG_TI_far_type
     711                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$23)
     712              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
     713                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$45)
     714                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
     715              
     716              ;***************************************************************
     717              ;* DWARF CIE ENTRIES                                           *
     718              ;***************************************************************
     719              
     720              $C$DW$CIE       .dwcie 91
     721                      .dwcfi  cfa_register, 36
     722                      .dwcfi  cfa_offset, 0
     723                      .dwcfi  undefined, 0
     724                      .dwcfi  undefined, 1
     725                      .dwcfi  undefined, 2
     726                      .dwcfi  undefined, 3
     727                      .dwcfi  undefined, 4
     728                      .dwcfi  undefined, 5
     729                      .dwcfi  undefined, 6
     730                      .dwcfi  undefined, 7
     731                      .dwcfi  undefined, 8
     732                      .dwcfi  undefined, 9
     733                      .dwcfi  undefined, 10
     734                      .dwcfi  undefined, 11
     735                      .dwcfi  undefined, 12
     736                      .dwcfi  undefined, 13
     737                      .dwcfi  same_value, 14
     738                      .dwcfi  same_value, 15
     739                      .dwcfi  undefined, 16
     740                      .dwcfi  undefined, 17
     741                      .dwcfi  undefined, 18
     742                      .dwcfi  undefined, 19
     743                      .dwcfi  undefined, 20
     744                      .dwcfi  undefined, 21
     745                      .dwcfi  undefined, 22
     746                      .dwcfi  undefined, 23
     747                      .dwcfi  undefined, 24
     748                      .dwcfi  undefined, 25
     749                      .dwcfi  same_value, 26
     750                      .dwcfi  same_value, 27
     751                      .dwcfi  same_value, 28
     752                      .dwcfi  same_value, 29
     753                      .dwcfi  same_value, 30
     754                      .dwcfi  same_value, 31
     755                      .dwcfi  undefined, 32
     756                      .dwcfi  undefined, 33
     757                      .dwcfi  undefined, 34
     758                      .dwcfi  undefined, 35
     759                      .dwcfi  undefined, 36
     760                      .dwcfi  undefined, 37
     761                      .dwcfi  undefined, 38
     762                      .dwcfi  undefined, 39
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:52 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   17

     763                      .dwcfi  undefined, 40
     764                      .dwcfi  undefined, 41
     765                      .dwcfi  undefined, 42
     766                      .dwcfi  undefined, 43
     767                      .dwcfi  undefined, 44
