TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE    1

    5283              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 17:55:41 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4453              ;*******************************************************************************
    4454 000cb4       _xQueueIsQueueFullFromISR:
    4455                      .dwcfi  cfa_offset, 1
    4456                      .dwcfi  save_reg_to_mem, 91, -1
    4457 000cb4 4EF9          AADD #-7, SP
    4458                      .dwcfi  cfa_offset, 8
    4459              $C$DW$410       .dwtag  DW_TAG_variable, DW_AT_name("xQueue")
    4460                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_xQueue")
    4461                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$47)
    4462                      .dwattr $C$DW$410, DW_AT_location[DW_OP_bregx 0x24 0]
    4463              $C$DW$411       .dwtag  DW_TAG_variable, DW_AT_name("xReturn")
    4464                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_xReturn")
    4465                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$43)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   97

    4466                      .dwattr $C$DW$411, DW_AT_location[DW_OP_bregx 0x24 2]
    4467              $C$DW$412       .dwtag  DW_TAG_variable, DW_AT_name("pxQueue")
    4468                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_pxQueue")
    4469                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$57)
    4470                      .dwattr $C$DW$412, DW_AT_location[DW_OP_bregx 0x24 4]
    4471 000cb6 EB00          MOV XAR0, dbl(*SP(#0))
         000cb8 85   
    4472                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2351,column 17,is_stmt
    4473 000cb9 ED00          MOV dbl(*SP(#0)), XAR3
         000cbb BF   
    4474 000cbc EB08          MOV XAR3, dbl(*SP(#4))
         000cbe B5   
    4475                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2354,column 2,is_stmt
    4476 000cbf A96D          MOV *AR3(#29), AR1 ; |2354| 
         000cc1 001D 
    4477 000cc3 AA6D          MOV *AR3(#28), AR2 ; |2354| 
         000cc5 001C 
    4478 000cc7 12AC          CMPU AR2 != AR1, TC1 ; |2354| 
         000cc9 94   
    4479 000cca 62E4          BCC $C$L126,TC1 ; |2354| 
    4480                                                      ; branchcc occurs ; |2354| 
    4481                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2356,column 3,is_stmt
    4482 000ccc E604          MOV #1, *SP(#2) ; |2356| 
         000cce 01   
    4483                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2357,column 2,is_stmt
    4484 000ccf 4A03          B $C$L127 ; |2357| 
    4485                                                      ; branch occurs ; |2357| 
    4486 000cd1       $C$L126:    
    4487                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2360,column 3,is_stmt
    4488 000cd1 E604          MOV #0, *SP(#2) ; |2360| 
         000cd3 00   
    4489 000cd4       $C$L127:    
    4490                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2363,column 2,is_stmt
    4491 000cd4 A404          MOV *SP(#2), T0 ; |2363| 
    4492                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2364,column 1,is_stmt
    4493 000cd6 4E07          AADD #7, SP
    4494                      .dwcfi  cfa_offset, 1
    4495              $C$DW$413       .dwtag  DW_TAG_TI_branch
    4496                      .dwattr $C$DW$413, DW_AT_low_pc(0x00)
    4497                      .dwattr $C$DW$413, DW_AT_TI_return
    4498 000cd8 4804          RET
    4499                                                      ; return occurs
    4500                      .dwattr $C$DW$408, DW_AT_TI_end_file("../FreeRTOS/Source/queue.c")
    4501                      .dwattr $C$DW$408, DW_AT_TI_end_line(0x93c)
    4502                      .dwattr $C$DW$408, DW_AT_TI_end_column(0x01)
    4503                      .dwendentry
    4504                      .dwendtag $C$DW$408
    4505              
    4506              ;******************************************************************************
    4507              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    4508              ;******************************************************************************
    4509                      .global _vPortYield
    4510                      .global _pvPortMalloc
    4511                      .global _vPortFree
    4512                      .global _vListInitialise
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   98

    4513                      .global _vTaskSuspendAll
    4514                      .global _xTaskResumeAll
    4515                      .global _vTaskPlaceOnEventList
    4516                      .global _xTaskRemoveFromEventList
    4517                      .global _xTaskCheckForTimeOut
    4518                      .global _vTaskMissedYield
    4519                      .global _vTaskInternalSetTimeOutState
    4520                      .global _usCriticalNesting
    4521                      .global _memcpy
    4522              
    4523              ;*******************************************************************************
    4524              ;* TYPE INFORMATION                                                            *
    4525              ;*******************************************************************************
    4526              
    4527              $C$DW$T$22      .dwtag  DW_TAG_union_type
    4528                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    4529              $C$DW$414       .dwtag  DW_TAG_member
    4530                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    4531                      .dwattr $C$DW$414, DW_AT_name("xQueue")
    4532                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_xQueue")
    4533                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4534                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4535              $C$DW$415       .dwtag  DW_TAG_member
    4536                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$21)
    4537                      .dwattr $C$DW$415, DW_AT_name("xSemaphore")
    4538                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_xSemaphore")
    4539                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4540                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4541                      .dwendtag $C$DW$T$22
    4542              
    4543              
    4544              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4545                      .dwattr $C$DW$T$29, DW_AT_name("QueueDefinition")
    4546                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x22)
    4547              $C$DW$416       .dwtag  DW_TAG_member
    4548                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$24)
    4549                      .dwattr $C$DW$416, DW_AT_name("pcHead")
    4550                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_pcHead")
    4551                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4552                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4553              $C$DW$417       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$24)
    4555                      .dwattr $C$DW$417, DW_AT_name("pcWriteTo")
    4556                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_pcWriteTo")
    4557                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4558                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4559              $C$DW$418       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$22)
    4561                      .dwattr $C$DW$418, DW_AT_name("u")
    4562                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_u")
    4563                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4564                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4565              $C$DW$419       .dwtag  DW_TAG_member
    4566                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$25)
    4567                      .dwattr $C$DW$419, DW_AT_name("xTasksWaitingToSend")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   99

    4568                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_xTasksWaitingToSend")
    4569                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4570                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4571              $C$DW$420       .dwtag  DW_TAG_member
    4572                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$25)
    4573                      .dwattr $C$DW$420, DW_AT_name("xTasksWaitingToReceive")
    4574                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_xTasksWaitingToReceive")
    4575                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4576                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4577              $C$DW$421       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$27)
    4579                      .dwattr $C$DW$421, DW_AT_name("uxMessagesWaiting")
    4580                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_uxMessagesWaiting")
    4581                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4582                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4583              $C$DW$422       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$26)
    4585                      .dwattr $C$DW$422, DW_AT_name("uxLength")
    4586                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_uxLength")
    4587                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4588                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4589              $C$DW$423       .dwtag  DW_TAG_member
    4590                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$26)
    4591                      .dwattr $C$DW$423, DW_AT_name("uxItemSize")
    4592                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_uxItemSize")
    4593                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4594                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4595              $C$DW$424       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$28)
    4597                      .dwattr $C$DW$424, DW_AT_name("cRxLock")
    4598                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_cRxLock")
    4599                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4600                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4601              $C$DW$425       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$28)
    4603                      .dwattr $C$DW$425, DW_AT_name("cTxLock")
    4604                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_cTxLock")
    4605                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4606                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4607                      .dwendtag $C$DW$T$29
    4608              
    4609              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4610                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$29)
    4611                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    4612              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    4613                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    4614                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4615              $C$DW$426       .dwtag  DW_TAG_TI_far_type
    4616                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$46)
    4617              $C$DW$T$47      .dwtag  DW_TAG_const_type
    4618                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$426)
    4619              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
    4620                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    4621                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4622              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("Queue_t")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  100

    4623                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    4624                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4625              $C$DW$427       .dwtag  DW_TAG_TI_far_type
    4626                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$53)
    4627              $C$DW$T$54      .dwtag  DW_TAG_const_type
    4628                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$427)
    4629              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    4630                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4631                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    4632              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    4633                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$53)
    4634                      .dwattr $C$DW$T$56, DW_AT_address_class(0x17)
    4635              $C$DW$428       .dwtag  DW_TAG_TI_far_type
    4636                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$56)
    4637              $C$DW$T$57      .dwtag  DW_TAG_const_type
    4638                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$428)
    4639              
    4640              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4641                      .dwattr $C$DW$T$30, DW_AT_name("QueuePointers")
    4642                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    4643              $C$DW$429       .dwtag  DW_TAG_member
    4644                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
    4645                      .dwattr $C$DW$429, DW_AT_name("pcTail")
    4646                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_pcTail")
    4647                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4648                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4649              $C$DW$430       .dwtag  DW_TAG_member
    4650                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$24)
    4651                      .dwattr $C$DW$430, DW_AT_name("pcReadFrom")
    4652                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_pcReadFrom")
    4653                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4654                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4655                      .dwendtag $C$DW$T$30
    4656              
    4657              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("QueuePointers_t")
    4658                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$30)
    4659                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4660              
    4661              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4662                      .dwattr $C$DW$T$33, DW_AT_name("SemaphoreData")
    4663                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    4664              $C$DW$431       .dwtag  DW_TAG_member
    4665                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$32)
    4666                      .dwattr $C$DW$431, DW_AT_name("xMutexHolder")
    4667                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_xMutexHolder")
    4668                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4669                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4670              $C$DW$432       .dwtag  DW_TAG_member
    4671                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$26)
    4672                      .dwattr $C$DW$432, DW_AT_name("uxRecursiveCallCount")
    4673                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_uxRecursiveCallCount")
    4674                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4675                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4676                      .dwendtag $C$DW$T$33
    4677              
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  101

    4678              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreData_t")
    4679                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$33)
    4680                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    4681              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4682                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4683              $C$DW$433       .dwtag  DW_TAG_TI_far_type
    4684                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$3)
    4685              $C$DW$T$64      .dwtag  DW_TAG_const_type
    4686                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$433)
    4687              $C$DW$434       .dwtag  DW_TAG_TI_far_type
    4688              $C$DW$T$58      .dwtag  DW_TAG_const_type
    4689                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$434)
    4690              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    4691                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    4692                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
    4693              $C$DW$435       .dwtag  DW_TAG_TI_far_type
    4694                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$59)
    4695              $C$DW$T$65      .dwtag  DW_TAG_const_type
    4696                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$435)
    4697              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4698                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4699                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4700                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4701              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4702                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4703                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4704                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4705              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    4706                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$5)
    4707                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4708              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    4709                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    4710                      .dwattr $C$DW$T$24, DW_AT_address_class(0x17)
    4711              $C$DW$436       .dwtag  DW_TAG_TI_far_type
    4712                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$23)
    4713              $C$DW$T$28      .dwtag  DW_TAG_volatile_type
    4714                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$436)
    4715              $C$DW$437       .dwtag  DW_TAG_TI_far_type
    4716                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$23)
    4717              $C$DW$T$90      .dwtag  DW_TAG_const_type
    4718                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$437)
    4719              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4720                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4721                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4722                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4723              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    4724                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$6)
    4725                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4726              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    4727                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$49)
    4728                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    4729              $C$DW$438       .dwtag  DW_TAG_TI_far_type
    4730                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$49)
    4731              $C$DW$T$50      .dwtag  DW_TAG_const_type
    4732                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$438)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  102

    4733              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4734                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4735                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4736                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4737              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4738                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4739                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4740                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4741              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("BaseType_t")
    4742                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$8)
    4743                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4744              $C$DW$439       .dwtag  DW_TAG_TI_far_type
    4745                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$43)
    4746              $C$DW$T$91      .dwtag  DW_TAG_const_type
    4747                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$439)
    4748              $C$DW$T$106     .dwtag  DW_TAG_pointer_type
    4749                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$43)
    4750                      .dwattr $C$DW$T$106, DW_AT_address_class(0x17)
    4751              $C$DW$440       .dwtag  DW_TAG_TI_far_type
    4752                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$106)
    4753              $C$DW$T$107     .dwtag  DW_TAG_const_type
    4754                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$440)
    4755              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4756                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4757                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4758                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4759              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    4760                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$9)
    4761                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    4762              $C$DW$441       .dwtag  DW_TAG_TI_far_type
    4763                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$26)
    4764              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    4765                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$441)
    4766              $C$DW$442       .dwtag  DW_TAG_TI_far_type
    4767                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$26)
    4768              $C$DW$T$48      .dwtag  DW_TAG_const_type
    4769                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$442)
    4770              $C$DW$T$10      .dwtag  DW_TAG_base_type
    4771                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4772                      .dwattr $C$DW$T$10, DW_AT_name("int")
    4773                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    4774              $C$DW$T$11      .dwtag  DW_TAG_base_type
    4775                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4776                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4777                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    4778              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
    4779                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$11)
    4780                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4781              $C$DW$443       .dwtag  DW_TAG_TI_far_type
    4782                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$38)
    4783              $C$DW$T$74      .dwtag  DW_TAG_const_type
    4784                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$443)
    4785              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    4786                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$38)
    4787                      .dwattr $C$DW$T$99, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  103

    4788              $C$DW$444       .dwtag  DW_TAG_TI_far_type
    4789                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$99)
    4790              $C$DW$T$100     .dwtag  DW_TAG_const_type
    4791                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$444)
    4792              $C$DW$445       .dwtag  DW_TAG_TI_far_type
    4793                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$11)
    4794              $C$DW$T$121     .dwtag  DW_TAG_volatile_type
    4795                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$445)
    4796              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4797                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$11)
    4798                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4799              $C$DW$T$12      .dwtag  DW_TAG_base_type
    4800                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4801                      .dwattr $C$DW$T$12, DW_AT_name("long")
    4802                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    4803              $C$DW$T$13      .dwtag  DW_TAG_base_type
    4804                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4805                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4806                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    4807              $C$DW$T$14      .dwtag  DW_TAG_base_type
    4808                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4809                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    4810                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    4811                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    4812                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    4813              $C$DW$T$15      .dwtag  DW_TAG_base_type
    4814                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4815                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4816                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    4817                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    4818                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    4819              $C$DW$T$16      .dwtag  DW_TAG_base_type
    4820                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4821                      .dwattr $C$DW$T$16, DW_AT_name("float")
    4822                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    4823              $C$DW$T$17      .dwtag  DW_TAG_base_type
    4824                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4825                      .dwattr $C$DW$T$17, DW_AT_name("double")
    4826                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    4827              $C$DW$T$18      .dwtag  DW_TAG_base_type
    4828                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4829                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    4830                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    4831              
    4832              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4833                      .dwattr $C$DW$T$19, DW_AT_name("tskTaskControlBlock")
    4834                      .dwattr $C$DW$T$19, DW_AT_declaration
    4835                      .dwendtag $C$DW$T$19
    4836              
    4837              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    4838                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$19)
    4839                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
    4840              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    4841                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    4842                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  104

    4843              
    4844              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4845                      .dwattr $C$DW$T$37, DW_AT_name("xLIST")
    4846                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    4847              $C$DW$446       .dwtag  DW_TAG_member
    4848                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$27)
    4849                      .dwattr $C$DW$446, DW_AT_name("uxNumberOfItems")
    4850                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_uxNumberOfItems")
    4851                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4852                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4853              $C$DW$447       .dwtag  DW_TAG_member
    4854                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$35)
    4855                      .dwattr $C$DW$447, DW_AT_name("pxIndex")
    4856                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_pxIndex")
    4857                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4858                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4859              $C$DW$448       .dwtag  DW_TAG_member
    4860                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$36)
    4861                      .dwattr $C$DW$448, DW_AT_name("xListEnd")
    4862                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_xListEnd")
    4863                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4864                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4865                      .dwendtag $C$DW$T$37
    4866              
    4867              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    4868                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$37)
    4869                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4870              $C$DW$449       .dwtag  DW_TAG_TI_far_type
    4871                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$25)
    4872              $C$DW$T$94      .dwtag  DW_TAG_const_type
    4873                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$449)
    4874              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    4875                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    4876                      .dwattr $C$DW$T$95, DW_AT_address_class(0x17)
    4877              $C$DW$450       .dwtag  DW_TAG_TI_far_type
    4878                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$95)
    4879              $C$DW$T$96      .dwtag  DW_TAG_const_type
    4880                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$450)
    4881              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    4882                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$25)
    4883                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    4884              $C$DW$451       .dwtag  DW_TAG_TI_far_type
    4885                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$70)
    4886              $C$DW$T$71      .dwtag  DW_TAG_const_type
    4887                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$451)
    4888              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4889                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$37)
    4890                      .dwattr $C$DW$T$40, DW_AT_address_class(0x17)
    4891              
    4892              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4893                      .dwattr $C$DW$T$41, DW_AT_name("xLIST_ITEM")
    4894                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0a)
    4895              $C$DW$452       .dwtag  DW_TAG_member
    4896                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$38)
    4897                      .dwattr $C$DW$452, DW_AT_name("xItemValue")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  105

    4898                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_xItemValue")
    4899                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4900                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4901              $C$DW$453       .dwtag  DW_TAG_member
    4902                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$39)
    4903                      .dwattr $C$DW$453, DW_AT_name("pxNext")
    4904                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_pxNext")
    4905                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4906                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4907              $C$DW$454       .dwtag  DW_TAG_member
    4908                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$39)
    4909                      .dwattr $C$DW$454, DW_AT_name("pxPrevious")
    4910                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_pxPrevious")
    4911                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4912                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4913              $C$DW$455       .dwtag  DW_TAG_member
    4914                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$3)
    4915                      .dwattr $C$DW$455, DW_AT_name("pvOwner")
    4916                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_pvOwner")
    4917                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4918                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4919              $C$DW$456       .dwtag  DW_TAG_member
    4920                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$40)
    4921                      .dwattr $C$DW$456, DW_AT_name("pvContainer")
    4922                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_pvContainer")
    4923                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4924                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4925                      .dwendtag $C$DW$T$41
    4926              
    4927              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    4928                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$41)
    4929                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4930              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    4931                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4932                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    4933              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4934                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$41)
    4935                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    4936              
    4937              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    4938                      .dwattr $C$DW$T$42, DW_AT_name("xMINI_LIST_ITEM")
    4939                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x06)
    4940              $C$DW$457       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$38)
    4942                      .dwattr $C$DW$457, DW_AT_name("xItemValue")
    4943                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_xItemValue")
    4944                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4945                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4946              $C$DW$458       .dwtag  DW_TAG_member
    4947                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$39)
    4948                      .dwattr $C$DW$458, DW_AT_name("pxNext")
    4949                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_pxNext")
    4950                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4951                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4952              $C$DW$459       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  106

    4953                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$39)
    4954                      .dwattr $C$DW$459, DW_AT_name("pxPrevious")
    4955                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_pxPrevious")
    4956                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4957                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4958                      .dwendtag $C$DW$T$42
    4959              
    4960              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    4961                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$42)
    4962                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4963              
    4964              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4965                      .dwattr $C$DW$T$44, DW_AT_name("xTIME_OUT")
    4966                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    4967              $C$DW$460       .dwtag  DW_TAG_member
    4968                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$43)
    4969                      .dwattr $C$DW$460, DW_AT_name("xOverflowCount")
    4970                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_xOverflowCount")
    4971                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4972                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4973              $C$DW$461       .dwtag  DW_TAG_member
    4974                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$38)
    4975                      .dwattr $C$DW$461, DW_AT_name("xTimeOnEntering")
    4976                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_xTimeOnEntering")
    4977                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4978                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4979                      .dwendtag $C$DW$T$44
    4980              
    4981              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    4982                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$44)
    4983                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    4984              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    4985                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    4986                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    4987              $C$DW$462       .dwtag  DW_TAG_TI_far_type
    4988                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$78)
    4989              $C$DW$T$79      .dwtag  DW_TAG_const_type
    4990                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$462)
    4991                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4992              
    4993              ;***************************************************************
    4994              ;* DWARF CIE ENTRIES                                           *
    4995              ;***************************************************************
    4996              
    4997              $C$DW$CIE       .dwcie 91
    4998                      .dwcfi  cfa_register, 36
    4999                      .dwcfi  cfa_offset, 0
    5000                      .dwcfi  undefined, 0
    5001                      .dwcfi  undefined, 1
    5002                      .dwcfi  undefined, 2
    5003                      .dwcfi  undefined, 3
    5004                      .dwcfi  undefined, 4
    5005                      .dwcfi  undefined, 5
    5006                      .dwcfi  undefined, 6
    5007                      .dwcfi  undefined, 7
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:55:42 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  107

    5008                      .dwcfi  undefined, 8
    5009                      .dwcfi  undefined, 9
    5010                      .dwcfi  undefined, 10
    5011                      .dwcfi  undefined, 11
    5012                      .dwcfi  undefined, 12
    5013                      .dwcfi  undefined, 13
    5014                      .dwcfi  same_value, 14
    5015                      .dwcfi  same_value, 15
    5016                      .dwcfi  undefined, 16
    5017                      .dwcfi  undefined, 17
    5018                      .dwcfi  undefined, 18
    5019                      .dwcfi  undefined, 19
    5020                      .dwcfi  undefined, 20
    5021                      .dwcfi  undefined, 21
    5022                      .dwcfi  undefined, 22
    5023                      .dwcfi  undefined, 23
    5024                      .dwcfi  undefined, 24
    5025                      .dwcfi  undefined, 25
    5026                      .dwcfi  same_value, 26
    5027                      .dwcfi  same_value, 27
    5028                      .dwcfi  same_value, 28
    5029                      .dwcfi  same_value, 29
    5030                      .dwcfi  same_value, 30
    5031                      .dwcfi  same_value, 31
    5032                      .dwcfi  undefined, 32
    5033                      .dwcfi  undefined, 33
    5034                      .dwcfi  undefined, 34
    5035                      .dwcfi  undefined, 35
    5036                      .dwcfi  undefined, 36
    5037                      .dwcfi  undefined, 37
    5038                      .dwcfi  undefined, 38
    5039                      .dwcfi  undefined, 39
    5040                      .dwcfi  undefined, 40
    5041                      .dwcfi  undefined, 41
    5042                      .dwcfi  undefined, 42
    5043                      .dwcfi  undefined, 43
