TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:57:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE    1

    7750              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 17:57:03 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    7048              $C$DW$T$117     .dwtag  DW_TAG_const_type
    7049                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$523)
    7050              $C$DW$T$12      .dwtag  DW_TAG_base_type
    7051                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    7052                      .dwattr $C$DW$T$12, DW_AT_name("long")
    7053                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    7054              $C$DW$T$13      .dwtag  DW_TAG_base_type
    7055                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    7056                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    7057                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    7058              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    7059                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$13)
    7060                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    7061              $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    7062                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$29)
    7063                      .dwattr $C$DW$T$129, DW_AT_address_class(0x17)
    7064              $C$DW$524       .dwtag  DW_TAG_TI_far_type
    7065                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$29)
    7066              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    7067                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$524)
    7068              $C$DW$525       .dwtag  DW_TAG_TI_far_type
    7069                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$29)
    7070              $C$DW$T$74      .dwtag  DW_TAG_const_type
    7071                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$525)
    7072              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7073                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7074                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7075                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7076                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    7077                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    7078              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7079                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7080                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7081                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7082                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    7083                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    7084              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7085                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7086                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7087                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7088              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7089                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:57:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  158

    7090                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7091                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    7092              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7093                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7094                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    7095                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    7096              $C$DW$T$27      .dwtag  DW_TAG_base_type
    7097                      .dwattr $C$DW$T$27, DW_AT_encoding(DW_ATE_signed_char)
    7098                      .dwattr $C$DW$T$27, DW_AT_name("signed char")
    7099                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    7100              
    7101              $C$DW$T$28      .dwtag  DW_TAG_array_type
    7102                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    7103                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    7104                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    7105              $C$DW$526       .dwtag  DW_TAG_subrange_type
    7106                      .dwattr $C$DW$526, DW_AT_upper_bound(0x07)
    7107                      .dwendtag $C$DW$T$28
    7108              
    7109              $C$DW$527       .dwtag  DW_TAG_TI_far_type
    7110                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$27)
    7111              $C$DW$T$71      .dwtag  DW_TAG_const_type
    7112                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$527)
    7113              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    7114                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    7115                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
    7116              $C$DW$528       .dwtag  DW_TAG_TI_far_type
    7117                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$72)
    7118              $C$DW$T$73      .dwtag  DW_TAG_const_type
    7119                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$528)
    7120              $C$DW$T$146     .dwtag  DW_TAG_pointer_type
    7121                      .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$27)
    7122                      .dwattr $C$DW$T$146, DW_AT_address_class(0x17)
    7123              
    7124              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7125                      .dwattr $C$DW$T$20, DW_AT_name("tagSTACKSTRUCT")
    7126                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    7127              $C$DW$529       .dwtag  DW_TAG_member
    7128                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
    7129                      .dwattr $C$DW$529, DW_AT_name("pxTopOfStack")
    7130                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_pxTopOfStack")
    7131                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7132                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    7133              $C$DW$530       .dwtag  DW_TAG_member
    7134                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
    7135                      .dwattr $C$DW$530, DW_AT_name("pxTopOfSysStack")
    7136                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    7137                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7138                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    7139                      .dwendtag $C$DW$T$20
    7140              
    7141              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    7142                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$20)
    7143                      .dwattr $C$DW$T$150, DW_AT_address_class(0x17)
    7144              
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:57:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  159

    7145              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7146                      .dwattr $C$DW$T$33, DW_AT_name("tskTaskControlBlock")
    7147                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x2a)
    7148              $C$DW$531       .dwtag  DW_TAG_member
    7149                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$23)
    7150                      .dwattr $C$DW$531, DW_AT_name("pxTopOfStack")
    7151                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_pxTopOfStack")
    7152                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7153                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    7154              $C$DW$532       .dwtag  DW_TAG_member
    7155                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$23)
    7156                      .dwattr $C$DW$532, DW_AT_name("pxTopOfSysStack")
    7157                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    7158                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7159                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    7160              $C$DW$533       .dwtag  DW_TAG_member
    7161                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$24)
    7162                      .dwattr $C$DW$533, DW_AT_name("xStateListItem")
    7163                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_xStateListItem")
    7164                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7165                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    7166              $C$DW$534       .dwtag  DW_TAG_member
    7167                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$24)
    7168                      .dwattr $C$DW$534, DW_AT_name("xEventListItem")
    7169                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_xEventListItem")
    7170                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7171                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    7172              $C$DW$535       .dwtag  DW_TAG_member
    7173                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$25)
    7174                      .dwattr $C$DW$535, DW_AT_name("uxPriority")
    7175                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_uxPriority")
    7176                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7177                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    7178              $C$DW$536       .dwtag  DW_TAG_member
    7179                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$26)
    7180                      .dwattr $C$DW$536, DW_AT_name("pxStack")
    7181                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_pxStack")
    7182                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7183                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    7184              $C$DW$537       .dwtag  DW_TAG_member
    7185                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$26)
    7186                      .dwattr $C$DW$537, DW_AT_name("pxSysStack")
    7187                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_pxSysStack")
    7188                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7189                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    7190              $C$DW$538       .dwtag  DW_TAG_member
    7191                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$28)
    7192                      .dwattr $C$DW$538, DW_AT_name("pcTaskName")
    7193                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_pcTaskName")
    7194                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7195                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    7196              $C$DW$539       .dwtag  DW_TAG_member
    7197                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$30)
    7198                      .dwattr $C$DW$539, DW_AT_name("ulNotifiedValue")
    7199                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_ulNotifiedValue")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:57:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  160

    7200                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7201                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    7202              $C$DW$540       .dwtag  DW_TAG_member
    7203                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$32)
    7204                      .dwattr $C$DW$540, DW_AT_name("ucNotifyState")
    7205                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_ucNotifyState")
    7206                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7207                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    7208                      .dwendtag $C$DW$T$33
    7209              
    7210              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    7211                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$33)
    7212                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    7213              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    7214                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    7215                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    7216              $C$DW$541       .dwtag  DW_TAG_TI_far_type
    7217                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$76)
    7218              $C$DW$T$120     .dwtag  DW_TAG_const_type
    7219                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$541)
    7220              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    7221                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    7222                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    7223              $C$DW$542       .dwtag  DW_TAG_TI_far_type
    7224                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$77)
    7225              $C$DW$T$78      .dwtag  DW_TAG_const_type
    7226                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$542)
    7227              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    7228                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$33)
    7229                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    7230              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    7231                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    7232                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    7233              $C$DW$543       .dwtag  DW_TAG_TI_far_type
    7234                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$80)
    7235              $C$DW$T$151     .dwtag  DW_TAG_const_type
    7236                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$543)
    7237              $C$DW$T$152     .dwtag  DW_TAG_pointer_type
    7238                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$151)
    7239                      .dwattr $C$DW$T$152, DW_AT_address_class(0x17)
    7240              $C$DW$544       .dwtag  DW_TAG_TI_far_type
    7241                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$152)
    7242              $C$DW$T$153     .dwtag  DW_TAG_const_type
    7243                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$544)
    7244              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    7245                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    7246                      .dwattr $C$DW$T$81, DW_AT_address_class(0x17)
    7247              $C$DW$545       .dwtag  DW_TAG_TI_far_type
    7248                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$81)
    7249              $C$DW$T$154     .dwtag  DW_TAG_volatile_type
    7250                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$545)
    7251              $C$DW$546       .dwtag  DW_TAG_TI_far_type
    7252                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$81)
    7253              $C$DW$T$155     .dwtag  DW_TAG_const_type
    7254                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$546)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:57:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  161

    7255              
    7256              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7257                      .dwattr $C$DW$T$37, DW_AT_name("xLIST")
    7258                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    7259              $C$DW$547       .dwtag  DW_TAG_member
    7260                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$34)
    7261                      .dwattr $C$DW$547, DW_AT_name("uxNumberOfItems")
    7262                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_uxNumberOfItems")
    7263                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7264                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    7265              $C$DW$548       .dwtag  DW_TAG_member
    7266                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$35)
    7267                      .dwattr $C$DW$548, DW_AT_name("pxIndex")
    7268                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_pxIndex")
    7269                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7270                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    7271              $C$DW$549       .dwtag  DW_TAG_member
    7272                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$36)
    7273                      .dwattr $C$DW$549, DW_AT_name("xListEnd")
    7274                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_xListEnd")
    7275                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7276                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    7277                      .dwendtag $C$DW$T$37
    7278              
    7279              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    7280                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$37)
    7281                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    7282              $C$DW$550       .dwtag  DW_TAG_TI_far_type
    7283                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$61)
    7284              $C$DW$T$124     .dwtag  DW_TAG_const_type
    7285                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$550)
    7286              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    7287                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    7288                      .dwattr $C$DW$T$125, DW_AT_address_class(0x17)
    7289              $C$DW$551       .dwtag  DW_TAG_TI_far_type
    7290                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$125)
    7291              $C$DW$T$126     .dwtag  DW_TAG_const_type
    7292                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$551)
    7293              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    7294                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    7295                      .dwattr $C$DW$T$62, DW_AT_address_class(0x17)
    7296              $C$DW$552       .dwtag  DW_TAG_TI_far_type
    7297                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$62)
    7298              $C$DW$T$63      .dwtag  DW_TAG_const_type
    7299                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$552)
    7300              $C$DW$553       .dwtag  DW_TAG_TI_far_type
    7301                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$62)
    7302              $C$DW$T$156     .dwtag  DW_TAG_volatile_type
    7303                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$553)
    7304              
    7305              $C$DW$T$157     .dwtag  DW_TAG_array_type
    7306                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$61)
    7307                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    7308                      .dwattr $C$DW$T$157, DW_AT_byte_size(0x28)
    7309              $C$DW$554       .dwtag  DW_TAG_subrange_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:57:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  162

    7310                      .dwattr $C$DW$554, DW_AT_upper_bound(0x03)
    7311                      .dwendtag $C$DW$T$157
    7312              
    7313              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    7314                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$37)
    7315                      .dwattr $C$DW$T$40, DW_AT_address_class(0x17)
    7316              
    7317              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    7318                      .dwattr $C$DW$T$41, DW_AT_name("xLIST_ITEM")
    7319                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0a)
    7320              $C$DW$555       .dwtag  DW_TAG_member
    7321                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$38)
    7322                      .dwattr $C$DW$555, DW_AT_name("xItemValue")
    7323                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_xItemValue")
    7324                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7325                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    7326              $C$DW$556       .dwtag  DW_TAG_member
    7327                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$39)
    7328                      .dwattr $C$DW$556, DW_AT_name("pxNext")
    7329                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_pxNext")
    7330                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7331                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    7332              $C$DW$557       .dwtag  DW_TAG_member
    7333                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$39)
    7334                      .dwattr $C$DW$557, DW_AT_name("pxPrevious")
    7335                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_pxPrevious")
    7336                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7337                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    7338              $C$DW$558       .dwtag  DW_TAG_member
    7339                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$3)
    7340                      .dwattr $C$DW$558, DW_AT_name("pvOwner")
    7341                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_pvOwner")
    7342                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7343                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    7344              $C$DW$559       .dwtag  DW_TAG_member
    7345                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$40)
    7346                      .dwattr $C$DW$559, DW_AT_name("pvContainer")
    7347                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_pvContainer")
    7348                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7349                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    7350                      .dwendtag $C$DW$T$41
    7351              
    7352              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    7353                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$41)
    7354                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    7355              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    7356                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
    7357                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    7358              $C$DW$560       .dwtag  DW_TAG_TI_far_type
    7359                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$35)
    7360              $C$DW$T$66      .dwtag  DW_TAG_const_type
    7361                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$560)
    7362              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    7363                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$41)
    7364                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:57:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  163

    7365              
    7366              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    7367                      .dwattr $C$DW$T$42, DW_AT_name("xMEMORY_REGION")
    7368                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x06)
    7369              $C$DW$561       .dwtag  DW_TAG_member
    7370                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$3)
    7371                      .dwattr $C$DW$561, DW_AT_name("pvBaseAddress")
    7372                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_pvBaseAddress")
    7373                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7374                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    7375              $C$DW$562       .dwtag  DW_TAG_member
    7376                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$29)
    7377                      .dwattr $C$DW$562, DW_AT_name("ulLengthInBytes")
    7378                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_ulLengthInBytes")
    7379                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7380                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    7381              $C$DW$563       .dwtag  DW_TAG_member
    7382                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$29)
    7383                      .dwattr $C$DW$563, DW_AT_name("ulParameters")
    7384                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_ulParameters")
    7385                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7386                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    7387                      .dwendtag $C$DW$T$42
    7388              
    7389              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    7390                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$42)
    7391                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    7392              $C$DW$564       .dwtag  DW_TAG_TI_far_type
    7393                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$82)
    7394              $C$DW$T$83      .dwtag  DW_TAG_const_type
    7395                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$564)
    7396              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    7397                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    7398                      .dwattr $C$DW$T$84, DW_AT_address_class(0x17)
    7399              $C$DW$565       .dwtag  DW_TAG_TI_far_type
    7400                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$84)
    7401              $C$DW$T$85      .dwtag  DW_TAG_const_type
    7402                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$565)
    7403              
    7404              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7405                      .dwattr $C$DW$T$43, DW_AT_name("xMINI_LIST_ITEM")
    7406                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x06)
    7407              $C$DW$566       .dwtag  DW_TAG_member
    7408                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$38)
    7409                      .dwattr $C$DW$566, DW_AT_name("xItemValue")
    7410                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_xItemValue")
    7411                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7412                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    7413              $C$DW$567       .dwtag  DW_TAG_member
    7414                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$39)
    7415                      .dwattr $C$DW$567, DW_AT_name("pxNext")
    7416                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_pxNext")
    7417                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7418                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    7419              $C$DW$568       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:57:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  164

    7420                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$39)
    7421                      .dwattr $C$DW$568, DW_AT_name("pxPrevious")
    7422                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_pxPrevious")
    7423                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7424                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    7425                      .dwendtag $C$DW$T$43
    7426              
    7427              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    7428                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$43)
    7429                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    7430              
    7431              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7432                      .dwattr $C$DW$T$45, DW_AT_name("xTIME_OUT")
    7433                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    7434              $C$DW$569       .dwtag  DW_TAG_member
    7435                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$44)
    7436                      .dwattr $C$DW$569, DW_AT_name("xOverflowCount")
    7437                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_xOverflowCount")
    7438                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7439                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    7440              $C$DW$570       .dwtag  DW_TAG_member
    7441                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$38)
    7442                      .dwattr $C$DW$570, DW_AT_name("xTimeOnEntering")
    7443                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_xTimeOnEntering")
    7444                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7445                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    7446                      .dwendtag $C$DW$T$45
    7447              
    7448              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    7449                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$45)
    7450                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    7451              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    7452                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    7453                      .dwattr $C$DW$T$101, DW_AT_address_class(0x17)
    7454              $C$DW$571       .dwtag  DW_TAG_TI_far_type
    7455                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$101)
    7456              $C$DW$T$102     .dwtag  DW_TAG_const_type
    7457                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$571)
    7458                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    7459              
    7460              ;***************************************************************
    7461              ;* DWARF CIE ENTRIES                                           *
    7462              ;***************************************************************
    7463              
    7464              $C$DW$CIE       .dwcie 91
    7465                      .dwcfi  cfa_register, 36
    7466                      .dwcfi  cfa_offset, 0
    7467                      .dwcfi  undefined, 0
    7468                      .dwcfi  undefined, 1
    7469                      .dwcfi  undefined, 2
    7470                      .dwcfi  undefined, 3
    7471                      .dwcfi  undefined, 4
    7472                      .dwcfi  undefined, 5
    7473                      .dwcfi  undefined, 6
    7474                      .dwcfi  undefined, 7
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:57:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  165

    7475                      .dwcfi  undefined, 8
    7476                      .dwcfi  undefined, 9
    7477                      .dwcfi  undefined, 10
    7478                      .dwcfi  undefined, 11
    7479                      .dwcfi  undefined, 12
    7480                      .dwcfi  undefined, 13
    7481                      .dwcfi  same_value, 14
    7482                      .dwcfi  same_value, 15
    7483                      .dwcfi  undefined, 16
    7484                      .dwcfi  undefined, 17
    7485                      .dwcfi  undefined, 18
    7486                      .dwcfi  undefined, 19
    7487                      .dwcfi  undefined, 20
    7488                      .dwcfi  undefined, 21
    7489                      .dwcfi  undefined, 22
    7490                      .dwcfi  undefined, 23
    7491                      .dwcfi  undefined, 24
    7492                      .dwcfi  undefined, 25
    7493                      .dwcfi  same_value, 26
    7494                      .dwcfi  same_value, 27
    7495                      .dwcfi  same_value, 28
    7496                      .dwcfi  same_value, 29
    7497                      .dwcfi  same_value, 30
    7498                      .dwcfi  same_value, 31
    7499                      .dwcfi  undefined, 32
    7500                      .dwcfi  undefined, 33
    7501                      .dwcfi  undefined, 34
    7502                      .dwcfi  undefined, 35
    7503                      .dwcfi  undefined, 36
    7504                      .dwcfi  undefined, 37
    7505                      .dwcfi  undefined, 38
    7506                      .dwcfi  undefined, 39
    7507                      .dwcfi  undefined, 40
    7508                      .dwcfi  undefined, 41
    7509                      .dwcfi  undefined, 42
    7510                      .dwcfi  undefined, 43
