TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:11:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE    1

    7824              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 17:11:31 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    7113              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    7114                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$13)
    7115                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:11:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  159

    7116              $C$DW$T$130     .dwtag  DW_TAG_pointer_type
    7117                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$29)
    7118                      .dwattr $C$DW$T$130, DW_AT_address_class(0x17)
    7119              $C$DW$530       .dwtag  DW_TAG_TI_far_type
    7120                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$29)
    7121              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    7122                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$530)
    7123              $C$DW$531       .dwtag  DW_TAG_TI_far_type
    7124                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$29)
    7125              $C$DW$T$77      .dwtag  DW_TAG_const_type
    7126                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$531)
    7127              $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    7128                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$77)
    7129                      .dwattr $C$DW$T$148, DW_AT_address_class(0x17)
    7130              $C$DW$532       .dwtag  DW_TAG_TI_far_type
    7131                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$148)
    7132              $C$DW$T$149     .dwtag  DW_TAG_const_type
    7133                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$532)
    7134              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7135                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7136                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7137                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7138                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    7139                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    7140              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7141                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7142                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7143                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7144                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    7145                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    7146              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7147                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7148                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7149                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7150              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7151                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    7152                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7153                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    7154              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7155                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7156                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    7157                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    7158              $C$DW$T$27      .dwtag  DW_TAG_base_type
    7159                      .dwattr $C$DW$T$27, DW_AT_encoding(DW_ATE_signed_char)
    7160                      .dwattr $C$DW$T$27, DW_AT_name("signed char")
    7161                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    7162              
    7163              $C$DW$T$28      .dwtag  DW_TAG_array_type
    7164                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    7165                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    7166                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    7167              $C$DW$533       .dwtag  DW_TAG_subrange_type
    7168                      .dwattr $C$DW$533, DW_AT_upper_bound(0x07)
    7169                      .dwendtag $C$DW$T$28
    7170              
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:11:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  160

    7171              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    7172                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$27)
    7173                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    7174              $C$DW$534       .dwtag  DW_TAG_TI_far_type
    7175                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$27)
    7176              $C$DW$T$74      .dwtag  DW_TAG_const_type
    7177                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$534)
    7178              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    7179                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    7180                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    7181              $C$DW$535       .dwtag  DW_TAG_TI_far_type
    7182                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$75)
    7183              $C$DW$T$76      .dwtag  DW_TAG_const_type
    7184                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$535)
    7185              
    7186              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7187                      .dwattr $C$DW$T$20, DW_AT_name("tagSTACKSTRUCT")
    7188                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    7189              $C$DW$536       .dwtag  DW_TAG_member
    7190                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$19)
    7191                      .dwattr $C$DW$536, DW_AT_name("pxTopOfStack")
    7192                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_pxTopOfStack")
    7193                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7194                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    7195              $C$DW$537       .dwtag  DW_TAG_member
    7196                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$19)
    7197                      .dwattr $C$DW$537, DW_AT_name("pxTopOfSysStack")
    7198                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    7199                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7200                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    7201                      .dwendtag $C$DW$T$20
    7202              
    7203              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    7204                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$20)
    7205                      .dwattr $C$DW$T$154, DW_AT_address_class(0x17)
    7206              
    7207              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7208                      .dwattr $C$DW$T$33, DW_AT_name("tskTaskControlBlock")
    7209                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x2e)
    7210              $C$DW$538       .dwtag  DW_TAG_member
    7211                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$23)
    7212                      .dwattr $C$DW$538, DW_AT_name("pxTopOfStack")
    7213                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_pxTopOfStack")
    7214                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7215                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    7216              $C$DW$539       .dwtag  DW_TAG_member
    7217                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$23)
    7218                      .dwattr $C$DW$539, DW_AT_name("pxTopOfSysStack")
    7219                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    7220                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7221                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    7222              $C$DW$540       .dwtag  DW_TAG_member
    7223                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$24)
    7224                      .dwattr $C$DW$540, DW_AT_name("xStateListItem")
    7225                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_xStateListItem")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:11:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  161

    7226                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7227                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    7228              $C$DW$541       .dwtag  DW_TAG_member
    7229                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$24)
    7230                      .dwattr $C$DW$541, DW_AT_name("xEventListItem")
    7231                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_xEventListItem")
    7232                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7233                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    7234              $C$DW$542       .dwtag  DW_TAG_member
    7235                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$25)
    7236                      .dwattr $C$DW$542, DW_AT_name("uxPriority")
    7237                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_uxPriority")
    7238                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7239                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    7240              $C$DW$543       .dwtag  DW_TAG_member
    7241                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$26)
    7242                      .dwattr $C$DW$543, DW_AT_name("pxStack")
    7243                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_pxStack")
    7244                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7245                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    7246              $C$DW$544       .dwtag  DW_TAG_member
    7247                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$26)
    7248                      .dwattr $C$DW$544, DW_AT_name("pxSysStack")
    7249                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_pxSysStack")
    7250                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7251                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    7252              $C$DW$545       .dwtag  DW_TAG_member
    7253                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$28)
    7254                      .dwattr $C$DW$545, DW_AT_name("pcTaskName")
    7255                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_pcTaskName")
    7256                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7257                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    7258              $C$DW$546       .dwtag  DW_TAG_member
    7259                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$26)
    7260                      .dwattr $C$DW$546, DW_AT_name("pxEndOfStack")
    7261                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_pxEndOfStack")
    7262                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7263                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    7264              $C$DW$547       .dwtag  DW_TAG_member
    7265                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$26)
    7266                      .dwattr $C$DW$547, DW_AT_name("pxEndOfSysStack")
    7267                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_pxEndOfSysStack")
    7268                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7269                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    7270              $C$DW$548       .dwtag  DW_TAG_member
    7271                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$30)
    7272                      .dwattr $C$DW$548, DW_AT_name("ulNotifiedValue")
    7273                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ulNotifiedValue")
    7274                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7275                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    7276              $C$DW$549       .dwtag  DW_TAG_member
    7277                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$32)
    7278                      .dwattr $C$DW$549, DW_AT_name("ucNotifyState")
    7279                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_ucNotifyState")
    7280                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:11:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  162

    7281                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    7282                      .dwendtag $C$DW$T$33
    7283              
    7284              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    7285                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$33)
    7286                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
    7287              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    7288                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    7289                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    7290              $C$DW$550       .dwtag  DW_TAG_TI_far_type
    7291                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$70)
    7292              $C$DW$T$121     .dwtag  DW_TAG_const_type
    7293                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$550)
    7294              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    7295                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$70)
    7296                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    7297              $C$DW$551       .dwtag  DW_TAG_TI_far_type
    7298                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$78)
    7299              $C$DW$T$79      .dwtag  DW_TAG_const_type
    7300                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$551)
    7301              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    7302                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$33)
    7303                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    7304              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    7305                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    7306                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    7307              $C$DW$552       .dwtag  DW_TAG_TI_far_type
    7308                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$81)
    7309              $C$DW$T$155     .dwtag  DW_TAG_const_type
    7310                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$552)
    7311              $C$DW$T$156     .dwtag  DW_TAG_pointer_type
    7312                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$155)
    7313                      .dwattr $C$DW$T$156, DW_AT_address_class(0x17)
    7314              $C$DW$553       .dwtag  DW_TAG_TI_far_type
    7315                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$156)
    7316              $C$DW$T$157     .dwtag  DW_TAG_const_type
    7317                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$553)
    7318              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    7319                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    7320                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    7321              $C$DW$554       .dwtag  DW_TAG_TI_far_type
    7322                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$82)
    7323              $C$DW$T$158     .dwtag  DW_TAG_volatile_type
    7324                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$554)
    7325              $C$DW$555       .dwtag  DW_TAG_TI_far_type
    7326                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$82)
    7327              $C$DW$T$159     .dwtag  DW_TAG_const_type
    7328                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$555)
    7329              
    7330              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7331                      .dwattr $C$DW$T$37, DW_AT_name("xLIST")
    7332                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    7333              $C$DW$556       .dwtag  DW_TAG_member
    7334                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$34)
    7335                      .dwattr $C$DW$556, DW_AT_name("uxNumberOfItems")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:11:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  163

    7336                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_uxNumberOfItems")
    7337                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7338                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    7339              $C$DW$557       .dwtag  DW_TAG_member
    7340                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$35)
    7341                      .dwattr $C$DW$557, DW_AT_name("pxIndex")
    7342                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_pxIndex")
    7343                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7344                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    7345              $C$DW$558       .dwtag  DW_TAG_member
    7346                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$36)
    7347                      .dwattr $C$DW$558, DW_AT_name("xListEnd")
    7348                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_xListEnd")
    7349                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7350                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    7351                      .dwendtag $C$DW$T$37
    7352              
    7353              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    7354                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$37)
    7355                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    7356              $C$DW$559       .dwtag  DW_TAG_TI_far_type
    7357                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$59)
    7358              $C$DW$T$125     .dwtag  DW_TAG_const_type
    7359                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$559)
    7360              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    7361                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    7362                      .dwattr $C$DW$T$126, DW_AT_address_class(0x17)
    7363              $C$DW$560       .dwtag  DW_TAG_TI_far_type
    7364                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$126)
    7365              $C$DW$T$127     .dwtag  DW_TAG_const_type
    7366                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$560)
    7367              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    7368                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    7369                      .dwattr $C$DW$T$60, DW_AT_address_class(0x17)
    7370              $C$DW$561       .dwtag  DW_TAG_TI_far_type
    7371                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$60)
    7372              $C$DW$T$61      .dwtag  DW_TAG_const_type
    7373                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$561)
    7374              $C$DW$562       .dwtag  DW_TAG_TI_far_type
    7375                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$60)
    7376              $C$DW$T$160     .dwtag  DW_TAG_volatile_type
    7377                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$562)
    7378              
    7379              $C$DW$T$161     .dwtag  DW_TAG_array_type
    7380                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$59)
    7381                      .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    7382                      .dwattr $C$DW$T$161, DW_AT_byte_size(0x28)
    7383              $C$DW$563       .dwtag  DW_TAG_subrange_type
    7384                      .dwattr $C$DW$563, DW_AT_upper_bound(0x03)
    7385                      .dwendtag $C$DW$T$161
    7386              
    7387              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    7388                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$37)
    7389                      .dwattr $C$DW$T$40, DW_AT_address_class(0x17)
    7390              
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:11:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  164

    7391              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    7392                      .dwattr $C$DW$T$41, DW_AT_name("xLIST_ITEM")
    7393                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0a)
    7394              $C$DW$564       .dwtag  DW_TAG_member
    7395                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$38)
    7396                      .dwattr $C$DW$564, DW_AT_name("xItemValue")
    7397                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_xItemValue")
    7398                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7399                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    7400              $C$DW$565       .dwtag  DW_TAG_member
    7401                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$39)
    7402                      .dwattr $C$DW$565, DW_AT_name("pxNext")
    7403                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_pxNext")
    7404                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7405                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    7406              $C$DW$566       .dwtag  DW_TAG_member
    7407                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$39)
    7408                      .dwattr $C$DW$566, DW_AT_name("pxPrevious")
    7409                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_pxPrevious")
    7410                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7411                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    7412              $C$DW$567       .dwtag  DW_TAG_member
    7413                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$3)
    7414                      .dwattr $C$DW$567, DW_AT_name("pvOwner")
    7415                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_pvOwner")
    7416                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7417                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    7418              $C$DW$568       .dwtag  DW_TAG_member
    7419                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$40)
    7420                      .dwattr $C$DW$568, DW_AT_name("pvContainer")
    7421                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_pvContainer")
    7422                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7423                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    7424                      .dwendtag $C$DW$T$41
    7425              
    7426              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    7427                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$41)
    7428                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    7429              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    7430                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
    7431                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    7432              $C$DW$569       .dwtag  DW_TAG_TI_far_type
    7433                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$35)
    7434              $C$DW$T$64      .dwtag  DW_TAG_const_type
    7435                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$569)
    7436              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    7437                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$41)
    7438                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    7439              
    7440              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    7441                      .dwattr $C$DW$T$42, DW_AT_name("xMEMORY_REGION")
    7442                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x06)
    7443              $C$DW$570       .dwtag  DW_TAG_member
    7444                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$3)
    7445                      .dwattr $C$DW$570, DW_AT_name("pvBaseAddress")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:11:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  165

    7446                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_pvBaseAddress")
    7447                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7448                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    7449              $C$DW$571       .dwtag  DW_TAG_member
    7450                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$29)
    7451                      .dwattr $C$DW$571, DW_AT_name("ulLengthInBytes")
    7452                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_ulLengthInBytes")
    7453                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7454                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    7455              $C$DW$572       .dwtag  DW_TAG_member
    7456                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$29)
    7457                      .dwattr $C$DW$572, DW_AT_name("ulParameters")
    7458                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_ulParameters")
    7459                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7460                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    7461                      .dwendtag $C$DW$T$42
    7462              
    7463              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    7464                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$42)
    7465                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    7466              $C$DW$573       .dwtag  DW_TAG_TI_far_type
    7467                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$83)
    7468              $C$DW$T$84      .dwtag  DW_TAG_const_type
    7469                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$573)
    7470              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    7471                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    7472                      .dwattr $C$DW$T$85, DW_AT_address_class(0x17)
    7473              $C$DW$574       .dwtag  DW_TAG_TI_far_type
    7474                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$85)
    7475              $C$DW$T$86      .dwtag  DW_TAG_const_type
    7476                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$574)
    7477              
    7478              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7479                      .dwattr $C$DW$T$43, DW_AT_name("xMINI_LIST_ITEM")
    7480                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x06)
    7481              $C$DW$575       .dwtag  DW_TAG_member
    7482                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$38)
    7483                      .dwattr $C$DW$575, DW_AT_name("xItemValue")
    7484                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_xItemValue")
    7485                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7486                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    7487              $C$DW$576       .dwtag  DW_TAG_member
    7488                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$39)
    7489                      .dwattr $C$DW$576, DW_AT_name("pxNext")
    7490                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_pxNext")
    7491                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7492                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    7493              $C$DW$577       .dwtag  DW_TAG_member
    7494                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$39)
    7495                      .dwattr $C$DW$577, DW_AT_name("pxPrevious")
    7496                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_pxPrevious")
    7497                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7498                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    7499                      .dwendtag $C$DW$T$43
    7500              
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:11:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  166

    7501              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    7502                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$43)
    7503                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    7504              
    7505              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7506                      .dwattr $C$DW$T$45, DW_AT_name("xTIME_OUT")
    7507                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    7508              $C$DW$578       .dwtag  DW_TAG_member
    7509                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$44)
    7510                      .dwattr $C$DW$578, DW_AT_name("xOverflowCount")
    7511                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_xOverflowCount")
    7512                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7513                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    7514              $C$DW$579       .dwtag  DW_TAG_member
    7515                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$38)
    7516                      .dwattr $C$DW$579, DW_AT_name("xTimeOnEntering")
    7517                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_xTimeOnEntering")
    7518                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7519                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    7520                      .dwendtag $C$DW$T$45
    7521              
    7522              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    7523                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$45)
    7524                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    7525              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    7526                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    7527                      .dwattr $C$DW$T$102, DW_AT_address_class(0x17)
    7528              $C$DW$580       .dwtag  DW_TAG_TI_far_type
    7529                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$102)
    7530              $C$DW$T$103     .dwtag  DW_TAG_const_type
    7531                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$580)
    7532                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    7533              
    7534              ;***************************************************************
    7535              ;* DWARF CIE ENTRIES                                           *
    7536              ;***************************************************************
    7537              
    7538              $C$DW$CIE       .dwcie 91
    7539                      .dwcfi  cfa_register, 36
    7540                      .dwcfi  cfa_offset, 0
    7541                      .dwcfi  undefined, 0
    7542                      .dwcfi  undefined, 1
    7543                      .dwcfi  undefined, 2
    7544                      .dwcfi  undefined, 3
    7545                      .dwcfi  undefined, 4
    7546                      .dwcfi  undefined, 5
    7547                      .dwcfi  undefined, 6
    7548                      .dwcfi  undefined, 7
    7549                      .dwcfi  undefined, 8
    7550                      .dwcfi  undefined, 9
    7551                      .dwcfi  undefined, 10
    7552                      .dwcfi  undefined, 11
    7553                      .dwcfi  undefined, 12
    7554                      .dwcfi  undefined, 13
    7555                      .dwcfi  same_value, 14
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:11:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  167

    7556                      .dwcfi  same_value, 15
    7557                      .dwcfi  undefined, 16
    7558                      .dwcfi  undefined, 17
    7559                      .dwcfi  undefined, 18
    7560                      .dwcfi  undefined, 19
    7561                      .dwcfi  undefined, 20
    7562                      .dwcfi  undefined, 21
    7563                      .dwcfi  undefined, 22
    7564                      .dwcfi  undefined, 23
    7565                      .dwcfi  undefined, 24
    7566                      .dwcfi  undefined, 25
    7567                      .dwcfi  same_value, 26
    7568                      .dwcfi  same_value, 27
    7569                      .dwcfi  same_value, 28
    7570                      .dwcfi  same_value, 29
    7571                      .dwcfi  same_value, 30
    7572                      .dwcfi  same_value, 31
    7573                      .dwcfi  undefined, 32
    7574                      .dwcfi  undefined, 33
    7575                      .dwcfi  undefined, 34
    7576                      .dwcfi  undefined, 35
    7577                      .dwcfi  undefined, 36
    7578                      .dwcfi  undefined, 37
    7579                      .dwcfi  undefined, 38
    7580                      .dwcfi  undefined, 39
    7581                      .dwcfi  undefined, 40
    7582                      .dwcfi  undefined, 41
    7583                      .dwcfi  undefined, 42
    7584                      .dwcfi  undefined, 43
