TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE    1

    2227              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Aug 19 02:57:40 2016                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1196              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_LENGTH_31"), DW_AT_const_value(0x1e)
    1197              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_LENGTH_32"), DW_AT_const_value(0x1f)
    1198              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_MAX_WORD_LEN"), DW_AT_const_value(0x20)
    1199                      .dwendtag $C$DW$T$25
    1200              
    1201              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_WordLen")
    1202                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1203                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1204              
    1205              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
    1206                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1207              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_IRQ_DISABLE"), DW_AT_const_value(0x00)
    1208              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_IRQ_ENABLE"), DW_AT_const_value(0x01)
    1209                      .dwendtag $C$DW$T$27
    1210              
    1211              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_WordCntEnb")
    1212                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1213                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1214              
    1215              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
    1216                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1217              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FRAME_IRQ_DISABLE"), DW_AT_const_value(0x00)
    1218              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FRAME_IRQ_ENABLE"), DW_AT_const_value(0x01)
    1219                      .dwendtag $C$DW$T$29
    1220              
    1221              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FrameCntEnb")
    1222                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1223                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1224              
    1225              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   28

    1226                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1227              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_0"), DW_AT_const_value(0x00)
    1228              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_1"), DW_AT_const_value(0x01)
    1229              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_2"), DW_AT_const_value(0x02)
    1230              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_3"), DW_AT_const_value(0x03)
    1231              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_UNKNOWN"), DW_AT_const_value(0x04)
    1232                      .dwendtag $C$DW$T$31
    1233              
    1234              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_DataDly")
    1235                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1236                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1237              
    1238              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
    1239                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1240              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLKP_LOW_AT_IDLE"), DW_AT_const_value(0x00)
    1241              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLKP_HIGH_AT_IDLE"), DW_AT_const_value(0x01)
    1242                      .dwendtag $C$DW$T$33
    1243              
    1244              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity")
    1245                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1246                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1247              
    1248              $C$DW$T$35      .dwtag  DW_TAG_enumeration_type
    1249                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1250              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CSP_ACTIVE_LOW"), DW_AT_const_value(0x00)
    1251              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CSP_ACTIVE_HIGH"), DW_AT_const_value(0x01)
    1252                      .dwendtag $C$DW$T$35
    1253              
    1254              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ChipSelPol")
    1255                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1256                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1257              
    1258              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    1259                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1260              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLK_PH_FALL_EDGE"), DW_AT_const_value(0x00)
    1261              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLK_PH_RISE_EDGE"), DW_AT_const_value(0x01)
    1262                      .dwendtag $C$DW$T$37
    1263              
    1264              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPh")
    1265                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1266                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1267              
    1268              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1269                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
    1270              $C$DW$157       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$157, DW_AT_name("configured")
    1273                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_configured")
    1274                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1276              $C$DW$158       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$21)
    1278                      .dwattr $C$DW$158, DW_AT_name("mode")
    1279                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_mode")
    1280                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   29

    1281                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$159       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$23)
    1284                      .dwattr $C$DW$159, DW_AT_name("opMode")
    1285                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_opMode")
    1286                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1287                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1288                      .dwendtag $C$DW$T$24
    1289              
    1290              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiObj")
    1291                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$24)
    1292                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1293              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1294                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    1295                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    1296              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiHandle")
    1297                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1298                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1299              
    1300              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1301                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    1302              $C$DW$160       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1304                      .dwattr $C$DW$160, DW_AT_name("spiClkDiv")
    1305                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_spiClkDiv")
    1306                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1308              $C$DW$161       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$26)
    1310                      .dwattr $C$DW$161, DW_AT_name("wLen")
    1311                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_wLen")
    1312                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1313                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1314              $C$DW$162       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$162, DW_AT_name("frLen")
    1317                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_frLen")
    1318                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1319                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$163       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$28)
    1322                      .dwattr $C$DW$163, DW_AT_name("wcEnable")
    1323                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_wcEnable")
    1324                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1325                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1326              $C$DW$164       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$30)
    1328                      .dwattr $C$DW$164, DW_AT_name("fcEnable")
    1329                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_fcEnable")
    1330                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1331                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1332              $C$DW$165       .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    1334                      .dwattr $C$DW$165, DW_AT_name("csNum")
    1335                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_csNum")
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   30

    1336                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1337                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1338              $C$DW$166       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$32)
    1340                      .dwattr $C$DW$166, DW_AT_name("dataDelay")
    1341                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_dataDelay")
    1342                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1343                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1344              $C$DW$167       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$34)
    1346                      .dwattr $C$DW$167, DW_AT_name("clkPol")
    1347                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_clkPol")
    1348                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1349                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1350              $C$DW$168       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$36)
    1352                      .dwattr $C$DW$168, DW_AT_name("csPol")
    1353                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_csPol")
    1354                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1355                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1356              $C$DW$169       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$38)
    1358                      .dwattr $C$DW$169, DW_AT_name("clkPh")
    1359                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_clkPh")
    1360                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1361                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1362                      .dwendtag $C$DW$T$39
    1363              
    1364              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Config")
    1365                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$39)
    1366                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1367              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    1368                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1369                      .dwattr $C$DW$T$52, DW_AT_address_class(0x17)
    1370              
    1371              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1372                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x48)
    1373              $C$DW$170       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$40)
    1375                      .dwattr $C$DW$170, DW_AT_name("EBSR")
    1376                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_EBSR")
    1377                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1379              $C$DW$171       .dwtag  DW_TAG_member
    1380                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$40)
    1381                      .dwattr $C$DW$171, DW_AT_name("RSVD0")
    1382                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD0")
    1383                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1384                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$172       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$40)
    1387                      .dwattr $C$DW$172, DW_AT_name("PCGCR1")
    1388                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PCGCR1")
    1389                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1390                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   31

    1391              $C$DW$173       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$40)
    1393                      .dwattr $C$DW$173, DW_AT_name("PCGCR2")
    1394                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PCGCR2")
    1395                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1396                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1397              $C$DW$174       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$40)
    1399                      .dwattr $C$DW$174, DW_AT_name("PSRCR")
    1400                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PSRCR")
    1401                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1402                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1403              $C$DW$175       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$40)
    1405                      .dwattr $C$DW$175, DW_AT_name("PRCR")
    1406                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PRCR")
    1407                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1408                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1409              $C$DW$176       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$41)
    1411                      .dwattr $C$DW$176, DW_AT_name("RSVD1")
    1412                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_RSVD1")
    1413                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1414                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1415              $C$DW$177       .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$40)
    1417                      .dwattr $C$DW$177, DW_AT_name("TIAFR")
    1418                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_TIAFR")
    1419                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1420                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1421              $C$DW$178       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$40)
    1423                      .dwattr $C$DW$178, DW_AT_name("RSVD2")
    1424                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RSVD2")
    1425                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1426                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1427              $C$DW$179       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$40)
    1429                      .dwattr $C$DW$179, DW_AT_name("ODSCR")
    1430                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ODSCR")
    1431                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1432                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1433              $C$DW$180       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$40)
    1435                      .dwattr $C$DW$180, DW_AT_name("PDINHIBR1")
    1436                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PDINHIBR1")
    1437                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1438                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1439              $C$DW$181       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$40)
    1441                      .dwattr $C$DW$181, DW_AT_name("PDINHIBR2")
    1442                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PDINHIBR2")
    1443                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1444                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1445              $C$DW$182       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   32

    1446                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    1447                      .dwattr $C$DW$182, DW_AT_name("PDINHIBR3")
    1448                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PDINHIBR3")
    1449                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1450                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1451              $C$DW$183       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$40)
    1453                      .dwattr $C$DW$183, DW_AT_name("DMA0CESR1")
    1454                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DMA0CESR1")
    1455                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1456                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1457              $C$DW$184       .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    1459                      .dwattr $C$DW$184, DW_AT_name("DMA0CESR2")
    1460                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_DMA0CESR2")
    1461                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1462                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1463              $C$DW$185       .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$40)
    1465                      .dwattr $C$DW$185, DW_AT_name("DMA1CESR1")
    1466                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_DMA1CESR1")
    1467                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1468                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1469              $C$DW$186       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$40)
    1471                      .dwattr $C$DW$186, DW_AT_name("DMA1CESR2")
    1472                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_DMA1CESR2")
    1473                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1474                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1475              $C$DW$187       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$40)
    1477                      .dwattr $C$DW$187, DW_AT_name("SDRAMCCR")
    1478                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_SDRAMCCR")
    1479                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1480                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1481              $C$DW$188       .dwtag  DW_TAG_member
    1482                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$40)
    1483                      .dwattr $C$DW$188, DW_AT_name("CCR2")
    1484                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CCR2")
    1485                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1486                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1487              $C$DW$189       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$40)
    1489                      .dwattr $C$DW$189, DW_AT_name("CGCR1")
    1490                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CGCR1")
    1491                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1492                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1493              $C$DW$190       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$40)
    1495                      .dwattr $C$DW$190, DW_AT_name("CGICR")
    1496                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CGICR")
    1497                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1498                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1499              $C$DW$191       .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$40)
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   33

    1501                      .dwattr $C$DW$191, DW_AT_name("CGCR2")
    1502                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_CGCR2")
    1503                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1504                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1505              $C$DW$192       .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$40)
    1507                      .dwattr $C$DW$192, DW_AT_name("CGOCR")
    1508                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_CGOCR")
    1509                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1510                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1511              $C$DW$193       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$40)
    1513                      .dwattr $C$DW$193, DW_AT_name("CCSSR")
    1514                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_CCSSR")
    1515                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1516                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$194       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$40)
    1519                      .dwattr $C$DW$194, DW_AT_name("RSVD3")
    1520                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RSVD3")
    1521                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1522                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1523              $C$DW$195       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$40)
    1525                      .dwattr $C$DW$195, DW_AT_name("ECDR")
    1526                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_ECDR")
    1527                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1528                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1529              $C$DW$196       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$40)
    1531                      .dwattr $C$DW$196, DW_AT_name("RSVD4")
    1532                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_RSVD4")
    1533                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1534                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1535              $C$DW$197       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$40)
    1537                      .dwattr $C$DW$197, DW_AT_name("RAMSLPMDCNTLR1")
    1538                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1539                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1540                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1541              $C$DW$198       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$40)
    1543                      .dwattr $C$DW$198, DW_AT_name("RSVD5")
    1544                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_RSVD5")
    1545                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1546                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1547              $C$DW$199       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$40)
    1549                      .dwattr $C$DW$199, DW_AT_name("RAMSLPMDCNTLR2")
    1550                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1551                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1552                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1553              $C$DW$200       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$40)
    1555                      .dwattr $C$DW$200, DW_AT_name("RAMSLPMDCNTLR3")
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   34

    1556                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1557                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1558                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$201       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$40)
    1561                      .dwattr $C$DW$201, DW_AT_name("RAMSLPMDCNTLR4")
    1562                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1563                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1564                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1565              $C$DW$202       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$40)
    1567                      .dwattr $C$DW$202, DW_AT_name("RAMSLPMDCNTLR5")
    1568                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1569                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1570                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1571              $C$DW$203       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$42)
    1573                      .dwattr $C$DW$203, DW_AT_name("RSVD6")
    1574                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_RSVD6")
    1575                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1576                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1577              $C$DW$204       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$40)
    1579                      .dwattr $C$DW$204, DW_AT_name("DMAIFR")
    1580                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_DMAIFR")
    1581                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1582                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1583              $C$DW$205       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$40)
    1585                      .dwattr $C$DW$205, DW_AT_name("DMAIER")
    1586                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_DMAIER")
    1587                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1588                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1589              $C$DW$206       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$40)
    1591                      .dwattr $C$DW$206, DW_AT_name("USBSCR")
    1592                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_USBSCR")
    1593                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1594                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1595              $C$DW$207       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$40)
    1597                      .dwattr $C$DW$207, DW_AT_name("ESCR")
    1598                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_ESCR")
    1599                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1600                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$208       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$42)
    1603                      .dwattr $C$DW$208, DW_AT_name("RSVD7")
    1604                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_RSVD7")
    1605                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1606                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1607              $C$DW$209       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$40)
    1609                      .dwattr $C$DW$209, DW_AT_name("DMA2CESR1")
    1610                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_DMA2CESR1")
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   35

    1611                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1612                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1613              $C$DW$210       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$40)
    1615                      .dwattr $C$DW$210, DW_AT_name("DMA2CESR2")
    1616                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_DMA2CESR2")
    1617                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1618                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1619              $C$DW$211       .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$40)
    1621                      .dwattr $C$DW$211, DW_AT_name("DMA3CESR1")
    1622                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_DMA3CESR1")
    1623                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1624                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1625              $C$DW$212       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$40)
    1627                      .dwattr $C$DW$212, DW_AT_name("DMA3CESR2")
    1628                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_DMA3CESR2")
    1629                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1630                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1631              $C$DW$213       .dwtag  DW_TAG_member
    1632                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$40)
    1633                      .dwattr $C$DW$213, DW_AT_name("CLKSTOP")
    1634                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_CLKSTOP")
    1635                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1636                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1637              $C$DW$214       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$43)
    1639                      .dwattr $C$DW$214, DW_AT_name("RSVD8")
    1640                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_RSVD8")
    1641                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1642                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1643              $C$DW$215       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$40)
    1645                      .dwattr $C$DW$215, DW_AT_name("DIEIDR0")
    1646                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DIEIDR0")
    1647                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1648                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1649              $C$DW$216       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$40)
    1651                      .dwattr $C$DW$216, DW_AT_name("DIEIDR1")
    1652                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DIEIDR1")
    1653                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1654                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1655              $C$DW$217       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$40)
    1657                      .dwattr $C$DW$217, DW_AT_name("DIEIDR2")
    1658                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_DIEIDR2")
    1659                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1660                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1661              $C$DW$218       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$40)
    1663                      .dwattr $C$DW$218, DW_AT_name("DIEIDR3")
    1664                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_DIEIDR3")
    1665                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   36

    1666                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1667              $C$DW$219       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$40)
    1669                      .dwattr $C$DW$219, DW_AT_name("DIEIDR4")
    1670                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_DIEIDR4")
    1671                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1672                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1673              $C$DW$220       .dwtag  DW_TAG_member
    1674                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$40)
    1675                      .dwattr $C$DW$220, DW_AT_name("DIEIDR5")
    1676                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_DIEIDR5")
    1677                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1678                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1679              $C$DW$221       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$40)
    1681                      .dwattr $C$DW$221, DW_AT_name("DIEIDR6")
    1682                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_DIEIDR6")
    1683                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1684                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1685              $C$DW$222       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$40)
    1687                      .dwattr $C$DW$222, DW_AT_name("DIEIDR7")
    1688                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_DIEIDR7")
    1689                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1690                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1691                      .dwendtag $C$DW$T$44
    1692              
    1693              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1694                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$44)
    1695                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1696              $C$DW$223       .dwtag  DW_TAG_TI_far_type
    1697                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$53)
    1698              $C$DW$224       .dwtag  DW_TAG_TI_ioport_type
    1699                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$223)
    1700              $C$DW$T$54      .dwtag  DW_TAG_volatile_type
    1701                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$224)
    1702              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    1703                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1704                      .dwattr $C$DW$T$55, DW_AT_address_class(0x10)
    1705              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1706                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    1707                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1708              
    1709              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1710                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x0a)
    1711              $C$DW$225       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$40)
    1713                      .dwattr $C$DW$225, DW_AT_name("SPICDR")
    1714                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_SPICDR")
    1715                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$226       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$40)
    1719                      .dwattr $C$DW$226, DW_AT_name("SPICCR")
    1720                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_SPICCR")
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   37

    1721                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1722                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$227       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$40)
    1725                      .dwattr $C$DW$227, DW_AT_name("SPIDCR1")
    1726                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_SPIDCR1")
    1727                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1728                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1729              $C$DW$228       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$40)
    1731                      .dwattr $C$DW$228, DW_AT_name("SPIDCR2")
    1732                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_SPIDCR2")
    1733                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1734                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$229       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$40)
    1737                      .dwattr $C$DW$229, DW_AT_name("SPICMD1")
    1738                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_SPICMD1")
    1739                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1740                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1741              $C$DW$230       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$40)
    1743                      .dwattr $C$DW$230, DW_AT_name("SPICMD2")
    1744                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_SPICMD2")
    1745                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1746                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1747              $C$DW$231       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$40)
    1749                      .dwattr $C$DW$231, DW_AT_name("SPISTAT1")
    1750                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_SPISTAT1")
    1751                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1752                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1753              $C$DW$232       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$40)
    1755                      .dwattr $C$DW$232, DW_AT_name("SPISTAT2")
    1756                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_SPISTAT2")
    1757                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1758                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1759              $C$DW$233       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$40)
    1761                      .dwattr $C$DW$233, DW_AT_name("SPIDR1")
    1762                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_SPIDR1")
    1763                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1764                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$234       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$40)
    1767                      .dwattr $C$DW$234, DW_AT_name("SPIDR2")
    1768                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_SPIDR2")
    1769                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1770                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1771                      .dwendtag $C$DW$T$45
    1772              
    1773              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiRegs")
    1774                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$45)
    1775                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Fri Aug 19 02:57:41 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_spiflash.asm                                               PAGE   38

    1776              $C$DW$235       .dwtag  DW_TAG_TI_far_type
    1777                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$57)
    1778              $C$DW$236       .dwtag  DW_TAG_TI_ioport_type
    1779                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$235)
    1780              $C$DW$T$58      .dwtag  DW_TAG_volatile_type
    1781                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$236)
    1782              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    1783                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1784                      .dwattr $C$DW$T$59, DW_AT_address_class(0x10)
    1785              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiRegsOvly")
    1786                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    1787                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1788              
    1789              $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    1790                      .dwattr $C$DW$T$61, DW_AT_name("SPI_Command")
    1791                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
    1792              $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_RSVD_CMD"), DW_AT_const_value(0x00)
    1793              $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_READ"), DW_AT_const_value(0x01)
    1794              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WRITE"), DW_AT_const_value(0x02)
    1795              $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_RSVD1_CMD"), DW_AT_const_value(0x03)
    1796                      .dwendtag $C$DW$T$61
    1797              
    1798              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Command")
    1799                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    1800                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1801              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1802                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1803                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1804                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1805              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1806                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1807                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1808                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1809              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1810                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1811                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1812                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1813              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    1814                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$6)
    1815                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1816              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1817                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1818                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1819                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1820              $C$DW$T$8       .dwtag  DW_TAG_base_type
