TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    5248              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 22 15:53:59 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4252                      .align  2
    4253 000010 0054  $C$FSL3:        .string "TestTsk2",0
         000011 0065 
         000012 0073 
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   90

         000013 0074 
         000014 0054 
         000015 0073 
         000016 006B 
         000017 0032 
         000018 0000 
    4254                      .align  2
    4255 00001a 0054  $C$FSL4:        .string "TestTsk3",0
         00001b 0065 
         00001c 0073 
         00001d 0074 
         00001e 0054 
         00001f 0073 
         000020 006B 
         000021 0033 
         000022 0000 
    4256                      .align  2
    4257 000024 0054  $C$FSL5:        .string "TestTsk4",0
         000025 0065 
         000026 0073 
         000027 0074 
         000028 0054 
         000029 0073 
         00002a 006B 
         00002b 0034 
         00002c 0000 
    4258                      .align  2
    4259 00002e 0042  $C$FSL6:        .string "BlueLED",0
         00002f 006C 
         000030 0075 
         000031 0065 
         000032 004C 
         000033 0045 
         000034 0044 
         000035 0000 
    4260                      .align  2
    4261 000036 0058  $C$FSL7:        .string "XFLEDtsk",0
         000037 0046 
         000038 004C 
         000039 0045 
         00003a 0044 
         00003b 0074 
         00003c 0073 
         00003d 006B 
         00003e 0000 
    4262                      .align  2
    4263 000040 0047  $C$FSL8:        .string "GRNLED",0
         000041 0052 
         000042 004E 
         000043 004C 
         000044 0045 
         000045 0044 
         000046 0000 
    4264                      .align  2
    4265 000048 0058  $C$FSL9:        .string "XFLDtsk2",0
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   91

         000049 0046 
         00004a 004C 
         00004b 0044 
         00004c 0074 
         00004d 0073 
         00004e 006B 
         00004f 0032 
         000050 0000 
    4266                      .align  2
    4267 000052 004C  $C$FSL10:       .string "LEDCTRL",0
         000053 0045 
         000054 0044 
         000055 0043 
         000056 0054 
         000057 0052 
         000058 004C 
         000059 0000 
    4268                      .align  2
    4269 00005a 0052  $C$FSL11:       .string "RedLED",0
         00005b 0065 
         00005c 0064 
         00005d 004C 
         00005e 0045 
         00005f 0044 
         000060 0000 
    4270              ;******************************************************************************
    4271              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    4272              ;******************************************************************************
    4273                      .global _EZDSP5535_init
    4274                      .global _EZDSP5535_waitusec
    4275                      .global _xTaskCreate
    4276                      .global _vTaskDelay
    4277                      .global _vTaskSuspend
    4278                      .global _vTaskResume
    4279                      .global _vTaskStartScheduler
    4280                      .global _xQueueGenericSend
    4281                      .global _xQueueSemaphoreTake
    4282                      .global _xQueueGenericCreate
    4283                      .global _reset_RTC
    4284                      .global _enable_i2s0
    4285                      .global _set_i2s0_slave
    4286                      .global _set_dma0_ch0_i2s0_Lout
    4287                      .global _set_dma0_ch1_i2s0_Rout
    4288                      .global _set_dma0_ch0_stop
    4289                      .global _set_dma0_ch1_stop
    4290                      .global _EZDSP5535_LED_init
    4291                      .global _EZDSP5535_LED_on
    4292                      .global _EZDSP5535_LED_off
    4293                      .global _EZDSP5535_XF_toggle
    4294                      .global _EZDSP5535_GPIO_init
    4295                      .global _EZDSP5535_GPIO_setOutput
    4296                      .global _EZDSP5535_SAR_init
    4297                      .global _EZDSP5535_SAR_getKey
    4298                      .global _PLL_init
    4299                      .global _PLL_config
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   92

    4300                      .global _PLL_reset
    4301                      .global _mem_test
    4302                      .global _oled_test
    4303                      .global _spiflash_test
    4304                      .global _RTC_reset
    4305                      .global _fTimer
    4306                      .global _Flag_RTC
    4307                      .global _Conunt_RTC
    4308                      .global _VECSTART
    4309              
    4310              ;*******************************************************************************
    4311              ;* TYPE INFORMATION                                                            *
    4312              ;*******************************************************************************
    4313              
    4314              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4315                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    4316              $C$DW$385       .dwtag  DW_TAG_member
    4317                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$21)
    4318                      .dwattr $C$DW$385, DW_AT_name("PLLCNTL1")
    4319                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_PLLCNTL1")
    4320                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4321                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4322              $C$DW$386       .dwtag  DW_TAG_member
    4323                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$21)
    4324                      .dwattr $C$DW$386, DW_AT_name("PLLINCNTL")
    4325                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_PLLINCNTL")
    4326                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4327                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4328              $C$DW$387       .dwtag  DW_TAG_member
    4329                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$21)
    4330                      .dwattr $C$DW$387, DW_AT_name("PLLCNTL2")
    4331                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_PLLCNTL2")
    4332                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4333                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4334              $C$DW$388       .dwtag  DW_TAG_member
    4335                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$21)
    4336                      .dwattr $C$DW$388, DW_AT_name("PLLOUTCNTL")
    4337                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    4338                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4339                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4340                      .dwendtag $C$DW$T$22
    4341              
    4342              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    4343                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    4344                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4345              $C$DW$389       .dwtag  DW_TAG_TI_far_type
    4346                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$28)
    4347              $C$DW$T$36      .dwtag  DW_TAG_const_type
    4348                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$389)
    4349              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    4350                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    4351                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    4352              
    4353              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4354                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x48)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   93

    4355              $C$DW$390       .dwtag  DW_TAG_member
    4356                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$23)
    4357                      .dwattr $C$DW$390, DW_AT_name("EBSR")
    4358                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_EBSR")
    4359                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4360                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4361              $C$DW$391       .dwtag  DW_TAG_member
    4362                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$23)
    4363                      .dwattr $C$DW$391, DW_AT_name("RSVD0")
    4364                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_RSVD0")
    4365                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4366                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4367              $C$DW$392       .dwtag  DW_TAG_member
    4368                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$23)
    4369                      .dwattr $C$DW$392, DW_AT_name("PCGCR1")
    4370                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_PCGCR1")
    4371                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4372                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4373              $C$DW$393       .dwtag  DW_TAG_member
    4374                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$23)
    4375                      .dwattr $C$DW$393, DW_AT_name("PCGCR2")
    4376                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_PCGCR2")
    4377                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4378                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4379              $C$DW$394       .dwtag  DW_TAG_member
    4380                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$23)
    4381                      .dwattr $C$DW$394, DW_AT_name("PSRCR")
    4382                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_PSRCR")
    4383                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4384                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4385              $C$DW$395       .dwtag  DW_TAG_member
    4386                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$23)
    4387                      .dwattr $C$DW$395, DW_AT_name("PRCR")
    4388                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_PRCR")
    4389                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4390                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4391              $C$DW$396       .dwtag  DW_TAG_member
    4392                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$24)
    4393                      .dwattr $C$DW$396, DW_AT_name("RSVD1")
    4394                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_RSVD1")
    4395                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4396                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4397              $C$DW$397       .dwtag  DW_TAG_member
    4398                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$23)
    4399                      .dwattr $C$DW$397, DW_AT_name("TIAFR")
    4400                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_TIAFR")
    4401                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4402                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4403              $C$DW$398       .dwtag  DW_TAG_member
    4404                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$23)
    4405                      .dwattr $C$DW$398, DW_AT_name("RSVD2")
    4406                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_RSVD2")
    4407                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4408                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4409              $C$DW$399       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   94

    4410                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$23)
    4411                      .dwattr $C$DW$399, DW_AT_name("ODSCR")
    4412                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_ODSCR")
    4413                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4414                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4415              $C$DW$400       .dwtag  DW_TAG_member
    4416                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$23)
    4417                      .dwattr $C$DW$400, DW_AT_name("PDINHIBR1")
    4418                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_PDINHIBR1")
    4419                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4420                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4421              $C$DW$401       .dwtag  DW_TAG_member
    4422                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$23)
    4423                      .dwattr $C$DW$401, DW_AT_name("PDINHIBR2")
    4424                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_PDINHIBR2")
    4425                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4426                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4427              $C$DW$402       .dwtag  DW_TAG_member
    4428                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
    4429                      .dwattr $C$DW$402, DW_AT_name("PDINHIBR3")
    4430                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_PDINHIBR3")
    4431                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4432                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4433              $C$DW$403       .dwtag  DW_TAG_member
    4434                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$23)
    4435                      .dwattr $C$DW$403, DW_AT_name("DMA0CESR1")
    4436                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_DMA0CESR1")
    4437                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4438                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4439              $C$DW$404       .dwtag  DW_TAG_member
    4440                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$23)
    4441                      .dwattr $C$DW$404, DW_AT_name("DMA0CESR2")
    4442                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_DMA0CESR2")
    4443                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4444                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4445              $C$DW$405       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$23)
    4447                      .dwattr $C$DW$405, DW_AT_name("DMA1CESR1")
    4448                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_DMA1CESR1")
    4449                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4450                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4451              $C$DW$406       .dwtag  DW_TAG_member
    4452                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$23)
    4453                      .dwattr $C$DW$406, DW_AT_name("DMA1CESR2")
    4454                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_DMA1CESR2")
    4455                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4456                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4457              $C$DW$407       .dwtag  DW_TAG_member
    4458                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$23)
    4459                      .dwattr $C$DW$407, DW_AT_name("SDRAMCCR")
    4460                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_SDRAMCCR")
    4461                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4462                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4463              $C$DW$408       .dwtag  DW_TAG_member
    4464                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   95

    4465                      .dwattr $C$DW$408, DW_AT_name("CCR2")
    4466                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_CCR2")
    4467                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4468                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4469              $C$DW$409       .dwtag  DW_TAG_member
    4470                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$23)
    4471                      .dwattr $C$DW$409, DW_AT_name("CGCR1")
    4472                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_CGCR1")
    4473                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4474                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4475              $C$DW$410       .dwtag  DW_TAG_member
    4476                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$23)
    4477                      .dwattr $C$DW$410, DW_AT_name("CGICR")
    4478                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_CGICR")
    4479                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4480                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4481              $C$DW$411       .dwtag  DW_TAG_member
    4482                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$23)
    4483                      .dwattr $C$DW$411, DW_AT_name("CGCR2")
    4484                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_CGCR2")
    4485                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4486                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4487              $C$DW$412       .dwtag  DW_TAG_member
    4488                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$23)
    4489                      .dwattr $C$DW$412, DW_AT_name("CGOCR")
    4490                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_CGOCR")
    4491                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4492                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4493              $C$DW$413       .dwtag  DW_TAG_member
    4494                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$23)
    4495                      .dwattr $C$DW$413, DW_AT_name("CCSSR")
    4496                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_CCSSR")
    4497                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4498                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4499              $C$DW$414       .dwtag  DW_TAG_member
    4500                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$23)
    4501                      .dwattr $C$DW$414, DW_AT_name("RSVD3")
    4502                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_RSVD3")
    4503                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4504                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4505              $C$DW$415       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$23)
    4507                      .dwattr $C$DW$415, DW_AT_name("ECDR")
    4508                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_ECDR")
    4509                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4510                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4511              $C$DW$416       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$23)
    4513                      .dwattr $C$DW$416, DW_AT_name("RSVD4")
    4514                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_RSVD4")
    4515                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4516                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4517              $C$DW$417       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$23)
    4519                      .dwattr $C$DW$417, DW_AT_name("RAMSLPMDCNTLR1")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   96

    4520                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4521                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4522                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4523              $C$DW$418       .dwtag  DW_TAG_member
    4524                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$23)
    4525                      .dwattr $C$DW$418, DW_AT_name("RSVD5")
    4526                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_RSVD5")
    4527                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4528                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4529              $C$DW$419       .dwtag  DW_TAG_member
    4530                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$23)
    4531                      .dwattr $C$DW$419, DW_AT_name("RAMSLPMDCNTLR2")
    4532                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4533                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4534                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4535              $C$DW$420       .dwtag  DW_TAG_member
    4536                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$23)
    4537                      .dwattr $C$DW$420, DW_AT_name("RAMSLPMDCNTLR3")
    4538                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4539                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4540                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4541              $C$DW$421       .dwtag  DW_TAG_member
    4542                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$23)
    4543                      .dwattr $C$DW$421, DW_AT_name("RAMSLPMDCNTLR4")
    4544                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4545                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4546                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4547              $C$DW$422       .dwtag  DW_TAG_member
    4548                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$23)
    4549                      .dwattr $C$DW$422, DW_AT_name("RAMSLPMDCNTLR5")
    4550                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4551                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4552                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4553              $C$DW$423       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$25)
    4555                      .dwattr $C$DW$423, DW_AT_name("RSVD6")
    4556                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_RSVD6")
    4557                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4558                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4559              $C$DW$424       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$23)
    4561                      .dwattr $C$DW$424, DW_AT_name("DMAIFR")
    4562                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_DMAIFR")
    4563                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4564                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4565              $C$DW$425       .dwtag  DW_TAG_member
    4566                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$23)
    4567                      .dwattr $C$DW$425, DW_AT_name("DMAIER")
    4568                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_DMAIER")
    4569                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4570                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4571              $C$DW$426       .dwtag  DW_TAG_member
    4572                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$23)
    4573                      .dwattr $C$DW$426, DW_AT_name("USBSCR")
    4574                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_USBSCR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   97

    4575                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4576                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4577              $C$DW$427       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$23)
    4579                      .dwattr $C$DW$427, DW_AT_name("ESCR")
    4580                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_ESCR")
    4581                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4582                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4583              $C$DW$428       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$25)
    4585                      .dwattr $C$DW$428, DW_AT_name("RSVD7")
    4586                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_RSVD7")
    4587                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4588                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4589              $C$DW$429       .dwtag  DW_TAG_member
    4590                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$23)
    4591                      .dwattr $C$DW$429, DW_AT_name("DMA2CESR1")
    4592                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_DMA2CESR1")
    4593                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4594                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4595              $C$DW$430       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$23)
    4597                      .dwattr $C$DW$430, DW_AT_name("DMA2CESR2")
    4598                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_DMA2CESR2")
    4599                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4600                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4601              $C$DW$431       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$23)
    4603                      .dwattr $C$DW$431, DW_AT_name("DMA3CESR1")
    4604                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_DMA3CESR1")
    4605                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4606                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4607              $C$DW$432       .dwtag  DW_TAG_member
    4608                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$23)
    4609                      .dwattr $C$DW$432, DW_AT_name("DMA3CESR2")
    4610                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_DMA3CESR2")
    4611                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4612                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4613              $C$DW$433       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$23)
    4615                      .dwattr $C$DW$433, DW_AT_name("CLKSTOP")
    4616                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_CLKSTOP")
    4617                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4618                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$434       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$26)
    4621                      .dwattr $C$DW$434, DW_AT_name("RSVD8")
    4622                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_RSVD8")
    4623                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4624                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4625              $C$DW$435       .dwtag  DW_TAG_member
    4626                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$23)
    4627                      .dwattr $C$DW$435, DW_AT_name("DIEIDR0")
    4628                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_DIEIDR0")
    4629                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   98

    4630                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4631              $C$DW$436       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$23)
    4633                      .dwattr $C$DW$436, DW_AT_name("DIEIDR1")
    4634                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_DIEIDR1")
    4635                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4636                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4637              $C$DW$437       .dwtag  DW_TAG_member
    4638                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$23)
    4639                      .dwattr $C$DW$437, DW_AT_name("DIEIDR2")
    4640                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_DIEIDR2")
    4641                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4642                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4643              $C$DW$438       .dwtag  DW_TAG_member
    4644                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$23)
    4645                      .dwattr $C$DW$438, DW_AT_name("DIEIDR3")
    4646                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_DIEIDR3")
    4647                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4648                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4649              $C$DW$439       .dwtag  DW_TAG_member
    4650                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$23)
    4651                      .dwattr $C$DW$439, DW_AT_name("DIEIDR4")
    4652                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_DIEIDR4")
    4653                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4654                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4655              $C$DW$440       .dwtag  DW_TAG_member
    4656                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$23)
    4657                      .dwattr $C$DW$440, DW_AT_name("DIEIDR5")
    4658                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_DIEIDR5")
    4659                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4660                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4661              $C$DW$441       .dwtag  DW_TAG_member
    4662                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$23)
    4663                      .dwattr $C$DW$441, DW_AT_name("DIEIDR6")
    4664                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_DIEIDR6")
    4665                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4666                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4667              $C$DW$442       .dwtag  DW_TAG_member
    4668                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$23)
    4669                      .dwattr $C$DW$442, DW_AT_name("DIEIDR7")
    4670                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_DIEIDR7")
    4671                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4672                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4673                      .dwendtag $C$DW$T$27
    4674              
    4675              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4676                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    4677                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4678              $C$DW$443       .dwtag  DW_TAG_TI_far_type
    4679                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$31)
    4680              $C$DW$444       .dwtag  DW_TAG_TI_ioport_type
    4681                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$443)
    4682              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    4683                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$444)
    4684              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   99

    4685                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4686                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    4687              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4688                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4689                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4690              
    4691              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4692                      .dwattr $C$DW$T$35, DW_AT_name("PLL_Obj")
    4693                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    4694              $C$DW$445       .dwtag  DW_TAG_member
    4695                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$29)
    4696                      .dwattr $C$DW$445, DW_AT_name("pllConfig")
    4697                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_pllConfig")
    4698                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4699                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4700              $C$DW$446       .dwtag  DW_TAG_member
    4701                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$30)
    4702                      .dwattr $C$DW$446, DW_AT_name("instId")
    4703                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_instId")
    4704                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4705                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4706              $C$DW$447       .dwtag  DW_TAG_member
    4707                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$34)
    4708                      .dwattr $C$DW$447, DW_AT_name("sysAddr")
    4709                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_sysAddr")
    4710                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4711                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4712                      .dwendtag $C$DW$T$35
    4713              
    4714              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    4715                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    4716                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4717              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4718                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4719                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    4720              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4721                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$35)
    4722                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    4723              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    4724                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4725                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4726              
    4727              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4728                      .dwattr $C$DW$T$19, DW_AT_name("QueueDefinition")
    4729                      .dwattr $C$DW$T$19, DW_AT_declaration
    4730                      .dwendtag $C$DW$T$19
    4731              
    4732              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    4733                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$19)
    4734                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    4735              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    4736                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4737                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4738              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreHandle_t")
    4739                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:00 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE  100

    4740                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4741              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4742                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4743              $C$DW$448       .dwtag  DW_TAG_TI_far_type
    4744                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$3)
    4745              $C$DW$T$50      .dwtag  DW_TAG_const_type
    4746                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$448)
    4747              
    4748              $C$DW$T$53      .dwtag  DW_TAG_subroutine_type
    4749                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4750              $C$DW$449       .dwtag  DW_TAG_formal_parameter
    4751                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$3)
    4752                      .dwendtag $C$DW$T$53
    4753              
    4754              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    4755                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    4756                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    4757              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    4758                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4759                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4760              $C$DW$450       .dwtag  DW_TAG_TI_far_type
    4761              $C$DW$T$66      .dwtag  DW_TAG_const_type
    4762                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$450)
    4763              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    4764                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    4765                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
