TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    5126              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Thu Sep 20 02:43:44 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         000007 0065 
         000008 0073 
         000009 0074 
         00000a 0054 
         00000b 0073 
         00000c 006B 
         00000d 0031 
         00000e 0000 
    4130                      .align  2
    4131 000010 0054  $C$FSL3:        .string "TestTsk2",0
         000011 0065 
         000012 0073 
         000013 0074 
         000014 0054 
         000015 0073 
         000016 006B 
         000017 0032 
         000018 0000 
    4132                      .align  2
    4133 00001a 0054  $C$FSL4:        .string "TestTsk3",0
         00001b 0065 
         00001c 0073 
         00001d 0074 
         00001e 0054 
         00001f 0073 
         000020 006B 
         000021 0033 
         000022 0000 
    4134                      .align  2
    4135 000024 0054  $C$FSL5:        .string "TestTsk4",0
         000025 0065 
         000026 0073 
         000027 0074 
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   88

         000028 0054 
         000029 0073 
         00002a 006B 
         00002b 0034 
         00002c 0000 
    4136                      .align  2
    4137 00002e 0042  $C$FSL6:        .string "BlueLED",0
         00002f 006C 
         000030 0075 
         000031 0065 
         000032 004C 
         000033 0045 
         000034 0044 
         000035 0000 
    4138                      .align  2
    4139 000036 0058  $C$FSL7:        .string "XFLEDtsk",0
         000037 0046 
         000038 004C 
         000039 0045 
         00003a 0044 
         00003b 0074 
         00003c 0073 
         00003d 006B 
         00003e 0000 
    4140                      .align  2
    4141 000040 0047  $C$FSL8:        .string "GRNLED",0
         000041 0052 
         000042 004E 
         000043 004C 
         000044 0045 
         000045 0044 
         000046 0000 
    4142                      .align  2
    4143 000048 0058  $C$FSL9:        .string "XFLDtsk2",0
         000049 0046 
         00004a 004C 
         00004b 0044 
         00004c 0074 
         00004d 0073 
         00004e 006B 
         00004f 0032 
         000050 0000 
    4144                      .align  2
    4145 000052 004C  $C$FSL10:       .string "LEDCTRL",0
         000053 0045 
         000054 0044 
         000055 0043 
         000056 0054 
         000057 0052 
         000058 004C 
         000059 0000 
    4146                      .align  2
    4147 00005a 0052  $C$FSL11:       .string "RedLED",0
         00005b 0065 
         00005c 0064 
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   89

         00005d 004C 
         00005e 0045 
         00005f 0044 
         000060 0000 
    4148              ;******************************************************************************
    4149              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    4150              ;******************************************************************************
    4151                      .global _EZDSP5535_init
    4152                      .global _EZDSP5535_waitusec
    4153                      .global _xTaskCreate
    4154                      .global _vTaskDelay
    4155                      .global _vTaskSuspend
    4156                      .global _vTaskResume
    4157                      .global _vTaskStartScheduler
    4158                      .global _xQueueGenericSend
    4159                      .global _xQueueSemaphoreTake
    4160                      .global _xQueueGenericCreate
    4161                      .global _reset_RTC
    4162                      .global _enable_i2s0
    4163                      .global _set_i2s0_slave
    4164                      .global _set_dma0_ch0_i2s0_Lout
    4165                      .global _set_dma0_ch1_i2s0_Rout
    4166                      .global _set_dma0_ch0_stop
    4167                      .global _set_dma0_ch1_stop
    4168                      .global _EZDSP5535_LED_init
    4169                      .global _EZDSP5535_LED_on
    4170                      .global _EZDSP5535_LED_off
    4171                      .global _EZDSP5535_XF_toggle
    4172                      .global _EZDSP5535_GPIO_init
    4173                      .global _EZDSP5535_GPIO_setOutput
    4174                      .global _EZDSP5535_SAR_init
    4175                      .global _EZDSP5535_SAR_getKey
    4176                      .global _PLL_init
    4177                      .global _PLL_config
    4178                      .global _PLL_reset
    4179                      .global _mem_test
    4180                      .global _oled_test
    4181                      .global _spiflash_test
    4182                      .global _RTC_reset
    4183                      .global _fTimer
    4184                      .global _Flag_RTC
    4185                      .global _Conunt_RTC
    4186                      .global _VECSTART
    4187              
    4188              ;*******************************************************************************
    4189              ;* TYPE INFORMATION                                                            *
    4190              ;*******************************************************************************
    4191              
    4192              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4193                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    4194              $C$DW$380       .dwtag  DW_TAG_member
    4195                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$21)
    4196                      .dwattr $C$DW$380, DW_AT_name("PLLCNTL1")
    4197                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_PLLCNTL1")
    4198                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   90

    4199                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4200              $C$DW$381       .dwtag  DW_TAG_member
    4201                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$21)
    4202                      .dwattr $C$DW$381, DW_AT_name("PLLINCNTL")
    4203                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_PLLINCNTL")
    4204                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4205                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4206              $C$DW$382       .dwtag  DW_TAG_member
    4207                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$21)
    4208                      .dwattr $C$DW$382, DW_AT_name("PLLCNTL2")
    4209                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_PLLCNTL2")
    4210                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4211                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4212              $C$DW$383       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$21)
    4214                      .dwattr $C$DW$383, DW_AT_name("PLLOUTCNTL")
    4215                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    4216                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4217                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4218                      .dwendtag $C$DW$T$22
    4219              
    4220              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    4221                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    4222                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4223              $C$DW$384       .dwtag  DW_TAG_TI_far_type
    4224                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$28)
    4225              $C$DW$T$36      .dwtag  DW_TAG_const_type
    4226                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$384)
    4227              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    4228                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    4229                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    4230              
    4231              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4232                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x48)
    4233              $C$DW$385       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$23)
    4235                      .dwattr $C$DW$385, DW_AT_name("EBSR")
    4236                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_EBSR")
    4237                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4238                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4239              $C$DW$386       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$23)
    4241                      .dwattr $C$DW$386, DW_AT_name("RSVD0")
    4242                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_RSVD0")
    4243                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4244                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$387       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    4247                      .dwattr $C$DW$387, DW_AT_name("PCGCR1")
    4248                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_PCGCR1")
    4249                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4250                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4251              $C$DW$388       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$23)
    4253                      .dwattr $C$DW$388, DW_AT_name("PCGCR2")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   91

    4254                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_PCGCR2")
    4255                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4256                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4257              $C$DW$389       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$23)
    4259                      .dwattr $C$DW$389, DW_AT_name("PSRCR")
    4260                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_PSRCR")
    4261                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4262                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4263              $C$DW$390       .dwtag  DW_TAG_member
    4264                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$23)
    4265                      .dwattr $C$DW$390, DW_AT_name("PRCR")
    4266                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_PRCR")
    4267                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4268                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4269              $C$DW$391       .dwtag  DW_TAG_member
    4270                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$24)
    4271                      .dwattr $C$DW$391, DW_AT_name("RSVD1")
    4272                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_RSVD1")
    4273                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4274                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4275              $C$DW$392       .dwtag  DW_TAG_member
    4276                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$23)
    4277                      .dwattr $C$DW$392, DW_AT_name("TIAFR")
    4278                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_TIAFR")
    4279                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4280                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4281              $C$DW$393       .dwtag  DW_TAG_member
    4282                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$23)
    4283                      .dwattr $C$DW$393, DW_AT_name("RSVD2")
    4284                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_RSVD2")
    4285                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4286                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4287              $C$DW$394       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$23)
    4289                      .dwattr $C$DW$394, DW_AT_name("ODSCR")
    4290                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_ODSCR")
    4291                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4292                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4293              $C$DW$395       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$23)
    4295                      .dwattr $C$DW$395, DW_AT_name("PDINHIBR1")
    4296                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_PDINHIBR1")
    4297                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4298                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4299              $C$DW$396       .dwtag  DW_TAG_member
    4300                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$23)
    4301                      .dwattr $C$DW$396, DW_AT_name("PDINHIBR2")
    4302                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_PDINHIBR2")
    4303                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4304                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4305              $C$DW$397       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$23)
    4307                      .dwattr $C$DW$397, DW_AT_name("PDINHIBR3")
    4308                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_PDINHIBR3")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   92

    4309                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4310                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4311              $C$DW$398       .dwtag  DW_TAG_member
    4312                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$23)
    4313                      .dwattr $C$DW$398, DW_AT_name("DMA0CESR1")
    4314                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_DMA0CESR1")
    4315                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4316                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4317              $C$DW$399       .dwtag  DW_TAG_member
    4318                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$23)
    4319                      .dwattr $C$DW$399, DW_AT_name("DMA0CESR2")
    4320                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_DMA0CESR2")
    4321                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4322                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4323              $C$DW$400       .dwtag  DW_TAG_member
    4324                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$23)
    4325                      .dwattr $C$DW$400, DW_AT_name("DMA1CESR1")
    4326                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_DMA1CESR1")
    4327                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4328                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4329              $C$DW$401       .dwtag  DW_TAG_member
    4330                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$23)
    4331                      .dwattr $C$DW$401, DW_AT_name("DMA1CESR2")
    4332                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_DMA1CESR2")
    4333                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4334                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4335              $C$DW$402       .dwtag  DW_TAG_member
    4336                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
    4337                      .dwattr $C$DW$402, DW_AT_name("SDRAMCCR")
    4338                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_SDRAMCCR")
    4339                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4340                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4341              $C$DW$403       .dwtag  DW_TAG_member
    4342                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$23)
    4343                      .dwattr $C$DW$403, DW_AT_name("CCR2")
    4344                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_CCR2")
    4345                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4346                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4347              $C$DW$404       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$23)
    4349                      .dwattr $C$DW$404, DW_AT_name("CGCR1")
    4350                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_CGCR1")
    4351                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4352                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4353              $C$DW$405       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$23)
    4355                      .dwattr $C$DW$405, DW_AT_name("CGICR")
    4356                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_CGICR")
    4357                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4358                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4359              $C$DW$406       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$23)
    4361                      .dwattr $C$DW$406, DW_AT_name("CGCR2")
    4362                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_CGCR2")
    4363                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   93

    4364                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4365              $C$DW$407       .dwtag  DW_TAG_member
    4366                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$23)
    4367                      .dwattr $C$DW$407, DW_AT_name("CGOCR")
    4368                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_CGOCR")
    4369                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4370                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4371              $C$DW$408       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$23)
    4373                      .dwattr $C$DW$408, DW_AT_name("CCSSR")
    4374                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_CCSSR")
    4375                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4376                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4377              $C$DW$409       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$23)
    4379                      .dwattr $C$DW$409, DW_AT_name("RSVD3")
    4380                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_RSVD3")
    4381                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4382                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4383              $C$DW$410       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$23)
    4385                      .dwattr $C$DW$410, DW_AT_name("ECDR")
    4386                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_ECDR")
    4387                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4388                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4389              $C$DW$411       .dwtag  DW_TAG_member
    4390                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$23)
    4391                      .dwattr $C$DW$411, DW_AT_name("RSVD4")
    4392                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_RSVD4")
    4393                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4394                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4395              $C$DW$412       .dwtag  DW_TAG_member
    4396                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$23)
    4397                      .dwattr $C$DW$412, DW_AT_name("RAMSLPMDCNTLR1")
    4398                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4399                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4400                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4401              $C$DW$413       .dwtag  DW_TAG_member
    4402                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$23)
    4403                      .dwattr $C$DW$413, DW_AT_name("RSVD5")
    4404                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_RSVD5")
    4405                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4406                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4407              $C$DW$414       .dwtag  DW_TAG_member
    4408                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$23)
    4409                      .dwattr $C$DW$414, DW_AT_name("RAMSLPMDCNTLR2")
    4410                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4411                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4412                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4413              $C$DW$415       .dwtag  DW_TAG_member
    4414                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$23)
    4415                      .dwattr $C$DW$415, DW_AT_name("RAMSLPMDCNTLR3")
    4416                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4417                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4418                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   94

    4419              $C$DW$416       .dwtag  DW_TAG_member
    4420                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$23)
    4421                      .dwattr $C$DW$416, DW_AT_name("RAMSLPMDCNTLR4")
    4422                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4423                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4424                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4425              $C$DW$417       .dwtag  DW_TAG_member
    4426                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$23)
    4427                      .dwattr $C$DW$417, DW_AT_name("RAMSLPMDCNTLR5")
    4428                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4429                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4430                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4431              $C$DW$418       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$25)
    4433                      .dwattr $C$DW$418, DW_AT_name("RSVD6")
    4434                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_RSVD6")
    4435                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4436                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4437              $C$DW$419       .dwtag  DW_TAG_member
    4438                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$23)
    4439                      .dwattr $C$DW$419, DW_AT_name("DMAIFR")
    4440                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_DMAIFR")
    4441                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4442                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4443              $C$DW$420       .dwtag  DW_TAG_member
    4444                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$23)
    4445                      .dwattr $C$DW$420, DW_AT_name("DMAIER")
    4446                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_DMAIER")
    4447                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4448                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4449              $C$DW$421       .dwtag  DW_TAG_member
    4450                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$23)
    4451                      .dwattr $C$DW$421, DW_AT_name("USBSCR")
    4452                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_USBSCR")
    4453                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4454                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4455              $C$DW$422       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$23)
    4457                      .dwattr $C$DW$422, DW_AT_name("ESCR")
    4458                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_ESCR")
    4459                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4460                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4461              $C$DW$423       .dwtag  DW_TAG_member
    4462                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$25)
    4463                      .dwattr $C$DW$423, DW_AT_name("RSVD7")
    4464                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_RSVD7")
    4465                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4466                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4467              $C$DW$424       .dwtag  DW_TAG_member
    4468                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$23)
    4469                      .dwattr $C$DW$424, DW_AT_name("DMA2CESR1")
    4470                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_DMA2CESR1")
    4471                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4472                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4473              $C$DW$425       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   95

    4474                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$23)
    4475                      .dwattr $C$DW$425, DW_AT_name("DMA2CESR2")
    4476                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_DMA2CESR2")
    4477                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4478                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4479              $C$DW$426       .dwtag  DW_TAG_member
    4480                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$23)
    4481                      .dwattr $C$DW$426, DW_AT_name("DMA3CESR1")
    4482                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_DMA3CESR1")
    4483                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4484                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4485              $C$DW$427       .dwtag  DW_TAG_member
    4486                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$23)
    4487                      .dwattr $C$DW$427, DW_AT_name("DMA3CESR2")
    4488                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_DMA3CESR2")
    4489                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4490                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4491              $C$DW$428       .dwtag  DW_TAG_member
    4492                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$23)
    4493                      .dwattr $C$DW$428, DW_AT_name("CLKSTOP")
    4494                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_CLKSTOP")
    4495                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4496                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4497              $C$DW$429       .dwtag  DW_TAG_member
    4498                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$26)
    4499                      .dwattr $C$DW$429, DW_AT_name("RSVD8")
    4500                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_RSVD8")
    4501                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4502                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4503              $C$DW$430       .dwtag  DW_TAG_member
    4504                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$23)
    4505                      .dwattr $C$DW$430, DW_AT_name("DIEIDR0")
    4506                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_DIEIDR0")
    4507                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4508                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4509              $C$DW$431       .dwtag  DW_TAG_member
    4510                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$23)
    4511                      .dwattr $C$DW$431, DW_AT_name("DIEIDR1")
    4512                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_DIEIDR1")
    4513                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4514                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4515              $C$DW$432       .dwtag  DW_TAG_member
    4516                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$23)
    4517                      .dwattr $C$DW$432, DW_AT_name("DIEIDR2")
    4518                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_DIEIDR2")
    4519                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4520                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4521              $C$DW$433       .dwtag  DW_TAG_member
    4522                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$23)
    4523                      .dwattr $C$DW$433, DW_AT_name("DIEIDR3")
    4524                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_DIEIDR3")
    4525                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4526                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4527              $C$DW$434       .dwtag  DW_TAG_member
    4528                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   96

    4529                      .dwattr $C$DW$434, DW_AT_name("DIEIDR4")
    4530                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_DIEIDR4")
    4531                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4532                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4533              $C$DW$435       .dwtag  DW_TAG_member
    4534                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$23)
    4535                      .dwattr $C$DW$435, DW_AT_name("DIEIDR5")
    4536                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_DIEIDR5")
    4537                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4538                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4539              $C$DW$436       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$23)
    4541                      .dwattr $C$DW$436, DW_AT_name("DIEIDR6")
    4542                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_DIEIDR6")
    4543                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4544                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4545              $C$DW$437       .dwtag  DW_TAG_member
    4546                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$23)
    4547                      .dwattr $C$DW$437, DW_AT_name("DIEIDR7")
    4548                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_DIEIDR7")
    4549                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4550                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4551                      .dwendtag $C$DW$T$27
    4552              
    4553              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4554                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    4555                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4556              $C$DW$438       .dwtag  DW_TAG_TI_far_type
    4557                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$31)
    4558              $C$DW$439       .dwtag  DW_TAG_TI_ioport_type
    4559                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$438)
    4560              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    4561                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$439)
    4562              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    4563                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4564                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    4565              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4566                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4567                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4568              
    4569              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4570                      .dwattr $C$DW$T$35, DW_AT_name("PLL_Obj")
    4571                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    4572              $C$DW$440       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$29)
    4574                      .dwattr $C$DW$440, DW_AT_name("pllConfig")
    4575                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_pllConfig")
    4576                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4577                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4578              $C$DW$441       .dwtag  DW_TAG_member
    4579                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$30)
    4580                      .dwattr $C$DW$441, DW_AT_name("instId")
    4581                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_instId")
    4582                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4583                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   97

    4584              $C$DW$442       .dwtag  DW_TAG_member
    4585                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$34)
    4586                      .dwattr $C$DW$442, DW_AT_name("sysAddr")
    4587                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_sysAddr")
    4588                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4589                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4590                      .dwendtag $C$DW$T$35
    4591              
    4592              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    4593                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    4594                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4595              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4596                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4597                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    4598              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4599                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$35)
    4600                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    4601              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    4602                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4603                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4604              
    4605              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4606                      .dwattr $C$DW$T$19, DW_AT_name("QueueDefinition")
    4607                      .dwattr $C$DW$T$19, DW_AT_declaration
    4608                      .dwendtag $C$DW$T$19
    4609              
    4610              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    4611                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$19)
    4612                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    4613              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    4614                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4615                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4616              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreHandle_t")
    4617                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4618                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4619              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4620                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4621              $C$DW$443       .dwtag  DW_TAG_TI_far_type
    4622                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$3)
    4623              $C$DW$T$50      .dwtag  DW_TAG_const_type
    4624                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$443)
    4625              
    4626              $C$DW$T$53      .dwtag  DW_TAG_subroutine_type
    4627                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4628              $C$DW$444       .dwtag  DW_TAG_formal_parameter
    4629                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$3)
    4630                      .dwendtag $C$DW$T$53
    4631              
    4632              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    4633                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    4634                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    4635              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    4636                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4637                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4638              $C$DW$445       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 02:43:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   98

    4639              $C$DW$T$66      .dwtag  DW_TAG_const_type
    4640                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$445)
    4641              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    4642                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    4643                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
