TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    4999              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Sep 18 04:49:46 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4003                      .align  2
    4004 000006 0054  $C$FSL2:        .string "TestTsk1",0
         000007 0065 
         000008 0073 
         000009 0074 
         00000a 0054 
         00000b 0073 
         00000c 006B 
         00000d 0031 
         00000e 0000 
    4005                      .align  2
    4006 000010 0054  $C$FSL3:        .string "TestTsk2",0
         000011 0065 
         000012 0073 
         000013 0074 
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   85

         000014 0054 
         000015 0073 
         000016 006B 
         000017 0032 
         000018 0000 
    4007                      .align  2
    4008 00001a 0054  $C$FSL4:        .string "TestTsk3",0
         00001b 0065 
         00001c 0073 
         00001d 0074 
         00001e 0054 
         00001f 0073 
         000020 006B 
         000021 0033 
         000022 0000 
    4009                      .align  2
    4010 000024 0042  $C$FSL5:        .string "BlueLED",0
         000025 006C 
         000026 0075 
         000027 0065 
         000028 004C 
         000029 0045 
         00002a 0044 
         00002b 0000 
    4011                      .align  2
    4012 00002c 0058  $C$FSL6:        .string "XFLEDtsk",0
         00002d 0046 
         00002e 004C 
         00002f 0045 
         000030 0044 
         000031 0074 
         000032 0073 
         000033 006B 
         000034 0000 
    4013                      .align  2
    4014 000036 0047  $C$FSL7:        .string "GRNLED",0
         000037 0052 
         000038 004E 
         000039 004C 
         00003a 0045 
         00003b 0044 
         00003c 0000 
    4015                      .align  2
    4016 00003e 0058  $C$FSL8:        .string "XFLDtsk2",0
         00003f 0046 
         000040 004C 
         000041 0044 
         000042 0074 
         000043 0073 
         000044 006B 
         000045 0032 
         000046 0000 
    4017                      .align  2
    4018 000048 004C  $C$FSL9:        .string "LEDCTRL",0
         000049 0045 
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   86

         00004a 0044 
         00004b 0043 
         00004c 0054 
         00004d 0052 
         00004e 004C 
         00004f 0000 
    4019                      .align  2
    4020 000050 0052  $C$FSL10:       .string "RedLED",0
         000051 0065 
         000052 0064 
         000053 004C 
         000054 0045 
         000055 0044 
         000056 0000 
    4021              ;******************************************************************************
    4022              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    4023              ;******************************************************************************
    4024                      .global _EZDSP5535_init
    4025                      .global _EZDSP5535_waitusec
    4026                      .global _xTaskCreate
    4027                      .global _vTaskDelay
    4028                      .global _vTaskSuspend
    4029                      .global _vTaskResume
    4030                      .global _vTaskStartScheduler
    4031                      .global _xQueueGenericSend
    4032                      .global _xQueueSemaphoreTake
    4033                      .global _xQueueGenericCreate
    4034                      .global _reset_RTC
    4035                      .global _enable_i2s0
    4036                      .global _set_i2s0_slave
    4037                      .global _set_dma0_ch0_i2s0_Lout
    4038                      .global _set_dma0_ch1_i2s0_Rout
    4039                      .global _set_dma0_ch0_stop
    4040                      .global _set_dma0_ch1_stop
    4041                      .global _EZDSP5535_LED_init
    4042                      .global _EZDSP5535_LED_on
    4043                      .global _EZDSP5535_LED_off
    4044                      .global _EZDSP5535_XF_toggle
    4045                      .global _EZDSP5535_GPIO_init
    4046                      .global _EZDSP5535_GPIO_setOutput
    4047                      .global _EZDSP5535_SAR_init
    4048                      .global _EZDSP5535_SAR_getKey
    4049                      .global _PLL_init
    4050                      .global _PLL_config
    4051                      .global _PLL_reset
    4052                      .global _mem_test
    4053                      .global _oled_test
    4054                      .global _spiflash_test
    4055                      .global _RTC_reset
    4056                      .global _fTimer
    4057                      .global _Flag_RTC
    4058                      .global _Conunt_RTC
    4059                      .global _VECSTART
    4060              
    4061              ;*******************************************************************************
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   87

    4062              ;* TYPE INFORMATION                                                            *
    4063              ;*******************************************************************************
    4064              
    4065              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4066                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    4067              $C$DW$367       .dwtag  DW_TAG_member
    4068                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$21)
    4069                      .dwattr $C$DW$367, DW_AT_name("PLLCNTL1")
    4070                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_PLLCNTL1")
    4071                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4072                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4073              $C$DW$368       .dwtag  DW_TAG_member
    4074                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$21)
    4075                      .dwattr $C$DW$368, DW_AT_name("PLLINCNTL")
    4076                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_PLLINCNTL")
    4077                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4078                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4079              $C$DW$369       .dwtag  DW_TAG_member
    4080                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$21)
    4081                      .dwattr $C$DW$369, DW_AT_name("PLLCNTL2")
    4082                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_PLLCNTL2")
    4083                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4084                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4085              $C$DW$370       .dwtag  DW_TAG_member
    4086                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$21)
    4087                      .dwattr $C$DW$370, DW_AT_name("PLLOUTCNTL")
    4088                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    4089                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4090                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4091                      .dwendtag $C$DW$T$22
    4092              
    4093              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    4094                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    4095                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4096              $C$DW$371       .dwtag  DW_TAG_TI_far_type
    4097                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$28)
    4098              $C$DW$T$36      .dwtag  DW_TAG_const_type
    4099                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$371)
    4100              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    4101                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    4102                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    4103              
    4104              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4105                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x48)
    4106              $C$DW$372       .dwtag  DW_TAG_member
    4107                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    4108                      .dwattr $C$DW$372, DW_AT_name("EBSR")
    4109                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_EBSR")
    4110                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4111                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4112              $C$DW$373       .dwtag  DW_TAG_member
    4113                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    4114                      .dwattr $C$DW$373, DW_AT_name("RSVD0")
    4115                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_RSVD0")
    4116                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   88

    4117                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4118              $C$DW$374       .dwtag  DW_TAG_member
    4119                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
    4120                      .dwattr $C$DW$374, DW_AT_name("PCGCR1")
    4121                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_PCGCR1")
    4122                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4123                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4124              $C$DW$375       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
    4126                      .dwattr $C$DW$375, DW_AT_name("PCGCR2")
    4127                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_PCGCR2")
    4128                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4129                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4130              $C$DW$376       .dwtag  DW_TAG_member
    4131                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$23)
    4132                      .dwattr $C$DW$376, DW_AT_name("PSRCR")
    4133                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_PSRCR")
    4134                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4135                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4136              $C$DW$377       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$23)
    4138                      .dwattr $C$DW$377, DW_AT_name("PRCR")
    4139                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_PRCR")
    4140                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4141                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4142              $C$DW$378       .dwtag  DW_TAG_member
    4143                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$24)
    4144                      .dwattr $C$DW$378, DW_AT_name("RSVD1")
    4145                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_RSVD1")
    4146                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4147                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4148              $C$DW$379       .dwtag  DW_TAG_member
    4149                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$23)
    4150                      .dwattr $C$DW$379, DW_AT_name("TIAFR")
    4151                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_TIAFR")
    4152                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4153                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4154              $C$DW$380       .dwtag  DW_TAG_member
    4155                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$23)
    4156                      .dwattr $C$DW$380, DW_AT_name("RSVD2")
    4157                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_RSVD2")
    4158                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4159                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4160              $C$DW$381       .dwtag  DW_TAG_member
    4161                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$23)
    4162                      .dwattr $C$DW$381, DW_AT_name("ODSCR")
    4163                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ODSCR")
    4164                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4165                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4166              $C$DW$382       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$23)
    4168                      .dwattr $C$DW$382, DW_AT_name("PDINHIBR1")
    4169                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_PDINHIBR1")
    4170                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4171                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   89

    4172              $C$DW$383       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$23)
    4174                      .dwattr $C$DW$383, DW_AT_name("PDINHIBR2")
    4175                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_PDINHIBR2")
    4176                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4177                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4178              $C$DW$384       .dwtag  DW_TAG_member
    4179                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$23)
    4180                      .dwattr $C$DW$384, DW_AT_name("PDINHIBR3")
    4181                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_PDINHIBR3")
    4182                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4183                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4184              $C$DW$385       .dwtag  DW_TAG_member
    4185                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$23)
    4186                      .dwattr $C$DW$385, DW_AT_name("DMA0CESR1")
    4187                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_DMA0CESR1")
    4188                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4189                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4190              $C$DW$386       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$23)
    4192                      .dwattr $C$DW$386, DW_AT_name("DMA0CESR2")
    4193                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_DMA0CESR2")
    4194                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4195                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4196              $C$DW$387       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    4198                      .dwattr $C$DW$387, DW_AT_name("DMA1CESR1")
    4199                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_DMA1CESR1")
    4200                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4201                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4202              $C$DW$388       .dwtag  DW_TAG_member
    4203                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$23)
    4204                      .dwattr $C$DW$388, DW_AT_name("DMA1CESR2")
    4205                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_DMA1CESR2")
    4206                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4207                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4208              $C$DW$389       .dwtag  DW_TAG_member
    4209                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$23)
    4210                      .dwattr $C$DW$389, DW_AT_name("SDRAMCCR")
    4211                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_SDRAMCCR")
    4212                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4213                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4214              $C$DW$390       .dwtag  DW_TAG_member
    4215                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$23)
    4216                      .dwattr $C$DW$390, DW_AT_name("CCR2")
    4217                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_CCR2")
    4218                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4219                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4220              $C$DW$391       .dwtag  DW_TAG_member
    4221                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$23)
    4222                      .dwattr $C$DW$391, DW_AT_name("CGCR1")
    4223                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_CGCR1")
    4224                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4225                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4226              $C$DW$392       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   90

    4227                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$23)
    4228                      .dwattr $C$DW$392, DW_AT_name("CGICR")
    4229                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_CGICR")
    4230                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4231                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4232              $C$DW$393       .dwtag  DW_TAG_member
    4233                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$23)
    4234                      .dwattr $C$DW$393, DW_AT_name("CGCR2")
    4235                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_CGCR2")
    4236                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4237                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4238              $C$DW$394       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$23)
    4240                      .dwattr $C$DW$394, DW_AT_name("CGOCR")
    4241                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_CGOCR")
    4242                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4243                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4244              $C$DW$395       .dwtag  DW_TAG_member
    4245                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$23)
    4246                      .dwattr $C$DW$395, DW_AT_name("CCSSR")
    4247                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_CCSSR")
    4248                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4249                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4250              $C$DW$396       .dwtag  DW_TAG_member
    4251                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$23)
    4252                      .dwattr $C$DW$396, DW_AT_name("RSVD3")
    4253                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_RSVD3")
    4254                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4255                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4256              $C$DW$397       .dwtag  DW_TAG_member
    4257                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$23)
    4258                      .dwattr $C$DW$397, DW_AT_name("ECDR")
    4259                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_ECDR")
    4260                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4261                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4262              $C$DW$398       .dwtag  DW_TAG_member
    4263                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$23)
    4264                      .dwattr $C$DW$398, DW_AT_name("RSVD4")
    4265                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_RSVD4")
    4266                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4267                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4268              $C$DW$399       .dwtag  DW_TAG_member
    4269                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$23)
    4270                      .dwattr $C$DW$399, DW_AT_name("RAMSLPMDCNTLR1")
    4271                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4272                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4273                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4274              $C$DW$400       .dwtag  DW_TAG_member
    4275                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$23)
    4276                      .dwattr $C$DW$400, DW_AT_name("RSVD5")
    4277                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_RSVD5")
    4278                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4279                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4280              $C$DW$401       .dwtag  DW_TAG_member
    4281                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   91

    4282                      .dwattr $C$DW$401, DW_AT_name("RAMSLPMDCNTLR2")
    4283                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4284                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4285                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4286              $C$DW$402       .dwtag  DW_TAG_member
    4287                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
    4288                      .dwattr $C$DW$402, DW_AT_name("RAMSLPMDCNTLR3")
    4289                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4290                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4291                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4292              $C$DW$403       .dwtag  DW_TAG_member
    4293                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$23)
    4294                      .dwattr $C$DW$403, DW_AT_name("RAMSLPMDCNTLR4")
    4295                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4296                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4297                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4298              $C$DW$404       .dwtag  DW_TAG_member
    4299                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$23)
    4300                      .dwattr $C$DW$404, DW_AT_name("RAMSLPMDCNTLR5")
    4301                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4302                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4303                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4304              $C$DW$405       .dwtag  DW_TAG_member
    4305                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$25)
    4306                      .dwattr $C$DW$405, DW_AT_name("RSVD6")
    4307                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_RSVD6")
    4308                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4309                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4310              $C$DW$406       .dwtag  DW_TAG_member
    4311                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$23)
    4312                      .dwattr $C$DW$406, DW_AT_name("DMAIFR")
    4313                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_DMAIFR")
    4314                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4315                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4316              $C$DW$407       .dwtag  DW_TAG_member
    4317                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$23)
    4318                      .dwattr $C$DW$407, DW_AT_name("DMAIER")
    4319                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_DMAIER")
    4320                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4321                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4322              $C$DW$408       .dwtag  DW_TAG_member
    4323                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$23)
    4324                      .dwattr $C$DW$408, DW_AT_name("USBSCR")
    4325                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_USBSCR")
    4326                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4327                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4328              $C$DW$409       .dwtag  DW_TAG_member
    4329                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$23)
    4330                      .dwattr $C$DW$409, DW_AT_name("ESCR")
    4331                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_ESCR")
    4332                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4333                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4334              $C$DW$410       .dwtag  DW_TAG_member
    4335                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$25)
    4336                      .dwattr $C$DW$410, DW_AT_name("RSVD7")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   92

    4337                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_RSVD7")
    4338                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4339                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4340              $C$DW$411       .dwtag  DW_TAG_member
    4341                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$23)
    4342                      .dwattr $C$DW$411, DW_AT_name("DMA2CESR1")
    4343                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_DMA2CESR1")
    4344                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4345                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4346              $C$DW$412       .dwtag  DW_TAG_member
    4347                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$23)
    4348                      .dwattr $C$DW$412, DW_AT_name("DMA2CESR2")
    4349                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_DMA2CESR2")
    4350                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4351                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4352              $C$DW$413       .dwtag  DW_TAG_member
    4353                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$23)
    4354                      .dwattr $C$DW$413, DW_AT_name("DMA3CESR1")
    4355                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_DMA3CESR1")
    4356                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4357                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4358              $C$DW$414       .dwtag  DW_TAG_member
    4359                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$23)
    4360                      .dwattr $C$DW$414, DW_AT_name("DMA3CESR2")
    4361                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_DMA3CESR2")
    4362                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4363                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4364              $C$DW$415       .dwtag  DW_TAG_member
    4365                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$23)
    4366                      .dwattr $C$DW$415, DW_AT_name("CLKSTOP")
    4367                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_CLKSTOP")
    4368                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4369                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4370              $C$DW$416       .dwtag  DW_TAG_member
    4371                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$26)
    4372                      .dwattr $C$DW$416, DW_AT_name("RSVD8")
    4373                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_RSVD8")
    4374                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4375                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4376              $C$DW$417       .dwtag  DW_TAG_member
    4377                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$23)
    4378                      .dwattr $C$DW$417, DW_AT_name("DIEIDR0")
    4379                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_DIEIDR0")
    4380                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4381                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4382              $C$DW$418       .dwtag  DW_TAG_member
    4383                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$23)
    4384                      .dwattr $C$DW$418, DW_AT_name("DIEIDR1")
    4385                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_DIEIDR1")
    4386                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4387                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4388              $C$DW$419       .dwtag  DW_TAG_member
    4389                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$23)
    4390                      .dwattr $C$DW$419, DW_AT_name("DIEIDR2")
    4391                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_DIEIDR2")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   93

    4392                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4393                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4394              $C$DW$420       .dwtag  DW_TAG_member
    4395                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$23)
    4396                      .dwattr $C$DW$420, DW_AT_name("DIEIDR3")
    4397                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_DIEIDR3")
    4398                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4399                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4400              $C$DW$421       .dwtag  DW_TAG_member
    4401                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$23)
    4402                      .dwattr $C$DW$421, DW_AT_name("DIEIDR4")
    4403                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_DIEIDR4")
    4404                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4405                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4406              $C$DW$422       .dwtag  DW_TAG_member
    4407                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$23)
    4408                      .dwattr $C$DW$422, DW_AT_name("DIEIDR5")
    4409                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_DIEIDR5")
    4410                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4411                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4412              $C$DW$423       .dwtag  DW_TAG_member
    4413                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$23)
    4414                      .dwattr $C$DW$423, DW_AT_name("DIEIDR6")
    4415                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_DIEIDR6")
    4416                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4417                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4418              $C$DW$424       .dwtag  DW_TAG_member
    4419                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$23)
    4420                      .dwattr $C$DW$424, DW_AT_name("DIEIDR7")
    4421                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_DIEIDR7")
    4422                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4423                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4424                      .dwendtag $C$DW$T$27
    4425              
    4426              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4427                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    4428                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4429              $C$DW$425       .dwtag  DW_TAG_TI_far_type
    4430                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$31)
    4431              $C$DW$426       .dwtag  DW_TAG_TI_ioport_type
    4432                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$425)
    4433              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    4434                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$426)
    4435              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    4436                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4437                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    4438              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4439                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4440                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4441              
    4442              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4443                      .dwattr $C$DW$T$35, DW_AT_name("PLL_Obj")
    4444                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    4445              $C$DW$427       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$29)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   94

    4447                      .dwattr $C$DW$427, DW_AT_name("pllConfig")
    4448                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_pllConfig")
    4449                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4450                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4451              $C$DW$428       .dwtag  DW_TAG_member
    4452                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$30)
    4453                      .dwattr $C$DW$428, DW_AT_name("instId")
    4454                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_instId")
    4455                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4456                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4457              $C$DW$429       .dwtag  DW_TAG_member
    4458                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$34)
    4459                      .dwattr $C$DW$429, DW_AT_name("sysAddr")
    4460                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_sysAddr")
    4461                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4462                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4463                      .dwendtag $C$DW$T$35
    4464              
    4465              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    4466                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    4467                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4468              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4469                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4470                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    4471              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4472                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$35)
    4473                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    4474              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    4475                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4476                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4477              
    4478              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4479                      .dwattr $C$DW$T$19, DW_AT_name("QueueDefinition")
    4480                      .dwattr $C$DW$T$19, DW_AT_declaration
    4481                      .dwendtag $C$DW$T$19
    4482              
    4483              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    4484                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$19)
    4485                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    4486              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    4487                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4488                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4489              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreHandle_t")
    4490                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4491                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4492              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4493                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4494              $C$DW$430       .dwtag  DW_TAG_TI_far_type
    4495                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$3)
    4496              $C$DW$T$50      .dwtag  DW_TAG_const_type
    4497                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$430)
    4498              
    4499              $C$DW$T$53      .dwtag  DW_TAG_subroutine_type
    4500                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4501              $C$DW$431       .dwtag  DW_TAG_formal_parameter
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   95

    4502                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$3)
    4503                      .dwendtag $C$DW$T$53
    4504              
    4505              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    4506                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    4507                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    4508              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    4509                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4510                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4511              $C$DW$432       .dwtag  DW_TAG_TI_far_type
    4512              $C$DW$T$66      .dwtag  DW_TAG_const_type
    4513                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$432)
    4514              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    4515                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    4516                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
