TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    2698              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 14 03:53:57 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1780 0003ac 4EFB          AADD #-5, SP
    1781                      .dwcfi  cfa_offset, 6
    1782              $C$DW$158       .dwtag  DW_TAG_variable, DW_AT_name("pxTask")
    1783                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_pxTask")
    1784                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$48)
    1785                      .dwattr $C$DW$158, DW_AT_location[DW_OP_bregx 0x24 0]
    1786              $C$DW$159       .dwtag  DW_TAG_variable, DW_AT_name("pcTaskName")
    1787                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_pcTaskName")
    1788                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$50)
    1789                      .dwattr $C$DW$159, DW_AT_location[DW_OP_bregx 0x24 2]
    1790 0003ae EB04          MOV XAR1, dbl(*SP(#2))
         0003b0 95   
    1791 0003b1 EB00          MOV XAR0, dbl(*SP(#0))
         0003b3 85   
    1792                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 925,column 2,is_stmt
    1793                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 926,column 2,is_stmt
    1794                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 931,column 2,is_stmt
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   38

    1795 0003b4 20     nop
    1796 0003b5 46B3   bset INTM
    1797 0003b7       $C$L32:    
    1798 0003b7       $C$DW$L$_vApplicationStackOverflowHook$2$B:
    1799                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 932,column 2,is_stmt
    1800 0003b7 4A7E          B $C$L32  ; |932| 
    1801                                                      ; branch occurs ; |932| 
    1802 0003b9       $C$DW$L$_vApplicationStackOverflowHook$2$E:
    1803                      .dwcfi  cfa_offset, 1
    1804              
    1805              $C$DW$160       .dwtag  DW_TAG_TI_loop
    1806                      .dwattr $C$DW$160, DW_AT_name("F:\eZdsp_DBG\eZDSP_5535_Files\ccsws2\test\Debug\main.asm:$C$L32:1:1536
    1807                      .dwattr $C$DW$160, DW_AT_TI_begin_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    1808                      .dwattr $C$DW$160, DW_AT_TI_begin_line(0x3a4)
    1809                      .dwattr $C$DW$160, DW_AT_TI_end_line(0x3a4)
    1810              $C$DW$161       .dwtag  DW_TAG_TI_loop_range
    1811                      .dwattr $C$DW$161, DW_AT_low_pc($C$DW$L$_vApplicationStackOverflowHook$2$B)
    1812                      .dwattr $C$DW$161, DW_AT_high_pc($C$DW$L$_vApplicationStackOverflowHook$2$E)
    1813                      .dwendtag $C$DW$160
    1814              
    1815                      .dwattr $C$DW$155, DW_AT_TI_end_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    1816                      .dwattr $C$DW$155, DW_AT_TI_end_line(0x3a5)
    1817                      .dwattr $C$DW$155, DW_AT_TI_end_column(0x01)
    1818                      .dwendentry
    1819                      .dwendtag $C$DW$155
    1820              
    1821              ;******************************************************************************
    1822              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    1823              ;******************************************************************************
    1824                      .global _EZDSP5535_init
    1825                      .global _EZDSP5535_waitusec
    1826                      .global _vTaskStartScheduler
    1827                      .global _vStartLEDFlashTasks
    1828                      .global _reset_RTC
    1829                      .global _enable_i2s0
    1830                      .global _set_i2s0_slave
    1831                      .global _set_dma0_ch0_i2s0_Lout
    1832                      .global _set_dma0_ch1_i2s0_Rout
    1833                      .global _set_dma0_ch0_stop
    1834                      .global _set_dma0_ch1_stop
    1835                      .global _EZDSP5535_LED_init
    1836                      .global _EZDSP5535_LED_on
    1837                      .global _EZDSP5535_LED_off
    1838                      .global _EZDSP5535_XF_toggle
    1839                      .global _EZDSP5535_GPIO_init
    1840                      .global _EZDSP5535_SAR_init
    1841                      .global _EZDSP5535_SAR_getKey
    1842                      .global _PLL_init
    1843                      .global _PLL_config
    1844                      .global _PLL_reset
    1845                      .global _mem_test
    1846                      .global _oled_test
    1847                      .global _spiflash_test
    1848                      .global _RTC_reset
    1849                      .global _fTimer
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   39

    1850                      .global _Flag_RTC
    1851                      .global _Conunt_RTC
    1852                      .global _VECSTART
    1853              
    1854              ;*******************************************************************************
    1855              ;* TYPE INFORMATION                                                            *
    1856              ;*******************************************************************************
    1857              
    1858              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1859                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1860              $C$DW$162       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1862                      .dwattr $C$DW$162, DW_AT_name("PLLCNTL1")
    1863                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PLLCNTL1")
    1864                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1865                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1866              $C$DW$163       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    1868                      .dwattr $C$DW$163, DW_AT_name("PLLINCNTL")
    1869                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PLLINCNTL")
    1870                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1871                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1872              $C$DW$164       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    1874                      .dwattr $C$DW$164, DW_AT_name("PLLCNTL2")
    1875                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PLLCNTL2")
    1876                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1877                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1878              $C$DW$165       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    1880                      .dwattr $C$DW$165, DW_AT_name("PLLOUTCNTL")
    1881                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    1882                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1883                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1884                      .dwendtag $C$DW$T$21
    1885              
    1886              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    1887                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$21)
    1888                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1889              $C$DW$166       .dwtag  DW_TAG_TI_far_type
    1890                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$27)
    1891              $C$DW$T$35      .dwtag  DW_TAG_const_type
    1892                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$166)
    1893              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1894                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1895                      .dwattr $C$DW$T$28, DW_AT_address_class(0x17)
    1896              
    1897              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1898                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
    1899              $C$DW$167       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
    1901                      .dwattr $C$DW$167, DW_AT_name("EBSR")
    1902                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_EBSR")
    1903                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1904                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   40

    1905              $C$DW$168       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    1907                      .dwattr $C$DW$168, DW_AT_name("RSVD0")
    1908                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD0")
    1909                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1910                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1911              $C$DW$169       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    1913                      .dwattr $C$DW$169, DW_AT_name("PCGCR1")
    1914                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PCGCR1")
    1915                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1916                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$170       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    1919                      .dwattr $C$DW$170, DW_AT_name("PCGCR2")
    1920                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PCGCR2")
    1921                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1922                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$171       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    1925                      .dwattr $C$DW$171, DW_AT_name("PSRCR")
    1926                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PSRCR")
    1927                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1928                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$172       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    1931                      .dwattr $C$DW$172, DW_AT_name("PRCR")
    1932                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PRCR")
    1933                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1934                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1935              $C$DW$173       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
    1937                      .dwattr $C$DW$173, DW_AT_name("RSVD1")
    1938                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD1")
    1939                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1940                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1941              $C$DW$174       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    1943                      .dwattr $C$DW$174, DW_AT_name("TIAFR")
    1944                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_TIAFR")
    1945                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1946                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1947              $C$DW$175       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
    1949                      .dwattr $C$DW$175, DW_AT_name("RSVD2")
    1950                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD2")
    1951                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1952                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$176       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$22)
    1955                      .dwattr $C$DW$176, DW_AT_name("ODSCR")
    1956                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ODSCR")
    1957                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1958                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1959              $C$DW$177       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   41

    1960                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    1961                      .dwattr $C$DW$177, DW_AT_name("PDINHIBR1")
    1962                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PDINHIBR1")
    1963                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1964                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1965              $C$DW$178       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    1967                      .dwattr $C$DW$178, DW_AT_name("PDINHIBR2")
    1968                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PDINHIBR2")
    1969                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1970                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$179       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$22)
    1973                      .dwattr $C$DW$179, DW_AT_name("PDINHIBR3")
    1974                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PDINHIBR3")
    1975                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1976                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1977              $C$DW$180       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    1979                      .dwattr $C$DW$180, DW_AT_name("DMA0CESR1")
    1980                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_DMA0CESR1")
    1981                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1982                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$181       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$22)
    1985                      .dwattr $C$DW$181, DW_AT_name("DMA0CESR2")
    1986                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_DMA0CESR2")
    1987                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1988                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1989              $C$DW$182       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$22)
    1991                      .dwattr $C$DW$182, DW_AT_name("DMA1CESR1")
    1992                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DMA1CESR1")
    1993                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1994                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1995              $C$DW$183       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    1997                      .dwattr $C$DW$183, DW_AT_name("DMA1CESR2")
    1998                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DMA1CESR2")
    1999                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2000                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2001              $C$DW$184       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    2003                      .dwattr $C$DW$184, DW_AT_name("SDRAMCCR")
    2004                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SDRAMCCR")
    2005                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2006                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2007              $C$DW$185       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    2009                      .dwattr $C$DW$185, DW_AT_name("CCR2")
    2010                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CCR2")
    2011                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2012                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$186       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   42

    2015                      .dwattr $C$DW$186, DW_AT_name("CGCR1")
    2016                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_CGCR1")
    2017                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2018                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2019              $C$DW$187       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    2021                      .dwattr $C$DW$187, DW_AT_name("CGICR")
    2022                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_CGICR")
    2023                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2024                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2025              $C$DW$188       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$22)
    2027                      .dwattr $C$DW$188, DW_AT_name("CGCR2")
    2028                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CGCR2")
    2029                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2030                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2031              $C$DW$189       .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2033                      .dwattr $C$DW$189, DW_AT_name("CGOCR")
    2034                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CGOCR")
    2035                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2036                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2037              $C$DW$190       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    2039                      .dwattr $C$DW$190, DW_AT_name("CCSSR")
    2040                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CCSSR")
    2041                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2042                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2043              $C$DW$191       .dwtag  DW_TAG_member
    2044                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
    2045                      .dwattr $C$DW$191, DW_AT_name("RSVD3")
    2046                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_RSVD3")
    2047                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2048                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2049              $C$DW$192       .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    2051                      .dwattr $C$DW$192, DW_AT_name("ECDR")
    2052                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_ECDR")
    2053                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2054                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2055              $C$DW$193       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    2057                      .dwattr $C$DW$193, DW_AT_name("RSVD4")
    2058                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RSVD4")
    2059                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2060                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2061              $C$DW$194       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
    2063                      .dwattr $C$DW$194, DW_AT_name("RAMSLPMDCNTLR1")
    2064                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2065                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2066                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2067              $C$DW$195       .dwtag  DW_TAG_member
    2068                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2069                      .dwattr $C$DW$195, DW_AT_name("RSVD5")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   43

    2070                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_RSVD5")
    2071                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2072                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2073              $C$DW$196       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2075                      .dwattr $C$DW$196, DW_AT_name("RAMSLPMDCNTLR2")
    2076                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2077                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2078                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2079              $C$DW$197       .dwtag  DW_TAG_member
    2080                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
    2081                      .dwattr $C$DW$197, DW_AT_name("RAMSLPMDCNTLR3")
    2082                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2083                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2084                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2085              $C$DW$198       .dwtag  DW_TAG_member
    2086                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    2087                      .dwattr $C$DW$198, DW_AT_name("RAMSLPMDCNTLR4")
    2088                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2089                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2090                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2091              $C$DW$199       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$22)
    2093                      .dwattr $C$DW$199, DW_AT_name("RAMSLPMDCNTLR5")
    2094                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2095                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2096                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2097              $C$DW$200       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$24)
    2099                      .dwattr $C$DW$200, DW_AT_name("RSVD6")
    2100                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_RSVD6")
    2101                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2102                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2103              $C$DW$201       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    2105                      .dwattr $C$DW$201, DW_AT_name("DMAIFR")
    2106                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_DMAIFR")
    2107                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2108                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2109              $C$DW$202       .dwtag  DW_TAG_member
    2110                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    2111                      .dwattr $C$DW$202, DW_AT_name("DMAIER")
    2112                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_DMAIER")
    2113                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2114                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2115              $C$DW$203       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$22)
    2117                      .dwattr $C$DW$203, DW_AT_name("USBSCR")
    2118                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_USBSCR")
    2119                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2120                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2121              $C$DW$204       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$22)
    2123                      .dwattr $C$DW$204, DW_AT_name("ESCR")
    2124                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ESCR")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   44

    2125                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2126                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2127              $C$DW$205       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$24)
    2129                      .dwattr $C$DW$205, DW_AT_name("RSVD7")
    2130                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_RSVD7")
    2131                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2132                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2133              $C$DW$206       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$22)
    2135                      .dwattr $C$DW$206, DW_AT_name("DMA2CESR1")
    2136                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_DMA2CESR1")
    2137                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2138                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2139              $C$DW$207       .dwtag  DW_TAG_member
    2140                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$22)
    2141                      .dwattr $C$DW$207, DW_AT_name("DMA2CESR2")
    2142                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_DMA2CESR2")
    2143                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2144                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2145              $C$DW$208       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$22)
    2147                      .dwattr $C$DW$208, DW_AT_name("DMA3CESR1")
    2148                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_DMA3CESR1")
    2149                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2150                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2151              $C$DW$209       .dwtag  DW_TAG_member
    2152                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$22)
    2153                      .dwattr $C$DW$209, DW_AT_name("DMA3CESR2")
    2154                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_DMA3CESR2")
    2155                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2156                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2157              $C$DW$210       .dwtag  DW_TAG_member
    2158                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
    2159                      .dwattr $C$DW$210, DW_AT_name("CLKSTOP")
    2160                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_CLKSTOP")
    2161                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2162                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2163              $C$DW$211       .dwtag  DW_TAG_member
    2164                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$25)
    2165                      .dwattr $C$DW$211, DW_AT_name("RSVD8")
    2166                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RSVD8")
    2167                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2168                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2169              $C$DW$212       .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$22)
    2171                      .dwattr $C$DW$212, DW_AT_name("DIEIDR0")
    2172                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_DIEIDR0")
    2173                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2174                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2175              $C$DW$213       .dwtag  DW_TAG_member
    2176                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$22)
    2177                      .dwattr $C$DW$213, DW_AT_name("DIEIDR1")
    2178                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_DIEIDR1")
    2179                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   45

    2180                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2181              $C$DW$214       .dwtag  DW_TAG_member
    2182                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$22)
    2183                      .dwattr $C$DW$214, DW_AT_name("DIEIDR2")
    2184                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DIEIDR2")
    2185                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2186                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2187              $C$DW$215       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$22)
    2189                      .dwattr $C$DW$215, DW_AT_name("DIEIDR3")
    2190                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DIEIDR3")
    2191                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2192                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2193              $C$DW$216       .dwtag  DW_TAG_member
    2194                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
    2195                      .dwattr $C$DW$216, DW_AT_name("DIEIDR4")
    2196                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DIEIDR4")
    2197                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2198                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2199              $C$DW$217       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$22)
    2201                      .dwattr $C$DW$217, DW_AT_name("DIEIDR5")
    2202                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_DIEIDR5")
    2203                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2204                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2205              $C$DW$218       .dwtag  DW_TAG_member
    2206                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$22)
    2207                      .dwattr $C$DW$218, DW_AT_name("DIEIDR6")
    2208                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_DIEIDR6")
    2209                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2210                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2211              $C$DW$219       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
    2213                      .dwattr $C$DW$219, DW_AT_name("DIEIDR7")
    2214                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_DIEIDR7")
    2215                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2216                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2217                      .dwendtag $C$DW$T$26
    2218              
    2219              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2220                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$26)
    2221                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2222              $C$DW$220       .dwtag  DW_TAG_TI_far_type
    2223                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$30)
    2224              $C$DW$221       .dwtag  DW_TAG_TI_ioport_type
    2225                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$220)
    2226              $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    2227                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$221)
    2228              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    2229                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    2230                      .dwattr $C$DW$T$32, DW_AT_address_class(0x10)
    2231              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2232                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2233                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2234              
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   46

    2235              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2236                      .dwattr $C$DW$T$34, DW_AT_name("PLL_Obj")
    2237                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    2238              $C$DW$222       .dwtag  DW_TAG_member
    2239                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$28)
    2240                      .dwattr $C$DW$222, DW_AT_name("pllConfig")
    2241                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_pllConfig")
    2242                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2243                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2244              $C$DW$223       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$29)
    2246                      .dwattr $C$DW$223, DW_AT_name("instId")
    2247                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_instId")
    2248                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2249                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2250              $C$DW$224       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$33)
    2252                      .dwattr $C$DW$224, DW_AT_name("sysAddr")
    2253                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_sysAddr")
    2254                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2255                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2256                      .dwendtag $C$DW$T$34
    2257              
    2258              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    2259                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    2260                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2261              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2262                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2263                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    2264              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    2265                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$34)
    2266                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    2267              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    2268                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2269                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2270              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2271                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2272                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2273                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2274              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2275                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2276                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2277                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2278              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2279                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2280                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2281                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2282              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    2283                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$6)
    2284                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2285              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2286                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2287                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2288                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2289              $C$DW$T$8       .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:53:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   47

    2290                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2291                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2292                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2293              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2294                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$8)
    2295                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2296              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2297                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2298                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2299              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2300                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2301                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2302                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2303              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    2304                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$9)
    2305                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
