TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    4545              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 16 03:53:20 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3541                      .dwendtag $C$DW$324
    3542              
    3543                      .dwattr $C$DW$306, DW_AT_TI_end_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    3544                      .dwattr $C$DW$306, DW_AT_TI_end_line(0x5ce)
    3545                      .dwattr $C$DW$306, DW_AT_TI_end_column(0x01)
    3546                      .dwendentry
    3547                      .dwendtag $C$DW$306
    3548              
    3549              ;*******************************************************************************
    3550              ;* FAR STRINGS                                                                 *
    3551              ;*******************************************************************************
    3552 000000               .sect   ".const:.string"
    3553                      .align  2
    3554 000000 0053  $C$FSL1:        .string "Start",0
         000001 0074 
         000002 0061 
         000003 0072 
         000004 0074 
         000005 0000 
    3555                      .align  2
    3556 000006 0042  $C$FSL2:        .string "BlueLED",0
         000007 006C 
         000008 0075 
         000009 0065 
         00000a 004C 
         00000b 0045 
         00000c 0044 
         00000d 0000 
    3557                      .align  2
    3558 00000e 0058  $C$FSL3:        .string "XFLEDtsk",0
         00000f 0046 
         000010 004C 
         000011 0045 
         000012 0044 
         000013 0074 
         000014 0073 
         000015 006B 
         000016 0000 
    3559                      .align  2
    3560 000018 0047  $C$FSL4:        .string "GRNLED",0
         000019 0052 
         00001a 004E 
         00001b 004C 
         00001c 0045 
         00001d 0044 
         00001e 0000 
    3561                      .align  2
    3562 000020 0058  $C$FSL5:        .string "XFLDtsk2",0
         000021 0046 
         000022 004C 
         000023 0044 
         000024 0074 
         000025 0073 
         000026 006B 
         000027 0032 
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   76

         000028 0000 
    3563                      .align  2
    3564 00002a 004C  $C$FSL6:        .string "LEDCTRL",0
         00002b 0045 
         00002c 0044 
         00002d 0043 
         00002e 0054 
         00002f 0052 
         000030 004C 
         000031 0000 
    3565                      .align  2
    3566 000032 0052  $C$FSL7:        .string "RedLED",0
         000033 0065 
         000034 0064 
         000035 004C 
         000036 0045 
         000037 0044 
         000038 0000 
    3567              ;******************************************************************************
    3568              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    3569              ;******************************************************************************
    3570                      .global _EZDSP5535_init
    3571                      .global _EZDSP5535_waitusec
    3572                      .global _xTaskCreate
    3573                      .global _vTaskDelay
    3574                      .global _vTaskSuspend
    3575                      .global _vTaskResume
    3576                      .global _vTaskStartScheduler
    3577                      .global _xQueueGenericSend
    3578                      .global _xQueueSemaphoreTake
    3579                      .global _xQueueGenericCreate
    3580                      .global _reset_RTC
    3581                      .global _enable_i2s0
    3582                      .global _set_i2s0_slave
    3583                      .global _set_dma0_ch0_i2s0_Lout
    3584                      .global _set_dma0_ch1_i2s0_Rout
    3585                      .global _set_dma0_ch0_stop
    3586                      .global _set_dma0_ch1_stop
    3587                      .global _EZDSP5535_LED_init
    3588                      .global _EZDSP5535_LED_on
    3589                      .global _EZDSP5535_LED_off
    3590                      .global _EZDSP5535_XF_toggle
    3591                      .global _EZDSP5535_GPIO_init
    3592                      .global _EZDSP5535_GPIO_setOutput
    3593                      .global _EZDSP5535_SAR_init
    3594                      .global _EZDSP5535_SAR_getKey
    3595                      .global _PLL_init
    3596                      .global _PLL_config
    3597                      .global _PLL_reset
    3598                      .global _mem_test
    3599                      .global _oled_test
    3600                      .global _spiflash_test
    3601                      .global _RTC_reset
    3602                      .global _fTimer
    3603                      .global _Flag_RTC
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   77

    3604                      .global _Conunt_RTC
    3605                      .global _VECSTART
    3606              
    3607              ;*******************************************************************************
    3608              ;* TYPE INFORMATION                                                            *
    3609              ;*******************************************************************************
    3610              
    3611              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3612                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    3613              $C$DW$327       .dwtag  DW_TAG_member
    3614                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$21)
    3615                      .dwattr $C$DW$327, DW_AT_name("PLLCNTL1")
    3616                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_PLLCNTL1")
    3617                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3618                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3619              $C$DW$328       .dwtag  DW_TAG_member
    3620                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
    3621                      .dwattr $C$DW$328, DW_AT_name("PLLINCNTL")
    3622                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_PLLINCNTL")
    3623                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3624                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3625              $C$DW$329       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$21)
    3627                      .dwattr $C$DW$329, DW_AT_name("PLLCNTL2")
    3628                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_PLLCNTL2")
    3629                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3630                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3631              $C$DW$330       .dwtag  DW_TAG_member
    3632                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$21)
    3633                      .dwattr $C$DW$330, DW_AT_name("PLLOUTCNTL")
    3634                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    3635                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3636                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3637                      .dwendtag $C$DW$T$22
    3638              
    3639              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    3640                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    3641                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3642              $C$DW$331       .dwtag  DW_TAG_TI_far_type
    3643                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$28)
    3644              $C$DW$T$36      .dwtag  DW_TAG_const_type
    3645                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$331)
    3646              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3647                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3648                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    3649              
    3650              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3651                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x48)
    3652              $C$DW$332       .dwtag  DW_TAG_member
    3653                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$23)
    3654                      .dwattr $C$DW$332, DW_AT_name("EBSR")
    3655                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_EBSR")
    3656                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3657                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3658              $C$DW$333       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   78

    3659                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$23)
    3660                      .dwattr $C$DW$333, DW_AT_name("RSVD0")
    3661                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_RSVD0")
    3662                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3663                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3664              $C$DW$334       .dwtag  DW_TAG_member
    3665                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$23)
    3666                      .dwattr $C$DW$334, DW_AT_name("PCGCR1")
    3667                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_PCGCR1")
    3668                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3669                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3670              $C$DW$335       .dwtag  DW_TAG_member
    3671                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$23)
    3672                      .dwattr $C$DW$335, DW_AT_name("PCGCR2")
    3673                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_PCGCR2")
    3674                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3675                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3676              $C$DW$336       .dwtag  DW_TAG_member
    3677                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$23)
    3678                      .dwattr $C$DW$336, DW_AT_name("PSRCR")
    3679                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_PSRCR")
    3680                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3681                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3682              $C$DW$337       .dwtag  DW_TAG_member
    3683                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
    3684                      .dwattr $C$DW$337, DW_AT_name("PRCR")
    3685                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_PRCR")
    3686                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3687                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3688              $C$DW$338       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$24)
    3690                      .dwattr $C$DW$338, DW_AT_name("RSVD1")
    3691                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_RSVD1")
    3692                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3693                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3694              $C$DW$339       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$23)
    3696                      .dwattr $C$DW$339, DW_AT_name("TIAFR")
    3697                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_TIAFR")
    3698                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3699                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3700              $C$DW$340       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
    3702                      .dwattr $C$DW$340, DW_AT_name("RSVD2")
    3703                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_RSVD2")
    3704                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3705                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3706              $C$DW$341       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$23)
    3708                      .dwattr $C$DW$341, DW_AT_name("ODSCR")
    3709                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_ODSCR")
    3710                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3711                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$342       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   79

    3714                      .dwattr $C$DW$342, DW_AT_name("PDINHIBR1")
    3715                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_PDINHIBR1")
    3716                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3717                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3718              $C$DW$343       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$23)
    3720                      .dwattr $C$DW$343, DW_AT_name("PDINHIBR2")
    3721                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_PDINHIBR2")
    3722                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3723                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3724              $C$DW$344       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$23)
    3726                      .dwattr $C$DW$344, DW_AT_name("PDINHIBR3")
    3727                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_PDINHIBR3")
    3728                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3729                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3730              $C$DW$345       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$23)
    3732                      .dwattr $C$DW$345, DW_AT_name("DMA0CESR1")
    3733                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_DMA0CESR1")
    3734                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3735                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3736              $C$DW$346       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    3738                      .dwattr $C$DW$346, DW_AT_name("DMA0CESR2")
    3739                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_DMA0CESR2")
    3740                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3741                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3742              $C$DW$347       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
    3744                      .dwattr $C$DW$347, DW_AT_name("DMA1CESR1")
    3745                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_DMA1CESR1")
    3746                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3747                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3748              $C$DW$348       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$23)
    3750                      .dwattr $C$DW$348, DW_AT_name("DMA1CESR2")
    3751                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_DMA1CESR2")
    3752                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3753                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3754              $C$DW$349       .dwtag  DW_TAG_member
    3755                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
    3756                      .dwattr $C$DW$349, DW_AT_name("SDRAMCCR")
    3757                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_SDRAMCCR")
    3758                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3759                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3760              $C$DW$350       .dwtag  DW_TAG_member
    3761                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
    3762                      .dwattr $C$DW$350, DW_AT_name("CCR2")
    3763                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_CCR2")
    3764                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3765                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3766              $C$DW$351       .dwtag  DW_TAG_member
    3767                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
    3768                      .dwattr $C$DW$351, DW_AT_name("CGCR1")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   80

    3769                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_CGCR1")
    3770                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3771                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3772              $C$DW$352       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    3774                      .dwattr $C$DW$352, DW_AT_name("CGICR")
    3775                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_CGICR")
    3776                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3777                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3778              $C$DW$353       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
    3780                      .dwattr $C$DW$353, DW_AT_name("CGCR2")
    3781                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_CGCR2")
    3782                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3783                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3784              $C$DW$354       .dwtag  DW_TAG_member
    3785                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
    3786                      .dwattr $C$DW$354, DW_AT_name("CGOCR")
    3787                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_CGOCR")
    3788                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3789                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3790              $C$DW$355       .dwtag  DW_TAG_member
    3791                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
    3792                      .dwattr $C$DW$355, DW_AT_name("CCSSR")
    3793                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_CCSSR")
    3794                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3795                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3796              $C$DW$356       .dwtag  DW_TAG_member
    3797                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
    3798                      .dwattr $C$DW$356, DW_AT_name("RSVD3")
    3799                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_RSVD3")
    3800                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3801                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3802              $C$DW$357       .dwtag  DW_TAG_member
    3803                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$23)
    3804                      .dwattr $C$DW$357, DW_AT_name("ECDR")
    3805                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_ECDR")
    3806                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3807                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3808              $C$DW$358       .dwtag  DW_TAG_member
    3809                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    3810                      .dwattr $C$DW$358, DW_AT_name("RSVD4")
    3811                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_RSVD4")
    3812                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    3813                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3814              $C$DW$359       .dwtag  DW_TAG_member
    3815                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
    3816                      .dwattr $C$DW$359, DW_AT_name("RAMSLPMDCNTLR1")
    3817                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    3818                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3819                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3820              $C$DW$360       .dwtag  DW_TAG_member
    3821                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$23)
    3822                      .dwattr $C$DW$360, DW_AT_name("RSVD5")
    3823                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_RSVD5")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   81

    3824                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3825                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3826              $C$DW$361       .dwtag  DW_TAG_member
    3827                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
    3828                      .dwattr $C$DW$361, DW_AT_name("RAMSLPMDCNTLR2")
    3829                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    3830                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3831                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3832              $C$DW$362       .dwtag  DW_TAG_member
    3833                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
    3834                      .dwattr $C$DW$362, DW_AT_name("RAMSLPMDCNTLR3")
    3835                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    3836                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    3837                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3838              $C$DW$363       .dwtag  DW_TAG_member
    3839                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$23)
    3840                      .dwattr $C$DW$363, DW_AT_name("RAMSLPMDCNTLR4")
    3841                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    3842                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3843                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3844              $C$DW$364       .dwtag  DW_TAG_member
    3845                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    3846                      .dwattr $C$DW$364, DW_AT_name("RAMSLPMDCNTLR5")
    3847                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    3848                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    3849                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3850              $C$DW$365       .dwtag  DW_TAG_member
    3851                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$25)
    3852                      .dwattr $C$DW$365, DW_AT_name("RSVD6")
    3853                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_RSVD6")
    3854                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3855                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3856              $C$DW$366       .dwtag  DW_TAG_member
    3857                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$23)
    3858                      .dwattr $C$DW$366, DW_AT_name("DMAIFR")
    3859                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_DMAIFR")
    3860                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3861                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3862              $C$DW$367       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
    3864                      .dwattr $C$DW$367, DW_AT_name("DMAIER")
    3865                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_DMAIER")
    3866                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3867                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3868              $C$DW$368       .dwtag  DW_TAG_member
    3869                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
    3870                      .dwattr $C$DW$368, DW_AT_name("USBSCR")
    3871                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_USBSCR")
    3872                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3873                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3874              $C$DW$369       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
    3876                      .dwattr $C$DW$369, DW_AT_name("ESCR")
    3877                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ESCR")
    3878                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   82

    3879                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3880              $C$DW$370       .dwtag  DW_TAG_member
    3881                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$25)
    3882                      .dwattr $C$DW$370, DW_AT_name("RSVD7")
    3883                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_RSVD7")
    3884                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3885                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3886              $C$DW$371       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    3888                      .dwattr $C$DW$371, DW_AT_name("DMA2CESR1")
    3889                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_DMA2CESR1")
    3890                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3891                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3892              $C$DW$372       .dwtag  DW_TAG_member
    3893                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    3894                      .dwattr $C$DW$372, DW_AT_name("DMA2CESR2")
    3895                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_DMA2CESR2")
    3896                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    3897                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3898              $C$DW$373       .dwtag  DW_TAG_member
    3899                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    3900                      .dwattr $C$DW$373, DW_AT_name("DMA3CESR1")
    3901                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_DMA3CESR1")
    3902                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3903                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3904              $C$DW$374       .dwtag  DW_TAG_member
    3905                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
    3906                      .dwattr $C$DW$374, DW_AT_name("DMA3CESR2")
    3907                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_DMA3CESR2")
    3908                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    3909                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3910              $C$DW$375       .dwtag  DW_TAG_member
    3911                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
    3912                      .dwattr $C$DW$375, DW_AT_name("CLKSTOP")
    3913                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_CLKSTOP")
    3914                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3915                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3916              $C$DW$376       .dwtag  DW_TAG_member
    3917                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$26)
    3918                      .dwattr $C$DW$376, DW_AT_name("RSVD8")
    3919                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_RSVD8")
    3920                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    3921                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3922              $C$DW$377       .dwtag  DW_TAG_member
    3923                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$23)
    3924                      .dwattr $C$DW$377, DW_AT_name("DIEIDR0")
    3925                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_DIEIDR0")
    3926                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3927                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3928              $C$DW$378       .dwtag  DW_TAG_member
    3929                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    3930                      .dwattr $C$DW$378, DW_AT_name("DIEIDR1")
    3931                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_DIEIDR1")
    3932                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3933                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   83

    3934              $C$DW$379       .dwtag  DW_TAG_member
    3935                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$23)
    3936                      .dwattr $C$DW$379, DW_AT_name("DIEIDR2")
    3937                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_DIEIDR2")
    3938                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3939                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3940              $C$DW$380       .dwtag  DW_TAG_member
    3941                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$23)
    3942                      .dwattr $C$DW$380, DW_AT_name("DIEIDR3")
    3943                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_DIEIDR3")
    3944                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    3945                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3946              $C$DW$381       .dwtag  DW_TAG_member
    3947                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$23)
    3948                      .dwattr $C$DW$381, DW_AT_name("DIEIDR4")
    3949                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_DIEIDR4")
    3950                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3951                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3952              $C$DW$382       .dwtag  DW_TAG_member
    3953                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$23)
    3954                      .dwattr $C$DW$382, DW_AT_name("DIEIDR5")
    3955                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_DIEIDR5")
    3956                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3957                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3958              $C$DW$383       .dwtag  DW_TAG_member
    3959                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$23)
    3960                      .dwattr $C$DW$383, DW_AT_name("DIEIDR6")
    3961                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_DIEIDR6")
    3962                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3963                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3964              $C$DW$384       .dwtag  DW_TAG_member
    3965                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$23)
    3966                      .dwattr $C$DW$384, DW_AT_name("DIEIDR7")
    3967                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_DIEIDR7")
    3968                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    3969                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3970                      .dwendtag $C$DW$T$27
    3971              
    3972              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    3973                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    3974                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3975              $C$DW$385       .dwtag  DW_TAG_TI_far_type
    3976                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$31)
    3977              $C$DW$386       .dwtag  DW_TAG_TI_ioport_type
    3978                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$385)
    3979              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    3980                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$386)
    3981              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    3982                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3983                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    3984              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    3985                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    3986                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    3987              
    3988              $C$DW$T$35      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   84

    3989                      .dwattr $C$DW$T$35, DW_AT_name("PLL_Obj")
    3990                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    3991              $C$DW$387       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$29)
    3993                      .dwattr $C$DW$387, DW_AT_name("pllConfig")
    3994                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_pllConfig")
    3995                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3996                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3997              $C$DW$388       .dwtag  DW_TAG_member
    3998                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$30)
    3999                      .dwattr $C$DW$388, DW_AT_name("instId")
    4000                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_instId")
    4001                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4002                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4003              $C$DW$389       .dwtag  DW_TAG_member
    4004                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$34)
    4005                      .dwattr $C$DW$389, DW_AT_name("sysAddr")
    4006                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_sysAddr")
    4007                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4008                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4009                      .dwendtag $C$DW$T$35
    4010              
    4011              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    4012                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    4013                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4014              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4015                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4016                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    4017              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4018                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$35)
    4019                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    4020              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    4021                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4022                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4023              
    4024              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4025                      .dwattr $C$DW$T$19, DW_AT_name("QueueDefinition")
    4026                      .dwattr $C$DW$T$19, DW_AT_declaration
    4027                      .dwendtag $C$DW$T$19
    4028              
    4029              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    4030                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$19)
    4031                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    4032              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    4033                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4034                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4035              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreHandle_t")
    4036                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4037                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4038              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4039                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4040              $C$DW$390       .dwtag  DW_TAG_TI_far_type
    4041                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$3)
    4042              $C$DW$T$50      .dwtag  DW_TAG_const_type
    4043                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$390)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 03:53:21 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   85

    4044              
    4045              $C$DW$T$53      .dwtag  DW_TAG_subroutine_type
    4046                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4047              $C$DW$391       .dwtag  DW_TAG_formal_parameter
    4048                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$3)
    4049                      .dwendtag $C$DW$T$53
    4050              
    4051              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    4052                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    4053                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    4054              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    4055                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4056                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4057              $C$DW$392       .dwtag  DW_TAG_TI_far_type
    4058              $C$DW$T$66      .dwtag  DW_TAG_const_type
    4059                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$392)
    4060              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    4061                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    4062                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
