TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    4408              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Mon Sep 17 05:59:44 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3404                      .dwendtag $C$DW$315
    3405              
    3406                      .dwattr $C$DW$305, DW_AT_TI_end_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    3407                      .dwattr $C$DW$305, DW_AT_TI_end_line(0x5ec)
    3408                      .dwattr $C$DW$305, DW_AT_TI_end_column(0x01)
    3409                      .dwendentry
    3410                      .dwendtag $C$DW$305
    3411              
    3412              ;*******************************************************************************
    3413              ;* FAR STRINGS                                                                 *
    3414              ;*******************************************************************************
    3415 000000               .sect   ".const:.string"
    3416                      .align  2
    3417 000000 0053  $C$FSL1:        .string "Start",0
         000001 0074 
         000002 0061 
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   72

         000003 0072 
         000004 0074 
         000005 0000 
    3418                      .align  2
    3419 000006 0042  $C$FSL2:        .string "BlueLED",0
         000007 006C 
         000008 0075 
         000009 0065 
         00000a 004C 
         00000b 0045 
         00000c 0044 
         00000d 0000 
    3420                      .align  2
    3421 00000e 0058  $C$FSL3:        .string "XFLEDtsk",0
         00000f 0046 
         000010 004C 
         000011 0045 
         000012 0044 
         000013 0074 
         000014 0073 
         000015 006B 
         000016 0000 
    3422                      .align  2
    3423 000018 0047  $C$FSL4:        .string "GRNLED",0
         000019 0052 
         00001a 004E 
         00001b 004C 
         00001c 0045 
         00001d 0044 
         00001e 0000 
    3424                      .align  2
    3425 000020 0058  $C$FSL5:        .string "XFLDtsk2",0
         000021 0046 
         000022 004C 
         000023 0044 
         000024 0074 
         000025 0073 
         000026 006B 
         000027 0032 
         000028 0000 
    3426                      .align  2
    3427 00002a 004C  $C$FSL6:        .string "LEDCTRL",0
         00002b 0045 
         00002c 0044 
         00002d 0043 
         00002e 0054 
         00002f 0052 
         000030 004C 
         000031 0000 
    3428                      .align  2
    3429 000032 0052  $C$FSL7:        .string "RedLED",0
         000033 0065 
         000034 0064 
         000035 004C 
         000036 0045 
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   73

         000037 0044 
         000038 0000 
    3430              ;******************************************************************************
    3431              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    3432              ;******************************************************************************
    3433                      .global _EZDSP5535_init
    3434                      .global _EZDSP5535_waitusec
    3435                      .global _xTaskCreate
    3436                      .global _vTaskDelay
    3437                      .global _vTaskSuspend
    3438                      .global _vTaskResume
    3439                      .global _vTaskStartScheduler
    3440                      .global _xQueueGenericSend
    3441                      .global _xQueueSemaphoreTake
    3442                      .global _xQueueGenericCreate
    3443                      .global _reset_RTC
    3444                      .global _enable_i2s0
    3445                      .global _set_i2s0_slave
    3446                      .global _set_dma0_ch0_i2s0_Lout
    3447                      .global _set_dma0_ch1_i2s0_Rout
    3448                      .global _set_dma0_ch0_stop
    3449                      .global _set_dma0_ch1_stop
    3450                      .global _EZDSP5535_LED_init
    3451                      .global _EZDSP5535_LED_on
    3452                      .global _EZDSP5535_LED_off
    3453                      .global _EZDSP5535_XF_toggle
    3454                      .global _EZDSP5535_GPIO_init
    3455                      .global _EZDSP5535_GPIO_setOutput
    3456                      .global _EZDSP5535_SAR_init
    3457                      .global _EZDSP5535_SAR_getKey
    3458                      .global _PLL_init
    3459                      .global _PLL_config
    3460                      .global _PLL_reset
    3461                      .global _mem_test
    3462                      .global _oled_test
    3463                      .global _spiflash_test
    3464                      .global _RTC_reset
    3465                      .global _fTimer
    3466                      .global _Flag_RTC
    3467                      .global _Conunt_RTC
    3468                      .global _VECSTART
    3469              
    3470              ;*******************************************************************************
    3471              ;* TYPE INFORMATION                                                            *
    3472              ;*******************************************************************************
    3473              
    3474              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3475                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    3476              $C$DW$317       .dwtag  DW_TAG_member
    3477                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$21)
    3478                      .dwattr $C$DW$317, DW_AT_name("PLLCNTL1")
    3479                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_PLLCNTL1")
    3480                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3481                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3482              $C$DW$318       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   74

    3483                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$21)
    3484                      .dwattr $C$DW$318, DW_AT_name("PLLINCNTL")
    3485                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_PLLINCNTL")
    3486                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3487                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3488              $C$DW$319       .dwtag  DW_TAG_member
    3489                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$21)
    3490                      .dwattr $C$DW$319, DW_AT_name("PLLCNTL2")
    3491                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_PLLCNTL2")
    3492                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3493                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3494              $C$DW$320       .dwtag  DW_TAG_member
    3495                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
    3496                      .dwattr $C$DW$320, DW_AT_name("PLLOUTCNTL")
    3497                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    3498                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3499                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3500                      .dwendtag $C$DW$T$22
    3501              
    3502              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    3503                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    3504                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3505              $C$DW$321       .dwtag  DW_TAG_TI_far_type
    3506                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$28)
    3507              $C$DW$T$36      .dwtag  DW_TAG_const_type
    3508                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$321)
    3509              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3510                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3511                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    3512              
    3513              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3514                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x48)
    3515              $C$DW$322       .dwtag  DW_TAG_member
    3516                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$23)
    3517                      .dwattr $C$DW$322, DW_AT_name("EBSR")
    3518                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_EBSR")
    3519                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3520                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3521              $C$DW$323       .dwtag  DW_TAG_member
    3522                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$23)
    3523                      .dwattr $C$DW$323, DW_AT_name("RSVD0")
    3524                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_RSVD0")
    3525                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3526                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3527              $C$DW$324       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$23)
    3529                      .dwattr $C$DW$324, DW_AT_name("PCGCR1")
    3530                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_PCGCR1")
    3531                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3532                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3533              $C$DW$325       .dwtag  DW_TAG_member
    3534                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$23)
    3535                      .dwattr $C$DW$325, DW_AT_name("PCGCR2")
    3536                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_PCGCR2")
    3537                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   75

    3538                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3539              $C$DW$326       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$23)
    3541                      .dwattr $C$DW$326, DW_AT_name("PSRCR")
    3542                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_PSRCR")
    3543                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3544                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3545              $C$DW$327       .dwtag  DW_TAG_member
    3546                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$23)
    3547                      .dwattr $C$DW$327, DW_AT_name("PRCR")
    3548                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_PRCR")
    3549                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3550                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3551              $C$DW$328       .dwtag  DW_TAG_member
    3552                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$24)
    3553                      .dwattr $C$DW$328, DW_AT_name("RSVD1")
    3554                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_RSVD1")
    3555                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3556                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3557              $C$DW$329       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$23)
    3559                      .dwattr $C$DW$329, DW_AT_name("TIAFR")
    3560                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_TIAFR")
    3561                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3562                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3563              $C$DW$330       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$23)
    3565                      .dwattr $C$DW$330, DW_AT_name("RSVD2")
    3566                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_RSVD2")
    3567                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3568                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3569              $C$DW$331       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$23)
    3571                      .dwattr $C$DW$331, DW_AT_name("ODSCR")
    3572                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_ODSCR")
    3573                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3574                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3575              $C$DW$332       .dwtag  DW_TAG_member
    3576                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$23)
    3577                      .dwattr $C$DW$332, DW_AT_name("PDINHIBR1")
    3578                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_PDINHIBR1")
    3579                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3580                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3581              $C$DW$333       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$23)
    3583                      .dwattr $C$DW$333, DW_AT_name("PDINHIBR2")
    3584                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_PDINHIBR2")
    3585                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3586                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3587              $C$DW$334       .dwtag  DW_TAG_member
    3588                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$23)
    3589                      .dwattr $C$DW$334, DW_AT_name("PDINHIBR3")
    3590                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_PDINHIBR3")
    3591                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3592                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   76

    3593              $C$DW$335       .dwtag  DW_TAG_member
    3594                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$23)
    3595                      .dwattr $C$DW$335, DW_AT_name("DMA0CESR1")
    3596                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_DMA0CESR1")
    3597                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3598                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3599              $C$DW$336       .dwtag  DW_TAG_member
    3600                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$23)
    3601                      .dwattr $C$DW$336, DW_AT_name("DMA0CESR2")
    3602                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_DMA0CESR2")
    3603                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3604                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3605              $C$DW$337       .dwtag  DW_TAG_member
    3606                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
    3607                      .dwattr $C$DW$337, DW_AT_name("DMA1CESR1")
    3608                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_DMA1CESR1")
    3609                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3610                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3611              $C$DW$338       .dwtag  DW_TAG_member
    3612                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
    3613                      .dwattr $C$DW$338, DW_AT_name("DMA1CESR2")
    3614                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_DMA1CESR2")
    3615                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3616                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3617              $C$DW$339       .dwtag  DW_TAG_member
    3618                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$23)
    3619                      .dwattr $C$DW$339, DW_AT_name("SDRAMCCR")
    3620                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_SDRAMCCR")
    3621                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3622                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3623              $C$DW$340       .dwtag  DW_TAG_member
    3624                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
    3625                      .dwattr $C$DW$340, DW_AT_name("CCR2")
    3626                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_CCR2")
    3627                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3628                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3629              $C$DW$341       .dwtag  DW_TAG_member
    3630                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$23)
    3631                      .dwattr $C$DW$341, DW_AT_name("CGCR1")
    3632                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_CGCR1")
    3633                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3634                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3635              $C$DW$342       .dwtag  DW_TAG_member
    3636                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$23)
    3637                      .dwattr $C$DW$342, DW_AT_name("CGICR")
    3638                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_CGICR")
    3639                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3640                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3641              $C$DW$343       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$23)
    3643                      .dwattr $C$DW$343, DW_AT_name("CGCR2")
    3644                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_CGCR2")
    3645                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3646                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3647              $C$DW$344       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   77

    3648                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$23)
    3649                      .dwattr $C$DW$344, DW_AT_name("CGOCR")
    3650                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_CGOCR")
    3651                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3652                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3653              $C$DW$345       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$23)
    3655                      .dwattr $C$DW$345, DW_AT_name("CCSSR")
    3656                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_CCSSR")
    3657                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3658                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3659              $C$DW$346       .dwtag  DW_TAG_member
    3660                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    3661                      .dwattr $C$DW$346, DW_AT_name("RSVD3")
    3662                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_RSVD3")
    3663                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3664                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3665              $C$DW$347       .dwtag  DW_TAG_member
    3666                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
    3667                      .dwattr $C$DW$347, DW_AT_name("ECDR")
    3668                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_ECDR")
    3669                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3670                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3671              $C$DW$348       .dwtag  DW_TAG_member
    3672                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$23)
    3673                      .dwattr $C$DW$348, DW_AT_name("RSVD4")
    3674                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_RSVD4")
    3675                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    3676                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3677              $C$DW$349       .dwtag  DW_TAG_member
    3678                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
    3679                      .dwattr $C$DW$349, DW_AT_name("RAMSLPMDCNTLR1")
    3680                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    3681                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3682                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3683              $C$DW$350       .dwtag  DW_TAG_member
    3684                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
    3685                      .dwattr $C$DW$350, DW_AT_name("RSVD5")
    3686                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_RSVD5")
    3687                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3688                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3689              $C$DW$351       .dwtag  DW_TAG_member
    3690                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
    3691                      .dwattr $C$DW$351, DW_AT_name("RAMSLPMDCNTLR2")
    3692                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    3693                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3694                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3695              $C$DW$352       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    3697                      .dwattr $C$DW$352, DW_AT_name("RAMSLPMDCNTLR3")
    3698                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    3699                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    3700                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3701              $C$DW$353       .dwtag  DW_TAG_member
    3702                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   78

    3703                      .dwattr $C$DW$353, DW_AT_name("RAMSLPMDCNTLR4")
    3704                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    3705                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3706                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3707              $C$DW$354       .dwtag  DW_TAG_member
    3708                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
    3709                      .dwattr $C$DW$354, DW_AT_name("RAMSLPMDCNTLR5")
    3710                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    3711                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    3712                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3713              $C$DW$355       .dwtag  DW_TAG_member
    3714                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$25)
    3715                      .dwattr $C$DW$355, DW_AT_name("RSVD6")
    3716                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_RSVD6")
    3717                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3718                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3719              $C$DW$356       .dwtag  DW_TAG_member
    3720                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
    3721                      .dwattr $C$DW$356, DW_AT_name("DMAIFR")
    3722                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_DMAIFR")
    3723                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3724                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3725              $C$DW$357       .dwtag  DW_TAG_member
    3726                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$23)
    3727                      .dwattr $C$DW$357, DW_AT_name("DMAIER")
    3728                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_DMAIER")
    3729                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3730                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3731              $C$DW$358       .dwtag  DW_TAG_member
    3732                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    3733                      .dwattr $C$DW$358, DW_AT_name("USBSCR")
    3734                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_USBSCR")
    3735                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3736                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3737              $C$DW$359       .dwtag  DW_TAG_member
    3738                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
    3739                      .dwattr $C$DW$359, DW_AT_name("ESCR")
    3740                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_ESCR")
    3741                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    3742                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3743              $C$DW$360       .dwtag  DW_TAG_member
    3744                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$25)
    3745                      .dwattr $C$DW$360, DW_AT_name("RSVD7")
    3746                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_RSVD7")
    3747                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3748                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3749              $C$DW$361       .dwtag  DW_TAG_member
    3750                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
    3751                      .dwattr $C$DW$361, DW_AT_name("DMA2CESR1")
    3752                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_DMA2CESR1")
    3753                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3754                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3755              $C$DW$362       .dwtag  DW_TAG_member
    3756                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
    3757                      .dwattr $C$DW$362, DW_AT_name("DMA2CESR2")
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   79

    3758                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_DMA2CESR2")
    3759                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    3760                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3761              $C$DW$363       .dwtag  DW_TAG_member
    3762                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$23)
    3763                      .dwattr $C$DW$363, DW_AT_name("DMA3CESR1")
    3764                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_DMA3CESR1")
    3765                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3766                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3767              $C$DW$364       .dwtag  DW_TAG_member
    3768                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    3769                      .dwattr $C$DW$364, DW_AT_name("DMA3CESR2")
    3770                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_DMA3CESR2")
    3771                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    3772                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3773              $C$DW$365       .dwtag  DW_TAG_member
    3774                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    3775                      .dwattr $C$DW$365, DW_AT_name("CLKSTOP")
    3776                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_CLKSTOP")
    3777                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3778                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3779              $C$DW$366       .dwtag  DW_TAG_member
    3780                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$26)
    3781                      .dwattr $C$DW$366, DW_AT_name("RSVD8")
    3782                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_RSVD8")
    3783                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    3784                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3785              $C$DW$367       .dwtag  DW_TAG_member
    3786                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
    3787                      .dwattr $C$DW$367, DW_AT_name("DIEIDR0")
    3788                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_DIEIDR0")
    3789                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3790                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3791              $C$DW$368       .dwtag  DW_TAG_member
    3792                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
    3793                      .dwattr $C$DW$368, DW_AT_name("DIEIDR1")
    3794                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_DIEIDR1")
    3795                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3796                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3797              $C$DW$369       .dwtag  DW_TAG_member
    3798                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
    3799                      .dwattr $C$DW$369, DW_AT_name("DIEIDR2")
    3800                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_DIEIDR2")
    3801                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3802                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3803              $C$DW$370       .dwtag  DW_TAG_member
    3804                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$23)
    3805                      .dwattr $C$DW$370, DW_AT_name("DIEIDR3")
    3806                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_DIEIDR3")
    3807                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    3808                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3809              $C$DW$371       .dwtag  DW_TAG_member
    3810                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    3811                      .dwattr $C$DW$371, DW_AT_name("DIEIDR4")
    3812                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_DIEIDR4")
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   80

    3813                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3814                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3815              $C$DW$372       .dwtag  DW_TAG_member
    3816                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    3817                      .dwattr $C$DW$372, DW_AT_name("DIEIDR5")
    3818                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_DIEIDR5")
    3819                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3820                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3821              $C$DW$373       .dwtag  DW_TAG_member
    3822                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    3823                      .dwattr $C$DW$373, DW_AT_name("DIEIDR6")
    3824                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_DIEIDR6")
    3825                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3826                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3827              $C$DW$374       .dwtag  DW_TAG_member
    3828                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
    3829                      .dwattr $C$DW$374, DW_AT_name("DIEIDR7")
    3830                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_DIEIDR7")
    3831                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    3832                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3833                      .dwendtag $C$DW$T$27
    3834              
    3835              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    3836                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    3837                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3838              $C$DW$375       .dwtag  DW_TAG_TI_far_type
    3839                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$31)
    3840              $C$DW$376       .dwtag  DW_TAG_TI_ioport_type
    3841                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$375)
    3842              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    3843                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$376)
    3844              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    3845                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3846                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    3847              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    3848                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    3849                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    3850              
    3851              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3852                      .dwattr $C$DW$T$35, DW_AT_name("PLL_Obj")
    3853                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    3854              $C$DW$377       .dwtag  DW_TAG_member
    3855                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$29)
    3856                      .dwattr $C$DW$377, DW_AT_name("pllConfig")
    3857                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_pllConfig")
    3858                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3859                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3860              $C$DW$378       .dwtag  DW_TAG_member
    3861                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$30)
    3862                      .dwattr $C$DW$378, DW_AT_name("instId")
    3863                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_instId")
    3864                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3865                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3866              $C$DW$379       .dwtag  DW_TAG_member
    3867                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$34)
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   81

    3868                      .dwattr $C$DW$379, DW_AT_name("sysAddr")
    3869                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_sysAddr")
    3870                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3871                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3872                      .dwendtag $C$DW$T$35
    3873              
    3874              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    3875                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    3876                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3877              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    3878                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3879                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    3880              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    3881                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$35)
    3882                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    3883              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    3884                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3885                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3886              
    3887              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3888                      .dwattr $C$DW$T$19, DW_AT_name("QueueDefinition")
    3889                      .dwattr $C$DW$T$19, DW_AT_declaration
    3890                      .dwendtag $C$DW$T$19
    3891              
    3892              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    3893                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$19)
    3894                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    3895              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    3896                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3897                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3898              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreHandle_t")
    3899                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    3900                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3901              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3902                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    3903              $C$DW$380       .dwtag  DW_TAG_TI_far_type
    3904                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$3)
    3905              $C$DW$T$50      .dwtag  DW_TAG_const_type
    3906                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$380)
    3907              
    3908              $C$DW$T$53      .dwtag  DW_TAG_subroutine_type
    3909                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3910              $C$DW$381       .dwtag  DW_TAG_formal_parameter
    3911                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$3)
    3912                      .dwendtag $C$DW$T$53
    3913              
    3914              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    3915                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    3916                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    3917              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    3918                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3919                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3920              $C$DW$382       .dwtag  DW_TAG_TI_far_type
    3921              $C$DW$T$66      .dwtag  DW_TAG_const_type
    3922                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$382)
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:59:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   82

    3923              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    3924                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    3925                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
