TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    3148              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 09 04:48:31 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2174                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_pcTaskName")
    2175                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$58)
    2176                      .dwattr $C$DW$195, DW_AT_location[DW_OP_bregx 0x24 2]
    2177 0004ae EB04          MOV XAR1, dbl(*SP(#2))
         0004b0 95   
    2178 0004b1 EB00          MOV XAR0, dbl(*SP(#0))
         0004b3 85   
    2179                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 837,column 2,is_stmt
    2180                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 838,column 2,is_stmt
    2181                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 843,column 2,is_stmt
    2182 0004b4 20     nop
    2183 0004b5 46B3   bset INTM
    2184 0004b7       $C$L40:    
    2185 0004b7       $C$DW$L$_vApplicationStackOverflowHook$2$B:
    2186                      .dwpsn  file "../FreeRTOS/Demo/c5515_CCS/main.c",line 844,column 2,is_stmt
    2187 0004b7 4A7E          B $C$L40  ; |844| 
    2188                                                      ; branch occurs ; |844| 
    2189 0004b9       $C$DW$L$_vApplicationStackOverflowHook$2$E:
    2190                      .dwcfi  cfa_offset, 1
    2191              
    2192              $C$DW$196       .dwtag  DW_TAG_TI_loop
    2193                      .dwattr $C$DW$196, DW_AT_name("F:\eZdsp_DBG\eZDSP_5535_Files\ccsws2\test\Debug\main.asm:$C$L40:1:1536
    2194                      .dwattr $C$DW$196, DW_AT_TI_begin_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    2195                      .dwattr $C$DW$196, DW_AT_TI_begin_line(0x34c)
    2196                      .dwattr $C$DW$196, DW_AT_TI_end_line(0x34c)
    2197              $C$DW$197       .dwtag  DW_TAG_TI_loop_range
    2198                      .dwattr $C$DW$197, DW_AT_low_pc($C$DW$L$_vApplicationStackOverflowHook$2$B)
    2199                      .dwattr $C$DW$197, DW_AT_high_pc($C$DW$L$_vApplicationStackOverflowHook$2$E)
    2200                      .dwendtag $C$DW$196
    2201              
    2202                      .dwattr $C$DW$191, DW_AT_TI_end_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    2203                      .dwattr $C$DW$191, DW_AT_TI_end_line(0x34d)
    2204                      .dwattr $C$DW$191, DW_AT_TI_end_column(0x01)
    2205                      .dwendentry
    2206                      .dwendtag $C$DW$191
    2207              
    2208              ;*******************************************************************************
    2209              ;* FAR STRINGS                                                                 *
    2210              ;*******************************************************************************
    2211 000000               .sect   ".const:.string"
    2212                      .align  2
    2213 000000 0043  $C$FSL1:        .string "Check",0
         000001 0068 
         000002 0065 
         000003 0063 
         000004 006B 
         000005 0000 
    2214              ;******************************************************************************
    2215              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    2216              ;******************************************************************************
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   47

    2217                      .global _EZDSP5535_init
    2218                      .global _EZDSP5535_waitusec
    2219                      .global _xTaskCreate
    2220                      .global _vTaskDelay
    2221                      .global _vTaskStartScheduler
    2222                      .global _vStartLEDFlashTasks
    2223                      .global _xAreIntegerMathsTaskStillRunning
    2224                      .global _xArePollingQueuesStillRunning
    2225                      .global _reset_RTC
    2226                      .global _enable_i2s0
    2227                      .global _set_i2s0_slave
    2228                      .global _set_dma0_ch0_i2s0_Lout
    2229                      .global _set_dma0_ch1_i2s0_Rout
    2230                      .global _set_dma0_ch0_stop
    2231                      .global _set_dma0_ch1_stop
    2232                      .global _EZDSP5535_LED_init
    2233                      .global _EZDSP5535_LED_on
    2234                      .global _EZDSP5535_LED_off
    2235                      .global _EZDSP5535_XF_toggle
    2236                      .global _EZDSP5535_SAR_init
    2237                      .global _EZDSP5535_SAR_getKey
    2238                      .global _PLL_init
    2239                      .global _PLL_config
    2240                      .global _PLL_reset
    2241                      .global _mem_test
    2242                      .global _oled_test
    2243                      .global _spiflash_test
    2244                      .global _RTC_reset
    2245                      .global _fTimer
    2246                      .global _Flag_RTC
    2247                      .global _Conunt_RTC
    2248                      .global _VECSTART
    2249              
    2250              ;*******************************************************************************
    2251              ;* TYPE INFORMATION                                                            *
    2252              ;*******************************************************************************
    2253              
    2254              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2255                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    2256              $C$DW$198       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    2258                      .dwattr $C$DW$198, DW_AT_name("PLLCNTL1")
    2259                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PLLCNTL1")
    2260                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2261                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2262              $C$DW$199       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    2264                      .dwattr $C$DW$199, DW_AT_name("PLLINCNTL")
    2265                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PLLINCNTL")
    2266                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2267                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2268              $C$DW$200       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    2270                      .dwattr $C$DW$200, DW_AT_name("PLLCNTL2")
    2271                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_PLLCNTL2")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   48

    2272                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2273                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2274              $C$DW$201       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    2276                      .dwattr $C$DW$201, DW_AT_name("PLLOUTCNTL")
    2277                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    2278                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2279                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2280                      .dwendtag $C$DW$T$21
    2281              
    2282              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    2283                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$21)
    2284                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2285              $C$DW$202       .dwtag  DW_TAG_TI_far_type
    2286                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$27)
    2287              $C$DW$T$35      .dwtag  DW_TAG_const_type
    2288                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$202)
    2289              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    2290                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2291                      .dwattr $C$DW$T$28, DW_AT_address_class(0x17)
    2292              
    2293              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2294                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
    2295              $C$DW$203       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$22)
    2297                      .dwattr $C$DW$203, DW_AT_name("EBSR")
    2298                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_EBSR")
    2299                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2300                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2301              $C$DW$204       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$22)
    2303                      .dwattr $C$DW$204, DW_AT_name("RSVD0")
    2304                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_RSVD0")
    2305                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2306                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2307              $C$DW$205       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$22)
    2309                      .dwattr $C$DW$205, DW_AT_name("PCGCR1")
    2310                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_PCGCR1")
    2311                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2312                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2313              $C$DW$206       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$22)
    2315                      .dwattr $C$DW$206, DW_AT_name("PCGCR2")
    2316                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_PCGCR2")
    2317                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2318                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2319              $C$DW$207       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$22)
    2321                      .dwattr $C$DW$207, DW_AT_name("PSRCR")
    2322                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_PSRCR")
    2323                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2324                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2325              $C$DW$208       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   49

    2327                      .dwattr $C$DW$208, DW_AT_name("PRCR")
    2328                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_PRCR")
    2329                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2330                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2331              $C$DW$209       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$23)
    2333                      .dwattr $C$DW$209, DW_AT_name("RSVD1")
    2334                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_RSVD1")
    2335                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2336                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2337              $C$DW$210       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
    2339                      .dwattr $C$DW$210, DW_AT_name("TIAFR")
    2340                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_TIAFR")
    2341                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2342                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$211       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
    2345                      .dwattr $C$DW$211, DW_AT_name("RSVD2")
    2346                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RSVD2")
    2347                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2348                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2349              $C$DW$212       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$22)
    2351                      .dwattr $C$DW$212, DW_AT_name("ODSCR")
    2352                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_ODSCR")
    2353                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2354                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2355              $C$DW$213       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$22)
    2357                      .dwattr $C$DW$213, DW_AT_name("PDINHIBR1")
    2358                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_PDINHIBR1")
    2359                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2360                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2361              $C$DW$214       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$22)
    2363                      .dwattr $C$DW$214, DW_AT_name("PDINHIBR2")
    2364                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_PDINHIBR2")
    2365                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2366                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2367              $C$DW$215       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$22)
    2369                      .dwattr $C$DW$215, DW_AT_name("PDINHIBR3")
    2370                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_PDINHIBR3")
    2371                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2372                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2373              $C$DW$216       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
    2375                      .dwattr $C$DW$216, DW_AT_name("DMA0CESR1")
    2376                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DMA0CESR1")
    2377                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2378                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2379              $C$DW$217       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$22)
    2381                      .dwattr $C$DW$217, DW_AT_name("DMA0CESR2")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   50

    2382                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_DMA0CESR2")
    2383                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2384                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2385              $C$DW$218       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$22)
    2387                      .dwattr $C$DW$218, DW_AT_name("DMA1CESR1")
    2388                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_DMA1CESR1")
    2389                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2390                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2391              $C$DW$219       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
    2393                      .dwattr $C$DW$219, DW_AT_name("DMA1CESR2")
    2394                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_DMA1CESR2")
    2395                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2396                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2397              $C$DW$220       .dwtag  DW_TAG_member
    2398                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$22)
    2399                      .dwattr $C$DW$220, DW_AT_name("SDRAMCCR")
    2400                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_SDRAMCCR")
    2401                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2402                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2403              $C$DW$221       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$22)
    2405                      .dwattr $C$DW$221, DW_AT_name("CCR2")
    2406                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_CCR2")
    2407                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2408                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2409              $C$DW$222       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$22)
    2411                      .dwattr $C$DW$222, DW_AT_name("CGCR1")
    2412                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_CGCR1")
    2413                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2414                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2415              $C$DW$223       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$22)
    2417                      .dwattr $C$DW$223, DW_AT_name("CGICR")
    2418                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_CGICR")
    2419                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2420                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2421              $C$DW$224       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$22)
    2423                      .dwattr $C$DW$224, DW_AT_name("CGCR2")
    2424                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_CGCR2")
    2425                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2426                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2427              $C$DW$225       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$22)
    2429                      .dwattr $C$DW$225, DW_AT_name("CGOCR")
    2430                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_CGOCR")
    2431                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2432                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2433              $C$DW$226       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$22)
    2435                      .dwattr $C$DW$226, DW_AT_name("CCSSR")
    2436                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_CCSSR")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   51

    2437                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2438                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2439              $C$DW$227       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$22)
    2441                      .dwattr $C$DW$227, DW_AT_name("RSVD3")
    2442                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_RSVD3")
    2443                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2444                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2445              $C$DW$228       .dwtag  DW_TAG_member
    2446                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$22)
    2447                      .dwattr $C$DW$228, DW_AT_name("ECDR")
    2448                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_ECDR")
    2449                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2450                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2451              $C$DW$229       .dwtag  DW_TAG_member
    2452                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$22)
    2453                      .dwattr $C$DW$229, DW_AT_name("RSVD4")
    2454                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_RSVD4")
    2455                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2456                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2457              $C$DW$230       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$22)
    2459                      .dwattr $C$DW$230, DW_AT_name("RAMSLPMDCNTLR1")
    2460                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2461                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2462                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2463              $C$DW$231       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$22)
    2465                      .dwattr $C$DW$231, DW_AT_name("RSVD5")
    2466                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_RSVD5")
    2467                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2468                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2469              $C$DW$232       .dwtag  DW_TAG_member
    2470                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$22)
    2471                      .dwattr $C$DW$232, DW_AT_name("RAMSLPMDCNTLR2")
    2472                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2473                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2474                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2475              $C$DW$233       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$22)
    2477                      .dwattr $C$DW$233, DW_AT_name("RAMSLPMDCNTLR3")
    2478                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2479                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2480                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2481              $C$DW$234       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$22)
    2483                      .dwattr $C$DW$234, DW_AT_name("RAMSLPMDCNTLR4")
    2484                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2485                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2486                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2487              $C$DW$235       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$22)
    2489                      .dwattr $C$DW$235, DW_AT_name("RAMSLPMDCNTLR5")
    2490                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2491                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   52

    2492                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2493              $C$DW$236       .dwtag  DW_TAG_member
    2494                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$24)
    2495                      .dwattr $C$DW$236, DW_AT_name("RSVD6")
    2496                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_RSVD6")
    2497                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2498                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2499              $C$DW$237       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$22)
    2501                      .dwattr $C$DW$237, DW_AT_name("DMAIFR")
    2502                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_DMAIFR")
    2503                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2504                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2505              $C$DW$238       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$22)
    2507                      .dwattr $C$DW$238, DW_AT_name("DMAIER")
    2508                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_DMAIER")
    2509                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2510                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2511              $C$DW$239       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$22)
    2513                      .dwattr $C$DW$239, DW_AT_name("USBSCR")
    2514                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_USBSCR")
    2515                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2516                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2517              $C$DW$240       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$22)
    2519                      .dwattr $C$DW$240, DW_AT_name("ESCR")
    2520                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_ESCR")
    2521                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2522                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2523              $C$DW$241       .dwtag  DW_TAG_member
    2524                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$24)
    2525                      .dwattr $C$DW$241, DW_AT_name("RSVD7")
    2526                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_RSVD7")
    2527                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2528                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2529              $C$DW$242       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$22)
    2531                      .dwattr $C$DW$242, DW_AT_name("DMA2CESR1")
    2532                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_DMA2CESR1")
    2533                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2534                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2535              $C$DW$243       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$22)
    2537                      .dwattr $C$DW$243, DW_AT_name("DMA2CESR2")
    2538                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_DMA2CESR2")
    2539                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2540                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2541              $C$DW$244       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$22)
    2543                      .dwattr $C$DW$244, DW_AT_name("DMA3CESR1")
    2544                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_DMA3CESR1")
    2545                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2546                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   53

    2547              $C$DW$245       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$22)
    2549                      .dwattr $C$DW$245, DW_AT_name("DMA3CESR2")
    2550                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_DMA3CESR2")
    2551                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2552                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2553              $C$DW$246       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$22)
    2555                      .dwattr $C$DW$246, DW_AT_name("CLKSTOP")
    2556                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_CLKSTOP")
    2557                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2558                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2559              $C$DW$247       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$25)
    2561                      .dwattr $C$DW$247, DW_AT_name("RSVD8")
    2562                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_RSVD8")
    2563                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2564                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2565              $C$DW$248       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$22)
    2567                      .dwattr $C$DW$248, DW_AT_name("DIEIDR0")
    2568                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_DIEIDR0")
    2569                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2570                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2571              $C$DW$249       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    2573                      .dwattr $C$DW$249, DW_AT_name("DIEIDR1")
    2574                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_DIEIDR1")
    2575                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2576                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2577              $C$DW$250       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
    2579                      .dwattr $C$DW$250, DW_AT_name("DIEIDR2")
    2580                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_DIEIDR2")
    2581                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2582                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2583              $C$DW$251       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$22)
    2585                      .dwattr $C$DW$251, DW_AT_name("DIEIDR3")
    2586                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_DIEIDR3")
    2587                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2588                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2589              $C$DW$252       .dwtag  DW_TAG_member
    2590                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    2591                      .dwattr $C$DW$252, DW_AT_name("DIEIDR4")
    2592                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_DIEIDR4")
    2593                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2594                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2595              $C$DW$253       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$22)
    2597                      .dwattr $C$DW$253, DW_AT_name("DIEIDR5")
    2598                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_DIEIDR5")
    2599                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2600                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2601              $C$DW$254       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   54

    2602                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$22)
    2603                      .dwattr $C$DW$254, DW_AT_name("DIEIDR6")
    2604                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_DIEIDR6")
    2605                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2606                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2607              $C$DW$255       .dwtag  DW_TAG_member
    2608                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$22)
    2609                      .dwattr $C$DW$255, DW_AT_name("DIEIDR7")
    2610                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_DIEIDR7")
    2611                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2612                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2613                      .dwendtag $C$DW$T$26
    2614              
    2615              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2616                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$26)
    2617                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2618              $C$DW$256       .dwtag  DW_TAG_TI_far_type
    2619                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$30)
    2620              $C$DW$257       .dwtag  DW_TAG_TI_ioport_type
    2621                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$256)
    2622              $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    2623                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$257)
    2624              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    2625                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    2626                      .dwattr $C$DW$T$32, DW_AT_address_class(0x10)
    2627              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2628                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2629                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2630              
    2631              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2632                      .dwattr $C$DW$T$34, DW_AT_name("PLL_Obj")
    2633                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    2634              $C$DW$258       .dwtag  DW_TAG_member
    2635                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$28)
    2636                      .dwattr $C$DW$258, DW_AT_name("pllConfig")
    2637                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_pllConfig")
    2638                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2639                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2640              $C$DW$259       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$29)
    2642                      .dwattr $C$DW$259, DW_AT_name("instId")
    2643                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_instId")
    2644                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2645                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$260       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$33)
    2648                      .dwattr $C$DW$260, DW_AT_name("sysAddr")
    2649                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_sysAddr")
    2650                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2651                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2652                      .dwendtag $C$DW$T$34
    2653              
    2654              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    2655                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    2656                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:32 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   55

    2657              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2658                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2659                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    2660              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    2661                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$34)
    2662                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    2663              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    2664                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2665                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2666              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2667                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    2668              $C$DW$261       .dwtag  DW_TAG_TI_far_type
    2669                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$3)
    2670              $C$DW$T$40      .dwtag  DW_TAG_const_type
    2671                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$261)
    2672              
    2673              $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    2674                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2675              $C$DW$262       .dwtag  DW_TAG_formal_parameter
    2676                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$3)
    2677                      .dwendtag $C$DW$T$43
    2678              
    2679              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    2680                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2681                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    2682              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    2683                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2684                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2685              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2686                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2687                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2688                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2689              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2690                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2691                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2692                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2693              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2694                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2695                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2696                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2697              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    2698                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$6)
    2699                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2700              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2701                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2702                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2703                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
