TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    3888              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 15 05:24:36 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2886                      .dwattr $C$DW$254, DW_AT_low_pc($C$DW$L$_LED_TaskGreen$2$B)
    2887                      .dwattr $C$DW$254, DW_AT_high_pc($C$DW$L$_LED_TaskGreen$2$E)
    2888              $C$DW$255       .dwtag  DW_TAG_TI_loop_range
    2889                      .dwattr $C$DW$255, DW_AT_low_pc($C$DW$L$_LED_TaskGreen$3$B)
    2890                      .dwattr $C$DW$255, DW_AT_high_pc($C$DW$L$_LED_TaskGreen$3$E)
    2891              $C$DW$256       .dwtag  DW_TAG_TI_loop_range
    2892                      .dwattr $C$DW$256, DW_AT_low_pc($C$DW$L$_LED_TaskGreen$5$B)
    2893                      .dwattr $C$DW$256, DW_AT_high_pc($C$DW$L$_LED_TaskGreen$5$E)
    2894              $C$DW$257       .dwtag  DW_TAG_TI_loop_range
    2895                      .dwattr $C$DW$257, DW_AT_low_pc($C$DW$L$_LED_TaskGreen$4$B)
    2896                      .dwattr $C$DW$257, DW_AT_high_pc($C$DW$L$_LED_TaskGreen$4$E)
    2897                      .dwendtag $C$DW$253
    2898              
    2899                      .dwattr $C$DW$246, DW_AT_TI_end_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    2900                      .dwattr $C$DW$246, DW_AT_TI_end_line(0x4ca)
    2901                      .dwattr $C$DW$246, DW_AT_TI_end_column(0x01)
    2902                      .dwendentry
    2903                      .dwendtag $C$DW$246
    2904              
    2905              ;*******************************************************************************
    2906              ;* FAR STRINGS                                                                 *
    2907              ;*******************************************************************************
    2908 000000               .sect   ".const:.string"
    2909                      .align  2
    2910 000000 0042  $C$FSL1:        .string "BlueLED",0
         000001 006C 
         000002 0075 
         000003 0065 
         000004 004C 
         000005 0045 
         000006 0044 
         000007 0000 
    2911                      .align  2
    2912 000008 0052  $C$FSL2:        .string "RedLED",0
         000009 0065 
         00000a 0064 
         00000b 004C 
         00000c 0045 
         00000d 0044 
         00000e 0000 
    2913                      .align  2
    2914 000010 0058  $C$FSL3:        .string "XFLEDtsk",0
         000011 0046 
         000012 004C 
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   62

         000013 0045 
         000014 0044 
         000015 0074 
         000016 0073 
         000017 006B 
         000018 0000 
    2915                      .align  2
    2916 00001a 0047  $C$FSL4:        .string "GRNLED",0
         00001b 0052 
         00001c 004E 
         00001d 004C 
         00001e 0045 
         00001f 0044 
         000020 0000 
    2917              ;******************************************************************************
    2918              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    2919              ;******************************************************************************
    2920                      .global _EZDSP5535_init
    2921                      .global _EZDSP5535_waitusec
    2922                      .global _xTaskCreate
    2923                      .global _vTaskStartScheduler
    2924                      .global _xQueueGenericSend
    2925                      .global _xQueueSemaphoreTake
    2926                      .global _xQueueGenericCreate
    2927                      .global _reset_RTC
    2928                      .global _enable_i2s0
    2929                      .global _set_i2s0_slave
    2930                      .global _set_dma0_ch0_i2s0_Lout
    2931                      .global _set_dma0_ch1_i2s0_Rout
    2932                      .global _set_dma0_ch0_stop
    2933                      .global _set_dma0_ch1_stop
    2934                      .global _EZDSP5535_LED_init
    2935                      .global _EZDSP5535_LED_on
    2936                      .global _EZDSP5535_LED_off
    2937                      .global _EZDSP5535_XF_toggle
    2938                      .global _EZDSP5535_GPIO_init
    2939                      .global _EZDSP5535_GPIO_setOutput
    2940                      .global _EZDSP5535_SAR_init
    2941                      .global _EZDSP5535_SAR_getKey
    2942                      .global _PLL_init
    2943                      .global _PLL_config
    2944                      .global _PLL_reset
    2945                      .global _mem_test
    2946                      .global _oled_test
    2947                      .global _spiflash_test
    2948                      .global _RTC_reset
    2949                      .global _fTimer
    2950                      .global _Flag_RTC
    2951                      .global _Conunt_RTC
    2952                      .global _VECSTART
    2953              
    2954              ;*******************************************************************************
    2955              ;* TYPE INFORMATION                                                            *
    2956              ;*******************************************************************************
    2957              
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   63

    2958              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2959                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    2960              $C$DW$258       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$21)
    2962                      .dwattr $C$DW$258, DW_AT_name("PLLCNTL1")
    2963                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_PLLCNTL1")
    2964                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2965                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2966              $C$DW$259       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$21)
    2968                      .dwattr $C$DW$259, DW_AT_name("PLLINCNTL")
    2969                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_PLLINCNTL")
    2970                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2971                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2972              $C$DW$260       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$21)
    2974                      .dwattr $C$DW$260, DW_AT_name("PLLCNTL2")
    2975                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_PLLCNTL2")
    2976                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2977                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2978              $C$DW$261       .dwtag  DW_TAG_member
    2979                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$21)
    2980                      .dwattr $C$DW$261, DW_AT_name("PLLOUTCNTL")
    2981                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    2982                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2983                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2984                      .dwendtag $C$DW$T$22
    2985              
    2986              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    2987                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    2988                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2989              $C$DW$262       .dwtag  DW_TAG_TI_far_type
    2990                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$28)
    2991              $C$DW$T$36      .dwtag  DW_TAG_const_type
    2992                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$262)
    2993              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2994                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    2995                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    2996              
    2997              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2998                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x48)
    2999              $C$DW$263       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$23)
    3001                      .dwattr $C$DW$263, DW_AT_name("EBSR")
    3002                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_EBSR")
    3003                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3004                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3005              $C$DW$264       .dwtag  DW_TAG_member
    3006                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$23)
    3007                      .dwattr $C$DW$264, DW_AT_name("RSVD0")
    3008                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_RSVD0")
    3009                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3010                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3011              $C$DW$265       .dwtag  DW_TAG_member
    3012                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   64

    3013                      .dwattr $C$DW$265, DW_AT_name("PCGCR1")
    3014                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_PCGCR1")
    3015                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3016                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3017              $C$DW$266       .dwtag  DW_TAG_member
    3018                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$23)
    3019                      .dwattr $C$DW$266, DW_AT_name("PCGCR2")
    3020                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_PCGCR2")
    3021                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3022                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3023              $C$DW$267       .dwtag  DW_TAG_member
    3024                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$23)
    3025                      .dwattr $C$DW$267, DW_AT_name("PSRCR")
    3026                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_PSRCR")
    3027                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3028                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3029              $C$DW$268       .dwtag  DW_TAG_member
    3030                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$23)
    3031                      .dwattr $C$DW$268, DW_AT_name("PRCR")
    3032                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_PRCR")
    3033                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3034                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3035              $C$DW$269       .dwtag  DW_TAG_member
    3036                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$24)
    3037                      .dwattr $C$DW$269, DW_AT_name("RSVD1")
    3038                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_RSVD1")
    3039                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3040                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3041              $C$DW$270       .dwtag  DW_TAG_member
    3042                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$23)
    3043                      .dwattr $C$DW$270, DW_AT_name("TIAFR")
    3044                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_TIAFR")
    3045                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3046                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3047              $C$DW$271       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$23)
    3049                      .dwattr $C$DW$271, DW_AT_name("RSVD2")
    3050                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_RSVD2")
    3051                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3052                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3053              $C$DW$272       .dwtag  DW_TAG_member
    3054                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$23)
    3055                      .dwattr $C$DW$272, DW_AT_name("ODSCR")
    3056                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_ODSCR")
    3057                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3058                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3059              $C$DW$273       .dwtag  DW_TAG_member
    3060                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$23)
    3061                      .dwattr $C$DW$273, DW_AT_name("PDINHIBR1")
    3062                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_PDINHIBR1")
    3063                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3064                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3065              $C$DW$274       .dwtag  DW_TAG_member
    3066                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$23)
    3067                      .dwattr $C$DW$274, DW_AT_name("PDINHIBR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   65

    3068                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_PDINHIBR2")
    3069                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3070                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3071              $C$DW$275       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$23)
    3073                      .dwattr $C$DW$275, DW_AT_name("PDINHIBR3")
    3074                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_PDINHIBR3")
    3075                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3076                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3077              $C$DW$276       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$23)
    3079                      .dwattr $C$DW$276, DW_AT_name("DMA0CESR1")
    3080                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_DMA0CESR1")
    3081                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3082                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3083              $C$DW$277       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$23)
    3085                      .dwattr $C$DW$277, DW_AT_name("DMA0CESR2")
    3086                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_DMA0CESR2")
    3087                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3088                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3089              $C$DW$278       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$23)
    3091                      .dwattr $C$DW$278, DW_AT_name("DMA1CESR1")
    3092                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_DMA1CESR1")
    3093                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3094                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3095              $C$DW$279       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$23)
    3097                      .dwattr $C$DW$279, DW_AT_name("DMA1CESR2")
    3098                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_DMA1CESR2")
    3099                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3100                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3101              $C$DW$280       .dwtag  DW_TAG_member
    3102                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$23)
    3103                      .dwattr $C$DW$280, DW_AT_name("SDRAMCCR")
    3104                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_SDRAMCCR")
    3105                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3106                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3107              $C$DW$281       .dwtag  DW_TAG_member
    3108                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$23)
    3109                      .dwattr $C$DW$281, DW_AT_name("CCR2")
    3110                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_CCR2")
    3111                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3112                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3113              $C$DW$282       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$23)
    3115                      .dwattr $C$DW$282, DW_AT_name("CGCR1")
    3116                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_CGCR1")
    3117                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3118                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3119              $C$DW$283       .dwtag  DW_TAG_member
    3120                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$23)
    3121                      .dwattr $C$DW$283, DW_AT_name("CGICR")
    3122                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_CGICR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   66

    3123                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3124                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3125              $C$DW$284       .dwtag  DW_TAG_member
    3126                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$23)
    3127                      .dwattr $C$DW$284, DW_AT_name("CGCR2")
    3128                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_CGCR2")
    3129                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3130                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3131              $C$DW$285       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$23)
    3133                      .dwattr $C$DW$285, DW_AT_name("CGOCR")
    3134                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_CGOCR")
    3135                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3136                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3137              $C$DW$286       .dwtag  DW_TAG_member
    3138                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$23)
    3139                      .dwattr $C$DW$286, DW_AT_name("CCSSR")
    3140                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_CCSSR")
    3141                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3142                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3143              $C$DW$287       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$23)
    3145                      .dwattr $C$DW$287, DW_AT_name("RSVD3")
    3146                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RSVD3")
    3147                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3148                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3149              $C$DW$288       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$23)
    3151                      .dwattr $C$DW$288, DW_AT_name("ECDR")
    3152                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_ECDR")
    3153                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3154                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3155              $C$DW$289       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$23)
    3157                      .dwattr $C$DW$289, DW_AT_name("RSVD4")
    3158                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_RSVD4")
    3159                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    3160                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3161              $C$DW$290       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$23)
    3163                      .dwattr $C$DW$290, DW_AT_name("RAMSLPMDCNTLR1")
    3164                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    3165                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3166                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3167              $C$DW$291       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$23)
    3169                      .dwattr $C$DW$291, DW_AT_name("RSVD5")
    3170                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_RSVD5")
    3171                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3172                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3173              $C$DW$292       .dwtag  DW_TAG_member
    3174                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$23)
    3175                      .dwattr $C$DW$292, DW_AT_name("RAMSLPMDCNTLR2")
    3176                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    3177                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   67

    3178                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3179              $C$DW$293       .dwtag  DW_TAG_member
    3180                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$23)
    3181                      .dwattr $C$DW$293, DW_AT_name("RAMSLPMDCNTLR3")
    3182                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    3183                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    3184                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3185              $C$DW$294       .dwtag  DW_TAG_member
    3186                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$23)
    3187                      .dwattr $C$DW$294, DW_AT_name("RAMSLPMDCNTLR4")
    3188                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    3189                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3190                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3191              $C$DW$295       .dwtag  DW_TAG_member
    3192                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$23)
    3193                      .dwattr $C$DW$295, DW_AT_name("RAMSLPMDCNTLR5")
    3194                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    3195                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    3196                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3197              $C$DW$296       .dwtag  DW_TAG_member
    3198                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$25)
    3199                      .dwattr $C$DW$296, DW_AT_name("RSVD6")
    3200                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_RSVD6")
    3201                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3202                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3203              $C$DW$297       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$23)
    3205                      .dwattr $C$DW$297, DW_AT_name("DMAIFR")
    3206                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_DMAIFR")
    3207                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3208                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3209              $C$DW$298       .dwtag  DW_TAG_member
    3210                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$23)
    3211                      .dwattr $C$DW$298, DW_AT_name("DMAIER")
    3212                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_DMAIER")
    3213                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3214                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3215              $C$DW$299       .dwtag  DW_TAG_member
    3216                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$23)
    3217                      .dwattr $C$DW$299, DW_AT_name("USBSCR")
    3218                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_USBSCR")
    3219                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3220                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3221              $C$DW$300       .dwtag  DW_TAG_member
    3222                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$23)
    3223                      .dwattr $C$DW$300, DW_AT_name("ESCR")
    3224                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_ESCR")
    3225                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    3226                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3227              $C$DW$301       .dwtag  DW_TAG_member
    3228                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$25)
    3229                      .dwattr $C$DW$301, DW_AT_name("RSVD7")
    3230                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_RSVD7")
    3231                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3232                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   68

    3233              $C$DW$302       .dwtag  DW_TAG_member
    3234                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$23)
    3235                      .dwattr $C$DW$302, DW_AT_name("DMA2CESR1")
    3236                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_DMA2CESR1")
    3237                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3238                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3239              $C$DW$303       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$23)
    3241                      .dwattr $C$DW$303, DW_AT_name("DMA2CESR2")
    3242                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_DMA2CESR2")
    3243                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    3244                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3245              $C$DW$304       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$23)
    3247                      .dwattr $C$DW$304, DW_AT_name("DMA3CESR1")
    3248                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_DMA3CESR1")
    3249                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3250                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3251              $C$DW$305       .dwtag  DW_TAG_member
    3252                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$23)
    3253                      .dwattr $C$DW$305, DW_AT_name("DMA3CESR2")
    3254                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_DMA3CESR2")
    3255                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    3256                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3257              $C$DW$306       .dwtag  DW_TAG_member
    3258                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$23)
    3259                      .dwattr $C$DW$306, DW_AT_name("CLKSTOP")
    3260                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_CLKSTOP")
    3261                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3262                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3263              $C$DW$307       .dwtag  DW_TAG_member
    3264                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$26)
    3265                      .dwattr $C$DW$307, DW_AT_name("RSVD8")
    3266                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_RSVD8")
    3267                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    3268                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3269              $C$DW$308       .dwtag  DW_TAG_member
    3270                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$23)
    3271                      .dwattr $C$DW$308, DW_AT_name("DIEIDR0")
    3272                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_DIEIDR0")
    3273                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3274                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3275              $C$DW$309       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$23)
    3277                      .dwattr $C$DW$309, DW_AT_name("DIEIDR1")
    3278                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_DIEIDR1")
    3279                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3280                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3281              $C$DW$310       .dwtag  DW_TAG_member
    3282                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$23)
    3283                      .dwattr $C$DW$310, DW_AT_name("DIEIDR2")
    3284                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_DIEIDR2")
    3285                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3286                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3287              $C$DW$311       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   69

    3288                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$23)
    3289                      .dwattr $C$DW$311, DW_AT_name("DIEIDR3")
    3290                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_DIEIDR3")
    3291                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    3292                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3293              $C$DW$312       .dwtag  DW_TAG_member
    3294                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$23)
    3295                      .dwattr $C$DW$312, DW_AT_name("DIEIDR4")
    3296                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_DIEIDR4")
    3297                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3298                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3299              $C$DW$313       .dwtag  DW_TAG_member
    3300                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$23)
    3301                      .dwattr $C$DW$313, DW_AT_name("DIEIDR5")
    3302                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_DIEIDR5")
    3303                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3304                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3305              $C$DW$314       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$23)
    3307                      .dwattr $C$DW$314, DW_AT_name("DIEIDR6")
    3308                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_DIEIDR6")
    3309                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3310                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3311              $C$DW$315       .dwtag  DW_TAG_member
    3312                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$23)
    3313                      .dwattr $C$DW$315, DW_AT_name("DIEIDR7")
    3314                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_DIEIDR7")
    3315                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    3316                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3317                      .dwendtag $C$DW$T$27
    3318              
    3319              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    3320                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    3321                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3322              $C$DW$316       .dwtag  DW_TAG_TI_far_type
    3323                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$31)
    3324              $C$DW$317       .dwtag  DW_TAG_TI_ioport_type
    3325                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$316)
    3326              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    3327                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$317)
    3328              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    3329                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3330                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    3331              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    3332                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    3333                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    3334              
    3335              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3336                      .dwattr $C$DW$T$35, DW_AT_name("PLL_Obj")
    3337                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    3338              $C$DW$318       .dwtag  DW_TAG_member
    3339                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$29)
    3340                      .dwattr $C$DW$318, DW_AT_name("pllConfig")
    3341                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_pllConfig")
    3342                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   70

    3343                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3344              $C$DW$319       .dwtag  DW_TAG_member
    3345                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$30)
    3346                      .dwattr $C$DW$319, DW_AT_name("instId")
    3347                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_instId")
    3348                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3349                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3350              $C$DW$320       .dwtag  DW_TAG_member
    3351                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$34)
    3352                      .dwattr $C$DW$320, DW_AT_name("sysAddr")
    3353                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_sysAddr")
    3354                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3355                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3356                      .dwendtag $C$DW$T$35
    3357              
    3358              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    3359                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    3360                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3361              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    3362                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3363                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    3364              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    3365                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$35)
    3366                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    3367              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    3368                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3369                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3370              
    3371              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3372                      .dwattr $C$DW$T$19, DW_AT_name("QueueDefinition")
    3373                      .dwattr $C$DW$T$19, DW_AT_declaration
    3374                      .dwendtag $C$DW$T$19
    3375              
    3376              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    3377                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$19)
    3378                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    3379              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    3380                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3381                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3382              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreHandle_t")
    3383                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    3384                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3385              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3386                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    3387              $C$DW$321       .dwtag  DW_TAG_TI_far_type
    3388                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$3)
    3389              $C$DW$T$50      .dwtag  DW_TAG_const_type
    3390                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$321)
    3391              
    3392              $C$DW$T$53      .dwtag  DW_TAG_subroutine_type
    3393                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3394              $C$DW$322       .dwtag  DW_TAG_formal_parameter
    3395                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$3)
    3396                      .dwendtag $C$DW$T$53
    3397              
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:24:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   71

    3398              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    3399                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    3400                      .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    3401              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("TaskFunction_t")
    3402                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3403                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3404              $C$DW$323       .dwtag  DW_TAG_TI_far_type
    3405              $C$DW$T$58      .dwtag  DW_TAG_const_type
    3406                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$323)
    3407              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    3408                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3409                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
