TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE    1

    1596              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 23:29:50 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     607                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
     608                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     609              
     610              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
     611                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     612              $C$DW$54        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_NO_DISCHARGE"), DW_AT_const_value(0x00)
     613              $C$DW$55        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_DISCHARGE_ARRAY"), DW_AT_const_value(0x01)
     614                      .dwendtag $C$DW$T$31
     615              
     616              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarMultiCh")
     617                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
     618                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     619              
     620              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
     621                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     622              $C$DW$56        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_REF_0_8v"), DW_AT_const_value(0x00)
     623              $C$DW$57        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_REF_1v"), DW_AT_const_value(0x01)
     624              $C$DW$58        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_REF_VIN"), DW_AT_const_value(0x02)
     625                      .dwendtag $C$DW$T$33
     626              
     627              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RefVoltage")
     628                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
     629                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     630              
     631              $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
     632                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
     633              $C$DW$59        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_0"), DW_AT_const_value(0x00)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   14

     634              $C$DW$60        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_1"), DW_AT_const_value(0x01)
     635              $C$DW$61        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_2"), DW_AT_const_value(0x02)
     636              $C$DW$62        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_3"), DW_AT_const_value(0x03)
     637              $C$DW$63        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_4"), DW_AT_const_value(0x04)
     638              $C$DW$64        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_5"), DW_AT_const_value(0x05)
     639              $C$DW$65        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_NO_CHAN"), DW_AT_const_value(0x06)
     640                      .dwendtag $C$DW$T$40
     641              
     642              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanSel")
     643                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
     644                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     645              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
     646                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
     647                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
     648              
     649              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
     650                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
     651              $C$DW$66        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CONTINUOUS_CONVERSION"), DW_AT_const_value(0x0
     652              $C$DW$67        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_SINGLE_CONVERSION"), DW_AT_const_value(0x01)
     653                      .dwendtag $C$DW$T$43
     654              
     655              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanCyc")
     656                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
     657                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     658              
     659              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
     660                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
     661              $C$DW$68        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_KEYPAD_MEAS"), DW_AT_const_value(0x00)
     662              $C$DW$69        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_BATTRY_MEAS"), DW_AT_const_value(0x01)
     663              $C$DW$70        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_INT_VOLT_MEAS"), DW_AT_const_value(0x02)
     664              $C$DW$71        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_VOLUME_CTRL"), DW_AT_const_value(0x03)
     665              $C$DW$72        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_XAXIS"), DW_AT_const_value(0x04)
     666              $C$DW$73        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_YAXIS"), DW_AT_const_value(0x05)
     667              $C$DW$74        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_PEN_PRESS_DOWN"), DW_AT_const_value(0x06)
     668                      .dwendtag $C$DW$T$45
     669              
     670              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SARMeasParam")
     671                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
     672                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     673              
     674              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     675                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1b)
     676              $C$DW$75        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
     678                      .dwattr $C$DW$75, DW_AT_name("RSVD0")
     679                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_RSVD0")
     680                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     682              $C$DW$76        .dwtag  DW_TAG_member
     683                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
     684                      .dwattr $C$DW$76, DW_AT_name("USBLDOCNTL")
     685                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_USBLDOCNTL")
     686                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     687                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     688              $C$DW$77        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   15

     689                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
     690                      .dwattr $C$DW$77, DW_AT_name("RSVD1")
     691                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_RSVD1")
     692                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     693                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     694              $C$DW$78        .dwtag  DW_TAG_member
     695                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
     696                      .dwattr $C$DW$78, DW_AT_name("SARCTRL")
     697                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_SARCTRL")
     698                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     699                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     700              $C$DW$79        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
     702                      .dwattr $C$DW$79, DW_AT_name("RSVD2")
     703                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_RSVD2")
     704                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     705                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     706              $C$DW$80        .dwtag  DW_TAG_member
     707                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
     708                      .dwattr $C$DW$80, DW_AT_name("SARDATA")
     709                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_SARDATA")
     710                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     711                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     712              $C$DW$81        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
     714                      .dwattr $C$DW$81, DW_AT_name("RSVD3")
     715                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_RSVD3")
     716                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     717                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     718              $C$DW$82        .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
     720                      .dwattr $C$DW$82, DW_AT_name("SARCLKCTRL")
     721                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_SARCLKCTRL")
     722                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     723                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     724              $C$DW$83        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
     726                      .dwattr $C$DW$83, DW_AT_name("RSVD4")
     727                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_RSVD4")
     728                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     729                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     730              $C$DW$84        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
     732                      .dwattr $C$DW$84, DW_AT_name("SARPINCTRL")
     733                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_SARPINCTRL")
     734                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     735                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     736              $C$DW$85        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
     738                      .dwattr $C$DW$85, DW_AT_name("RSVD5")
     739                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_RSVD5")
     740                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     741                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     742              $C$DW$86        .dwtag  DW_TAG_member
     743                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   16

     744                      .dwattr $C$DW$86, DW_AT_name("SARGPOCTRL")
     745                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_SARGPOCTRL")
     746                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     747                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     748                      .dwendtag $C$DW$T$23
     749              
     750              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AnactrlRegs")
     751                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     752                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     753              $C$DW$87        .dwtag  DW_TAG_TI_far_type
     754                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$24)
     755              $C$DW$88        .dwtag  DW_TAG_TI_ioport_type
     756                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$87)
     757              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
     758                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$88)
     759              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
     760                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
     761                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
     762              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarRegsOvly")
     763                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     764                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     765              
     766              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     767                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x03)
     768              $C$DW$89        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$27)
     770                      .dwattr $C$DW$89, DW_AT_name("baseAddr")
     771                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_baseAddr")
     772                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     773                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     774              $C$DW$90        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     776                      .dwattr $C$DW$90, DW_AT_name("chanNo")
     777                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_chanNo")
     778                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     779                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     780              $C$DW$91        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$91, DW_AT_name("status")
     783                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_status")
     784                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     785                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     786                      .dwendtag $C$DW$T$28
     787              
     788              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarHandleObj")
     789                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$28)
     790                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
     791              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
     792                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
     793                      .dwattr $C$DW$T$48, DW_AT_address_class(0x17)
     794              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("SAR_Handle")
     795                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
     796                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
     797              
     798              $C$DW$T$35      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   17

     799                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
     800              $C$DW$92        .dwtag  DW_TAG_member
     801                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     802                      .dwattr $C$DW$92, DW_AT_name("SysClkDiv")
     803                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_SysClkDiv")
     804                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     805                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     806              $C$DW$93        .dwtag  DW_TAG_member
     807                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$30)
     808                      .dwattr $C$DW$93, DW_AT_name("OpMode")
     809                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_OpMode")
     810                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     811                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     812              $C$DW$94        .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$32)
     814                      .dwattr $C$DW$94, DW_AT_name("MultiCh")
     815                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_MultiCh")
     816                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     817                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     818              $C$DW$95        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$34)
     820                      .dwattr $C$DW$95, DW_AT_name("RefVoltage")
     821                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_RefVoltage")
     822                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     823                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     824                      .dwendtag $C$DW$T$35
     825              
     826              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChSetup")
     827                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$35)
     828                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
     829              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
     830                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
     831                      .dwattr $C$DW$T$51, DW_AT_address_class(0x17)
     832              
     833              $C$DW$T$39      .dwtag  DW_TAG_structure_type
     834                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x48)
     835              $C$DW$96        .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
     837                      .dwattr $C$DW$96, DW_AT_name("EBSR")
     838                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_EBSR")
     839                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     840                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     841              $C$DW$97        .dwtag  DW_TAG_member
     842                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
     843                      .dwattr $C$DW$97, DW_AT_name("RSVD0")
     844                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_RSVD0")
     845                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     846                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     847              $C$DW$98        .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
     849                      .dwattr $C$DW$98, DW_AT_name("PCGCR1")
     850                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PCGCR1")
     851                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     852                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$99        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   18

     854                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
     855                      .dwattr $C$DW$99, DW_AT_name("PCGCR2")
     856                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_PCGCR2")
     857                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     858                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     859              $C$DW$100       .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
     861                      .dwattr $C$DW$100, DW_AT_name("PSRCR")
     862                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PSRCR")
     863                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     864                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     865              $C$DW$101       .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
     867                      .dwattr $C$DW$101, DW_AT_name("PRCR")
     868                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_PRCR")
     869                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     870                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     871              $C$DW$102       .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$36)
     873                      .dwattr $C$DW$102, DW_AT_name("RSVD1")
     874                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_RSVD1")
     875                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     876                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$103       .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
     879                      .dwattr $C$DW$103, DW_AT_name("TIAFR")
     880                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_TIAFR")
     881                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     882                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$104       .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
     885                      .dwattr $C$DW$104, DW_AT_name("RSVD2")
     886                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_RSVD2")
     887                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     888                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$105       .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
     891                      .dwattr $C$DW$105, DW_AT_name("ODSCR")
     892                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ODSCR")
     893                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     894                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     895              $C$DW$106       .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
     897                      .dwattr $C$DW$106, DW_AT_name("PDINHIBR1")
     898                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_PDINHIBR1")
     899                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     900                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$107       .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
     903                      .dwattr $C$DW$107, DW_AT_name("PDINHIBR2")
     904                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PDINHIBR2")
     905                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     906                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     907              $C$DW$108       .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   19

     909                      .dwattr $C$DW$108, DW_AT_name("PDINHIBR3")
     910                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PDINHIBR3")
     911                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     912                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     913              $C$DW$109       .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
     915                      .dwattr $C$DW$109, DW_AT_name("DMA0CESR1")
     916                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_DMA0CESR1")
     917                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     918                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     919              $C$DW$110       .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
     921                      .dwattr $C$DW$110, DW_AT_name("DMA0CESR2")
     922                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_DMA0CESR2")
     923                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     924                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     925              $C$DW$111       .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
     927                      .dwattr $C$DW$111, DW_AT_name("DMA1CESR1")
     928                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_DMA1CESR1")
     929                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     930                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     931              $C$DW$112       .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
     933                      .dwattr $C$DW$112, DW_AT_name("DMA1CESR2")
     934                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_DMA1CESR2")
     935                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     936                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     937              $C$DW$113       .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
     939                      .dwattr $C$DW$113, DW_AT_name("SDRAMCCR")
     940                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_SDRAMCCR")
     941                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     942                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     943              $C$DW$114       .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
     945                      .dwattr $C$DW$114, DW_AT_name("CCR2")
     946                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_CCR2")
     947                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     948                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$115       .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
     951                      .dwattr $C$DW$115, DW_AT_name("CGCR1")
     952                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_CGCR1")
     953                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     954                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     955              $C$DW$116       .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
     957                      .dwattr $C$DW$116, DW_AT_name("CGICR")
     958                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_CGICR")
     959                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
     960                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     961              $C$DW$117       .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
     963                      .dwattr $C$DW$117, DW_AT_name("CGCR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   20

     964                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_CGCR2")
     965                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     966                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     967              $C$DW$118       .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
     969                      .dwattr $C$DW$118, DW_AT_name("CGOCR")
     970                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_CGOCR")
     971                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
     972                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     973              $C$DW$119       .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
     975                      .dwattr $C$DW$119, DW_AT_name("CCSSR")
     976                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CCSSR")
     977                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     978                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     979              $C$DW$120       .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
     981                      .dwattr $C$DW$120, DW_AT_name("RSVD3")
     982                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_RSVD3")
     983                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
     984                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     985              $C$DW$121       .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
     987                      .dwattr $C$DW$121, DW_AT_name("ECDR")
     988                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ECDR")
     989                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     990                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     991              $C$DW$122       .dwtag  DW_TAG_member
     992                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
     993                      .dwattr $C$DW$122, DW_AT_name("RSVD4")
     994                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_RSVD4")
     995                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
     996                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     997              $C$DW$123       .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
     999                      .dwattr $C$DW$123, DW_AT_name("RAMSLPMDCNTLR1")
    1000                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1001                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1002                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$124       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    1005                      .dwattr $C$DW$124, DW_AT_name("RSVD5")
    1006                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_RSVD5")
    1007                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1008                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1009              $C$DW$125       .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1011                      .dwattr $C$DW$125, DW_AT_name("RAMSLPMDCNTLR2")
    1012                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1013                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1014                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$126       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1017                      .dwattr $C$DW$126, DW_AT_name("RAMSLPMDCNTLR3")
    1018                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   21

    1019                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1020                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$127       .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    1023                      .dwattr $C$DW$127, DW_AT_name("RAMSLPMDCNTLR4")
    1024                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1025                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1026                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1027              $C$DW$128       .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1029                      .dwattr $C$DW$128, DW_AT_name("RAMSLPMDCNTLR5")
    1030                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1031                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1032                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$129       .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$37)
    1035                      .dwattr $C$DW$129, DW_AT_name("RSVD6")
    1036                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_RSVD6")
    1037                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1038                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$130       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1041                      .dwattr $C$DW$130, DW_AT_name("DMAIFR")
    1042                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_DMAIFR")
    1043                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1044                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$131       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    1047                      .dwattr $C$DW$131, DW_AT_name("DMAIER")
    1048                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_DMAIER")
    1049                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1050                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1051              $C$DW$132       .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1053                      .dwattr $C$DW$132, DW_AT_name("USBSCR")
    1054                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_USBSCR")
    1055                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1056                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$133       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1059                      .dwattr $C$DW$133, DW_AT_name("ESCR")
    1060                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ESCR")
    1061                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1062                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1063              $C$DW$134       .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$37)
    1065                      .dwattr $C$DW$134, DW_AT_name("RSVD7")
    1066                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_RSVD7")
    1067                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1068                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1069              $C$DW$135       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1071                      .dwattr $C$DW$135, DW_AT_name("DMA2CESR1")
    1072                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_DMA2CESR1")
    1073                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   22

    1074                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1075              $C$DW$136       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    1077                      .dwattr $C$DW$136, DW_AT_name("DMA2CESR2")
    1078                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_DMA2CESR2")
    1079                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1080                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1081              $C$DW$137       .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1083                      .dwattr $C$DW$137, DW_AT_name("DMA3CESR1")
    1084                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_DMA3CESR1")
    1085                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1086                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1087              $C$DW$138       .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1089                      .dwattr $C$DW$138, DW_AT_name("DMA3CESR2")
    1090                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_DMA3CESR2")
    1091                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1092                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1093              $C$DW$139       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1095                      .dwattr $C$DW$139, DW_AT_name("CLKSTOP")
    1096                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_CLKSTOP")
    1097                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1098                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$140       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$38)
    1101                      .dwattr $C$DW$140, DW_AT_name("RSVD8")
    1102                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_RSVD8")
    1103                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1104                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$141       .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1107                      .dwattr $C$DW$141, DW_AT_name("DIEIDR0")
    1108                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_DIEIDR0")
    1109                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1110                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$142       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1113                      .dwattr $C$DW$142, DW_AT_name("DIEIDR1")
    1114                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_DIEIDR1")
    1115                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1116                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$143       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1119                      .dwattr $C$DW$143, DW_AT_name("DIEIDR2")
    1120                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_DIEIDR2")
    1121                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1122                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$144       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1125                      .dwattr $C$DW$144, DW_AT_name("DIEIDR3")
    1126                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_DIEIDR3")
    1127                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1128                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   23

    1129              $C$DW$145       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1131                      .dwattr $C$DW$145, DW_AT_name("DIEIDR4")
    1132                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_DIEIDR4")
    1133                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1134                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$146       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1137                      .dwattr $C$DW$146, DW_AT_name("DIEIDR5")
    1138                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_DIEIDR5")
    1139                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1140                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$147       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    1143                      .dwattr $C$DW$147, DW_AT_name("DIEIDR6")
    1144                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_DIEIDR6")
    1145                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1146                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1147              $C$DW$148       .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    1149                      .dwattr $C$DW$148, DW_AT_name("DIEIDR7")
    1150                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_DIEIDR7")
    1151                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1152                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1153                      .dwendtag $C$DW$T$39
    1154              
    1155              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1156                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$39)
    1157                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1158              $C$DW$149       .dwtag  DW_TAG_TI_far_type
    1159                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$52)
    1160              $C$DW$150       .dwtag  DW_TAG_TI_ioport_type
    1161                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$149)
    1162              $C$DW$T$53      .dwtag  DW_TAG_volatile_type
    1163                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$150)
    1164              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    1165                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1166                      .dwattr $C$DW$T$54, DW_AT_address_class(0x10)
    1167              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1168                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1169                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1170              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1171                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1172                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1173                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1174              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1175                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1176                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1177                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1178              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1179                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1180                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1181                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1182              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    1183                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$6)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
ezdsp5535_sar.asm                                                    PAGE   24

    1184                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1185              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1186                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1187                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1188                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1189              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1190                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1191                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1192                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1193              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1194                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$8)
    1195                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1196              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1197                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1198                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1199              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    1200                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$59)
    1201                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    1202              $C$DW$T$9       .dwtag  DW_TAG_base_type
