TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE    1

    1941              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 09 04:48:32 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1404                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1405              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1406                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1407                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1408                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1409              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("BaseType_t")
    1410                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    1411                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1412              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1413                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1414                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1415                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1416              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    1417                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    1418                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   32

    1419              $C$DW$125       .dwtag  DW_TAG_TI_far_type
    1420                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1421              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    1422                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$125)
    1423              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1424                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1425                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1426                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1427              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1428                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1429                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1430                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1431              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
    1432                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$11)
    1433                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1434              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1435                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$11)
    1436                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1437              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1438                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$11)
    1439                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1440              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1441                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1442                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1443                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1444              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1445                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1446                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1447                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1448              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1449                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1450                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1451                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1452                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1453                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1454              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1455                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1456                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1457                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1458                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1459                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1460              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1461                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1462                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1463                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1464              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1465                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1466                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1467                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1468              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1469                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1470                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1471                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1472              
    1473              $C$DW$T$26      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   33

    1474                      .dwattr $C$DW$T$26, DW_AT_name("corCoRoutineControlBlock")
    1475                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x1a)
    1476              $C$DW$126       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$23)
    1478                      .dwattr $C$DW$126, DW_AT_name("pxCoRoutineFunction")
    1479                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_pxCoRoutineFunction")
    1480                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1482              $C$DW$127       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$24)
    1484                      .dwattr $C$DW$127, DW_AT_name("xGenericListItem")
    1485                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_xGenericListItem")
    1486                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1487                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1488              $C$DW$128       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$24)
    1490                      .dwattr $C$DW$128, DW_AT_name("xEventListItem")
    1491                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_xEventListItem")
    1492                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1493                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1494              $C$DW$129       .dwtag  DW_TAG_member
    1495                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    1496                      .dwattr $C$DW$129, DW_AT_name("uxPriority")
    1497                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_uxPriority")
    1498                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1499                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1500              $C$DW$130       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1502                      .dwattr $C$DW$130, DW_AT_name("uxIndex")
    1503                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_uxIndex")
    1504                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1505                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1506              $C$DW$131       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$25)
    1508                      .dwattr $C$DW$131, DW_AT_name("uxState")
    1509                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_uxState")
    1510                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1511                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1512                      .dwendtag $C$DW$T$26
    1513              
    1514              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CRCB_t")
    1515                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$26)
    1516                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1517              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    1518                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    1519                      .dwattr $C$DW$T$62, DW_AT_address_class(0x17)
    1520              
    1521              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1522                      .dwattr $C$DW$T$30, DW_AT_name("xLIST")
    1523                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    1524              $C$DW$132       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
    1526                      .dwattr $C$DW$132, DW_AT_name("uxNumberOfItems")
    1527                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1528                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   34

    1529                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1530              $C$DW$133       .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$28)
    1532                      .dwattr $C$DW$133, DW_AT_name("pxIndex")
    1533                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_pxIndex")
    1534                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1535                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1536              $C$DW$134       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$29)
    1538                      .dwattr $C$DW$134, DW_AT_name("xListEnd")
    1539                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_xListEnd")
    1540                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1541                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1542                      .dwendtag $C$DW$T$30
    1543              
    1544              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    1545                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$30)
    1546                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1547              $C$DW$135       .dwtag  DW_TAG_TI_far_type
    1548                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$39)
    1549              $C$DW$T$54      .dwtag  DW_TAG_const_type
    1550                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$135)
    1551              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    1552                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1553                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    1554              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    1555                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1556                      .dwattr $C$DW$T$40, DW_AT_address_class(0x17)
    1557              $C$DW$136       .dwtag  DW_TAG_TI_far_type
    1558                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$40)
    1559              $C$DW$T$41      .dwtag  DW_TAG_const_type
    1560                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$136)
    1561              
    1562              $C$DW$T$63      .dwtag  DW_TAG_array_type
    1563                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$39)
    1564                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1565                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x14)
    1566              $C$DW$137       .dwtag  DW_TAG_subrange_type
    1567                      .dwattr $C$DW$137, DW_AT_upper_bound(0x01)
    1568                      .dwendtag $C$DW$T$63
    1569              
    1570              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1571                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
    1572                      .dwattr $C$DW$T$33, DW_AT_address_class(0x17)
    1573              
    1574              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1575                      .dwattr $C$DW$T$34, DW_AT_name("xLIST_ITEM")
    1576                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    1577              $C$DW$138       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$31)
    1579                      .dwattr $C$DW$138, DW_AT_name("xItemValue")
    1580                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_xItemValue")
    1581                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1583              $C$DW$139       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   35

    1584                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$32)
    1585                      .dwattr $C$DW$139, DW_AT_name("pxNext")
    1586                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_pxNext")
    1587                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1588                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1589              $C$DW$140       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$32)
    1591                      .dwattr $C$DW$140, DW_AT_name("pxPrevious")
    1592                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_pxPrevious")
    1593                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1594                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1595              $C$DW$141       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$3)
    1597                      .dwattr $C$DW$141, DW_AT_name("pvOwner")
    1598                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_pvOwner")
    1599                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1600                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$142       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$33)
    1603                      .dwattr $C$DW$142, DW_AT_name("pvContainer")
    1604                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_pvContainer")
    1605                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1606                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1607                      .dwendtag $C$DW$T$34
    1608              
    1609              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    1610                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$34)
    1611                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1612              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1613                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$24)
    1614                      .dwattr $C$DW$T$28, DW_AT_address_class(0x17)
    1615              $C$DW$143       .dwtag  DW_TAG_TI_far_type
    1616                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$28)
    1617              $C$DW$T$44      .dwtag  DW_TAG_const_type
    1618                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$143)
    1619              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    1620                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$34)
    1621                      .dwattr $C$DW$T$32, DW_AT_address_class(0x17)
    1622              
    1623              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1624                      .dwattr $C$DW$T$35, DW_AT_name("xMINI_LIST_ITEM")
    1625                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    1626              $C$DW$144       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
    1628                      .dwattr $C$DW$144, DW_AT_name("xItemValue")
    1629                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_xItemValue")
    1630                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1631                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1632              $C$DW$145       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
    1634                      .dwattr $C$DW$145, DW_AT_name("pxNext")
    1635                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_pxNext")
    1636                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1637                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1638              $C$DW$146       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   36

    1639                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$32)
    1640                      .dwattr $C$DW$146, DW_AT_name("pxPrevious")
    1641                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_pxPrevious")
    1642                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1643                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1644                      .dwendtag $C$DW$T$35
    1645              
    1646              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    1647                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$35)
    1648                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1649                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1650              
    1651              ;***************************************************************
    1652              ;* DWARF CIE ENTRIES                                           *
    1653              ;***************************************************************
    1654              
    1655              $C$DW$CIE       .dwcie 91
    1656                      .dwcfi  cfa_register, 36
    1657                      .dwcfi  cfa_offset, 0
    1658                      .dwcfi  undefined, 0
    1659                      .dwcfi  undefined, 1
    1660                      .dwcfi  undefined, 2
    1661                      .dwcfi  undefined, 3
    1662                      .dwcfi  undefined, 4
    1663                      .dwcfi  undefined, 5
    1664                      .dwcfi  undefined, 6
    1665                      .dwcfi  undefined, 7
    1666                      .dwcfi  undefined, 8
    1667                      .dwcfi  undefined, 9
    1668                      .dwcfi  undefined, 10
    1669                      .dwcfi  undefined, 11
    1670                      .dwcfi  undefined, 12
    1671                      .dwcfi  undefined, 13
    1672                      .dwcfi  same_value, 14
    1673                      .dwcfi  same_value, 15
    1674                      .dwcfi  undefined, 16
    1675                      .dwcfi  undefined, 17
    1676                      .dwcfi  undefined, 18
    1677                      .dwcfi  undefined, 19
    1678                      .dwcfi  undefined, 20
    1679                      .dwcfi  undefined, 21
    1680                      .dwcfi  undefined, 22
    1681                      .dwcfi  undefined, 23
    1682                      .dwcfi  undefined, 24
    1683                      .dwcfi  undefined, 25
    1684                      .dwcfi  same_value, 26
    1685                      .dwcfi  same_value, 27
    1686                      .dwcfi  same_value, 28
    1687                      .dwcfi  same_value, 29
    1688                      .dwcfi  same_value, 30
    1689                      .dwcfi  same_value, 31
    1690                      .dwcfi  undefined, 32
    1691                      .dwcfi  undefined, 33
    1692                      .dwcfi  undefined, 34
    1693                      .dwcfi  undefined, 35
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   37

    1694                      .dwcfi  undefined, 36
    1695                      .dwcfi  undefined, 37
    1696                      .dwcfi  undefined, 38
    1697                      .dwcfi  undefined, 39
    1698                      .dwcfi  undefined, 40
    1699                      .dwcfi  undefined, 41
    1700                      .dwcfi  undefined, 42
    1701                      .dwcfi  undefined, 43
    1702                      .dwcfi  undefined, 44
    1703                      .dwcfi  undefined, 45
    1704                      .dwcfi  undefined, 46
    1705                      .dwcfi  undefined, 47
    1706                      .dwcfi  undefined, 48
    1707                      .dwcfi  undefined, 49
    1708                      .dwcfi  undefined, 50
    1709                      .dwcfi  undefined, 51
    1710                      .dwcfi  undefined, 52
    1711                      .dwcfi  undefined, 53
