TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE    1

    1944              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 15 01:52:33 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1404              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1405                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1406                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1407                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1408              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1409                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1410                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1411                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1412              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("BaseType_t")
    1413                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$8)
    1414                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1415              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1416                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1417                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1418                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1419              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    1420                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    1421                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1422              $C$DW$125       .dwtag  DW_TAG_TI_far_type
    1423                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1424              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    1425                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$125)
    1426              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1427                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1428                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1429                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1430              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1431                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1432                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1433                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1434              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1435                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$11)
    1436                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1437              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1438                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$11)
    1439                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1440              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1441                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1442                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1443                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1444              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1445                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1446                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1447                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1448              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
    1449                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$13)
    1450                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1451              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1452                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1453                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1454                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1455                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1456                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1457              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1458                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   33

    1459                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1460                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1461                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1462                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1463              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1464                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1465                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1466                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1467              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1468                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1469                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1470                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1471              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1472                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1473                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1474                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1475              
    1476              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1477                      .dwattr $C$DW$T$26, DW_AT_name("corCoRoutineControlBlock")
    1478                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x1a)
    1479              $C$DW$126       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$23)
    1481                      .dwattr $C$DW$126, DW_AT_name("pxCoRoutineFunction")
    1482                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_pxCoRoutineFunction")
    1483                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1484                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1485              $C$DW$127       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$24)
    1487                      .dwattr $C$DW$127, DW_AT_name("xGenericListItem")
    1488                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_xGenericListItem")
    1489                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1490                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$128       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$24)
    1493                      .dwattr $C$DW$128, DW_AT_name("xEventListItem")
    1494                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_xEventListItem")
    1495                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1496                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1497              $C$DW$129       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    1499                      .dwattr $C$DW$129, DW_AT_name("uxPriority")
    1500                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_uxPriority")
    1501                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1502                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$130       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1505                      .dwattr $C$DW$130, DW_AT_name("uxIndex")
    1506                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_uxIndex")
    1507                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1508                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$131       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$25)
    1511                      .dwattr $C$DW$131, DW_AT_name("uxState")
    1512                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_uxState")
    1513                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   34

    1514                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1515                      .dwendtag $C$DW$T$26
    1516              
    1517              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CRCB_t")
    1518                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$26)
    1519                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1520              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    1521                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    1522                      .dwattr $C$DW$T$62, DW_AT_address_class(0x17)
    1523              
    1524              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1525                      .dwattr $C$DW$T$30, DW_AT_name("xLIST")
    1526                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    1527              $C$DW$132       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
    1529                      .dwattr $C$DW$132, DW_AT_name("uxNumberOfItems")
    1530                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1531                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1533              $C$DW$133       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$28)
    1535                      .dwattr $C$DW$133, DW_AT_name("pxIndex")
    1536                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_pxIndex")
    1537                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1538                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$134       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$29)
    1541                      .dwattr $C$DW$134, DW_AT_name("xListEnd")
    1542                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_xListEnd")
    1543                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1544                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1545                      .dwendtag $C$DW$T$30
    1546              
    1547              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    1548                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$30)
    1549                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1550              $C$DW$135       .dwtag  DW_TAG_TI_far_type
    1551                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$39)
    1552              $C$DW$T$54      .dwtag  DW_TAG_const_type
    1553                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$135)
    1554              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    1555                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    1556                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    1557              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    1558                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1559                      .dwattr $C$DW$T$40, DW_AT_address_class(0x17)
    1560              $C$DW$136       .dwtag  DW_TAG_TI_far_type
    1561                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$40)
    1562              $C$DW$T$41      .dwtag  DW_TAG_const_type
    1563                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$136)
    1564              
    1565              $C$DW$T$63      .dwtag  DW_TAG_array_type
    1566                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$39)
    1567                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1568                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x14)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   35

    1569              $C$DW$137       .dwtag  DW_TAG_subrange_type
    1570                      .dwattr $C$DW$137, DW_AT_upper_bound(0x01)
    1571                      .dwendtag $C$DW$T$63
    1572              
    1573              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1574                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
    1575                      .dwattr $C$DW$T$33, DW_AT_address_class(0x17)
    1576              
    1577              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1578                      .dwattr $C$DW$T$34, DW_AT_name("xLIST_ITEM")
    1579                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    1580              $C$DW$138       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$31)
    1582                      .dwattr $C$DW$138, DW_AT_name("xItemValue")
    1583                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_xItemValue")
    1584                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1585                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1586              $C$DW$139       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$32)
    1588                      .dwattr $C$DW$139, DW_AT_name("pxNext")
    1589                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_pxNext")
    1590                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1591                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1592              $C$DW$140       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$32)
    1594                      .dwattr $C$DW$140, DW_AT_name("pxPrevious")
    1595                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_pxPrevious")
    1596                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1597                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1598              $C$DW$141       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$3)
    1600                      .dwattr $C$DW$141, DW_AT_name("pvOwner")
    1601                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_pvOwner")
    1602                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1603                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$142       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$33)
    1606                      .dwattr $C$DW$142, DW_AT_name("pvContainer")
    1607                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_pvContainer")
    1608                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1609                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1610                      .dwendtag $C$DW$T$34
    1611              
    1612              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    1613                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$34)
    1614                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1615              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1616                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$24)
    1617                      .dwattr $C$DW$T$28, DW_AT_address_class(0x17)
    1618              $C$DW$143       .dwtag  DW_TAG_TI_far_type
    1619                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$28)
    1620              $C$DW$T$44      .dwtag  DW_TAG_const_type
    1621                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$143)
    1622              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    1623                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$34)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   36

    1624                      .dwattr $C$DW$T$32, DW_AT_address_class(0x17)
    1625              
    1626              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1627                      .dwattr $C$DW$T$35, DW_AT_name("xMINI_LIST_ITEM")
    1628                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    1629              $C$DW$144       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
    1631                      .dwattr $C$DW$144, DW_AT_name("xItemValue")
    1632                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_xItemValue")
    1633                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1634                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1635              $C$DW$145       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
    1637                      .dwattr $C$DW$145, DW_AT_name("pxNext")
    1638                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_pxNext")
    1639                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1640                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1641              $C$DW$146       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$32)
    1643                      .dwattr $C$DW$146, DW_AT_name("pxPrevious")
    1644                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_pxPrevious")
    1645                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1646                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1647                      .dwendtag $C$DW$T$35
    1648              
    1649              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    1650                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$35)
    1651                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1652                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1653              
    1654              ;***************************************************************
    1655              ;* DWARF CIE ENTRIES                                           *
    1656              ;***************************************************************
    1657              
    1658              $C$DW$CIE       .dwcie 91
    1659                      .dwcfi  cfa_register, 36
    1660                      .dwcfi  cfa_offset, 0
    1661                      .dwcfi  undefined, 0
    1662                      .dwcfi  undefined, 1
    1663                      .dwcfi  undefined, 2
    1664                      .dwcfi  undefined, 3
    1665                      .dwcfi  undefined, 4
    1666                      .dwcfi  undefined, 5
    1667                      .dwcfi  undefined, 6
    1668                      .dwcfi  undefined, 7
    1669                      .dwcfi  undefined, 8
    1670                      .dwcfi  undefined, 9
    1671                      .dwcfi  undefined, 10
    1672                      .dwcfi  undefined, 11
    1673                      .dwcfi  undefined, 12
    1674                      .dwcfi  undefined, 13
    1675                      .dwcfi  same_value, 14
    1676                      .dwcfi  same_value, 15
    1677                      .dwcfi  undefined, 16
    1678                      .dwcfi  undefined, 17
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   37

    1679                      .dwcfi  undefined, 18
    1680                      .dwcfi  undefined, 19
    1681                      .dwcfi  undefined, 20
    1682                      .dwcfi  undefined, 21
    1683                      .dwcfi  undefined, 22
    1684                      .dwcfi  undefined, 23
    1685                      .dwcfi  undefined, 24
    1686                      .dwcfi  undefined, 25
    1687                      .dwcfi  same_value, 26
    1688                      .dwcfi  same_value, 27
    1689                      .dwcfi  same_value, 28
    1690                      .dwcfi  same_value, 29
    1691                      .dwcfi  same_value, 30
    1692                      .dwcfi  same_value, 31
    1693                      .dwcfi  undefined, 32
    1694                      .dwcfi  undefined, 33
    1695                      .dwcfi  undefined, 34
    1696                      .dwcfi  undefined, 35
    1697                      .dwcfi  undefined, 36
    1698                      .dwcfi  undefined, 37
    1699                      .dwcfi  undefined, 38
    1700                      .dwcfi  undefined, 39
    1701                      .dwcfi  undefined, 40
    1702                      .dwcfi  undefined, 41
    1703                      .dwcfi  undefined, 42
    1704                      .dwcfi  undefined, 43
    1705                      .dwcfi  undefined, 44
    1706                      .dwcfi  undefined, 45
    1707                      .dwcfi  undefined, 46
    1708                      .dwcfi  undefined, 47
    1709                      .dwcfi  undefined, 48
    1710                      .dwcfi  undefined, 49
    1711                      .dwcfi  undefined, 50
    1712                      .dwcfi  undefined, 51
    1713                      .dwcfi  undefined, 52
    1714                      .dwcfi  undefined, 53
