TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:14:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE    1

    1016              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Mon Sep 17 05:14:51 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     539                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     540                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     541              $C$DW$T$6       .dwtag  DW_TAG_base_type
     542                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     543                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     544                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     545              $C$DW$T$7       .dwtag  DW_TAG_base_type
     546                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     547                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     548                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     549              $C$DW$T$8       .dwtag  DW_TAG_base_type
     550                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     551                      .dwattr $C$DW$T$8, DW_AT_name("short")
     552                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     553              $C$DW$T$9       .dwtag  DW_TAG_base_type
     554                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     555                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     556                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     557              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
     558                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
     559                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     560              $C$DW$31        .dwtag  DW_TAG_TI_far_type
     561                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     562              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
     563                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$31)
     564              $C$DW$T$10      .dwtag  DW_TAG_base_type
     565                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     566                      .dwattr $C$DW$T$10, DW_AT_name("int")
     567                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     568              $C$DW$T$11      .dwtag  DW_TAG_base_type
     569                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     570                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     571                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     572              $C$DW$T$12      .dwtag  DW_TAG_base_type
     573                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     574                      .dwattr $C$DW$T$12, DW_AT_name("long")
     575                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     576              $C$DW$T$13      .dwtag  DW_TAG_base_type
     577                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     578                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     579                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     580              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
     581                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
     582                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     583              $C$DW$32        .dwtag  DW_TAG_TI_far_type
     584                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$25)
     585              $C$DW$T$38      .dwtag  DW_TAG_const_type
     586                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$32)
     587              $C$DW$T$14      .dwtag  DW_TAG_base_type
     588                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     589                      .dwattr $C$DW$T$14, DW_AT_name("long long")
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:14:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   14

     590                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     591                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     592                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     593              $C$DW$T$15      .dwtag  DW_TAG_base_type
     594                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     595                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     596                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     597                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     598                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     599              $C$DW$T$16      .dwtag  DW_TAG_base_type
     600                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     601                      .dwattr $C$DW$T$16, DW_AT_name("float")
     602                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     603              $C$DW$T$17      .dwtag  DW_TAG_base_type
     604                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     605                      .dwattr $C$DW$T$17, DW_AT_name("double")
     606                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     607              $C$DW$T$18      .dwtag  DW_TAG_base_type
     608                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     609                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     610                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     611              
     612              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     613                      .dwattr $C$DW$T$24, DW_AT_name("xLIST")
     614                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
     615              $C$DW$33        .dwtag  DW_TAG_member
     616                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
     617                      .dwattr $C$DW$33, DW_AT_name("uxNumberOfItems")
     618                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_uxNumberOfItems")
     619                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     620                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     621              $C$DW$34        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
     623                      .dwattr $C$DW$34, DW_AT_name("pxIndex")
     624                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_pxIndex")
     625                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     626                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     627              $C$DW$35        .dwtag  DW_TAG_member
     628                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$23)
     629                      .dwattr $C$DW$35, DW_AT_name("xListEnd")
     630                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_xListEnd")
     631                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     632                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     633                      .dwendtag $C$DW$T$24
     634              
     635              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
     636                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$24)
     637                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     638              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
     639                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     640                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
     641              $C$DW$36        .dwtag  DW_TAG_TI_far_type
     642                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$31)
     643              $C$DW$T$32      .dwtag  DW_TAG_const_type
     644                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$36)
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:14:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   15

     645              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
     646                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     647                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
     648              
     649              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     650                      .dwattr $C$DW$T$28, DW_AT_name("xLIST_ITEM")
     651                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
     652              $C$DW$37        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$25)
     654                      .dwattr $C$DW$37, DW_AT_name("xItemValue")
     655                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_xItemValue")
     656                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     657                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     658              $C$DW$38        .dwtag  DW_TAG_member
     659                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$26)
     660                      .dwattr $C$DW$38, DW_AT_name("pxNext")
     661                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_pxNext")
     662                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     663                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     664              $C$DW$39        .dwtag  DW_TAG_member
     665                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$26)
     666                      .dwattr $C$DW$39, DW_AT_name("pxPrevious")
     667                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_pxPrevious")
     668                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     669                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     670              $C$DW$40        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$3)
     672                      .dwattr $C$DW$40, DW_AT_name("pvOwner")
     673                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_pvOwner")
     674                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     675                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     676              $C$DW$41        .dwtag  DW_TAG_member
     677                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$27)
     678                      .dwattr $C$DW$41, DW_AT_name("pvContainer")
     679                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_pvContainer")
     680                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     681                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     682                      .dwendtag $C$DW$T$28
     683              
     684              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
     685                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$28)
     686                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     687              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     688                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     689                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
     690              $C$DW$42        .dwtag  DW_TAG_TI_far_type
     691                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$22)
     692              $C$DW$T$34      .dwtag  DW_TAG_const_type
     693                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$42)
     694              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
     695                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$28)
     696                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
     697              
     698              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     699                      .dwattr $C$DW$T$29, DW_AT_name("xMINI_LIST_ITEM")
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:14:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   16

     700                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x06)
     701              $C$DW$43        .dwtag  DW_TAG_member
     702                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$25)
     703                      .dwattr $C$DW$43, DW_AT_name("xItemValue")
     704                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_xItemValue")
     705                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     706                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     707              $C$DW$44        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$26)
     709                      .dwattr $C$DW$44, DW_AT_name("pxNext")
     710                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_pxNext")
     711                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     712                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     713              $C$DW$45        .dwtag  DW_TAG_member
     714                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$26)
     715                      .dwattr $C$DW$45, DW_AT_name("pxPrevious")
     716                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_pxPrevious")
     717                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     718                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     719                      .dwendtag $C$DW$T$29
     720              
     721              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
     722                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$29)
     723                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     724                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
     725              
     726              ;***************************************************************
     727              ;* DWARF CIE ENTRIES                                           *
     728              ;***************************************************************
     729              
     730              $C$DW$CIE       .dwcie 91
     731                      .dwcfi  cfa_register, 36
     732                      .dwcfi  cfa_offset, 0
     733                      .dwcfi  undefined, 0
     734                      .dwcfi  undefined, 1
     735                      .dwcfi  undefined, 2
     736                      .dwcfi  undefined, 3
     737                      .dwcfi  undefined, 4
     738                      .dwcfi  undefined, 5
     739                      .dwcfi  undefined, 6
     740                      .dwcfi  undefined, 7
     741                      .dwcfi  undefined, 8
     742                      .dwcfi  undefined, 9
     743                      .dwcfi  undefined, 10
     744                      .dwcfi  undefined, 11
     745                      .dwcfi  undefined, 12
     746                      .dwcfi  undefined, 13
     747                      .dwcfi  same_value, 14
     748                      .dwcfi  same_value, 15
     749                      .dwcfi  undefined, 16
     750                      .dwcfi  undefined, 17
     751                      .dwcfi  undefined, 18
     752                      .dwcfi  undefined, 19
     753                      .dwcfi  undefined, 20
     754                      .dwcfi  undefined, 21
TMS320C55x Assembler PC v4.4.1 Mon Sep 17 05:14:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   17

     755                      .dwcfi  undefined, 22
     756                      .dwcfi  undefined, 23
     757                      .dwcfi  undefined, 24
     758                      .dwcfi  undefined, 25
     759                      .dwcfi  same_value, 26
     760                      .dwcfi  same_value, 27
     761                      .dwcfi  same_value, 28
     762                      .dwcfi  same_value, 29
     763                      .dwcfi  same_value, 30
     764                      .dwcfi  same_value, 31
     765                      .dwcfi  undefined, 32
     766                      .dwcfi  undefined, 33
     767                      .dwcfi  undefined, 34
     768                      .dwcfi  undefined, 35
     769                      .dwcfi  undefined, 36
     770                      .dwcfi  undefined, 37
     771                      .dwcfi  undefined, 38
     772                      .dwcfi  undefined, 39
     773                      .dwcfi  undefined, 40
     774                      .dwcfi  undefined, 41
     775                      .dwcfi  undefined, 42
     776                      .dwcfi  undefined, 43
     777                      .dwcfi  undefined, 44
     778                      .dwcfi  undefined, 45
     779                      .dwcfi  undefined, 46
     780                      .dwcfi  undefined, 47
     781                      .dwcfi  undefined, 48
     782                      .dwcfi  undefined, 49
     783                      .dwcfi  undefined, 50
     784                      .dwcfi  undefined, 51
     785                      .dwcfi  undefined, 52
     786                      .dwcfi  undefined, 53
