TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE    1

    1012              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 09 04:48:34 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     537              $C$DW$T$6       .dwtag  DW_TAG_base_type
     538                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     539                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     540                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     541              $C$DW$T$7       .dwtag  DW_TAG_base_type
     542                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     543                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     544                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   13

     545              $C$DW$T$8       .dwtag  DW_TAG_base_type
     546                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     547                      .dwattr $C$DW$T$8, DW_AT_name("short")
     548                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     549              $C$DW$T$9       .dwtag  DW_TAG_base_type
     550                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     551                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     552                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     553              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
     554                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
     555                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     556              $C$DW$31        .dwtag  DW_TAG_TI_far_type
     557                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     558              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
     559                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$31)
     560              $C$DW$T$10      .dwtag  DW_TAG_base_type
     561                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     562                      .dwattr $C$DW$T$10, DW_AT_name("int")
     563                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     564              $C$DW$T$11      .dwtag  DW_TAG_base_type
     565                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     566                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     567                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     568              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
     569                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$11)
     570                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     571              $C$DW$32        .dwtag  DW_TAG_TI_far_type
     572                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$25)
     573              $C$DW$T$38      .dwtag  DW_TAG_const_type
     574                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$32)
     575              $C$DW$T$12      .dwtag  DW_TAG_base_type
     576                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     577                      .dwattr $C$DW$T$12, DW_AT_name("long")
     578                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     579              $C$DW$T$13      .dwtag  DW_TAG_base_type
     580                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     581                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     582                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     583              $C$DW$T$14      .dwtag  DW_TAG_base_type
     584                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     585                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     586                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     587                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     588                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     589              $C$DW$T$15      .dwtag  DW_TAG_base_type
     590                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     591                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     592                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     593                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     594                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     595              $C$DW$T$16      .dwtag  DW_TAG_base_type
     596                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     597                      .dwattr $C$DW$T$16, DW_AT_name("float")
     598                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     599              $C$DW$T$17      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   14

     600                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     601                      .dwattr $C$DW$T$17, DW_AT_name("double")
     602                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     603              $C$DW$T$18      .dwtag  DW_TAG_base_type
     604                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     605                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     606                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     607              
     608              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     609                      .dwattr $C$DW$T$24, DW_AT_name("xLIST")
     610                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
     611              $C$DW$33        .dwtag  DW_TAG_member
     612                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
     613                      .dwattr $C$DW$33, DW_AT_name("uxNumberOfItems")
     614                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_uxNumberOfItems")
     615                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     617              $C$DW$34        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
     619                      .dwattr $C$DW$34, DW_AT_name("pxIndex")
     620                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_pxIndex")
     621                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     622                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     623              $C$DW$35        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$23)
     625                      .dwattr $C$DW$35, DW_AT_name("xListEnd")
     626                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_xListEnd")
     627                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     628                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     629                      .dwendtag $C$DW$T$24
     630              
     631              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
     632                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$24)
     633                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     634              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
     635                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     636                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
     637              $C$DW$36        .dwtag  DW_TAG_TI_far_type
     638                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$31)
     639              $C$DW$T$32      .dwtag  DW_TAG_const_type
     640                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$36)
     641              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
     642                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     643                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
     644              
     645              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     646                      .dwattr $C$DW$T$28, DW_AT_name("xLIST_ITEM")
     647                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
     648              $C$DW$37        .dwtag  DW_TAG_member
     649                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$25)
     650                      .dwattr $C$DW$37, DW_AT_name("xItemValue")
     651                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_xItemValue")
     652                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     653                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     654              $C$DW$38        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   15

     655                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$26)
     656                      .dwattr $C$DW$38, DW_AT_name("pxNext")
     657                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_pxNext")
     658                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     659                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     660              $C$DW$39        .dwtag  DW_TAG_member
     661                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$26)
     662                      .dwattr $C$DW$39, DW_AT_name("pxPrevious")
     663                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_pxPrevious")
     664                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     665                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     666              $C$DW$40        .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$3)
     668                      .dwattr $C$DW$40, DW_AT_name("pvOwner")
     669                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_pvOwner")
     670                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     671                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     672              $C$DW$41        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$27)
     674                      .dwattr $C$DW$41, DW_AT_name("pvContainer")
     675                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_pvContainer")
     676                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     677                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     678                      .dwendtag $C$DW$T$28
     679              
     680              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
     681                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$28)
     682                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     683              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     684                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     685                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
     686              $C$DW$42        .dwtag  DW_TAG_TI_far_type
     687                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$22)
     688              $C$DW$T$34      .dwtag  DW_TAG_const_type
     689                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$42)
     690              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
     691                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$28)
     692                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
     693              
     694              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     695                      .dwattr $C$DW$T$29, DW_AT_name("xMINI_LIST_ITEM")
     696                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x06)
     697              $C$DW$43        .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$25)
     699                      .dwattr $C$DW$43, DW_AT_name("xItemValue")
     700                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_xItemValue")
     701                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     702                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     703              $C$DW$44        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$26)
     705                      .dwattr $C$DW$44, DW_AT_name("pxNext")
     706                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_pxNext")
     707                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     708                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     709              $C$DW$45        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   16

     710                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$26)
     711                      .dwattr $C$DW$45, DW_AT_name("pxPrevious")
     712                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_pxPrevious")
     713                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     714                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     715                      .dwendtag $C$DW$T$29
     716              
     717              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
     718                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$29)
     719                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     720                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
     721              
     722              ;***************************************************************
     723              ;* DWARF CIE ENTRIES                                           *
     724              ;***************************************************************
     725              
     726              $C$DW$CIE       .dwcie 91
     727                      .dwcfi  cfa_register, 36
     728                      .dwcfi  cfa_offset, 0
     729                      .dwcfi  undefined, 0
     730                      .dwcfi  undefined, 1
     731                      .dwcfi  undefined, 2
     732                      .dwcfi  undefined, 3
     733                      .dwcfi  undefined, 4
     734                      .dwcfi  undefined, 5
     735                      .dwcfi  undefined, 6
     736                      .dwcfi  undefined, 7
     737                      .dwcfi  undefined, 8
     738                      .dwcfi  undefined, 9
     739                      .dwcfi  undefined, 10
     740                      .dwcfi  undefined, 11
     741                      .dwcfi  undefined, 12
     742                      .dwcfi  undefined, 13
     743                      .dwcfi  same_value, 14
     744                      .dwcfi  same_value, 15
     745                      .dwcfi  undefined, 16
     746                      .dwcfi  undefined, 17
     747                      .dwcfi  undefined, 18
     748                      .dwcfi  undefined, 19
     749                      .dwcfi  undefined, 20
     750                      .dwcfi  undefined, 21
     751                      .dwcfi  undefined, 22
     752                      .dwcfi  undefined, 23
     753                      .dwcfi  undefined, 24
     754                      .dwcfi  undefined, 25
     755                      .dwcfi  same_value, 26
     756                      .dwcfi  same_value, 27
     757                      .dwcfi  same_value, 28
     758                      .dwcfi  same_value, 29
     759                      .dwcfi  same_value, 30
     760                      .dwcfi  same_value, 31
     761                      .dwcfi  undefined, 32
     762                      .dwcfi  undefined, 33
     763                      .dwcfi  undefined, 34
     764                      .dwcfi  undefined, 35
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:34 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
list.asm                                                             PAGE   17

     765                      .dwcfi  undefined, 36
     766                      .dwcfi  undefined, 37
     767                      .dwcfi  undefined, 38
     768                      .dwcfi  undefined, 39
     769                      .dwcfi  undefined, 40
     770                      .dwcfi  undefined, 41
     771                      .dwcfi  undefined, 42
     772                      .dwcfi  undefined, 43
     773                      .dwcfi  undefined, 44
     774                      .dwcfi  undefined, 45
     775                      .dwcfi  undefined, 46
     776                      .dwcfi  undefined, 47
     777                      .dwcfi  undefined, 48
     778                      .dwcfi  undefined, 49
     779                      .dwcfi  undefined, 50
     780                      .dwcfi  undefined, 51
     781                      .dwcfi  undefined, 52
     782                      .dwcfi  undefined, 53
