TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE    1

    7451              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Sep 18 04:49:49 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    6566 001202 2204          MOV AC0, T0 ; |2712| 
    6567 001204 3C01          MOV #0, AC1 ; |2712| 
    6568 001206 EC31          AMOV #_xQueueRegistry, XAR3 ; |2712| 
         001208 BE00 
         00120a 0000-
    6569 00120c EB6B          MOV AC1, dbl(*AR3(T0))
         00120e 18   
    6570                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2717,column 5,is_stmt
    6571 00120f F904          MOV *SP(#2) << #2, AC0 ; |2717| 
         001211 0208 
    6572 001213 2204          MOV AC0, T0 ; |2717| 
    6573 001215 EC31          AMOV #(_xQueueRegistry+2), XAR3 ; |2717| 
         001217 BE00 
         001219 0002-
    6574 00121b EB6B          MOV AC1, dbl(*AR3(T0))
         00121d 18   
    6575                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2718,column 5,is_stmt
    6576 00121e 4A0C          B $C$L236 ; |2718| 
    6577                                                      ; branch occurs ; |2718| 
    6578 001220       $C$L235:    
    6579 001220       $C$DW$L$_vQueueUnregisterQueue$5$B:
    6580                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2707,column 81,is_stmt
    6581 001220 F704          ADD #1, *SP(#2) ; |2707| 
         001222 0001 
    6582                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2707,column 33,is_stmt
    6583 001224 A904          MOV *SP(#2), AR1 ; |2707| 
    6584 001226 1294          CMPU AR1 < AR2, TC1 ; |2707| 
         001228 A4   
    6585 001229 0464          BCC $C$L234,TC1 ; |2707| 
         00122b B6   
    6586                                                      ; branchcc occurs ; |2707| 
    6587 00122c       $C$DW$L$_vQueueUnregisterQueue$5$E:
    6588                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2726,column 2,is_stmt
    6589 00122c       $C$L236:    
    6590 00122c 4E03          AADD #3, SP
    6591                      .dwcfi  cfa_offset, 1
    6592              $C$DW$571       .dwtag  DW_TAG_TI_branch
    6593                      .dwattr $C$DW$571, DW_AT_low_pc(0x00)
    6594                      .dwattr $C$DW$571, DW_AT_TI_return
    6595 00122e 4804          RET
    6596                                                      ; return occurs
    6597              
    6598              $C$DW$572       .dwtag  DW_TAG_TI_loop
    6599                      .dwattr $C$DW$572, DW_AT_name("F:\eZdsp_DBG\eZDSP_5535_Files\ccsws2\test\Debug\queue.asm:$C$L234:1:15
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  140

    6600                      .dwattr $C$DW$572, DW_AT_TI_begin_file("../FreeRTOS/Source/queue.c")
    6601                      .dwattr $C$DW$572, DW_AT_TI_begin_line(0xa93)
    6602                      .dwattr $C$DW$572, DW_AT_TI_end_line(0xaa4)
    6603              $C$DW$573       .dwtag  DW_TAG_TI_loop_range
    6604                      .dwattr $C$DW$573, DW_AT_low_pc($C$DW$L$_vQueueUnregisterQueue$2$B)
    6605                      .dwattr $C$DW$573, DW_AT_high_pc($C$DW$L$_vQueueUnregisterQueue$2$E)
    6606              $C$DW$574       .dwtag  DW_TAG_TI_loop_range
    6607                      .dwattr $C$DW$574, DW_AT_low_pc($C$DW$L$_vQueueUnregisterQueue$5$B)
    6608                      .dwattr $C$DW$574, DW_AT_high_pc($C$DW$L$_vQueueUnregisterQueue$5$E)
    6609                      .dwendtag $C$DW$572
    6610              
    6611                      .dwattr $C$DW$567, DW_AT_TI_end_file("../FreeRTOS/Source/queue.c")
    6612                      .dwattr $C$DW$567, DW_AT_TI_end_line(0xaa6)
    6613                      .dwattr $C$DW$567, DW_AT_TI_end_column(0x02)
    6614                      .dwendentry
    6615                      .dwendtag $C$DW$567
    6616              
    6617              ;******************************************************************************
    6618              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    6619              ;******************************************************************************
    6620                      .global _vPortYield
    6621                      .global _pvPortMalloc
    6622                      .global _vPortFree
    6623                      .global _vListInitialise
    6624                      .global _vTaskSuspendAll
    6625                      .global _xTaskResumeAll
    6626                      .global _vTaskPlaceOnEventList
    6627                      .global _xTaskRemoveFromEventList
    6628                      .global _xTaskGetCurrentTaskHandle
    6629                      .global _xTaskCheckForTimeOut
    6630                      .global _vTaskMissedYield
    6631                      .global _xTaskPriorityInherit
    6632                      .global _xTaskPriorityDisinherit
    6633                      .global _vTaskPriorityDisinheritAfterTimeout
    6634                      .global _pvTaskIncrementMutexHeldCount
    6635                      .global _vTaskInternalSetTimeOutState
    6636                      .global _usCriticalNesting
    6637                      .global _memcpy
    6638              
    6639              ;*******************************************************************************
    6640              ;* TYPE INFORMATION                                                            *
    6641              ;*******************************************************************************
    6642              
    6643              $C$DW$T$22      .dwtag  DW_TAG_union_type
    6644                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    6645              $C$DW$575       .dwtag  DW_TAG_member
    6646                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$20)
    6647                      .dwattr $C$DW$575, DW_AT_name("xQueue")
    6648                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_xQueue")
    6649                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6650                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6651              $C$DW$576       .dwtag  DW_TAG_member
    6652                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$21)
    6653                      .dwattr $C$DW$576, DW_AT_name("xSemaphore")
    6654                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_xSemaphore")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  141

    6655                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6656                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    6657                      .dwendtag $C$DW$T$22
    6658              
    6659              
    6660              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6661                      .dwattr $C$DW$T$28, DW_AT_name("QUEUE_REGISTRY_ITEM")
    6662                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    6663              $C$DW$577       .dwtag  DW_TAG_member
    6664                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$25)
    6665                      .dwattr $C$DW$577, DW_AT_name("pcQueueName")
    6666                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_pcQueueName")
    6667                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6668                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6669              $C$DW$578       .dwtag  DW_TAG_member
    6670                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$27)
    6671                      .dwattr $C$DW$578, DW_AT_name("xHandle")
    6672                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_xHandle")
    6673                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6674                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6675                      .dwendtag $C$DW$T$28
    6676              
    6677              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueRegistryItem")
    6678                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$28)
    6679                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    6680              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("QueueRegistryItem_t")
    6681                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    6682                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    6683              
    6684              $C$DW$T$53      .dwtag  DW_TAG_array_type
    6685                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    6686                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    6687                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x20)
    6688              $C$DW$579       .dwtag  DW_TAG_subrange_type
    6689                      .dwattr $C$DW$579, DW_AT_upper_bound(0x07)
    6690                      .dwendtag $C$DW$T$53
    6691              
    6692              
    6693              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6694                      .dwattr $C$DW$T$35, DW_AT_name("QueueDefinition")
    6695                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x22)
    6696              $C$DW$580       .dwtag  DW_TAG_member
    6697                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$30)
    6698                      .dwattr $C$DW$580, DW_AT_name("pcHead")
    6699                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_pcHead")
    6700                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6701                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    6702              $C$DW$581       .dwtag  DW_TAG_member
    6703                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$30)
    6704                      .dwattr $C$DW$581, DW_AT_name("pcWriteTo")
    6705                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_pcWriteTo")
    6706                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6707                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    6708              $C$DW$582       .dwtag  DW_TAG_member
    6709                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  142

    6710                      .dwattr $C$DW$582, DW_AT_name("u")
    6711                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_u")
    6712                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6713                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6714              $C$DW$583       .dwtag  DW_TAG_member
    6715                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$31)
    6716                      .dwattr $C$DW$583, DW_AT_name("xTasksWaitingToSend")
    6717                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_xTasksWaitingToSend")
    6718                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6719                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6720              $C$DW$584       .dwtag  DW_TAG_member
    6721                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$31)
    6722                      .dwattr $C$DW$584, DW_AT_name("xTasksWaitingToReceive")
    6723                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_xTasksWaitingToReceive")
    6724                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6725                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6726              $C$DW$585       .dwtag  DW_TAG_member
    6727                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$33)
    6728                      .dwattr $C$DW$585, DW_AT_name("uxMessagesWaiting")
    6729                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_uxMessagesWaiting")
    6730                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6731                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6732              $C$DW$586       .dwtag  DW_TAG_member
    6733                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$32)
    6734                      .dwattr $C$DW$586, DW_AT_name("uxLength")
    6735                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_uxLength")
    6736                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    6737                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6738              $C$DW$587       .dwtag  DW_TAG_member
    6739                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$32)
    6740                      .dwattr $C$DW$587, DW_AT_name("uxItemSize")
    6741                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_uxItemSize")
    6742                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    6743                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6744              $C$DW$588       .dwtag  DW_TAG_member
    6745                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$34)
    6746                      .dwattr $C$DW$588, DW_AT_name("cRxLock")
    6747                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_cRxLock")
    6748                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    6749                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6750              $C$DW$589       .dwtag  DW_TAG_member
    6751                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$34)
    6752                      .dwattr $C$DW$589, DW_AT_name("cTxLock")
    6753                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_cTxLock")
    6754                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6755                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    6756                      .dwendtag $C$DW$T$35
    6757              
    6758              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    6759                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$35)
    6760                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    6761              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    6762                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    6763                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    6764              $C$DW$590       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  143

    6765                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$27)
    6766              $C$DW$T$55      .dwtag  DW_TAG_const_type
    6767                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$590)
    6768              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
    6769                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$35)
    6770                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    6771              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("Queue_t")
    6772                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    6773                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    6774              $C$DW$591       .dwtag  DW_TAG_TI_far_type
    6775                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$64)
    6776              $C$DW$T$65      .dwtag  DW_TAG_const_type
    6777                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$591)
    6778              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    6779                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    6780                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    6781              $C$DW$592       .dwtag  DW_TAG_TI_far_type
    6782                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$66)
    6783              $C$DW$T$67      .dwtag  DW_TAG_const_type
    6784                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$592)
    6785              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    6786                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$64)
    6787                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    6788              $C$DW$593       .dwtag  DW_TAG_TI_far_type
    6789                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$68)
    6790              $C$DW$T$69      .dwtag  DW_TAG_const_type
    6791                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$593)
    6792              
    6793              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6794                      .dwattr $C$DW$T$36, DW_AT_name("QueuePointers")
    6795                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    6796              $C$DW$594       .dwtag  DW_TAG_member
    6797                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$30)
    6798                      .dwattr $C$DW$594, DW_AT_name("pcTail")
    6799                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_pcTail")
    6800                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6801                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    6802              $C$DW$595       .dwtag  DW_TAG_member
    6803                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$30)
    6804                      .dwattr $C$DW$595, DW_AT_name("pcReadFrom")
    6805                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_pcReadFrom")
    6806                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6807                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    6808                      .dwendtag $C$DW$T$36
    6809              
    6810              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("QueuePointers_t")
    6811                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$36)
    6812                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    6813              
    6814              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6815                      .dwattr $C$DW$T$39, DW_AT_name("SemaphoreData")
    6816                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    6817              $C$DW$596       .dwtag  DW_TAG_member
    6818                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$38)
    6819                      .dwattr $C$DW$596, DW_AT_name("xMutexHolder")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  144

    6820                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_xMutexHolder")
    6821                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6822                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    6823              $C$DW$597       .dwtag  DW_TAG_member
    6824                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$32)
    6825                      .dwattr $C$DW$597, DW_AT_name("uxRecursiveCallCount")
    6826                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_uxRecursiveCallCount")
    6827                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6828                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    6829                      .dwendtag $C$DW$T$39
    6830              
    6831              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreData_t")
    6832                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$39)
    6833                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    6834              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    6835                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    6836              $C$DW$598       .dwtag  DW_TAG_TI_far_type
    6837                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$3)
    6838              $C$DW$T$76      .dwtag  DW_TAG_const_type
    6839                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$598)
    6840              $C$DW$599       .dwtag  DW_TAG_TI_far_type
    6841              $C$DW$T$70      .dwtag  DW_TAG_const_type
    6842                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$599)
    6843              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    6844                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    6845                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    6846              $C$DW$600       .dwtag  DW_TAG_TI_far_type
    6847                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$71)
    6848              $C$DW$T$77      .dwtag  DW_TAG_const_type
    6849                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$600)
    6850              $C$DW$T$4       .dwtag  DW_TAG_base_type
    6851                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    6852                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    6853                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    6854              $C$DW$T$5       .dwtag  DW_TAG_base_type
    6855                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    6856                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    6857                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    6858              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    6859                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$5)
    6860                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    6861              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    6862                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    6863                      .dwattr $C$DW$T$30, DW_AT_address_class(0x17)
    6864              $C$DW$601       .dwtag  DW_TAG_TI_far_type
    6865                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$29)
    6866              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    6867                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$601)
    6868              $C$DW$602       .dwtag  DW_TAG_TI_far_type
    6869                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$29)
    6870              $C$DW$T$109     .dwtag  DW_TAG_const_type
    6871                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$602)
    6872              $C$DW$T$6       .dwtag  DW_TAG_base_type
    6873                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6874                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  145

    6875                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    6876              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    6877                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$6)
    6878                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    6879              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    6880                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$57)
    6881                      .dwattr $C$DW$T$97, DW_AT_address_class(0x17)
    6882              $C$DW$603       .dwtag  DW_TAG_TI_far_type
    6883                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$57)
    6884              $C$DW$T$58      .dwtag  DW_TAG_const_type
    6885                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$603)
    6886              $C$DW$T$7       .dwtag  DW_TAG_base_type
    6887                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    6888                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    6889                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    6890              $C$DW$T$8       .dwtag  DW_TAG_base_type
    6891                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    6892                      .dwattr $C$DW$T$8, DW_AT_name("short")
    6893                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    6894              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("BaseType_t")
    6895                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$8)
    6896                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6897              $C$DW$604       .dwtag  DW_TAG_TI_far_type
    6898                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$49)
    6899              $C$DW$T$110     .dwtag  DW_TAG_const_type
    6900                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$604)
    6901              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    6902                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$49)
    6903                      .dwattr $C$DW$T$131, DW_AT_address_class(0x17)
    6904              $C$DW$605       .dwtag  DW_TAG_TI_far_type
    6905                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$131)
    6906              $C$DW$T$132     .dwtag  DW_TAG_const_type
    6907                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$605)
    6908              $C$DW$T$9       .dwtag  DW_TAG_base_type
    6909                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6910                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    6911                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    6912              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    6913                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$9)
    6914                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    6915              $C$DW$606       .dwtag  DW_TAG_TI_far_type
    6916                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$32)
    6917              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    6918                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$606)
    6919              $C$DW$607       .dwtag  DW_TAG_TI_far_type
    6920                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$32)
    6921              $C$DW$T$56      .dwtag  DW_TAG_const_type
    6922                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$607)
    6923              $C$DW$T$10      .dwtag  DW_TAG_base_type
    6924                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    6925                      .dwattr $C$DW$T$10, DW_AT_name("int")
    6926                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    6927              $C$DW$T$11      .dwtag  DW_TAG_base_type
    6928                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    6929                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  146

    6930                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    6931              $C$DW$608       .dwtag  DW_TAG_TI_far_type
    6932                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$11)
    6933              $C$DW$T$147     .dwtag  DW_TAG_volatile_type
    6934                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$608)
    6935              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    6936                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$11)
    6937                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    6938              $C$DW$T$12      .dwtag  DW_TAG_base_type
    6939                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    6940                      .dwattr $C$DW$T$12, DW_AT_name("long")
    6941                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    6942              $C$DW$T$13      .dwtag  DW_TAG_base_type
    6943                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    6944                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    6945                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    6946              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
    6947                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$13)
    6948                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6949              $C$DW$609       .dwtag  DW_TAG_TI_far_type
    6950                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$44)
    6951              $C$DW$T$86      .dwtag  DW_TAG_const_type
    6952                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$609)
    6953              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    6954                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$44)
    6955                      .dwattr $C$DW$T$118, DW_AT_address_class(0x17)
    6956              $C$DW$610       .dwtag  DW_TAG_TI_far_type
    6957                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$118)
    6958              $C$DW$T$119     .dwtag  DW_TAG_const_type
    6959                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$610)
    6960              $C$DW$T$14      .dwtag  DW_TAG_base_type
    6961                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    6962                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    6963                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    6964                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    6965                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    6966              $C$DW$T$15      .dwtag  DW_TAG_base_type
    6967                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    6968                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    6969                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    6970                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    6971                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    6972              $C$DW$T$16      .dwtag  DW_TAG_base_type
    6973                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    6974                      .dwattr $C$DW$T$16, DW_AT_name("float")
    6975                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    6976              $C$DW$T$17      .dwtag  DW_TAG_base_type
    6977                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    6978                      .dwattr $C$DW$T$17, DW_AT_name("double")
    6979                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    6980              $C$DW$T$18      .dwtag  DW_TAG_base_type
    6981                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    6982                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    6983                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    6984              $C$DW$T$23      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  147

    6985                      .dwattr $C$DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    6986                      .dwattr $C$DW$T$23, DW_AT_name("signed char")
    6987                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    6988              $C$DW$611       .dwtag  DW_TAG_TI_far_type
    6989                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$23)
    6990              $C$DW$T$24      .dwtag  DW_TAG_const_type
    6991                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$611)
    6992              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    6993                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    6994                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
    6995              
    6996              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6997                      .dwattr $C$DW$T$19, DW_AT_name("tskTaskControlBlock")
    6998                      .dwattr $C$DW$T$19, DW_AT_declaration
    6999                      .dwendtag $C$DW$T$19
    7000              
    7001              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    7002                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
    7003                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    7004              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    7005                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    7006                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7007              $C$DW$612       .dwtag  DW_TAG_TI_far_type
    7008                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$38)
    7009              $C$DW$T$89      .dwtag  DW_TAG_const_type
    7010                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$612)
    7011              
    7012              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7013                      .dwattr $C$DW$T$43, DW_AT_name("xLIST")
    7014                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    7015              $C$DW$613       .dwtag  DW_TAG_member
    7016                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$33)
    7017                      .dwattr $C$DW$613, DW_AT_name("uxNumberOfItems")
    7018                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_uxNumberOfItems")
    7019                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7020                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    7021              $C$DW$614       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$41)
    7023                      .dwattr $C$DW$614, DW_AT_name("pxIndex")
    7024                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_pxIndex")
    7025                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7026                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    7027              $C$DW$615       .dwtag  DW_TAG_member
    7028                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$42)
    7029                      .dwattr $C$DW$615, DW_AT_name("xListEnd")
    7030                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_xListEnd")
    7031                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7032                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    7033                      .dwendtag $C$DW$T$43
    7034              
    7035              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    7036                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$43)
    7037                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    7038              $C$DW$616       .dwtag  DW_TAG_TI_far_type
    7039                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$31)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  148

    7040              $C$DW$T$113     .dwtag  DW_TAG_const_type
    7041                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$616)
    7042              $C$DW$T$114     .dwtag  DW_TAG_pointer_type
    7043                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    7044                      .dwattr $C$DW$T$114, DW_AT_address_class(0x17)
    7045              $C$DW$617       .dwtag  DW_TAG_TI_far_type
    7046                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$114)
    7047              $C$DW$T$115     .dwtag  DW_TAG_const_type
    7048                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$617)
    7049              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    7050                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    7051                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    7052              $C$DW$618       .dwtag  DW_TAG_TI_far_type
    7053                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$82)
    7054              $C$DW$T$83      .dwtag  DW_TAG_const_type
    7055                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$618)
    7056              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7057                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$43)
    7058                      .dwattr $C$DW$T$46, DW_AT_address_class(0x17)
    7059              
    7060              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    7061                      .dwattr $C$DW$T$47, DW_AT_name("xLIST_ITEM")
    7062                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0a)
    7063              $C$DW$619       .dwtag  DW_TAG_member
    7064                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$44)
    7065                      .dwattr $C$DW$619, DW_AT_name("xItemValue")
    7066                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_xItemValue")
    7067                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7068                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    7069              $C$DW$620       .dwtag  DW_TAG_member
    7070                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$45)
    7071                      .dwattr $C$DW$620, DW_AT_name("pxNext")
    7072                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_pxNext")
    7073                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7074                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    7075              $C$DW$621       .dwtag  DW_TAG_member
    7076                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$45)
    7077                      .dwattr $C$DW$621, DW_AT_name("pxPrevious")
    7078                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_pxPrevious")
    7079                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7080                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    7081              $C$DW$622       .dwtag  DW_TAG_member
    7082                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$3)
    7083                      .dwattr $C$DW$622, DW_AT_name("pvOwner")
    7084                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_pvOwner")
    7085                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7086                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    7087              $C$DW$623       .dwtag  DW_TAG_member
    7088                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$46)
    7089                      .dwattr $C$DW$623, DW_AT_name("pvContainer")
    7090                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_pvContainer")
    7091                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7092                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    7093                      .dwendtag $C$DW$T$47
    7094              
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  149

    7095              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    7096                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$47)
    7097                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    7098              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    7099                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    7100                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    7101              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    7102                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$47)
    7103                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    7104              
    7105              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    7106                      .dwattr $C$DW$T$48, DW_AT_name("xMINI_LIST_ITEM")
    7107                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x06)
    7108              $C$DW$624       .dwtag  DW_TAG_member
    7109                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$44)
    7110                      .dwattr $C$DW$624, DW_AT_name("xItemValue")
    7111                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_xItemValue")
    7112                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7113                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    7114              $C$DW$625       .dwtag  DW_TAG_member
    7115                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$45)
    7116                      .dwattr $C$DW$625, DW_AT_name("pxNext")
    7117                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_pxNext")
    7118                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7119                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    7120              $C$DW$626       .dwtag  DW_TAG_member
    7121                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$45)
    7122                      .dwattr $C$DW$626, DW_AT_name("pxPrevious")
    7123                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_pxPrevious")
    7124                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7125                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    7126                      .dwendtag $C$DW$T$48
    7127              
    7128              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    7129                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$48)
    7130                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    7131              
    7132              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    7133                      .dwattr $C$DW$T$50, DW_AT_name("xTIME_OUT")
    7134                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    7135              $C$DW$627       .dwtag  DW_TAG_member
    7136                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$49)
    7137                      .dwattr $C$DW$627, DW_AT_name("xOverflowCount")
    7138                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_xOverflowCount")
    7139                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7140                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    7141              $C$DW$628       .dwtag  DW_TAG_member
    7142                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$44)
    7143                      .dwattr $C$DW$628, DW_AT_name("xTimeOnEntering")
    7144                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_xTimeOnEntering")
    7145                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7146                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    7147                      .dwendtag $C$DW$T$50
    7148              
    7149              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  150

    7150                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$50)
    7151                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    7152              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    7153                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    7154                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    7155              $C$DW$629       .dwtag  DW_TAG_TI_far_type
    7156                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$93)
    7157              $C$DW$T$94      .dwtag  DW_TAG_const_type
    7158                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$629)
    7159                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    7160              
    7161              ;***************************************************************
    7162              ;* DWARF CIE ENTRIES                                           *
    7163              ;***************************************************************
    7164              
    7165              $C$DW$CIE       .dwcie 91
    7166                      .dwcfi  cfa_register, 36
    7167                      .dwcfi  cfa_offset, 0
    7168                      .dwcfi  undefined, 0
    7169                      .dwcfi  undefined, 1
    7170                      .dwcfi  undefined, 2
    7171                      .dwcfi  undefined, 3
    7172                      .dwcfi  undefined, 4
    7173                      .dwcfi  undefined, 5
    7174                      .dwcfi  undefined, 6
    7175                      .dwcfi  undefined, 7
    7176                      .dwcfi  undefined, 8
    7177                      .dwcfi  undefined, 9
    7178                      .dwcfi  undefined, 10
    7179                      .dwcfi  undefined, 11
    7180                      .dwcfi  undefined, 12
    7181                      .dwcfi  undefined, 13
    7182                      .dwcfi  same_value, 14
    7183                      .dwcfi  same_value, 15
    7184                      .dwcfi  undefined, 16
    7185                      .dwcfi  undefined, 17
    7186                      .dwcfi  undefined, 18
    7187                      .dwcfi  undefined, 19
    7188                      .dwcfi  undefined, 20
    7189                      .dwcfi  undefined, 21
    7190                      .dwcfi  undefined, 22
    7191                      .dwcfi  undefined, 23
    7192                      .dwcfi  undefined, 24
    7193                      .dwcfi  undefined, 25
    7194                      .dwcfi  same_value, 26
    7195                      .dwcfi  same_value, 27
    7196                      .dwcfi  same_value, 28
    7197                      .dwcfi  same_value, 29
    7198                      .dwcfi  same_value, 30
    7199                      .dwcfi  same_value, 31
    7200                      .dwcfi  undefined, 32
    7201                      .dwcfi  undefined, 33
    7202                      .dwcfi  undefined, 34
    7203                      .dwcfi  undefined, 35
    7204                      .dwcfi  undefined, 36
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  151

    7205                      .dwcfi  undefined, 37
    7206                      .dwcfi  undefined, 38
    7207                      .dwcfi  undefined, 39
