TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE    1

    6021              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 09 04:48:34 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    5190                                                      ; branchcc occurs ; |2608| 
    5191 000ef1 3C19          MOV #1, AR1
    5192 000ef3 4A02          B $C$L149 ; |2608| 
    5193                                                      ; branch occurs ; |2608| 
    5194 000ef5       $C$L148:    
    5195 000ef5 3C09          MOV #0, AR1
    5196 000ef7       $C$L149:    
    5197 000ef7 0419          BCC $C$L150,AR1 != #0 ; |2608| 
         000ef9 14   
    5198                                                      ; branchcc occurs ; |2608| 
    5199                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2610,column 6,is_stmt
    5200 000efa ED10          MOV dbl(*SP(#8)), XAR0
         000efc 8F   
    5201 000efd 1408          AADD #8, AR0 ; |2610| 
         000eff 84   
    5202              $C$DW$467       .dwtag  DW_TAG_TI_branch
    5203                      .dwattr $C$DW$467, DW_AT_low_pc(0x00)
    5204                      .dwattr $C$DW$467, DW_AT_name("_xCoRoutineRemoveFromEventList")
    5205                      .dwattr $C$DW$467, DW_AT_TI_call
    5206 000f00 6C00          CALL #_xCoRoutineRemoveFromEventList ; |2610| 
         000f02 0000!
    5207                                                      ; call occurs [#_xCoRoutineRemoveFromEventList] ; |2610| 
    5208 000f04 6404          BCC $C$L150,T0 == #0 ; |2610| 
    5209                                                      ; branchcc occurs ; |2610| 
    5210                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2612,column 7,is_stmt
    5211 000f06 ED08          MOV dbl(*SP(#4)), XAR3
         000f08 BF   
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  113

    5212 000f09 E661          MOV #1, *AR3 ; |2612| 
         000f0b 01   
    5213                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2613,column 6,is_stmt
    5214 000f0c 4A00          B $C$L150 ; |2613| 
    5215                                                      ; branch occurs ; |2613| 
    5216 000f0e       $C$L150:    
    5217                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2629,column 4,is_stmt
    5218 000f0e E60C          MOV #1, *SP(#6) ; |2629| 
         000f10 01   
    5219                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2630,column 3,is_stmt
    5220 000f11 4A03          B $C$L152 ; |2630| 
    5221                                                      ; branch occurs ; |2630| 
    5222 000f13       $C$L151:    
    5223                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2633,column 4,is_stmt
    5224 000f13 E60C          MOV #0, *SP(#6) ; |2633| 
         000f15 00   
    5225 000f16       $C$L152:    
    5226                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2636,column 3,is_stmt
    5227 000f16 A40C          MOV *SP(#6), T0 ; |2636| 
    5228                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2637,column 2,is_stmt
    5229 000f18 4E0B          AADD #11, SP
    5230                      .dwcfi  cfa_offset, 1
    5231              $C$DW$468       .dwtag  DW_TAG_TI_branch
    5232                      .dwattr $C$DW$468, DW_AT_low_pc(0x00)
    5233                      .dwattr $C$DW$468, DW_AT_TI_return
    5234 000f1a 4804          RET
    5235                                                      ; return occurs
    5236                      .dwattr $C$DW$457, DW_AT_TI_end_file("../FreeRTOS/Source/queue.c")
    5237                      .dwattr $C$DW$457, DW_AT_TI_end_line(0xa4d)
    5238                      .dwattr $C$DW$457, DW_AT_TI_end_column(0x02)
    5239                      .dwendentry
    5240                      .dwendtag $C$DW$457
    5241              
    5242              ;******************************************************************************
    5243              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    5244              ;******************************************************************************
    5245                      .global _vPortYield
    5246                      .global _pvPortMalloc
    5247                      .global _vPortFree
    5248                      .global _vListInitialise
    5249                      .global _vTaskSuspendAll
    5250                      .global _xTaskResumeAll
    5251                      .global _vTaskPlaceOnEventList
    5252                      .global _xTaskRemoveFromEventList
    5253                      .global _xTaskCheckForTimeOut
    5254                      .global _vTaskMissedYield
    5255                      .global _vTaskInternalSetTimeOutState
    5256                      .global _vCoRoutineAddToDelayedList
    5257                      .global _xCoRoutineRemoveFromEventList
    5258                      .global _usCriticalNesting
    5259                      .global _memcpy
    5260              
    5261              ;*******************************************************************************
    5262              ;* TYPE INFORMATION                                                            *
    5263              ;*******************************************************************************
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  114

    5264              
    5265              $C$DW$T$22      .dwtag  DW_TAG_union_type
    5266                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    5267              $C$DW$469       .dwtag  DW_TAG_member
    5268                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    5269                      .dwattr $C$DW$469, DW_AT_name("xQueue")
    5270                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_xQueue")
    5271                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5272                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5273              $C$DW$470       .dwtag  DW_TAG_member
    5274                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$21)
    5275                      .dwattr $C$DW$470, DW_AT_name("xSemaphore")
    5276                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_xSemaphore")
    5277                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5278                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5279                      .dwendtag $C$DW$T$22
    5280              
    5281              
    5282              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5283                      .dwattr $C$DW$T$29, DW_AT_name("QueueDefinition")
    5284                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x22)
    5285              $C$DW$471       .dwtag  DW_TAG_member
    5286                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$24)
    5287                      .dwattr $C$DW$471, DW_AT_name("pcHead")
    5288                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_pcHead")
    5289                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5290                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5291              $C$DW$472       .dwtag  DW_TAG_member
    5292                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$24)
    5293                      .dwattr $C$DW$472, DW_AT_name("pcWriteTo")
    5294                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_pcWriteTo")
    5295                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5296                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5297              $C$DW$473       .dwtag  DW_TAG_member
    5298                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$22)
    5299                      .dwattr $C$DW$473, DW_AT_name("u")
    5300                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_u")
    5301                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5302                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5303              $C$DW$474       .dwtag  DW_TAG_member
    5304                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$25)
    5305                      .dwattr $C$DW$474, DW_AT_name("xTasksWaitingToSend")
    5306                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_xTasksWaitingToSend")
    5307                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5308                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5309              $C$DW$475       .dwtag  DW_TAG_member
    5310                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$25)
    5311                      .dwattr $C$DW$475, DW_AT_name("xTasksWaitingToReceive")
    5312                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_xTasksWaitingToReceive")
    5313                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5314                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5315              $C$DW$476       .dwtag  DW_TAG_member
    5316                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$27)
    5317                      .dwattr $C$DW$476, DW_AT_name("uxMessagesWaiting")
    5318                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_uxMessagesWaiting")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  115

    5319                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5320                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5321              $C$DW$477       .dwtag  DW_TAG_member
    5322                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$26)
    5323                      .dwattr $C$DW$477, DW_AT_name("uxLength")
    5324                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_uxLength")
    5325                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5326                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5327              $C$DW$478       .dwtag  DW_TAG_member
    5328                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$26)
    5329                      .dwattr $C$DW$478, DW_AT_name("uxItemSize")
    5330                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_uxItemSize")
    5331                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5332                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5333              $C$DW$479       .dwtag  DW_TAG_member
    5334                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$28)
    5335                      .dwattr $C$DW$479, DW_AT_name("cRxLock")
    5336                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_cRxLock")
    5337                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5338                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5339              $C$DW$480       .dwtag  DW_TAG_member
    5340                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$28)
    5341                      .dwattr $C$DW$480, DW_AT_name("cTxLock")
    5342                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_cTxLock")
    5343                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5344                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5345                      .dwendtag $C$DW$T$29
    5346              
    5347              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    5348                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$29)
    5349                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    5350              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    5351                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    5352                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5353              $C$DW$481       .dwtag  DW_TAG_TI_far_type
    5354                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$46)
    5355              $C$DW$T$47      .dwtag  DW_TAG_const_type
    5356                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$481)
    5357              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
    5358                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    5359                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    5360              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("Queue_t")
    5361                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    5362                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    5363              $C$DW$482       .dwtag  DW_TAG_TI_far_type
    5364                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$53)
    5365              $C$DW$T$54      .dwtag  DW_TAG_const_type
    5366                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$482)
    5367              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    5368                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    5369                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    5370              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    5371                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$53)
    5372                      .dwattr $C$DW$T$56, DW_AT_address_class(0x17)
    5373              $C$DW$483       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  116

    5374                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$56)
    5375              $C$DW$T$57      .dwtag  DW_TAG_const_type
    5376                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$483)
    5377              
    5378              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5379                      .dwattr $C$DW$T$30, DW_AT_name("QueuePointers")
    5380                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    5381              $C$DW$484       .dwtag  DW_TAG_member
    5382                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$24)
    5383                      .dwattr $C$DW$484, DW_AT_name("pcTail")
    5384                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_pcTail")
    5385                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5386                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5387              $C$DW$485       .dwtag  DW_TAG_member
    5388                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$24)
    5389                      .dwattr $C$DW$485, DW_AT_name("pcReadFrom")
    5390                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_pcReadFrom")
    5391                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5392                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5393                      .dwendtag $C$DW$T$30
    5394              
    5395              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("QueuePointers_t")
    5396                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$30)
    5397                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    5398              
    5399              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5400                      .dwattr $C$DW$T$33, DW_AT_name("SemaphoreData")
    5401                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    5402              $C$DW$486       .dwtag  DW_TAG_member
    5403                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$32)
    5404                      .dwattr $C$DW$486, DW_AT_name("xMutexHolder")
    5405                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_xMutexHolder")
    5406                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5407                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5408              $C$DW$487       .dwtag  DW_TAG_member
    5409                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$26)
    5410                      .dwattr $C$DW$487, DW_AT_name("uxRecursiveCallCount")
    5411                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_uxRecursiveCallCount")
    5412                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5413                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5414                      .dwendtag $C$DW$T$33
    5415              
    5416              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreData_t")
    5417                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$33)
    5418                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    5419              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    5420                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    5421              $C$DW$488       .dwtag  DW_TAG_TI_far_type
    5422                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$3)
    5423              $C$DW$T$64      .dwtag  DW_TAG_const_type
    5424                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$488)
    5425              $C$DW$489       .dwtag  DW_TAG_TI_far_type
    5426              $C$DW$T$58      .dwtag  DW_TAG_const_type
    5427                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$489)
    5428              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  117

    5429                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    5430                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
    5431              $C$DW$490       .dwtag  DW_TAG_TI_far_type
    5432                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$59)
    5433              $C$DW$T$65      .dwtag  DW_TAG_const_type
    5434                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$490)
    5435              $C$DW$T$4       .dwtag  DW_TAG_base_type
    5436                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    5437                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    5438                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    5439              $C$DW$T$5       .dwtag  DW_TAG_base_type
    5440                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    5441                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    5442                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    5443              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    5444                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$5)
    5445                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    5446              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    5447                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    5448                      .dwattr $C$DW$T$24, DW_AT_address_class(0x17)
    5449              $C$DW$491       .dwtag  DW_TAG_TI_far_type
    5450                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$23)
    5451              $C$DW$T$28      .dwtag  DW_TAG_volatile_type
    5452                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$491)
    5453              $C$DW$492       .dwtag  DW_TAG_TI_far_type
    5454                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$23)
    5455              $C$DW$T$92      .dwtag  DW_TAG_const_type
    5456                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$492)
    5457              $C$DW$T$6       .dwtag  DW_TAG_base_type
    5458                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5459                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    5460                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    5461              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    5462                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$6)
    5463                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    5464              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    5465                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$49)
    5466                      .dwattr $C$DW$T$84, DW_AT_address_class(0x17)
    5467              $C$DW$493       .dwtag  DW_TAG_TI_far_type
    5468                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$49)
    5469              $C$DW$T$50      .dwtag  DW_TAG_const_type
    5470                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$493)
    5471              $C$DW$T$7       .dwtag  DW_TAG_base_type
    5472                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    5473                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    5474                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    5475              $C$DW$T$8       .dwtag  DW_TAG_base_type
    5476                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    5477                      .dwattr $C$DW$T$8, DW_AT_name("short")
    5478                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    5479              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("BaseType_t")
    5480                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$8)
    5481                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5482              $C$DW$494       .dwtag  DW_TAG_TI_far_type
    5483                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$43)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  118

    5484              $C$DW$T$93      .dwtag  DW_TAG_const_type
    5485                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$494)
    5486              $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    5487                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$43)
    5488                      .dwattr $C$DW$T$110, DW_AT_address_class(0x17)
    5489              $C$DW$495       .dwtag  DW_TAG_TI_far_type
    5490                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$110)
    5491              $C$DW$T$111     .dwtag  DW_TAG_const_type
    5492                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$495)
    5493              $C$DW$T$9       .dwtag  DW_TAG_base_type
    5494                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    5495                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    5496                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    5497              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    5498                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$9)
    5499                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    5500              $C$DW$496       .dwtag  DW_TAG_TI_far_type
    5501                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$26)
    5502              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    5503                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$496)
    5504              $C$DW$497       .dwtag  DW_TAG_TI_far_type
    5505                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$26)
    5506              $C$DW$T$48      .dwtag  DW_TAG_const_type
    5507                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$497)
    5508              $C$DW$T$10      .dwtag  DW_TAG_base_type
    5509                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    5510                      .dwattr $C$DW$T$10, DW_AT_name("int")
    5511                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    5512              $C$DW$T$11      .dwtag  DW_TAG_base_type
    5513                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    5514                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    5515                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    5516              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
    5517                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$11)
    5518                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    5519              $C$DW$498       .dwtag  DW_TAG_TI_far_type
    5520                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$38)
    5521              $C$DW$T$74      .dwtag  DW_TAG_const_type
    5522                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$498)
    5523              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    5524                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$38)
    5525                      .dwattr $C$DW$T$101, DW_AT_address_class(0x17)
    5526              $C$DW$499       .dwtag  DW_TAG_TI_far_type
    5527                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$101)
    5528              $C$DW$T$102     .dwtag  DW_TAG_const_type
    5529                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$499)
    5530              $C$DW$500       .dwtag  DW_TAG_TI_far_type
    5531                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$11)
    5532              $C$DW$T$129     .dwtag  DW_TAG_volatile_type
    5533                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$500)
    5534              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    5535                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$11)
    5536                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    5537              $C$DW$T$12      .dwtag  DW_TAG_base_type
    5538                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  119

    5539                      .dwattr $C$DW$T$12, DW_AT_name("long")
    5540                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    5541              $C$DW$T$13      .dwtag  DW_TAG_base_type
    5542                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    5543                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    5544                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    5545              $C$DW$T$14      .dwtag  DW_TAG_base_type
    5546                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    5547                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    5548                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    5549                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    5550                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    5551              $C$DW$T$15      .dwtag  DW_TAG_base_type
    5552                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    5553                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    5554                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    5555                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    5556                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    5557              $C$DW$T$16      .dwtag  DW_TAG_base_type
    5558                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    5559                      .dwattr $C$DW$T$16, DW_AT_name("float")
    5560                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    5561              $C$DW$T$17      .dwtag  DW_TAG_base_type
    5562                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    5563                      .dwattr $C$DW$T$17, DW_AT_name("double")
    5564                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    5565              $C$DW$T$18      .dwtag  DW_TAG_base_type
    5566                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    5567                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    5568                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    5569              
    5570              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5571                      .dwattr $C$DW$T$19, DW_AT_name("tskTaskControlBlock")
    5572                      .dwattr $C$DW$T$19, DW_AT_declaration
    5573                      .dwendtag $C$DW$T$19
    5574              
    5575              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    5576                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$19)
    5577                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
    5578              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    5579                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    5580                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    5581              
    5582              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5583                      .dwattr $C$DW$T$37, DW_AT_name("xLIST")
    5584                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
    5585              $C$DW$501       .dwtag  DW_TAG_member
    5586                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$27)
    5587                      .dwattr $C$DW$501, DW_AT_name("uxNumberOfItems")
    5588                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_uxNumberOfItems")
    5589                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5590                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5591              $C$DW$502       .dwtag  DW_TAG_member
    5592                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$35)
    5593                      .dwattr $C$DW$502, DW_AT_name("pxIndex")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  120

    5594                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_pxIndex")
    5595                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5596                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5597              $C$DW$503       .dwtag  DW_TAG_member
    5598                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$36)
    5599                      .dwattr $C$DW$503, DW_AT_name("xListEnd")
    5600                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_xListEnd")
    5601                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5602                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5603                      .dwendtag $C$DW$T$37
    5604              
    5605              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    5606                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$37)
    5607                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    5608              $C$DW$504       .dwtag  DW_TAG_TI_far_type
    5609                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$25)
    5610              $C$DW$T$96      .dwtag  DW_TAG_const_type
    5611                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$504)
    5612              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    5613                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    5614                      .dwattr $C$DW$T$97, DW_AT_address_class(0x17)
    5615              $C$DW$505       .dwtag  DW_TAG_TI_far_type
    5616                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$97)
    5617              $C$DW$T$98      .dwtag  DW_TAG_const_type
    5618                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$505)
    5619              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    5620                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$25)
    5621                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    5622              $C$DW$506       .dwtag  DW_TAG_TI_far_type
    5623                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$70)
    5624              $C$DW$T$71      .dwtag  DW_TAG_const_type
    5625                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$506)
    5626              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    5627                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$37)
    5628                      .dwattr $C$DW$T$40, DW_AT_address_class(0x17)
    5629              
    5630              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5631                      .dwattr $C$DW$T$41, DW_AT_name("xLIST_ITEM")
    5632                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0a)
    5633              $C$DW$507       .dwtag  DW_TAG_member
    5634                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$38)
    5635                      .dwattr $C$DW$507, DW_AT_name("xItemValue")
    5636                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_xItemValue")
    5637                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5638                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5639              $C$DW$508       .dwtag  DW_TAG_member
    5640                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$39)
    5641                      .dwattr $C$DW$508, DW_AT_name("pxNext")
    5642                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_pxNext")
    5643                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5644                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5645              $C$DW$509       .dwtag  DW_TAG_member
    5646                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$39)
    5647                      .dwattr $C$DW$509, DW_AT_name("pxPrevious")
    5648                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_pxPrevious")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  121

    5649                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5650                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5651              $C$DW$510       .dwtag  DW_TAG_member
    5652                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$3)
    5653                      .dwattr $C$DW$510, DW_AT_name("pvOwner")
    5654                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_pvOwner")
    5655                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5656                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5657              $C$DW$511       .dwtag  DW_TAG_member
    5658                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$40)
    5659                      .dwattr $C$DW$511, DW_AT_name("pvContainer")
    5660                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_pvContainer")
    5661                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5662                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5663                      .dwendtag $C$DW$T$41
    5664              
    5665              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    5666                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$41)
    5667                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    5668              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    5669                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    5670                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    5671              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    5672                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$41)
    5673                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    5674              
    5675              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5676                      .dwattr $C$DW$T$42, DW_AT_name("xMINI_LIST_ITEM")
    5677                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x06)
    5678              $C$DW$512       .dwtag  DW_TAG_member
    5679                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$38)
    5680                      .dwattr $C$DW$512, DW_AT_name("xItemValue")
    5681                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_xItemValue")
    5682                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5683                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5684              $C$DW$513       .dwtag  DW_TAG_member
    5685                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$39)
    5686                      .dwattr $C$DW$513, DW_AT_name("pxNext")
    5687                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_pxNext")
    5688                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5689                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5690              $C$DW$514       .dwtag  DW_TAG_member
    5691                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$39)
    5692                      .dwattr $C$DW$514, DW_AT_name("pxPrevious")
    5693                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_pxPrevious")
    5694                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5695                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5696                      .dwendtag $C$DW$T$42
    5697              
    5698              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    5699                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$42)
    5700                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    5701              
    5702              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    5703                      .dwattr $C$DW$T$44, DW_AT_name("xTIME_OUT")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  122

    5704                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    5705              $C$DW$515       .dwtag  DW_TAG_member
    5706                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$43)
    5707                      .dwattr $C$DW$515, DW_AT_name("xOverflowCount")
    5708                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_xOverflowCount")
    5709                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5710                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5711              $C$DW$516       .dwtag  DW_TAG_member
    5712                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$38)
    5713                      .dwattr $C$DW$516, DW_AT_name("xTimeOnEntering")
    5714                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_xTimeOnEntering")
    5715                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5716                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5717                      .dwendtag $C$DW$T$44
    5718              
    5719              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    5720                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$44)
    5721                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    5722              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    5723                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    5724                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    5725              $C$DW$517       .dwtag  DW_TAG_TI_far_type
    5726                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$78)
    5727              $C$DW$T$79      .dwtag  DW_TAG_const_type
    5728                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$517)
    5729                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    5730              
    5731              ;***************************************************************
    5732              ;* DWARF CIE ENTRIES                                           *
    5733              ;***************************************************************
    5734              
    5735              $C$DW$CIE       .dwcie 91
    5736                      .dwcfi  cfa_register, 36
    5737                      .dwcfi  cfa_offset, 0
    5738                      .dwcfi  undefined, 0
    5739                      .dwcfi  undefined, 1
    5740                      .dwcfi  undefined, 2
    5741                      .dwcfi  undefined, 3
    5742                      .dwcfi  undefined, 4
    5743                      .dwcfi  undefined, 5
    5744                      .dwcfi  undefined, 6
    5745                      .dwcfi  undefined, 7
    5746                      .dwcfi  undefined, 8
    5747                      .dwcfi  undefined, 9
    5748                      .dwcfi  undefined, 10
    5749                      .dwcfi  undefined, 11
    5750                      .dwcfi  undefined, 12
    5751                      .dwcfi  undefined, 13
    5752                      .dwcfi  same_value, 14
    5753                      .dwcfi  same_value, 15
    5754                      .dwcfi  undefined, 16
    5755                      .dwcfi  undefined, 17
    5756                      .dwcfi  undefined, 18
    5757                      .dwcfi  undefined, 19
    5758                      .dwcfi  undefined, 20
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:36 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  123

    5759                      .dwcfi  undefined, 21
    5760                      .dwcfi  undefined, 22
    5761                      .dwcfi  undefined, 23
    5762                      .dwcfi  undefined, 24
    5763                      .dwcfi  undefined, 25
    5764                      .dwcfi  same_value, 26
    5765                      .dwcfi  same_value, 27
    5766                      .dwcfi  same_value, 28
    5767                      .dwcfi  same_value, 29
    5768                      .dwcfi  same_value, 30
    5769                      .dwcfi  same_value, 31
    5770                      .dwcfi  undefined, 32
    5771                      .dwcfi  undefined, 33
    5772                      .dwcfi  undefined, 34
    5773                      .dwcfi  undefined, 35
    5774                      .dwcfi  undefined, 36
    5775                      .dwcfi  undefined, 37
    5776                      .dwcfi  undefined, 38
    5777                      .dwcfi  undefined, 39
    5778                      .dwcfi  undefined, 40
    5779                      .dwcfi  undefined, 41
    5780                      .dwcfi  undefined, 42
    5781                      .dwcfi  undefined, 43
