TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE    1

    8448              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 15 01:52:36 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

queue.asm                                                            PAGE  160

    7564                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2717,column 5,is_stmt
    7565 0014e7 F904          MOV *SP(#2) << #2, AC0 ; |2717| 
         0014e9 0208 
    7566 0014eb 2204          MOV AC0, T0 ; |2717| 
    7567 0014ed EC31          AMOV #(_xQueueRegistry+2), XAR3 ; |2717| 
         0014ef BE00 
         0014f1 0002-
    7568 0014f3 EB6B          MOV AC1, dbl(*AR3(T0))
         0014f5 18   
    7569                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2718,column 5,is_stmt
    7570 0014f6 4A0C          B $C$L277 ; |2718| 
    7571                                                      ; branch occurs ; |2718| 
    7572 0014f8       $C$L276:    
    7573 0014f8       $C$DW$L$_vQueueUnregisterQueue$5$B:
    7574                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2707,column 81,is_stmt
    7575 0014f8 F704          ADD #1, *SP(#2) ; |2707| 
         0014fa 0001 
    7576                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2707,column 33,is_stmt
    7577 0014fc A904          MOV *SP(#2), AR1 ; |2707| 
    7578 0014fe 1294          CMPU AR1 < AR2, TC1 ; |2707| 
         001500 A4   
    7579 001501 0464          BCC $C$L275,TC1 ; |2707| 
         001503 B6   
    7580                                                      ; branchcc occurs ; |2707| 
    7581 001504       $C$DW$L$_vQueueUnregisterQueue$5$E:
    7582                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2726,column 2,is_stmt
    7583 001504       $C$L277:    
    7584 001504 4E03          AADD #3, SP
    7585                      .dwcfi  cfa_offset, 1
    7586              $C$DW$639       .dwtag  DW_TAG_TI_branch
    7587                      .dwattr $C$DW$639, DW_AT_low_pc(0x00)
    7588                      .dwattr $C$DW$639, DW_AT_TI_return
    7589 001506 4804          RET
    7590                                                      ; return occurs
    7591              
    7592              $C$DW$640       .dwtag  DW_TAG_TI_loop
    7593                      .dwattr $C$DW$640, DW_AT_name("F:\eZdsp_DBG\eZDSP_5535_Files\ccsws2\test\Debug\queue.asm:$C$L275:1:15
    7594                      .dwattr $C$DW$640, DW_AT_TI_begin_file("../FreeRTOS/Source/queue.c")
    7595                      .dwattr $C$DW$640, DW_AT_TI_begin_line(0xa93)
    7596                      .dwattr $C$DW$640, DW_AT_TI_end_line(0xaa4)
    7597              $C$DW$641       .dwtag  DW_TAG_TI_loop_range
    7598                      .dwattr $C$DW$641, DW_AT_low_pc($C$DW$L$_vQueueUnregisterQueue$2$B)
    7599                      .dwattr $C$DW$641, DW_AT_high_pc($C$DW$L$_vQueueUnregisterQueue$2$E)
    7600              $C$DW$642       .dwtag  DW_TAG_TI_loop_range
    7601                      .dwattr $C$DW$642, DW_AT_low_pc($C$DW$L$_vQueueUnregisterQueue$5$B)
    7602                      .dwattr $C$DW$642, DW_AT_high_pc($C$DW$L$_vQueueUnregisterQueue$5$E)
    7603                      .dwendtag $C$DW$640
    7604              
    7605                      .dwattr $C$DW$635, DW_AT_TI_end_file("../FreeRTOS/Source/queue.c")
    7606                      .dwattr $C$DW$635, DW_AT_TI_end_line(0xaa6)
    7607                      .dwattr $C$DW$635, DW_AT_TI_end_column(0x02)
    7608                      .dwendentry
    7609                      .dwendtag $C$DW$635
    7610              
    7611              ;******************************************************************************
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  161

    7612              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    7613              ;******************************************************************************
    7614                      .global _vPortYield
    7615                      .global _pvPortMalloc
    7616                      .global _vPortFree
    7617                      .global _vListInitialise
    7618                      .global _vTaskSuspendAll
    7619                      .global _xTaskResumeAll
    7620                      .global _vTaskPlaceOnEventList
    7621                      .global _xTaskRemoveFromEventList
    7622                      .global _xTaskGetCurrentTaskHandle
    7623                      .global _xTaskCheckForTimeOut
    7624                      .global _vTaskMissedYield
    7625                      .global _xTaskGetSchedulerState
    7626                      .global _xTaskPriorityInherit
    7627                      .global _xTaskPriorityDisinherit
    7628                      .global _vTaskPriorityDisinheritAfterTimeout
    7629                      .global _pvTaskIncrementMutexHeldCount
    7630                      .global _vTaskInternalSetTimeOutState
    7631                      .global _vCoRoutineAddToDelayedList
    7632                      .global _xCoRoutineRemoveFromEventList
    7633                      .global _usCriticalNesting
    7634                      .global _memcpy
    7635              
    7636              ;*******************************************************************************
    7637              ;* TYPE INFORMATION                                                            *
    7638              ;*******************************************************************************
    7639              
    7640              $C$DW$T$22      .dwtag  DW_TAG_union_type
    7641                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    7642              $C$DW$643       .dwtag  DW_TAG_member
    7643                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$20)
    7644                      .dwattr $C$DW$643, DW_AT_name("xQueue")
    7645                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_xQueue")
    7646                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7647                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    7648              $C$DW$644       .dwtag  DW_TAG_member
    7649                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$21)
    7650                      .dwattr $C$DW$644, DW_AT_name("xSemaphore")
    7651                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_xSemaphore")
    7652                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7653                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    7654                      .dwendtag $C$DW$T$22
    7655              
    7656              
    7657              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7658                      .dwattr $C$DW$T$28, DW_AT_name("QUEUE_REGISTRY_ITEM")
    7659                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    7660              $C$DW$645       .dwtag  DW_TAG_member
    7661                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$25)
    7662                      .dwattr $C$DW$645, DW_AT_name("pcQueueName")
    7663                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_pcQueueName")
    7664                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7665                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    7666              $C$DW$646       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  162

    7667                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$27)
    7668                      .dwattr $C$DW$646, DW_AT_name("xHandle")
    7669                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_xHandle")
    7670                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7671                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    7672                      .dwendtag $C$DW$T$28
    7673              
    7674              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueRegistryItem")
    7675                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$28)
    7676                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    7677              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("QueueRegistryItem_t")
    7678                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    7679                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7680              
    7681              $C$DW$T$53      .dwtag  DW_TAG_array_type
    7682                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    7683                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    7684                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x20)
    7685              $C$DW$647       .dwtag  DW_TAG_subrange_type
    7686                      .dwattr $C$DW$647, DW_AT_upper_bound(0x07)
    7687                      .dwendtag $C$DW$T$53
    7688              
    7689              
    7690              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7691                      .dwattr $C$DW$T$35, DW_AT_name("QueueDefinition")
    7692                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x22)
    7693              $C$DW$648       .dwtag  DW_TAG_member
    7694                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$30)
    7695                      .dwattr $C$DW$648, DW_AT_name("pcHead")
    7696                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_pcHead")
    7697                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7698                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    7699              $C$DW$649       .dwtag  DW_TAG_member
    7700                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$30)
    7701                      .dwattr $C$DW$649, DW_AT_name("pcWriteTo")
    7702                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_pcWriteTo")
    7703                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7704                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    7705              $C$DW$650       .dwtag  DW_TAG_member
    7706                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$22)
    7707                      .dwattr $C$DW$650, DW_AT_name("u")
    7708                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_u")
    7709                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7710                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    7711              $C$DW$651       .dwtag  DW_TAG_member
    7712                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$31)
    7713                      .dwattr $C$DW$651, DW_AT_name("xTasksWaitingToSend")
    7714                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_xTasksWaitingToSend")
    7715                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7716                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    7717              $C$DW$652       .dwtag  DW_TAG_member
    7718                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$31)
    7719                      .dwattr $C$DW$652, DW_AT_name("xTasksWaitingToReceive")
    7720                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_xTasksWaitingToReceive")
    7721                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  163

    7722                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    7723              $C$DW$653       .dwtag  DW_TAG_member
    7724                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$33)
    7725                      .dwattr $C$DW$653, DW_AT_name("uxMessagesWaiting")
    7726                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_uxMessagesWaiting")
    7727                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7728                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    7729              $C$DW$654       .dwtag  DW_TAG_member
    7730                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$32)
    7731                      .dwattr $C$DW$654, DW_AT_name("uxLength")
    7732                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_uxLength")
    7733                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    7734                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    7735              $C$DW$655       .dwtag  DW_TAG_member
    7736                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$32)
    7737                      .dwattr $C$DW$655, DW_AT_name("uxItemSize")
    7738                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_uxItemSize")
    7739                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7740                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    7741              $C$DW$656       .dwtag  DW_TAG_member
    7742                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$34)
    7743                      .dwattr $C$DW$656, DW_AT_name("cRxLock")
    7744                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_cRxLock")
    7745                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7746                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    7747              $C$DW$657       .dwtag  DW_TAG_member
    7748                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$34)
    7749                      .dwattr $C$DW$657, DW_AT_name("cTxLock")
    7750                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_cTxLock")
    7751                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7752                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    7753                      .dwendtag $C$DW$T$35
    7754              
    7755              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    7756                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$35)
    7757                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    7758              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    7759                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    7760                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    7761              $C$DW$658       .dwtag  DW_TAG_TI_far_type
    7762                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$27)
    7763              $C$DW$T$55      .dwtag  DW_TAG_const_type
    7764                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$658)
    7765              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
    7766                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$35)
    7767                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    7768              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("Queue_t")
    7769                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    7770                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    7771              $C$DW$659       .dwtag  DW_TAG_TI_far_type
    7772                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$64)
    7773              $C$DW$T$65      .dwtag  DW_TAG_const_type
    7774                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$659)
    7775              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    7776                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  164

    7777                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    7778              $C$DW$660       .dwtag  DW_TAG_TI_far_type
    7779                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$66)
    7780              $C$DW$T$67      .dwtag  DW_TAG_const_type
    7781                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$660)
    7782              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    7783                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$64)
    7784                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    7785              $C$DW$661       .dwtag  DW_TAG_TI_far_type
    7786                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$68)
    7787              $C$DW$T$69      .dwtag  DW_TAG_const_type
    7788                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$661)
    7789              
    7790              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7791                      .dwattr $C$DW$T$36, DW_AT_name("QueuePointers")
    7792                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    7793              $C$DW$662       .dwtag  DW_TAG_member
    7794                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$30)
    7795                      .dwattr $C$DW$662, DW_AT_name("pcTail")
    7796                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_pcTail")
    7797                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7798                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    7799              $C$DW$663       .dwtag  DW_TAG_member
    7800                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$30)
    7801                      .dwattr $C$DW$663, DW_AT_name("pcReadFrom")
    7802                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_pcReadFrom")
    7803                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7804                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    7805                      .dwendtag $C$DW$T$36
    7806              
    7807              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("QueuePointers_t")
    7808                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$36)
    7809                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    7810              
    7811              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7812                      .dwattr $C$DW$T$39, DW_AT_name("SemaphoreData")
    7813                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    7814              $C$DW$664       .dwtag  DW_TAG_member
    7815                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$38)
    7816                      .dwattr $C$DW$664, DW_AT_name("xMutexHolder")
    7817                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_xMutexHolder")
    7818                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7819                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    7820              $C$DW$665       .dwtag  DW_TAG_member
    7821                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$32)
    7822                      .dwattr $C$DW$665, DW_AT_name("uxRecursiveCallCount")
    7823                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_uxRecursiveCallCount")
    7824                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7825                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    7826                      .dwendtag $C$DW$T$39
    7827              
    7828              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreData_t")
    7829                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$39)
    7830                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    7831              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  165

    7832                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    7833              $C$DW$666       .dwtag  DW_TAG_TI_far_type
    7834                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$3)
    7835              $C$DW$T$76      .dwtag  DW_TAG_const_type
    7836                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$666)
    7837              $C$DW$667       .dwtag  DW_TAG_TI_far_type
    7838              $C$DW$T$70      .dwtag  DW_TAG_const_type
    7839                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$667)
    7840              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    7841                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    7842                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    7843              $C$DW$668       .dwtag  DW_TAG_TI_far_type
    7844                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$71)
    7845              $C$DW$T$77      .dwtag  DW_TAG_const_type
    7846                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$668)
    7847              $C$DW$T$4       .dwtag  DW_TAG_base_type
    7848                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    7849                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    7850                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    7851              $C$DW$T$5       .dwtag  DW_TAG_base_type
    7852                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    7853                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    7854                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    7855              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    7856                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$5)
    7857                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    7858              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    7859                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    7860                      .dwattr $C$DW$T$30, DW_AT_address_class(0x17)
    7861              $C$DW$669       .dwtag  DW_TAG_TI_far_type
    7862                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$29)
    7863              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    7864                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$669)
    7865              $C$DW$670       .dwtag  DW_TAG_TI_far_type
    7866                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$29)
    7867              $C$DW$T$111     .dwtag  DW_TAG_const_type
    7868                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$670)
    7869              $C$DW$T$6       .dwtag  DW_TAG_base_type
    7870                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7871                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    7872                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    7873              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    7874                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$6)
    7875                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    7876              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    7877                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$57)
    7878                      .dwattr $C$DW$T$99, DW_AT_address_class(0x17)
    7879              $C$DW$671       .dwtag  DW_TAG_TI_far_type
    7880                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$57)
    7881              $C$DW$T$58      .dwtag  DW_TAG_const_type
    7882                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$671)
    7883              $C$DW$T$7       .dwtag  DW_TAG_base_type
    7884                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    7885                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    7886                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  166

    7887              $C$DW$T$8       .dwtag  DW_TAG_base_type
    7888                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    7889                      .dwattr $C$DW$T$8, DW_AT_name("short")
    7890                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    7891              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("BaseType_t")
    7892                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$8)
    7893                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    7894              $C$DW$672       .dwtag  DW_TAG_TI_far_type
    7895                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$49)
    7896              $C$DW$T$112     .dwtag  DW_TAG_const_type
    7897                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$672)
    7898              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    7899                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$49)
    7900                      .dwattr $C$DW$T$135, DW_AT_address_class(0x17)
    7901              $C$DW$673       .dwtag  DW_TAG_TI_far_type
    7902                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$135)
    7903              $C$DW$T$136     .dwtag  DW_TAG_const_type
    7904                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$673)
    7905              $C$DW$T$9       .dwtag  DW_TAG_base_type
    7906                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    7907                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    7908                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    7909              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    7910                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$9)
    7911                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    7912              $C$DW$674       .dwtag  DW_TAG_TI_far_type
    7913                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$32)
    7914              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    7915                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$674)
    7916              $C$DW$675       .dwtag  DW_TAG_TI_far_type
    7917                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$32)
    7918              $C$DW$T$56      .dwtag  DW_TAG_const_type
    7919                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$675)
    7920              $C$DW$T$10      .dwtag  DW_TAG_base_type
    7921                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    7922                      .dwattr $C$DW$T$10, DW_AT_name("int")
    7923                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    7924              $C$DW$T$11      .dwtag  DW_TAG_base_type
    7925                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    7926                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    7927                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    7928              $C$DW$676       .dwtag  DW_TAG_TI_far_type
    7929                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$11)
    7930              $C$DW$T$155     .dwtag  DW_TAG_volatile_type
    7931                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$676)
    7932              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    7933                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$11)
    7934                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    7935              $C$DW$T$12      .dwtag  DW_TAG_base_type
    7936                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    7937                      .dwattr $C$DW$T$12, DW_AT_name("long")
    7938                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    7939              $C$DW$T$13      .dwtag  DW_TAG_base_type
    7940                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    7941                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  167

    7942                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    7943              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
    7944                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$13)
    7945                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    7946              $C$DW$677       .dwtag  DW_TAG_TI_far_type
    7947                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$44)
    7948              $C$DW$T$86      .dwtag  DW_TAG_const_type
    7949                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$677)
    7950              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    7951                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$44)
    7952                      .dwattr $C$DW$T$120, DW_AT_address_class(0x17)
    7953              $C$DW$678       .dwtag  DW_TAG_TI_far_type
    7954                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$120)
    7955              $C$DW$T$121     .dwtag  DW_TAG_const_type
    7956                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$678)
    7957              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7958                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7959                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7960                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7961                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    7962                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    7963              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7964                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7965                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7966                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7967                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    7968                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    7969              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7970                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7971                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7972                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7973              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7974                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    7975                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7976                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    7977              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7978                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7979                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    7980                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    7981              $C$DW$T$23      .dwtag  DW_TAG_base_type
    7982                      .dwattr $C$DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    7983                      .dwattr $C$DW$T$23, DW_AT_name("signed char")
    7984                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    7985              $C$DW$679       .dwtag  DW_TAG_TI_far_type
    7986                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$23)
    7987              $C$DW$T$24      .dwtag  DW_TAG_const_type
    7988                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$679)
    7989              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    7990                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    7991                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
    7992              
    7993              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7994                      .dwattr $C$DW$T$19, DW_AT_name("tskTaskControlBlock")
    7995                      .dwattr $C$DW$T$19, DW_AT_declaration
    7996                      .dwendtag $C$DW$T$19
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  168

    7997              
    7998              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    7999                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
    8000                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    8001              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    8002                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    8003                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    8004              $C$DW$680       .dwtag  DW_TAG_TI_far_type
    8005                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$38)
    8006              $C$DW$T$89      .dwtag  DW_TAG_const_type
    8007                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$680)
    8008              
    8009              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    8010                      .dwattr $C$DW$T$43, DW_AT_name("xLIST")
    8011                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    8012              $C$DW$681       .dwtag  DW_TAG_member
    8013                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$33)
    8014                      .dwattr $C$DW$681, DW_AT_name("uxNumberOfItems")
    8015                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_uxNumberOfItems")
    8016                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8017                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    8018              $C$DW$682       .dwtag  DW_TAG_member
    8019                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$41)
    8020                      .dwattr $C$DW$682, DW_AT_name("pxIndex")
    8021                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_pxIndex")
    8022                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8023                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    8024              $C$DW$683       .dwtag  DW_TAG_member
    8025                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$42)
    8026                      .dwattr $C$DW$683, DW_AT_name("xListEnd")
    8027                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_xListEnd")
    8028                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8029                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    8030                      .dwendtag $C$DW$T$43
    8031              
    8032              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    8033                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$43)
    8034                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    8035              $C$DW$684       .dwtag  DW_TAG_TI_far_type
    8036                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$31)
    8037              $C$DW$T$115     .dwtag  DW_TAG_const_type
    8038                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$684)
    8039              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    8040                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$115)
    8041                      .dwattr $C$DW$T$116, DW_AT_address_class(0x17)
    8042              $C$DW$685       .dwtag  DW_TAG_TI_far_type
    8043                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$116)
    8044              $C$DW$T$117     .dwtag  DW_TAG_const_type
    8045                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$685)
    8046              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    8047                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    8048                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    8049              $C$DW$686       .dwtag  DW_TAG_TI_far_type
    8050                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$82)
    8051              $C$DW$T$83      .dwtag  DW_TAG_const_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  169

    8052                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$686)
    8053              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    8054                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$43)
    8055                      .dwattr $C$DW$T$46, DW_AT_address_class(0x17)
    8056              
    8057              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    8058                      .dwattr $C$DW$T$47, DW_AT_name("xLIST_ITEM")
    8059                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0a)
    8060              $C$DW$687       .dwtag  DW_TAG_member
    8061                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$44)
    8062                      .dwattr $C$DW$687, DW_AT_name("xItemValue")
    8063                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_xItemValue")
    8064                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8065                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    8066              $C$DW$688       .dwtag  DW_TAG_member
    8067                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$45)
    8068                      .dwattr $C$DW$688, DW_AT_name("pxNext")
    8069                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_pxNext")
    8070                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8071                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    8072              $C$DW$689       .dwtag  DW_TAG_member
    8073                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$45)
    8074                      .dwattr $C$DW$689, DW_AT_name("pxPrevious")
    8075                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_pxPrevious")
    8076                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8077                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8078              $C$DW$690       .dwtag  DW_TAG_member
    8079                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$3)
    8080                      .dwattr $C$DW$690, DW_AT_name("pvOwner")
    8081                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_pvOwner")
    8082                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8083                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8084              $C$DW$691       .dwtag  DW_TAG_member
    8085                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$46)
    8086                      .dwattr $C$DW$691, DW_AT_name("pvContainer")
    8087                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_pvContainer")
    8088                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8089                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8090                      .dwendtag $C$DW$T$47
    8091              
    8092              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    8093                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$47)
    8094                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    8095              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    8096                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    8097                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    8098              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    8099                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$47)
    8100                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    8101              
    8102              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    8103                      .dwattr $C$DW$T$48, DW_AT_name("xMINI_LIST_ITEM")
    8104                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x06)
    8105              $C$DW$692       .dwtag  DW_TAG_member
    8106                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$44)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  170

    8107                      .dwattr $C$DW$692, DW_AT_name("xItemValue")
    8108                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_xItemValue")
    8109                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8110                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8111              $C$DW$693       .dwtag  DW_TAG_member
    8112                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$45)
    8113                      .dwattr $C$DW$693, DW_AT_name("pxNext")
    8114                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_pxNext")
    8115                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8116                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8117              $C$DW$694       .dwtag  DW_TAG_member
    8118                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$45)
    8119                      .dwattr $C$DW$694, DW_AT_name("pxPrevious")
    8120                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_pxPrevious")
    8121                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8122                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8123                      .dwendtag $C$DW$T$48
    8124              
    8125              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    8126                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$48)
    8127                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    8128              
    8129              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    8130                      .dwattr $C$DW$T$50, DW_AT_name("xTIME_OUT")
    8131                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    8132              $C$DW$695       .dwtag  DW_TAG_member
    8133                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$49)
    8134                      .dwattr $C$DW$695, DW_AT_name("xOverflowCount")
    8135                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_xOverflowCount")
    8136                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8137                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8138              $C$DW$696       .dwtag  DW_TAG_member
    8139                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$44)
    8140                      .dwattr $C$DW$696, DW_AT_name("xTimeOnEntering")
    8141                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_xTimeOnEntering")
    8142                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8143                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8144                      .dwendtag $C$DW$T$50
    8145              
    8146              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    8147                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$50)
    8148                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    8149              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    8150                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    8151                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    8152              $C$DW$697       .dwtag  DW_TAG_TI_far_type
    8153                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$93)
    8154              $C$DW$T$94      .dwtag  DW_TAG_const_type
    8155                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$697)
    8156                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    8157              
    8158              ;***************************************************************
    8159              ;* DWARF CIE ENTRIES                                           *
    8160              ;***************************************************************
    8161              
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 01:52:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  171

    8162              $C$DW$CIE       .dwcie 91
    8163                      .dwcfi  cfa_register, 36
    8164                      .dwcfi  cfa_offset, 0
    8165                      .dwcfi  undefined, 0
    8166                      .dwcfi  undefined, 1
    8167                      .dwcfi  undefined, 2
    8168                      .dwcfi  undefined, 3
    8169                      .dwcfi  undefined, 4
    8170                      .dwcfi  undefined, 5
    8171                      .dwcfi  undefined, 6
    8172                      .dwcfi  undefined, 7
    8173                      .dwcfi  undefined, 8
    8174                      .dwcfi  undefined, 9
    8175                      .dwcfi  undefined, 10
    8176                      .dwcfi  undefined, 11
    8177                      .dwcfi  undefined, 12
    8178                      .dwcfi  undefined, 13
    8179                      .dwcfi  same_value, 14
    8180                      .dwcfi  same_value, 15
    8181                      .dwcfi  undefined, 16
    8182                      .dwcfi  undefined, 17
    8183                      .dwcfi  undefined, 18
    8184                      .dwcfi  undefined, 19
    8185                      .dwcfi  undefined, 20
    8186                      .dwcfi  undefined, 21
    8187                      .dwcfi  undefined, 22
    8188                      .dwcfi  undefined, 23
    8189                      .dwcfi  undefined, 24
    8190                      .dwcfi  undefined, 25
    8191                      .dwcfi  same_value, 26
    8192                      .dwcfi  same_value, 27
    8193                      .dwcfi  same_value, 28
    8194                      .dwcfi  same_value, 29
    8195                      .dwcfi  same_value, 30
    8196                      .dwcfi  same_value, 31
    8197                      .dwcfi  undefined, 32
    8198                      .dwcfi  undefined, 33
    8199                      .dwcfi  undefined, 34
    8200                      .dwcfi  undefined, 35
    8201                      .dwcfi  undefined, 36
    8202                      .dwcfi  undefined, 37
    8203                      .dwcfi  undefined, 38
    8204                      .dwcfi  undefined, 39
    8205                      .dwcfi  undefined, 40
    8206                      .dwcfi  undefined, 41
    8207                      .dwcfi  undefined, 42
    8208                      .dwcfi  undefined, 43
