TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE    1

    8189              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 15 05:11:54 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         001450 BE00 
         001452 0000-
    7305 001454 EB6B          MOV AC1, dbl(*AR3(T0))
         001456 18   
    7306                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2717,column 5,is_stmt
    7307 001457 F904          MOV *SP(#2) << #2, AC0 ; |2717| 
         001459 0208 
    7308 00145b 2204          MOV AC0, T0 ; |2717| 
    7309 00145d EC31          AMOV #(_xQueueRegistry+2), XAR3 ; |2717| 
         00145f BE00 
         001461 0002-
    7310 001463 EB6B          MOV AC1, dbl(*AR3(T0))
         001465 18   
    7311                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2718,column 5,is_stmt
    7312 001466 4A0C          B $C$L261 ; |2718| 
    7313                                                      ; branch occurs ; |2718| 
    7314 001468       $C$L260:    
    7315 001468       $C$DW$L$_vQueueUnregisterQueue$5$B:
    7316                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2707,column 81,is_stmt
    7317 001468 F704          ADD #1, *SP(#2) ; |2707| 
         00146a 0001 
    7318                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2707,column 33,is_stmt
    7319 00146c A904          MOV *SP(#2), AR1 ; |2707| 
    7320 00146e 1294          CMPU AR1 < AR2, TC1 ; |2707| 
         001470 A4   
    7321 001471 0464          BCC $C$L259,TC1 ; |2707| 
         001473 B6   
    7322                                                      ; branchcc occurs ; |2707| 
    7323 001474       $C$DW$L$_vQueueUnregisterQueue$5$E:
    7324                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 2726,column 2,is_stmt
    7325 001474       $C$L261:    
    7326 001474 4E03          AADD #3, SP
    7327                      .dwcfi  cfa_offset, 1
    7328              $C$DW$626       .dwtag  DW_TAG_TI_branch
    7329                      .dwattr $C$DW$626, DW_AT_low_pc(0x00)
    7330                      .dwattr $C$DW$626, DW_AT_TI_return
    7331 001476 4804          RET
    7332                                                      ; return occurs
    7333              
    7334              $C$DW$627       .dwtag  DW_TAG_TI_loop
    7335                      .dwattr $C$DW$627, DW_AT_name("F:\eZdsp_DBG\eZDSP_5535_Files\ccsws2\test\Debug\queue.asm:$C$L259:1:15
    7336                      .dwattr $C$DW$627, DW_AT_TI_begin_file("../FreeRTOS/Source/queue.c")
    7337                      .dwattr $C$DW$627, DW_AT_TI_begin_line(0xa93)
    7338                      .dwattr $C$DW$627, DW_AT_TI_end_line(0xaa4)
    7339              $C$DW$628       .dwtag  DW_TAG_TI_loop_range
    7340                      .dwattr $C$DW$628, DW_AT_low_pc($C$DW$L$_vQueueUnregisterQueue$2$B)
    7341                      .dwattr $C$DW$628, DW_AT_high_pc($C$DW$L$_vQueueUnregisterQueue$2$E)
    7342              $C$DW$629       .dwtag  DW_TAG_TI_loop_range
    7343                      .dwattr $C$DW$629, DW_AT_low_pc($C$DW$L$_vQueueUnregisterQueue$5$B)
    7344                      .dwattr $C$DW$629, DW_AT_high_pc($C$DW$L$_vQueueUnregisterQueue$5$E)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  156

    7345                      .dwendtag $C$DW$627
    7346              
    7347                      .dwattr $C$DW$622, DW_AT_TI_end_file("../FreeRTOS/Source/queue.c")
    7348                      .dwattr $C$DW$622, DW_AT_TI_end_line(0xaa6)
    7349                      .dwattr $C$DW$622, DW_AT_TI_end_column(0x02)
    7350                      .dwendentry
    7351                      .dwendtag $C$DW$622
    7352              
    7353              ;******************************************************************************
    7354              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    7355              ;******************************************************************************
    7356                      .global _vPortYield
    7357                      .global _pvPortMalloc
    7358                      .global _vPortFree
    7359                      .global _vListInitialise
    7360                      .global _vTaskSuspendAll
    7361                      .global _xTaskResumeAll
    7362                      .global _vTaskPlaceOnEventList
    7363                      .global _xTaskRemoveFromEventList
    7364                      .global _xTaskGetCurrentTaskHandle
    7365                      .global _xTaskCheckForTimeOut
    7366                      .global _vTaskMissedYield
    7367                      .global _xTaskPriorityInherit
    7368                      .global _xTaskPriorityDisinherit
    7369                      .global _vTaskPriorityDisinheritAfterTimeout
    7370                      .global _pvTaskIncrementMutexHeldCount
    7371                      .global _vTaskInternalSetTimeOutState
    7372                      .global _vCoRoutineAddToDelayedList
    7373                      .global _xCoRoutineRemoveFromEventList
    7374                      .global _usCriticalNesting
    7375                      .global _memcpy
    7376              
    7377              ;*******************************************************************************
    7378              ;* TYPE INFORMATION                                                            *
    7379              ;*******************************************************************************
    7380              
    7381              $C$DW$T$22      .dwtag  DW_TAG_union_type
    7382                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    7383              $C$DW$630       .dwtag  DW_TAG_member
    7384                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$20)
    7385                      .dwattr $C$DW$630, DW_AT_name("xQueue")
    7386                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_xQueue")
    7387                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7388                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    7389              $C$DW$631       .dwtag  DW_TAG_member
    7390                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$21)
    7391                      .dwattr $C$DW$631, DW_AT_name("xSemaphore")
    7392                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_xSemaphore")
    7393                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7394                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    7395                      .dwendtag $C$DW$T$22
    7396              
    7397              
    7398              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7399                      .dwattr $C$DW$T$28, DW_AT_name("QUEUE_REGISTRY_ITEM")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  157

    7400                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    7401              $C$DW$632       .dwtag  DW_TAG_member
    7402                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$25)
    7403                      .dwattr $C$DW$632, DW_AT_name("pcQueueName")
    7404                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_pcQueueName")
    7405                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7406                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    7407              $C$DW$633       .dwtag  DW_TAG_member
    7408                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$27)
    7409                      .dwattr $C$DW$633, DW_AT_name("xHandle")
    7410                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_xHandle")
    7411                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7412                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    7413                      .dwendtag $C$DW$T$28
    7414              
    7415              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueRegistryItem")
    7416                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$28)
    7417                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    7418              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("QueueRegistryItem_t")
    7419                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    7420                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7421              
    7422              $C$DW$T$53      .dwtag  DW_TAG_array_type
    7423                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    7424                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    7425                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x20)
    7426              $C$DW$634       .dwtag  DW_TAG_subrange_type
    7427                      .dwattr $C$DW$634, DW_AT_upper_bound(0x07)
    7428                      .dwendtag $C$DW$T$53
    7429              
    7430              
    7431              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7432                      .dwattr $C$DW$T$35, DW_AT_name("QueueDefinition")
    7433                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x22)
    7434              $C$DW$635       .dwtag  DW_TAG_member
    7435                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$30)
    7436                      .dwattr $C$DW$635, DW_AT_name("pcHead")
    7437                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_pcHead")
    7438                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7439                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    7440              $C$DW$636       .dwtag  DW_TAG_member
    7441                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$30)
    7442                      .dwattr $C$DW$636, DW_AT_name("pcWriteTo")
    7443                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_pcWriteTo")
    7444                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7445                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    7446              $C$DW$637       .dwtag  DW_TAG_member
    7447                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$22)
    7448                      .dwattr $C$DW$637, DW_AT_name("u")
    7449                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_u")
    7450                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7451                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    7452              $C$DW$638       .dwtag  DW_TAG_member
    7453                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$31)
    7454                      .dwattr $C$DW$638, DW_AT_name("xTasksWaitingToSend")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  158

    7455                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_xTasksWaitingToSend")
    7456                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7457                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    7458              $C$DW$639       .dwtag  DW_TAG_member
    7459                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$31)
    7460                      .dwattr $C$DW$639, DW_AT_name("xTasksWaitingToReceive")
    7461                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_xTasksWaitingToReceive")
    7462                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7463                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    7464              $C$DW$640       .dwtag  DW_TAG_member
    7465                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$33)
    7466                      .dwattr $C$DW$640, DW_AT_name("uxMessagesWaiting")
    7467                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_uxMessagesWaiting")
    7468                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7469                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    7470              $C$DW$641       .dwtag  DW_TAG_member
    7471                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$32)
    7472                      .dwattr $C$DW$641, DW_AT_name("uxLength")
    7473                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_uxLength")
    7474                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    7475                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    7476              $C$DW$642       .dwtag  DW_TAG_member
    7477                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$32)
    7478                      .dwattr $C$DW$642, DW_AT_name("uxItemSize")
    7479                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_uxItemSize")
    7480                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7481                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    7482              $C$DW$643       .dwtag  DW_TAG_member
    7483                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$34)
    7484                      .dwattr $C$DW$643, DW_AT_name("cRxLock")
    7485                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_cRxLock")
    7486                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7487                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    7488              $C$DW$644       .dwtag  DW_TAG_member
    7489                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$34)
    7490                      .dwattr $C$DW$644, DW_AT_name("cTxLock")
    7491                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_cTxLock")
    7492                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7493                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    7494                      .dwendtag $C$DW$T$35
    7495              
    7496              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    7497                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$35)
    7498                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    7499              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("QueueHandle_t")
    7500                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    7501                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    7502              $C$DW$645       .dwtag  DW_TAG_TI_far_type
    7503                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$27)
    7504              $C$DW$T$55      .dwtag  DW_TAG_const_type
    7505                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$645)
    7506              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
    7507                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$35)
    7508                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    7509              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("Queue_t")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  159

    7510                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    7511                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    7512              $C$DW$646       .dwtag  DW_TAG_TI_far_type
    7513                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$64)
    7514              $C$DW$T$65      .dwtag  DW_TAG_const_type
    7515                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$646)
    7516              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    7517                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    7518                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    7519              $C$DW$647       .dwtag  DW_TAG_TI_far_type
    7520                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$66)
    7521              $C$DW$T$67      .dwtag  DW_TAG_const_type
    7522                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$647)
    7523              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    7524                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$64)
    7525                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    7526              $C$DW$648       .dwtag  DW_TAG_TI_far_type
    7527                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$68)
    7528              $C$DW$T$69      .dwtag  DW_TAG_const_type
    7529                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$648)
    7530              
    7531              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7532                      .dwattr $C$DW$T$36, DW_AT_name("QueuePointers")
    7533                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    7534              $C$DW$649       .dwtag  DW_TAG_member
    7535                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$30)
    7536                      .dwattr $C$DW$649, DW_AT_name("pcTail")
    7537                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_pcTail")
    7538                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7539                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    7540              $C$DW$650       .dwtag  DW_TAG_member
    7541                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$30)
    7542                      .dwattr $C$DW$650, DW_AT_name("pcReadFrom")
    7543                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_pcReadFrom")
    7544                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7545                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    7546                      .dwendtag $C$DW$T$36
    7547              
    7548              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("QueuePointers_t")
    7549                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$36)
    7550                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    7551              
    7552              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7553                      .dwattr $C$DW$T$39, DW_AT_name("SemaphoreData")
    7554                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    7555              $C$DW$651       .dwtag  DW_TAG_member
    7556                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$38)
    7557                      .dwattr $C$DW$651, DW_AT_name("xMutexHolder")
    7558                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_xMutexHolder")
    7559                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7560                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    7561              $C$DW$652       .dwtag  DW_TAG_member
    7562                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$32)
    7563                      .dwattr $C$DW$652, DW_AT_name("uxRecursiveCallCount")
    7564                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_uxRecursiveCallCount")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  160

    7565                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7566                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    7567                      .dwendtag $C$DW$T$39
    7568              
    7569              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("SemaphoreData_t")
    7570                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$39)
    7571                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    7572              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    7573                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    7574              $C$DW$653       .dwtag  DW_TAG_TI_far_type
    7575                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$3)
    7576              $C$DW$T$76      .dwtag  DW_TAG_const_type
    7577                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$653)
    7578              $C$DW$654       .dwtag  DW_TAG_TI_far_type
    7579              $C$DW$T$70      .dwtag  DW_TAG_const_type
    7580                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$654)
    7581              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    7582                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    7583                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    7584              $C$DW$655       .dwtag  DW_TAG_TI_far_type
    7585                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$71)
    7586              $C$DW$T$77      .dwtag  DW_TAG_const_type
    7587                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$655)
    7588              $C$DW$T$4       .dwtag  DW_TAG_base_type
    7589                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    7590                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    7591                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    7592              $C$DW$T$5       .dwtag  DW_TAG_base_type
    7593                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    7594                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    7595                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    7596              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    7597                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$5)
    7598                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    7599              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    7600                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    7601                      .dwattr $C$DW$T$30, DW_AT_address_class(0x17)
    7602              $C$DW$656       .dwtag  DW_TAG_TI_far_type
    7603                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$29)
    7604              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    7605                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$656)
    7606              $C$DW$657       .dwtag  DW_TAG_TI_far_type
    7607                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$29)
    7608              $C$DW$T$111     .dwtag  DW_TAG_const_type
    7609                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$657)
    7610              $C$DW$T$6       .dwtag  DW_TAG_base_type
    7611                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7612                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    7613                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    7614              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    7615                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$6)
    7616                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    7617              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    7618                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$57)
    7619                      .dwattr $C$DW$T$99, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  161

    7620              $C$DW$658       .dwtag  DW_TAG_TI_far_type
    7621                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$57)
    7622              $C$DW$T$58      .dwtag  DW_TAG_const_type
    7623                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$658)
    7624              $C$DW$T$7       .dwtag  DW_TAG_base_type
    7625                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    7626                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    7627                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    7628              $C$DW$T$8       .dwtag  DW_TAG_base_type
    7629                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    7630                      .dwattr $C$DW$T$8, DW_AT_name("short")
    7631                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    7632              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("BaseType_t")
    7633                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$8)
    7634                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    7635              $C$DW$659       .dwtag  DW_TAG_TI_far_type
    7636                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$49)
    7637              $C$DW$T$112     .dwtag  DW_TAG_const_type
    7638                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$659)
    7639              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    7640                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$49)
    7641                      .dwattr $C$DW$T$135, DW_AT_address_class(0x17)
    7642              $C$DW$660       .dwtag  DW_TAG_TI_far_type
    7643                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$135)
    7644              $C$DW$T$136     .dwtag  DW_TAG_const_type
    7645                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$660)
    7646              $C$DW$T$9       .dwtag  DW_TAG_base_type
    7647                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    7648                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    7649                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    7650              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
    7651                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$9)
    7652                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    7653              $C$DW$661       .dwtag  DW_TAG_TI_far_type
    7654                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$32)
    7655              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    7656                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$661)
    7657              $C$DW$662       .dwtag  DW_TAG_TI_far_type
    7658                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$32)
    7659              $C$DW$T$56      .dwtag  DW_TAG_const_type
    7660                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$662)
    7661              $C$DW$T$10      .dwtag  DW_TAG_base_type
    7662                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    7663                      .dwattr $C$DW$T$10, DW_AT_name("int")
    7664                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    7665              $C$DW$T$11      .dwtag  DW_TAG_base_type
    7666                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    7667                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    7668                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    7669              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    7670                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$11)
    7671              $C$DW$T$155     .dwtag  DW_TAG_volatile_type
    7672                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$663)
    7673              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    7674                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$11)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  162

    7675                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    7676              $C$DW$T$12      .dwtag  DW_TAG_base_type
    7677                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    7678                      .dwattr $C$DW$T$12, DW_AT_name("long")
    7679                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    7680              $C$DW$T$13      .dwtag  DW_TAG_base_type
    7681                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    7682                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    7683                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    7684              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
    7685                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$13)
    7686                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    7687              $C$DW$664       .dwtag  DW_TAG_TI_far_type
    7688                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$44)
    7689              $C$DW$T$86      .dwtag  DW_TAG_const_type
    7690                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$664)
    7691              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    7692                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$44)
    7693                      .dwattr $C$DW$T$120, DW_AT_address_class(0x17)
    7694              $C$DW$665       .dwtag  DW_TAG_TI_far_type
    7695                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$120)
    7696              $C$DW$T$121     .dwtag  DW_TAG_const_type
    7697                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$665)
    7698              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7699                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7700                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7701                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7702                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    7703                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    7704              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7705                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7706                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7707                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7708                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    7709                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    7710              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7711                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7712                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7713                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7714              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7715                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    7716                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7717                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    7718              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7719                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7720                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    7721                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    7722              $C$DW$T$23      .dwtag  DW_TAG_base_type
    7723                      .dwattr $C$DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    7724                      .dwattr $C$DW$T$23, DW_AT_name("signed char")
    7725                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    7726              $C$DW$666       .dwtag  DW_TAG_TI_far_type
    7727                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$23)
    7728              $C$DW$T$24      .dwtag  DW_TAG_const_type
    7729                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$666)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  163

    7730              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    7731                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    7732                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
    7733              
    7734              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7735                      .dwattr $C$DW$T$19, DW_AT_name("tskTaskControlBlock")
    7736                      .dwattr $C$DW$T$19, DW_AT_declaration
    7737                      .dwendtag $C$DW$T$19
    7738              
    7739              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    7740                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
    7741                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    7742              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    7743                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    7744                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7745              $C$DW$667       .dwtag  DW_TAG_TI_far_type
    7746                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$38)
    7747              $C$DW$T$89      .dwtag  DW_TAG_const_type
    7748                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$667)
    7749              
    7750              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7751                      .dwattr $C$DW$T$43, DW_AT_name("xLIST")
    7752                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    7753              $C$DW$668       .dwtag  DW_TAG_member
    7754                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$33)
    7755                      .dwattr $C$DW$668, DW_AT_name("uxNumberOfItems")
    7756                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_uxNumberOfItems")
    7757                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7758                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    7759              $C$DW$669       .dwtag  DW_TAG_member
    7760                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$41)
    7761                      .dwattr $C$DW$669, DW_AT_name("pxIndex")
    7762                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_pxIndex")
    7763                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7764                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    7765              $C$DW$670       .dwtag  DW_TAG_member
    7766                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$42)
    7767                      .dwattr $C$DW$670, DW_AT_name("xListEnd")
    7768                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_xListEnd")
    7769                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7770                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    7771                      .dwendtag $C$DW$T$43
    7772              
    7773              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    7774                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$43)
    7775                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    7776              $C$DW$671       .dwtag  DW_TAG_TI_far_type
    7777                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$31)
    7778              $C$DW$T$115     .dwtag  DW_TAG_const_type
    7779                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$671)
    7780              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    7781                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$115)
    7782                      .dwattr $C$DW$T$116, DW_AT_address_class(0x17)
    7783              $C$DW$672       .dwtag  DW_TAG_TI_far_type
    7784                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$116)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  164

    7785              $C$DW$T$117     .dwtag  DW_TAG_const_type
    7786                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$672)
    7787              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    7788                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$31)
    7789                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    7790              $C$DW$673       .dwtag  DW_TAG_TI_far_type
    7791                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$82)
    7792              $C$DW$T$83      .dwtag  DW_TAG_const_type
    7793                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$673)
    7794              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7795                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$43)
    7796                      .dwattr $C$DW$T$46, DW_AT_address_class(0x17)
    7797              
    7798              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    7799                      .dwattr $C$DW$T$47, DW_AT_name("xLIST_ITEM")
    7800                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x0a)
    7801              $C$DW$674       .dwtag  DW_TAG_member
    7802                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$44)
    7803                      .dwattr $C$DW$674, DW_AT_name("xItemValue")
    7804                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_xItemValue")
    7805                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7806                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7807              $C$DW$675       .dwtag  DW_TAG_member
    7808                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$45)
    7809                      .dwattr $C$DW$675, DW_AT_name("pxNext")
    7810                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_pxNext")
    7811                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7812                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    7813              $C$DW$676       .dwtag  DW_TAG_member
    7814                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$45)
    7815                      .dwattr $C$DW$676, DW_AT_name("pxPrevious")
    7816                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_pxPrevious")
    7817                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7818                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    7819              $C$DW$677       .dwtag  DW_TAG_member
    7820                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$3)
    7821                      .dwattr $C$DW$677, DW_AT_name("pvOwner")
    7822                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_pvOwner")
    7823                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7824                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7825              $C$DW$678       .dwtag  DW_TAG_member
    7826                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$46)
    7827                      .dwattr $C$DW$678, DW_AT_name("pvContainer")
    7828                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_pvContainer")
    7829                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7830                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7831                      .dwendtag $C$DW$T$47
    7832              
    7833              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    7834                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$47)
    7835                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    7836              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    7837                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    7838                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    7839              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  165

    7840                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$47)
    7841                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    7842              
    7843              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    7844                      .dwattr $C$DW$T$48, DW_AT_name("xMINI_LIST_ITEM")
    7845                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x06)
    7846              $C$DW$679       .dwtag  DW_TAG_member
    7847                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$44)
    7848                      .dwattr $C$DW$679, DW_AT_name("xItemValue")
    7849                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_xItemValue")
    7850                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7851                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7852              $C$DW$680       .dwtag  DW_TAG_member
    7853                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$45)
    7854                      .dwattr $C$DW$680, DW_AT_name("pxNext")
    7855                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_pxNext")
    7856                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7857                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7858              $C$DW$681       .dwtag  DW_TAG_member
    7859                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$45)
    7860                      .dwattr $C$DW$681, DW_AT_name("pxPrevious")
    7861                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_pxPrevious")
    7862                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7863                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7864                      .dwendtag $C$DW$T$48
    7865              
    7866              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    7867                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$48)
    7868                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    7869              
    7870              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    7871                      .dwattr $C$DW$T$50, DW_AT_name("xTIME_OUT")
    7872                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    7873              $C$DW$682       .dwtag  DW_TAG_member
    7874                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$49)
    7875                      .dwattr $C$DW$682, DW_AT_name("xOverflowCount")
    7876                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_xOverflowCount")
    7877                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7878                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7879              $C$DW$683       .dwtag  DW_TAG_member
    7880                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$44)
    7881                      .dwattr $C$DW$683, DW_AT_name("xTimeOnEntering")
    7882                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_xTimeOnEntering")
    7883                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7884                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7885                      .dwendtag $C$DW$T$50
    7886              
    7887              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    7888                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$50)
    7889                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    7890              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    7891                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    7892                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    7893              $C$DW$684       .dwtag  DW_TAG_TI_far_type
    7894                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$93)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:11:57 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE  166

    7895              $C$DW$T$94      .dwtag  DW_TAG_const_type
    7896                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$684)
    7897                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    7898              
    7899              ;***************************************************************
    7900              ;* DWARF CIE ENTRIES                                           *
    7901              ;***************************************************************
    7902              
    7903              $C$DW$CIE       .dwcie 91
    7904                      .dwcfi  cfa_register, 36
    7905                      .dwcfi  cfa_offset, 0
    7906                      .dwcfi  undefined, 0
    7907                      .dwcfi  undefined, 1
    7908                      .dwcfi  undefined, 2
    7909                      .dwcfi  undefined, 3
    7910                      .dwcfi  undefined, 4
    7911                      .dwcfi  undefined, 5
    7912                      .dwcfi  undefined, 6
    7913                      .dwcfi  undefined, 7
    7914                      .dwcfi  undefined, 8
    7915                      .dwcfi  undefined, 9
    7916                      .dwcfi  undefined, 10
    7917                      .dwcfi  undefined, 11
    7918                      .dwcfi  undefined, 12
    7919                      .dwcfi  undefined, 13
    7920                      .dwcfi  same_value, 14
    7921                      .dwcfi  same_value, 15
    7922                      .dwcfi  undefined, 16
    7923                      .dwcfi  undefined, 17
    7924                      .dwcfi  undefined, 18
    7925                      .dwcfi  undefined, 19
    7926                      .dwcfi  undefined, 20
    7927                      .dwcfi  undefined, 21
    7928                      .dwcfi  undefined, 22
    7929                      .dwcfi  undefined, 23
    7930                      .dwcfi  undefined, 24
    7931                      .dwcfi  undefined, 25
    7932                      .dwcfi  same_value, 26
    7933                      .dwcfi  same_value, 27
    7934                      .dwcfi  same_value, 28
    7935                      .dwcfi  same_value, 29
    7936                      .dwcfi  same_value, 30
    7937                      .dwcfi  same_value, 31
    7938                      .dwcfi  undefined, 32
    7939                      .dwcfi  undefined, 33
    7940                      .dwcfi  undefined, 34
    7941                      .dwcfi  undefined, 35
    7942                      .dwcfi  undefined, 36
    7943                      .dwcfi  undefined, 37
    7944                      .dwcfi  undefined, 38
    7945                      .dwcfi  undefined, 39
    7946                      .dwcfi  undefined, 40
    7947                      .dwcfi  undefined, 41
    7948                      .dwcfi  undefined, 42
    7949                      .dwcfi  undefined, 43
