TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE    1

    9959              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Thu Sep 20 01:43:11 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    9242              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    9243                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    9244                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    9245              $C$DW$T$136     .dwtag  DW_TAG_pointer_type
    9246                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$28)
    9247                      .dwattr $C$DW$T$136, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  206

    9248              $C$DW$669       .dwtag  DW_TAG_TI_far_type
    9249                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$28)
    9250              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    9251                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$669)
    9252              $C$DW$670       .dwtag  DW_TAG_TI_far_type
    9253                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$28)
    9254              $C$DW$T$81      .dwtag  DW_TAG_const_type
    9255                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$670)
    9256              $C$DW$T$152     .dwtag  DW_TAG_pointer_type
    9257                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$81)
    9258                      .dwattr $C$DW$T$152, DW_AT_address_class(0x17)
    9259              $C$DW$671       .dwtag  DW_TAG_TI_far_type
    9260                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$152)
    9261              $C$DW$T$153     .dwtag  DW_TAG_const_type
    9262                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$671)
    9263              $C$DW$T$14      .dwtag  DW_TAG_base_type
    9264                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    9265                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    9266                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    9267                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    9268                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    9269              $C$DW$T$15      .dwtag  DW_TAG_base_type
    9270                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    9271                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    9272                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    9273                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    9274                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    9275              $C$DW$T$16      .dwtag  DW_TAG_base_type
    9276                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    9277                      .dwattr $C$DW$T$16, DW_AT_name("float")
    9278                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    9279              $C$DW$T$17      .dwtag  DW_TAG_base_type
    9280                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    9281                      .dwattr $C$DW$T$17, DW_AT_name("double")
    9282                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    9283              $C$DW$T$18      .dwtag  DW_TAG_base_type
    9284                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    9285                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    9286                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    9287              $C$DW$T$26      .dwtag  DW_TAG_base_type
    9288                      .dwattr $C$DW$T$26, DW_AT_encoding(DW_ATE_signed_char)
    9289                      .dwattr $C$DW$T$26, DW_AT_name("signed char")
    9290                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    9291              
    9292              $C$DW$T$27      .dwtag  DW_TAG_array_type
    9293                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    9294                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    9295                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
    9296              $C$DW$672       .dwtag  DW_TAG_subrange_type
    9297                      .dwattr $C$DW$672, DW_AT_upper_bound(0x07)
    9298                      .dwendtag $C$DW$T$27
    9299              
    9300              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    9301                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$26)
    9302                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  207

    9303              $C$DW$673       .dwtag  DW_TAG_TI_far_type
    9304                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$26)
    9305              $C$DW$T$78      .dwtag  DW_TAG_const_type
    9306                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$673)
    9307              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9308                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    9309                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    9310              $C$DW$674       .dwtag  DW_TAG_TI_far_type
    9311                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$79)
    9312              $C$DW$T$80      .dwtag  DW_TAG_const_type
    9313                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$674)
    9314              
    9315              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    9316                      .dwattr $C$DW$T$21, DW_AT_name("tagSTACKSTRUCT")
    9317                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    9318              $C$DW$675       .dwtag  DW_TAG_member
    9319                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$20)
    9320                      .dwattr $C$DW$675, DW_AT_name("pxTopOfStack")
    9321                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_pxTopOfStack")
    9322                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9323                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    9324              $C$DW$676       .dwtag  DW_TAG_member
    9325                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$20)
    9326                      .dwattr $C$DW$676, DW_AT_name("pxTopOfSysStack")
    9327                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    9328                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9329                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    9330                      .dwendtag $C$DW$T$21
    9331              
    9332              $C$DW$T$158     .dwtag  DW_TAG_pointer_type
    9333                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$21)
    9334                      .dwattr $C$DW$T$158, DW_AT_address_class(0x17)
    9335              
    9336              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    9337                      .dwattr $C$DW$T$32, DW_AT_name("tskTaskControlBlock")
    9338                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x2e)
    9339              $C$DW$677       .dwtag  DW_TAG_member
    9340                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$23)
    9341                      .dwattr $C$DW$677, DW_AT_name("pxTopOfStack")
    9342                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_pxTopOfStack")
    9343                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9344                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    9345              $C$DW$678       .dwtag  DW_TAG_member
    9346                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$23)
    9347                      .dwattr $C$DW$678, DW_AT_name("pxTopOfSysStack")
    9348                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    9349                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9350                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    9351              $C$DW$679       .dwtag  DW_TAG_member
    9352                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
    9353                      .dwattr $C$DW$679, DW_AT_name("xStateListItem")
    9354                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_xStateListItem")
    9355                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9356                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    9357              $C$DW$680       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  208

    9358                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$24)
    9359                      .dwattr $C$DW$680, DW_AT_name("xEventListItem")
    9360                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_xEventListItem")
    9361                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9362                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    9363              $C$DW$681       .dwtag  DW_TAG_member
    9364                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$25)
    9365                      .dwattr $C$DW$681, DW_AT_name("uxPriority")
    9366                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_uxPriority")
    9367                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9368                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    9369              $C$DW$682       .dwtag  DW_TAG_member
    9370                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$20)
    9371                      .dwattr $C$DW$682, DW_AT_name("pxStack")
    9372                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_pxStack")
    9373                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9374                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    9375              $C$DW$683       .dwtag  DW_TAG_member
    9376                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$20)
    9377                      .dwattr $C$DW$683, DW_AT_name("pxSysStack")
    9378                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_pxSysStack")
    9379                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9380                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    9381              $C$DW$684       .dwtag  DW_TAG_member
    9382                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$27)
    9383                      .dwattr $C$DW$684, DW_AT_name("pcTaskName")
    9384                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_pcTaskName")
    9385                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9386                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    9387              $C$DW$685       .dwtag  DW_TAG_member
    9388                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$25)
    9389                      .dwattr $C$DW$685, DW_AT_name("uxCriticalNesting")
    9390                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_uxCriticalNesting")
    9391                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9392                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    9393              $C$DW$686       .dwtag  DW_TAG_member
    9394                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$25)
    9395                      .dwattr $C$DW$686, DW_AT_name("uxBasePriority")
    9396                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_uxBasePriority")
    9397                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    9398                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    9399              $C$DW$687       .dwtag  DW_TAG_member
    9400                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$25)
    9401                      .dwattr $C$DW$687, DW_AT_name("uxMutexesHeld")
    9402                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_uxMutexesHeld")
    9403                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9404                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    9405              $C$DW$688       .dwtag  DW_TAG_member
    9406                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$29)
    9407                      .dwattr $C$DW$688, DW_AT_name("ulNotifiedValue")
    9408                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ulNotifiedValue")
    9409                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9410                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    9411              $C$DW$689       .dwtag  DW_TAG_member
    9412                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$31)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  209

    9413                      .dwattr $C$DW$689, DW_AT_name("ucNotifyState")
    9414                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_ucNotifyState")
    9415                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9416                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    9417                      .dwendtag $C$DW$T$32
    9418              
    9419              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9420                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$32)
    9421                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    9422              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    9423                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9424                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9425              $C$DW$690       .dwtag  DW_TAG_TI_far_type
    9426                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$48)
    9427              $C$DW$T$110     .dwtag  DW_TAG_const_type
    9428                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$690)
    9429              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    9430                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$48)
    9431                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    9432              $C$DW$691       .dwtag  DW_TAG_TI_far_type
    9433                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$82)
    9434              $C$DW$T$83      .dwtag  DW_TAG_const_type
    9435                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$691)
    9436              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    9437                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$32)
    9438                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    9439              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    9440                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    9441                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    9442              $C$DW$692       .dwtag  DW_TAG_TI_far_type
    9443                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$85)
    9444              $C$DW$T$160     .dwtag  DW_TAG_const_type
    9445                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$692)
    9446              $C$DW$T$161     .dwtag  DW_TAG_pointer_type
    9447                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$160)
    9448                      .dwattr $C$DW$T$161, DW_AT_address_class(0x17)
    9449              $C$DW$693       .dwtag  DW_TAG_TI_far_type
    9450                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$161)
    9451              $C$DW$T$162     .dwtag  DW_TAG_const_type
    9452                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$693)
    9453              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    9454                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    9455                      .dwattr $C$DW$T$86, DW_AT_address_class(0x17)
    9456              $C$DW$694       .dwtag  DW_TAG_TI_far_type
    9457                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$86)
    9458              $C$DW$T$163     .dwtag  DW_TAG_volatile_type
    9459                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$694)
    9460              $C$DW$695       .dwtag  DW_TAG_TI_far_type
    9461                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$86)
    9462              $C$DW$T$164     .dwtag  DW_TAG_const_type
    9463                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$695)
    9464              
    9465              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9466                      .dwattr $C$DW$T$36, DW_AT_name("xLIST")
    9467                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  210

    9468              $C$DW$696       .dwtag  DW_TAG_member
    9469                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$33)
    9470                      .dwattr $C$DW$696, DW_AT_name("uxNumberOfItems")
    9471                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_uxNumberOfItems")
    9472                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9473                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    9474              $C$DW$697       .dwtag  DW_TAG_member
    9475                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$34)
    9476                      .dwattr $C$DW$697, DW_AT_name("pxIndex")
    9477                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_pxIndex")
    9478                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9479                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    9480              $C$DW$698       .dwtag  DW_TAG_member
    9481                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$35)
    9482                      .dwattr $C$DW$698, DW_AT_name("xListEnd")
    9483                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_xListEnd")
    9484                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9485                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    9486                      .dwendtag $C$DW$T$36
    9487              
    9488              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    9489                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$36)
    9490                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    9491              $C$DW$699       .dwtag  DW_TAG_TI_far_type
    9492                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$65)
    9493              $C$DW$T$131     .dwtag  DW_TAG_const_type
    9494                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$699)
    9495              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    9496                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    9497                      .dwattr $C$DW$T$132, DW_AT_address_class(0x17)
    9498              $C$DW$700       .dwtag  DW_TAG_TI_far_type
    9499                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$132)
    9500              $C$DW$T$133     .dwtag  DW_TAG_const_type
    9501                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$700)
    9502              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    9503                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    9504                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    9505              $C$DW$701       .dwtag  DW_TAG_TI_far_type
    9506                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$66)
    9507              $C$DW$T$67      .dwtag  DW_TAG_const_type
    9508                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$701)
    9509              $C$DW$702       .dwtag  DW_TAG_TI_far_type
    9510                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$66)
    9511              $C$DW$T$165     .dwtag  DW_TAG_volatile_type
    9512                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$702)
    9513              
    9514              $C$DW$T$166     .dwtag  DW_TAG_array_type
    9515                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$65)
    9516                      .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    9517                      .dwattr $C$DW$T$166, DW_AT_byte_size(0x32)
    9518              $C$DW$703       .dwtag  DW_TAG_subrange_type
    9519                      .dwattr $C$DW$703, DW_AT_upper_bound(0x04)
    9520                      .dwendtag $C$DW$T$166
    9521              
    9522              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  211

    9523                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    9524                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    9525              
    9526              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9527                      .dwattr $C$DW$T$40, DW_AT_name("xLIST_ITEM")
    9528                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    9529              $C$DW$704       .dwtag  DW_TAG_member
    9530                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$37)
    9531                      .dwattr $C$DW$704, DW_AT_name("xItemValue")
    9532                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_xItemValue")
    9533                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9534                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    9535              $C$DW$705       .dwtag  DW_TAG_member
    9536                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$38)
    9537                      .dwattr $C$DW$705, DW_AT_name("pxNext")
    9538                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_pxNext")
    9539                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9540                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    9541              $C$DW$706       .dwtag  DW_TAG_member
    9542                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$38)
    9543                      .dwattr $C$DW$706, DW_AT_name("pxPrevious")
    9544                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_pxPrevious")
    9545                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9546                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    9547              $C$DW$707       .dwtag  DW_TAG_member
    9548                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$3)
    9549                      .dwattr $C$DW$707, DW_AT_name("pvOwner")
    9550                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_pvOwner")
    9551                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9552                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    9553              $C$DW$708       .dwtag  DW_TAG_member
    9554                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$39)
    9555                      .dwattr $C$DW$708, DW_AT_name("pvContainer")
    9556                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_pvContainer")
    9557                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9558                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    9559                      .dwendtag $C$DW$T$40
    9560              
    9561              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    9562                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$40)
    9563                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    9564              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    9565                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$24)
    9566                      .dwattr $C$DW$T$34, DW_AT_address_class(0x17)
    9567              $C$DW$709       .dwtag  DW_TAG_TI_far_type
    9568                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$34)
    9569              $C$DW$T$70      .dwtag  DW_TAG_const_type
    9570                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$709)
    9571              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    9572                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$40)
    9573                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    9574              
    9575              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9576                      .dwattr $C$DW$T$41, DW_AT_name("xMEMORY_REGION")
    9577                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  212

    9578              $C$DW$710       .dwtag  DW_TAG_member
    9579                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$3)
    9580                      .dwattr $C$DW$710, DW_AT_name("pvBaseAddress")
    9581                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_pvBaseAddress")
    9582                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9583                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    9584              $C$DW$711       .dwtag  DW_TAG_member
    9585                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$28)
    9586                      .dwattr $C$DW$711, DW_AT_name("ulLengthInBytes")
    9587                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_ulLengthInBytes")
    9588                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9589                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    9590              $C$DW$712       .dwtag  DW_TAG_member
    9591                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$28)
    9592                      .dwattr $C$DW$712, DW_AT_name("ulParameters")
    9593                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_ulParameters")
    9594                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9595                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    9596                      .dwendtag $C$DW$T$41
    9597              
    9598              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    9599                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$41)
    9600                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    9601              $C$DW$713       .dwtag  DW_TAG_TI_far_type
    9602                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$87)
    9603              $C$DW$T$88      .dwtag  DW_TAG_const_type
    9604                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$713)
    9605              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    9606                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    9607                      .dwattr $C$DW$T$89, DW_AT_address_class(0x17)
    9608              $C$DW$714       .dwtag  DW_TAG_TI_far_type
    9609                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$89)
    9610              $C$DW$T$90      .dwtag  DW_TAG_const_type
    9611                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$714)
    9612              
    9613              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    9614                      .dwattr $C$DW$T$42, DW_AT_name("xMINI_LIST_ITEM")
    9615                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x06)
    9616              $C$DW$715       .dwtag  DW_TAG_member
    9617                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$37)
    9618                      .dwattr $C$DW$715, DW_AT_name("xItemValue")
    9619                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_xItemValue")
    9620                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9621                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    9622              $C$DW$716       .dwtag  DW_TAG_member
    9623                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$38)
    9624                      .dwattr $C$DW$716, DW_AT_name("pxNext")
    9625                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_pxNext")
    9626                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9627                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    9628              $C$DW$717       .dwtag  DW_TAG_member
    9629                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$38)
    9630                      .dwattr $C$DW$717, DW_AT_name("pxPrevious")
    9631                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_pxPrevious")
    9632                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  213

    9633                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    9634                      .dwendtag $C$DW$T$42
    9635              
    9636              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    9637                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$42)
    9638                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    9639              
    9640              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9641                      .dwattr $C$DW$T$44, DW_AT_name("xTIME_OUT")
    9642                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    9643              $C$DW$718       .dwtag  DW_TAG_member
    9644                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$43)
    9645                      .dwattr $C$DW$718, DW_AT_name("xOverflowCount")
    9646                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_xOverflowCount")
    9647                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9648                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    9649              $C$DW$719       .dwtag  DW_TAG_member
    9650                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$37)
    9651                      .dwattr $C$DW$719, DW_AT_name("xTimeOnEntering")
    9652                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_xTimeOnEntering")
    9653                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9654                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    9655                      .dwendtag $C$DW$T$44
    9656              
    9657              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    9658                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$44)
    9659                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    9660              $C$DW$T$106     .dwtag  DW_TAG_pointer_type
    9661                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
    9662                      .dwattr $C$DW$T$106, DW_AT_address_class(0x17)
    9663              $C$DW$720       .dwtag  DW_TAG_TI_far_type
    9664                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$106)
    9665              $C$DW$T$107     .dwtag  DW_TAG_const_type
    9666                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$720)
    9667                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    9668              
    9669              ;***************************************************************
    9670              ;* DWARF CIE ENTRIES                                           *
    9671              ;***************************************************************
    9672              
    9673              $C$DW$CIE       .dwcie 91
    9674                      .dwcfi  cfa_register, 36
    9675                      .dwcfi  cfa_offset, 0
    9676                      .dwcfi  undefined, 0
    9677                      .dwcfi  undefined, 1
    9678                      .dwcfi  undefined, 2
    9679                      .dwcfi  undefined, 3
    9680                      .dwcfi  undefined, 4
    9681                      .dwcfi  undefined, 5
    9682                      .dwcfi  undefined, 6
    9683                      .dwcfi  undefined, 7
    9684                      .dwcfi  undefined, 8
    9685                      .dwcfi  undefined, 9
    9686                      .dwcfi  undefined, 10
    9687                      .dwcfi  undefined, 11
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:15 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  214

    9688                      .dwcfi  undefined, 12
    9689                      .dwcfi  undefined, 13
    9690                      .dwcfi  same_value, 14
    9691                      .dwcfi  same_value, 15
    9692                      .dwcfi  undefined, 16
    9693                      .dwcfi  undefined, 17
    9694                      .dwcfi  undefined, 18
    9695                      .dwcfi  undefined, 19
    9696                      .dwcfi  undefined, 20
    9697                      .dwcfi  undefined, 21
    9698                      .dwcfi  undefined, 22
    9699                      .dwcfi  undefined, 23
    9700                      .dwcfi  undefined, 24
    9701                      .dwcfi  undefined, 25
    9702                      .dwcfi  same_value, 26
    9703                      .dwcfi  same_value, 27
    9704                      .dwcfi  same_value, 28
    9705                      .dwcfi  same_value, 29
    9706                      .dwcfi  same_value, 30
    9707                      .dwcfi  same_value, 31
    9708                      .dwcfi  undefined, 32
    9709                      .dwcfi  undefined, 33
    9710                      .dwcfi  undefined, 34
    9711                      .dwcfi  undefined, 35
    9712                      .dwcfi  undefined, 36
    9713                      .dwcfi  undefined, 37
    9714                      .dwcfi  undefined, 38
    9715                      .dwcfi  undefined, 39
    9716                      .dwcfi  undefined, 40
    9717                      .dwcfi  undefined, 41
    9718                      .dwcfi  undefined, 42
    9719                      .dwcfi  undefined, 43
