TMS320C55x Assembler PC v4.4.1 Sat Sep 15 04:08:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE    1

    9599              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 15 04:08:22 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    8885                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$40)
    8886              $C$DW$T$144     .dwtag  DW_TAG_volatile_type
    8887                      .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$642)
    8888              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    8889                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$40)
    8890                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    8891              $C$DW$643       .dwtag  DW_TAG_TI_far_type
    8892                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$93)
    8893              $C$DW$T$94      .dwtag  DW_TAG_const_type
    8894                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$643)
    8895              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    8896                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$13)
    8897                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    8898              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    8899                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$31)
    8900                      .dwattr $C$DW$T$132, DW_AT_address_class(0x17)
    8901              $C$DW$644       .dwtag  DW_TAG_TI_far_type
    8902                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$31)
    8903              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    8904                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$644)
    8905              $C$DW$645       .dwtag  DW_TAG_TI_far_type
    8906                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$31)
    8907              $C$DW$T$76      .dwtag  DW_TAG_const_type
    8908                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$645)
    8909              $C$DW$T$14      .dwtag  DW_TAG_base_type
    8910                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    8911                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    8912                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    8913                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    8914                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    8915              $C$DW$T$15      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 04:08:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  198

    8916                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    8917                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    8918                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    8919                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    8920                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    8921              $C$DW$T$16      .dwtag  DW_TAG_base_type
    8922                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    8923                      .dwattr $C$DW$T$16, DW_AT_name("float")
    8924                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    8925              $C$DW$T$17      .dwtag  DW_TAG_base_type
    8926                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    8927                      .dwattr $C$DW$T$17, DW_AT_name("double")
    8928                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    8929              $C$DW$T$18      .dwtag  DW_TAG_base_type
    8930                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    8931                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    8932                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    8933              $C$DW$T$29      .dwtag  DW_TAG_base_type
    8934                      .dwattr $C$DW$T$29, DW_AT_encoding(DW_ATE_signed_char)
    8935                      .dwattr $C$DW$T$29, DW_AT_name("signed char")
    8936                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    8937              
    8938              $C$DW$T$30      .dwtag  DW_TAG_array_type
    8939                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    8940                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    8941                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    8942              $C$DW$646       .dwtag  DW_TAG_subrange_type
    8943                      .dwattr $C$DW$646, DW_AT_upper_bound(0x07)
    8944                      .dwendtag $C$DW$T$30
    8945              
    8946              $C$DW$647       .dwtag  DW_TAG_TI_far_type
    8947                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$29)
    8948              $C$DW$T$73      .dwtag  DW_TAG_const_type
    8949                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$647)
    8950              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    8951                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    8952                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    8953              $C$DW$648       .dwtag  DW_TAG_TI_far_type
    8954                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$74)
    8955              $C$DW$T$75      .dwtag  DW_TAG_const_type
    8956                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$648)
    8957              $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    8958                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$29)
    8959                      .dwattr $C$DW$T$148, DW_AT_address_class(0x17)
    8960              
    8961              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8962                      .dwattr $C$DW$T$20, DW_AT_name("tagSTACKSTRUCT")
    8963                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    8964              $C$DW$649       .dwtag  DW_TAG_member
    8965                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$19)
    8966                      .dwattr $C$DW$649, DW_AT_name("pxTopOfStack")
    8967                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_pxTopOfStack")
    8968                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8969                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    8970              $C$DW$650       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 04:08:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  199

    8971                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$19)
    8972                      .dwattr $C$DW$650, DW_AT_name("pxTopOfSysStack")
    8973                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    8974                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8975                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    8976                      .dwendtag $C$DW$T$20
    8977              
    8978              $C$DW$T$152     .dwtag  DW_TAG_pointer_type
    8979                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$20)
    8980                      .dwattr $C$DW$T$152, DW_AT_address_class(0x17)
    8981              
    8982              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8983                      .dwattr $C$DW$T$35, DW_AT_name("tskTaskControlBlock")
    8984                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x2c)
    8985              $C$DW$651       .dwtag  DW_TAG_member
    8986                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$23)
    8987                      .dwattr $C$DW$651, DW_AT_name("pxTopOfStack")
    8988                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_pxTopOfStack")
    8989                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8990                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    8991              $C$DW$652       .dwtag  DW_TAG_member
    8992                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$25)
    8993                      .dwattr $C$DW$652, DW_AT_name("pxTopOfSysStack")
    8994                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    8995                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8996                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    8997              $C$DW$653       .dwtag  DW_TAG_member
    8998                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$26)
    8999                      .dwattr $C$DW$653, DW_AT_name("xStateListItem")
    9000                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_xStateListItem")
    9001                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9002                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    9003              $C$DW$654       .dwtag  DW_TAG_member
    9004                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$26)
    9005                      .dwattr $C$DW$654, DW_AT_name("xEventListItem")
    9006                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_xEventListItem")
    9007                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9008                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    9009              $C$DW$655       .dwtag  DW_TAG_member
    9010                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$27)
    9011                      .dwattr $C$DW$655, DW_AT_name("uxPriority")
    9012                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_uxPriority")
    9013                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9014                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    9015              $C$DW$656       .dwtag  DW_TAG_member
    9016                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$28)
    9017                      .dwattr $C$DW$656, DW_AT_name("pxStack")
    9018                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_pxStack")
    9019                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9020                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    9021              $C$DW$657       .dwtag  DW_TAG_member
    9022                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$28)
    9023                      .dwattr $C$DW$657, DW_AT_name("pxSysStack")
    9024                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_pxSysStack")
    9025                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 04:08:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  200

    9026                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    9027              $C$DW$658       .dwtag  DW_TAG_member
    9028                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$30)
    9029                      .dwattr $C$DW$658, DW_AT_name("pcTaskName")
    9030                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_pcTaskName")
    9031                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9032                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    9033              $C$DW$659       .dwtag  DW_TAG_member
    9034                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$27)
    9035                      .dwattr $C$DW$659, DW_AT_name("uxBasePriority")
    9036                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_uxBasePriority")
    9037                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9038                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    9039              $C$DW$660       .dwtag  DW_TAG_member
    9040                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$27)
    9041                      .dwattr $C$DW$660, DW_AT_name("uxMutexesHeld")
    9042                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_uxMutexesHeld")
    9043                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    9044                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    9045              $C$DW$661       .dwtag  DW_TAG_member
    9046                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$32)
    9047                      .dwattr $C$DW$661, DW_AT_name("ulNotifiedValue")
    9048                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_ulNotifiedValue")
    9049                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9050                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    9051              $C$DW$662       .dwtag  DW_TAG_member
    9052                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$34)
    9053                      .dwattr $C$DW$662, DW_AT_name("ucNotifyState")
    9054                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_ucNotifyState")
    9055                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9056                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    9057                      .dwendtag $C$DW$T$35
    9058              
    9059              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    9060                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$35)
    9061                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    9062              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    9063                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    9064                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    9065              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    9066                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$78)
    9067              $C$DW$T$107     .dwtag  DW_TAG_const_type
    9068                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$663)
    9069              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9070                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    9071                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    9072              $C$DW$664       .dwtag  DW_TAG_TI_far_type
    9073                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$79)
    9074              $C$DW$T$80      .dwtag  DW_TAG_const_type
    9075                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$664)
    9076              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    9077                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
    9078                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    9079              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    9080                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 04:08:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  201

    9081                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    9082              $C$DW$665       .dwtag  DW_TAG_TI_far_type
    9083                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$82)
    9084              $C$DW$T$154     .dwtag  DW_TAG_const_type
    9085                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$665)
    9086              $C$DW$T$155     .dwtag  DW_TAG_pointer_type
    9087                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9088                      .dwattr $C$DW$T$155, DW_AT_address_class(0x17)
    9089              $C$DW$666       .dwtag  DW_TAG_TI_far_type
    9090                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$155)
    9091              $C$DW$T$156     .dwtag  DW_TAG_const_type
    9092                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$666)
    9093              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    9094                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    9095                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    9096              $C$DW$667       .dwtag  DW_TAG_TI_far_type
    9097                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$83)
    9098              $C$DW$T$157     .dwtag  DW_TAG_volatile_type
    9099                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$667)
    9100              $C$DW$668       .dwtag  DW_TAG_TI_far_type
    9101                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$83)
    9102              $C$DW$T$158     .dwtag  DW_TAG_const_type
    9103                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$668)
    9104              
    9105              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    9106                      .dwattr $C$DW$T$39, DW_AT_name("xLIST")
    9107                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    9108              $C$DW$669       .dwtag  DW_TAG_member
    9109                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$36)
    9110                      .dwattr $C$DW$669, DW_AT_name("uxNumberOfItems")
    9111                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_uxNumberOfItems")
    9112                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9113                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    9114              $C$DW$670       .dwtag  DW_TAG_member
    9115                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$37)
    9116                      .dwattr $C$DW$670, DW_AT_name("pxIndex")
    9117                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_pxIndex")
    9118                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9119                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    9120              $C$DW$671       .dwtag  DW_TAG_member
    9121                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$38)
    9122                      .dwattr $C$DW$671, DW_AT_name("xListEnd")
    9123                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_xListEnd")
    9124                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9125                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    9126                      .dwendtag $C$DW$T$39
    9127              
    9128              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    9129                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$39)
    9130                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    9131              $C$DW$672       .dwtag  DW_TAG_TI_far_type
    9132                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$63)
    9133              $C$DW$T$127     .dwtag  DW_TAG_const_type
    9134                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$672)
    9135              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 04:08:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  202

    9136                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    9137                      .dwattr $C$DW$T$128, DW_AT_address_class(0x17)
    9138              $C$DW$673       .dwtag  DW_TAG_TI_far_type
    9139                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$128)
    9140              $C$DW$T$129     .dwtag  DW_TAG_const_type
    9141                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$673)
    9142              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    9143                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    9144                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    9145              $C$DW$674       .dwtag  DW_TAG_TI_far_type
    9146                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$64)
    9147              $C$DW$T$65      .dwtag  DW_TAG_const_type
    9148                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$674)
    9149              $C$DW$675       .dwtag  DW_TAG_TI_far_type
    9150                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$64)
    9151              $C$DW$T$159     .dwtag  DW_TAG_volatile_type
    9152                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$675)
    9153              
    9154              $C$DW$T$160     .dwtag  DW_TAG_array_type
    9155                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$63)
    9156                      .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    9157                      .dwattr $C$DW$T$160, DW_AT_byte_size(0x32)
    9158              $C$DW$676       .dwtag  DW_TAG_subrange_type
    9159                      .dwattr $C$DW$676, DW_AT_upper_bound(0x04)
    9160                      .dwendtag $C$DW$T$160
    9161              
    9162              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    9163                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$39)
    9164                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    9165              
    9166              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    9167                      .dwattr $C$DW$T$43, DW_AT_name("xLIST_ITEM")
    9168                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    9169              $C$DW$677       .dwtag  DW_TAG_member
    9170                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$40)
    9171                      .dwattr $C$DW$677, DW_AT_name("xItemValue")
    9172                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_xItemValue")
    9173                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9174                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    9175              $C$DW$678       .dwtag  DW_TAG_member
    9176                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$41)
    9177                      .dwattr $C$DW$678, DW_AT_name("pxNext")
    9178                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_pxNext")
    9179                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9180                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    9181              $C$DW$679       .dwtag  DW_TAG_member
    9182                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$41)
    9183                      .dwattr $C$DW$679, DW_AT_name("pxPrevious")
    9184                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_pxPrevious")
    9185                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9186                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    9187              $C$DW$680       .dwtag  DW_TAG_member
    9188                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$3)
    9189                      .dwattr $C$DW$680, DW_AT_name("pvOwner")
    9190                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_pvOwner")
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 04:08:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  203

    9191                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9192                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    9193              $C$DW$681       .dwtag  DW_TAG_member
    9194                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$42)
    9195                      .dwattr $C$DW$681, DW_AT_name("pvContainer")
    9196                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_pvContainer")
    9197                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9198                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    9199                      .dwendtag $C$DW$T$43
    9200              
    9201              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    9202                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$43)
    9203                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    9204              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    9205                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$26)
    9206                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    9207              $C$DW$682       .dwtag  DW_TAG_TI_far_type
    9208                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$37)
    9209              $C$DW$T$68      .dwtag  DW_TAG_const_type
    9210                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$682)
    9211              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    9212                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$43)
    9213                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    9214              
    9215              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9216                      .dwattr $C$DW$T$44, DW_AT_name("xMEMORY_REGION")
    9217                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
    9218              $C$DW$683       .dwtag  DW_TAG_member
    9219                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$3)
    9220                      .dwattr $C$DW$683, DW_AT_name("pvBaseAddress")
    9221                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_pvBaseAddress")
    9222                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9223                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    9224              $C$DW$684       .dwtag  DW_TAG_member
    9225                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$31)
    9226                      .dwattr $C$DW$684, DW_AT_name("ulLengthInBytes")
    9227                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ulLengthInBytes")
    9228                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9229                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    9230              $C$DW$685       .dwtag  DW_TAG_member
    9231                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$31)
    9232                      .dwattr $C$DW$685, DW_AT_name("ulParameters")
    9233                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ulParameters")
    9234                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9235                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    9236                      .dwendtag $C$DW$T$44
    9237              
    9238              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    9239                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$44)
    9240                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    9241              $C$DW$686       .dwtag  DW_TAG_TI_far_type
    9242                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$84)
    9243              $C$DW$T$85      .dwtag  DW_TAG_const_type
    9244                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$686)
    9245              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 04:08:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  204

    9246                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    9247                      .dwattr $C$DW$T$86, DW_AT_address_class(0x17)
    9248              $C$DW$687       .dwtag  DW_TAG_TI_far_type
    9249                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$86)
    9250              $C$DW$T$87      .dwtag  DW_TAG_const_type
    9251                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$687)
    9252              
    9253              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    9254                      .dwattr $C$DW$T$45, DW_AT_name("xMINI_LIST_ITEM")
    9255                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x06)
    9256              $C$DW$688       .dwtag  DW_TAG_member
    9257                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$40)
    9258                      .dwattr $C$DW$688, DW_AT_name("xItemValue")
    9259                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_xItemValue")
    9260                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9261                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    9262              $C$DW$689       .dwtag  DW_TAG_member
    9263                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$41)
    9264                      .dwattr $C$DW$689, DW_AT_name("pxNext")
    9265                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_pxNext")
    9266                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9267                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    9268              $C$DW$690       .dwtag  DW_TAG_member
    9269                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$41)
    9270                      .dwattr $C$DW$690, DW_AT_name("pxPrevious")
    9271                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_pxPrevious")
    9272                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9273                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    9274                      .dwendtag $C$DW$T$45
    9275              
    9276              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    9277                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$45)
    9278                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    9279              
    9280              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    9281                      .dwattr $C$DW$T$47, DW_AT_name("xTIME_OUT")
    9282                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    9283              $C$DW$691       .dwtag  DW_TAG_member
    9284                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$46)
    9285                      .dwattr $C$DW$691, DW_AT_name("xOverflowCount")
    9286                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_xOverflowCount")
    9287                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9288                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    9289              $C$DW$692       .dwtag  DW_TAG_member
    9290                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$40)
    9291                      .dwattr $C$DW$692, DW_AT_name("xTimeOnEntering")
    9292                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_xTimeOnEntering")
    9293                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9294                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    9295                      .dwendtag $C$DW$T$47
    9296              
    9297              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    9298                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$47)
    9299                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    9300              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 04:08:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  205

    9301                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    9302                      .dwattr $C$DW$T$103, DW_AT_address_class(0x17)
    9303              $C$DW$693       .dwtag  DW_TAG_TI_far_type
    9304                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$103)
    9305              $C$DW$T$104     .dwtag  DW_TAG_const_type
    9306                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$693)
    9307                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    9308              
    9309              ;***************************************************************
    9310              ;* DWARF CIE ENTRIES                                           *
    9311              ;***************************************************************
    9312              
    9313              $C$DW$CIE       .dwcie 91
    9314                      .dwcfi  cfa_register, 36
    9315                      .dwcfi  cfa_offset, 0
    9316                      .dwcfi  undefined, 0
    9317                      .dwcfi  undefined, 1
    9318                      .dwcfi  undefined, 2
    9319                      .dwcfi  undefined, 3
    9320                      .dwcfi  undefined, 4
    9321                      .dwcfi  undefined, 5
    9322                      .dwcfi  undefined, 6
    9323                      .dwcfi  undefined, 7
    9324                      .dwcfi  undefined, 8
    9325                      .dwcfi  undefined, 9
    9326                      .dwcfi  undefined, 10
    9327                      .dwcfi  undefined, 11
    9328                      .dwcfi  undefined, 12
    9329                      .dwcfi  undefined, 13
    9330                      .dwcfi  same_value, 14
    9331                      .dwcfi  same_value, 15
    9332                      .dwcfi  undefined, 16
    9333                      .dwcfi  undefined, 17
    9334                      .dwcfi  undefined, 18
    9335                      .dwcfi  undefined, 19
    9336                      .dwcfi  undefined, 20
    9337                      .dwcfi  undefined, 21
    9338                      .dwcfi  undefined, 22
    9339                      .dwcfi  undefined, 23
    9340                      .dwcfi  undefined, 24
    9341                      .dwcfi  undefined, 25
    9342                      .dwcfi  same_value, 26
    9343                      .dwcfi  same_value, 27
    9344                      .dwcfi  same_value, 28
    9345                      .dwcfi  same_value, 29
    9346                      .dwcfi  same_value, 30
    9347                      .dwcfi  same_value, 31
    9348                      .dwcfi  undefined, 32
    9349                      .dwcfi  undefined, 33
    9350                      .dwcfi  undefined, 34
    9351                      .dwcfi  undefined, 35
    9352                      .dwcfi  undefined, 36
    9353                      .dwcfi  undefined, 37
    9354                      .dwcfi  undefined, 38
    9355                      .dwcfi  undefined, 39
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 04:08:26 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  206

