TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:08 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE    1

    9884              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 22 15:54:04 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    9167              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    9168                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$37)
    9169                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:08 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  204

    9170              $C$DW$661       .dwtag  DW_TAG_TI_far_type
    9171                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$93)
    9172              $C$DW$T$94      .dwtag  DW_TAG_const_type
    9173                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$661)
    9174              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    9175                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    9176                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    9177              $C$DW$T$133     .dwtag  DW_TAG_pointer_type
    9178                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$28)
    9179                      .dwattr $C$DW$T$133, DW_AT_address_class(0x17)
    9180              $C$DW$662       .dwtag  DW_TAG_TI_far_type
    9181                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$28)
    9182              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    9183                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$662)
    9184              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    9185                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$28)
    9186              $C$DW$T$78      .dwtag  DW_TAG_const_type
    9187                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$663)
    9188              $C$DW$T$14      .dwtag  DW_TAG_base_type
    9189                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    9190                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    9191                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    9192                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    9193                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    9194              $C$DW$T$15      .dwtag  DW_TAG_base_type
    9195                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    9196                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    9197                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    9198                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    9199                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    9200              $C$DW$T$16      .dwtag  DW_TAG_base_type
    9201                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    9202                      .dwattr $C$DW$T$16, DW_AT_name("float")
    9203                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    9204              $C$DW$T$17      .dwtag  DW_TAG_base_type
    9205                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    9206                      .dwattr $C$DW$T$17, DW_AT_name("double")
    9207                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    9208              $C$DW$T$18      .dwtag  DW_TAG_base_type
    9209                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    9210                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    9211                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    9212              $C$DW$T$26      .dwtag  DW_TAG_base_type
    9213                      .dwattr $C$DW$T$26, DW_AT_encoding(DW_ATE_signed_char)
    9214                      .dwattr $C$DW$T$26, DW_AT_name("signed char")
    9215                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    9216              
    9217              $C$DW$T$27      .dwtag  DW_TAG_array_type
    9218                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    9219                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    9220                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
    9221              $C$DW$664       .dwtag  DW_TAG_subrange_type
    9222                      .dwattr $C$DW$664, DW_AT_upper_bound(0x07)
    9223                      .dwendtag $C$DW$T$27
    9224              
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:08 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  205

    9225              $C$DW$665       .dwtag  DW_TAG_TI_far_type
    9226                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$26)
    9227              $C$DW$T$75      .dwtag  DW_TAG_const_type
    9228                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$665)
    9229              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    9230                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    9231                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    9232              $C$DW$666       .dwtag  DW_TAG_TI_far_type
    9233                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$76)
    9234              $C$DW$T$77      .dwtag  DW_TAG_const_type
    9235                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$666)
    9236              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    9237                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$26)
    9238                      .dwattr $C$DW$T$150, DW_AT_address_class(0x17)
    9239              
    9240              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    9241                      .dwattr $C$DW$T$21, DW_AT_name("tagSTACKSTRUCT")
    9242                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    9243              $C$DW$667       .dwtag  DW_TAG_member
    9244                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$20)
    9245                      .dwattr $C$DW$667, DW_AT_name("pxTopOfStack")
    9246                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_pxTopOfStack")
    9247                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9248                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    9249              $C$DW$668       .dwtag  DW_TAG_member
    9250                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$20)
    9251                      .dwattr $C$DW$668, DW_AT_name("pxTopOfSysStack")
    9252                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    9253                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9254                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    9255                      .dwendtag $C$DW$T$21
    9256              
    9257              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9258                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$21)
    9259                      .dwattr $C$DW$T$154, DW_AT_address_class(0x17)
    9260              
    9261              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    9262                      .dwattr $C$DW$T$32, DW_AT_name("tskTaskControlBlock")
    9263                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x2e)
    9264              $C$DW$669       .dwtag  DW_TAG_member
    9265                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$23)
    9266                      .dwattr $C$DW$669, DW_AT_name("pxTopOfStack")
    9267                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_pxTopOfStack")
    9268                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9269                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    9270              $C$DW$670       .dwtag  DW_TAG_member
    9271                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$23)
    9272                      .dwattr $C$DW$670, DW_AT_name("pxTopOfSysStack")
    9273                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    9274                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9275                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    9276              $C$DW$671       .dwtag  DW_TAG_member
    9277                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$24)
    9278                      .dwattr $C$DW$671, DW_AT_name("xStateListItem")
    9279                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_xStateListItem")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:08 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  206

    9280                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9281                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    9282              $C$DW$672       .dwtag  DW_TAG_member
    9283                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$24)
    9284                      .dwattr $C$DW$672, DW_AT_name("xEventListItem")
    9285                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_xEventListItem")
    9286                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9287                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    9288              $C$DW$673       .dwtag  DW_TAG_member
    9289                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$25)
    9290                      .dwattr $C$DW$673, DW_AT_name("uxPriority")
    9291                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_uxPriority")
    9292                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9293                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    9294              $C$DW$674       .dwtag  DW_TAG_member
    9295                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$20)
    9296                      .dwattr $C$DW$674, DW_AT_name("pxStack")
    9297                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_pxStack")
    9298                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9299                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    9300              $C$DW$675       .dwtag  DW_TAG_member
    9301                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$20)
    9302                      .dwattr $C$DW$675, DW_AT_name("pxSysStack")
    9303                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_pxSysStack")
    9304                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9305                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    9306              $C$DW$676       .dwtag  DW_TAG_member
    9307                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$27)
    9308                      .dwattr $C$DW$676, DW_AT_name("pcTaskName")
    9309                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_pcTaskName")
    9310                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9311                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    9312              $C$DW$677       .dwtag  DW_TAG_member
    9313                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$25)
    9314                      .dwattr $C$DW$677, DW_AT_name("uxCriticalNesting")
    9315                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_uxCriticalNesting")
    9316                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9317                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    9318              $C$DW$678       .dwtag  DW_TAG_member
    9319                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$25)
    9320                      .dwattr $C$DW$678, DW_AT_name("uxBasePriority")
    9321                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_uxBasePriority")
    9322                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    9323                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    9324              $C$DW$679       .dwtag  DW_TAG_member
    9325                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$25)
    9326                      .dwattr $C$DW$679, DW_AT_name("uxMutexesHeld")
    9327                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_uxMutexesHeld")
    9328                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9329                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    9330              $C$DW$680       .dwtag  DW_TAG_member
    9331                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$29)
    9332                      .dwattr $C$DW$680, DW_AT_name("ulNotifiedValue")
    9333                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_ulNotifiedValue")
    9334                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:08 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  207

    9335                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    9336              $C$DW$681       .dwtag  DW_TAG_member
    9337                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$31)
    9338                      .dwattr $C$DW$681, DW_AT_name("ucNotifyState")
    9339                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_ucNotifyState")
    9340                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9341                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    9342                      .dwendtag $C$DW$T$32
    9343              
    9344              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    9345                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$32)
    9346                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    9347              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    9348                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    9349                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    9350              $C$DW$682       .dwtag  DW_TAG_TI_far_type
    9351                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$48)
    9352              $C$DW$T$107     .dwtag  DW_TAG_const_type
    9353                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$682)
    9354              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9355                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$48)
    9356                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    9357              $C$DW$683       .dwtag  DW_TAG_TI_far_type
    9358                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$79)
    9359              $C$DW$T$80      .dwtag  DW_TAG_const_type
    9360                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$683)
    9361              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    9362                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$32)
    9363                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    9364              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    9365                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    9366                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    9367              $C$DW$684       .dwtag  DW_TAG_TI_far_type
    9368                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$82)
    9369              $C$DW$T$156     .dwtag  DW_TAG_const_type
    9370                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$684)
    9371              $C$DW$T$157     .dwtag  DW_TAG_pointer_type
    9372                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$156)
    9373                      .dwattr $C$DW$T$157, DW_AT_address_class(0x17)
    9374              $C$DW$685       .dwtag  DW_TAG_TI_far_type
    9375                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$157)
    9376              $C$DW$T$158     .dwtag  DW_TAG_const_type
    9377                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$685)
    9378              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    9379                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    9380                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    9381              $C$DW$686       .dwtag  DW_TAG_TI_far_type
    9382                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$83)
    9383              $C$DW$T$159     .dwtag  DW_TAG_volatile_type
    9384                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$686)
    9385              $C$DW$687       .dwtag  DW_TAG_TI_far_type
    9386                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$83)
    9387              $C$DW$T$160     .dwtag  DW_TAG_const_type
    9388                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$687)
    9389              
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:08 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  208

    9390              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9391                      .dwattr $C$DW$T$36, DW_AT_name("xLIST")
    9392                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    9393              $C$DW$688       .dwtag  DW_TAG_member
    9394                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$33)
    9395                      .dwattr $C$DW$688, DW_AT_name("uxNumberOfItems")
    9396                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_uxNumberOfItems")
    9397                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9398                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    9399              $C$DW$689       .dwtag  DW_TAG_member
    9400                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$34)
    9401                      .dwattr $C$DW$689, DW_AT_name("pxIndex")
    9402                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_pxIndex")
    9403                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9404                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    9405              $C$DW$690       .dwtag  DW_TAG_member
    9406                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$35)
    9407                      .dwattr $C$DW$690, DW_AT_name("xListEnd")
    9408                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_xListEnd")
    9409                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9410                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    9411                      .dwendtag $C$DW$T$36
    9412              
    9413              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    9414                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$36)
    9415                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    9416              $C$DW$691       .dwtag  DW_TAG_TI_far_type
    9417                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$65)
    9418              $C$DW$T$128     .dwtag  DW_TAG_const_type
    9419                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$691)
    9420              $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    9421                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    9422                      .dwattr $C$DW$T$129, DW_AT_address_class(0x17)
    9423              $C$DW$692       .dwtag  DW_TAG_TI_far_type
    9424                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$129)
    9425              $C$DW$T$130     .dwtag  DW_TAG_const_type
    9426                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$692)
    9427              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    9428                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    9429                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    9430              $C$DW$693       .dwtag  DW_TAG_TI_far_type
    9431                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$66)
    9432              $C$DW$T$67      .dwtag  DW_TAG_const_type
    9433                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$693)
    9434              $C$DW$694       .dwtag  DW_TAG_TI_far_type
    9435                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$66)
    9436              $C$DW$T$161     .dwtag  DW_TAG_volatile_type
    9437                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$694)
    9438              
    9439              $C$DW$T$162     .dwtag  DW_TAG_array_type
    9440                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$65)
    9441                      .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    9442                      .dwattr $C$DW$T$162, DW_AT_byte_size(0x32)
    9443              $C$DW$695       .dwtag  DW_TAG_subrange_type
    9444                      .dwattr $C$DW$695, DW_AT_upper_bound(0x04)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:08 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  209

    9445                      .dwendtag $C$DW$T$162
    9446              
    9447              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    9448                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    9449                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    9450              
    9451              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9452                      .dwattr $C$DW$T$40, DW_AT_name("xLIST_ITEM")
    9453                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    9454              $C$DW$696       .dwtag  DW_TAG_member
    9455                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$37)
    9456                      .dwattr $C$DW$696, DW_AT_name("xItemValue")
    9457                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_xItemValue")
    9458                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9459                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    9460              $C$DW$697       .dwtag  DW_TAG_member
    9461                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$38)
    9462                      .dwattr $C$DW$697, DW_AT_name("pxNext")
    9463                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_pxNext")
    9464                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9465                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    9466              $C$DW$698       .dwtag  DW_TAG_member
    9467                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$38)
    9468                      .dwattr $C$DW$698, DW_AT_name("pxPrevious")
    9469                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_pxPrevious")
    9470                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9471                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    9472              $C$DW$699       .dwtag  DW_TAG_member
    9473                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$3)
    9474                      .dwattr $C$DW$699, DW_AT_name("pvOwner")
    9475                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_pvOwner")
    9476                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9477                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    9478              $C$DW$700       .dwtag  DW_TAG_member
    9479                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$39)
    9480                      .dwattr $C$DW$700, DW_AT_name("pvContainer")
    9481                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_pvContainer")
    9482                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9483                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    9484                      .dwendtag $C$DW$T$40
    9485              
    9486              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    9487                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$40)
    9488                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    9489              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    9490                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$24)
    9491                      .dwattr $C$DW$T$34, DW_AT_address_class(0x17)
    9492              $C$DW$701       .dwtag  DW_TAG_TI_far_type
    9493                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$34)
    9494              $C$DW$T$70      .dwtag  DW_TAG_const_type
    9495                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$701)
    9496              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    9497                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$40)
    9498                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    9499              
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:08 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  210

    9500              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9501                      .dwattr $C$DW$T$41, DW_AT_name("xMEMORY_REGION")
    9502                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
    9503              $C$DW$702       .dwtag  DW_TAG_member
    9504                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$3)
    9505                      .dwattr $C$DW$702, DW_AT_name("pvBaseAddress")
    9506                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_pvBaseAddress")
    9507                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9508                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    9509              $C$DW$703       .dwtag  DW_TAG_member
    9510                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$28)
    9511                      .dwattr $C$DW$703, DW_AT_name("ulLengthInBytes")
    9512                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ulLengthInBytes")
    9513                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9514                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    9515              $C$DW$704       .dwtag  DW_TAG_member
    9516                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$28)
    9517                      .dwattr $C$DW$704, DW_AT_name("ulParameters")
    9518                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_ulParameters")
    9519                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9520                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    9521                      .dwendtag $C$DW$T$41
    9522              
    9523              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    9524                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$41)
    9525                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    9526              $C$DW$705       .dwtag  DW_TAG_TI_far_type
    9527                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$84)
    9528              $C$DW$T$85      .dwtag  DW_TAG_const_type
    9529                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$705)
    9530              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    9531                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    9532                      .dwattr $C$DW$T$86, DW_AT_address_class(0x17)
    9533              $C$DW$706       .dwtag  DW_TAG_TI_far_type
    9534                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$86)
    9535              $C$DW$T$87      .dwtag  DW_TAG_const_type
    9536                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$706)
    9537              
    9538              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    9539                      .dwattr $C$DW$T$42, DW_AT_name("xMINI_LIST_ITEM")
    9540                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x06)
    9541              $C$DW$707       .dwtag  DW_TAG_member
    9542                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$37)
    9543                      .dwattr $C$DW$707, DW_AT_name("xItemValue")
    9544                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_xItemValue")
    9545                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9546                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    9547              $C$DW$708       .dwtag  DW_TAG_member
    9548                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$38)
    9549                      .dwattr $C$DW$708, DW_AT_name("pxNext")
    9550                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_pxNext")
    9551                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9552                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    9553              $C$DW$709       .dwtag  DW_TAG_member
    9554                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$38)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:08 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  211

    9555                      .dwattr $C$DW$709, DW_AT_name("pxPrevious")
    9556                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_pxPrevious")
    9557                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9558                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    9559                      .dwendtag $C$DW$T$42
    9560              
    9561              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    9562                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$42)
    9563                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    9564              
    9565              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9566                      .dwattr $C$DW$T$44, DW_AT_name("xTIME_OUT")
    9567                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    9568              $C$DW$710       .dwtag  DW_TAG_member
    9569                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$43)
    9570                      .dwattr $C$DW$710, DW_AT_name("xOverflowCount")
    9571                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_xOverflowCount")
    9572                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9573                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    9574              $C$DW$711       .dwtag  DW_TAG_member
    9575                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$37)
    9576                      .dwattr $C$DW$711, DW_AT_name("xTimeOnEntering")
    9577                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_xTimeOnEntering")
    9578                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9579                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    9580                      .dwendtag $C$DW$T$44
    9581              
    9582              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    9583                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$44)
    9584                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    9585              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    9586                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    9587                      .dwattr $C$DW$T$103, DW_AT_address_class(0x17)
    9588              $C$DW$712       .dwtag  DW_TAG_TI_far_type
    9589                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$103)
    9590              $C$DW$T$104     .dwtag  DW_TAG_const_type
    9591                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$712)
    9592                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    9593              
    9594              ;***************************************************************
    9595              ;* DWARF CIE ENTRIES                                           *
    9596              ;***************************************************************
    9597              
    9598              $C$DW$CIE       .dwcie 91
    9599                      .dwcfi  cfa_register, 36
    9600                      .dwcfi  cfa_offset, 0
    9601                      .dwcfi  undefined, 0
    9602                      .dwcfi  undefined, 1
    9603                      .dwcfi  undefined, 2
    9604                      .dwcfi  undefined, 3
    9605                      .dwcfi  undefined, 4
    9606                      .dwcfi  undefined, 5
    9607                      .dwcfi  undefined, 6
    9608                      .dwcfi  undefined, 7
    9609                      .dwcfi  undefined, 8
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 15:54:08 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  212

    9610                      .dwcfi  undefined, 9
    9611                      .dwcfi  undefined, 10
    9612                      .dwcfi  undefined, 11
    9613                      .dwcfi  undefined, 12
    9614                      .dwcfi  undefined, 13
    9615                      .dwcfi  same_value, 14
    9616                      .dwcfi  same_value, 15
    9617                      .dwcfi  undefined, 16
    9618                      .dwcfi  undefined, 17
    9619                      .dwcfi  undefined, 18
    9620                      .dwcfi  undefined, 19
    9621                      .dwcfi  undefined, 20
    9622                      .dwcfi  undefined, 21
    9623                      .dwcfi  undefined, 22
    9624                      .dwcfi  undefined, 23
    9625                      .dwcfi  undefined, 24
    9626                      .dwcfi  undefined, 25
    9627                      .dwcfi  same_value, 26
    9628                      .dwcfi  same_value, 27
    9629                      .dwcfi  same_value, 28
    9630                      .dwcfi  same_value, 29
    9631                      .dwcfi  same_value, 30
    9632                      .dwcfi  same_value, 31
    9633                      .dwcfi  undefined, 32
    9634                      .dwcfi  undefined, 33
    9635                      .dwcfi  undefined, 34
    9636                      .dwcfi  undefined, 35
    9637                      .dwcfi  undefined, 36
    9638                      .dwcfi  undefined, 37
    9639                      .dwcfi  undefined, 38
    9640                      .dwcfi  undefined, 39
    9641                      .dwcfi  undefined, 40
    9642                      .dwcfi  undefined, 41
    9643                      .dwcfi  undefined, 42
    9644                      .dwcfi  undefined, 43
