TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE    1

    7777              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 09 04:48:37 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    7075              $C$DW$T$119     .dwtag  DW_TAG_const_type
    7076                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$523)
    7077              $C$DW$T$12      .dwtag  DW_TAG_base_type
    7078                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    7079                      .dwattr $C$DW$T$12, DW_AT_name("long")
    7080                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    7081              $C$DW$T$13      .dwtag  DW_TAG_base_type
    7082                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    7083                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    7084                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    7085              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    7086                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$13)
    7087                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    7088              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    7089                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$31)
    7090                      .dwattr $C$DW$T$131, DW_AT_address_class(0x17)
    7091              $C$DW$524       .dwtag  DW_TAG_TI_far_type
    7092                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$31)
    7093              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    7094                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$524)
    7095              $C$DW$525       .dwtag  DW_TAG_TI_far_type
    7096                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$31)
    7097              $C$DW$T$76      .dwtag  DW_TAG_const_type
    7098                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$525)
    7099              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7100                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7101                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7102                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7103                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    7104                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    7105              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7106                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7107                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7108                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7109                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    7110                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    7111              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7112                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7113                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7114                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7115              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7116                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    7117                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7118                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    7119              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7120                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7121                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    7122                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    7123              $C$DW$T$29      .dwtag  DW_TAG_base_type
    7124                      .dwattr $C$DW$T$29, DW_AT_encoding(DW_ATE_signed_char)
    7125                      .dwattr $C$DW$T$29, DW_AT_name("signed char")
    7126                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    7127              
    7128              $C$DW$T$30      .dwtag  DW_TAG_array_type
    7129                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  159

    7130                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    7131                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    7132              $C$DW$526       .dwtag  DW_TAG_subrange_type
    7133                      .dwattr $C$DW$526, DW_AT_upper_bound(0x07)
    7134                      .dwendtag $C$DW$T$30
    7135              
    7136              $C$DW$527       .dwtag  DW_TAG_TI_far_type
    7137                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$29)
    7138              $C$DW$T$73      .dwtag  DW_TAG_const_type
    7139                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$527)
    7140              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    7141                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    7142                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    7143              $C$DW$528       .dwtag  DW_TAG_TI_far_type
    7144                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$74)
    7145              $C$DW$T$75      .dwtag  DW_TAG_const_type
    7146                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$528)
    7147              $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    7148                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$29)
    7149                      .dwattr $C$DW$T$147, DW_AT_address_class(0x17)
    7150              
    7151              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7152                      .dwattr $C$DW$T$20, DW_AT_name("tagSTACKSTRUCT")
    7153                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    7154              $C$DW$529       .dwtag  DW_TAG_member
    7155                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
    7156                      .dwattr $C$DW$529, DW_AT_name("pxTopOfStack")
    7157                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_pxTopOfStack")
    7158                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7159                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    7160              $C$DW$530       .dwtag  DW_TAG_member
    7161                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
    7162                      .dwattr $C$DW$530, DW_AT_name("pxTopOfSysStack")
    7163                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    7164                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7165                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    7166                      .dwendtag $C$DW$T$20
    7167              
    7168              $C$DW$T$151     .dwtag  DW_TAG_pointer_type
    7169                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$20)
    7170                      .dwattr $C$DW$T$151, DW_AT_address_class(0x17)
    7171              
    7172              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7173                      .dwattr $C$DW$T$35, DW_AT_name("tskTaskControlBlock")
    7174                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x2a)
    7175              $C$DW$531       .dwtag  DW_TAG_member
    7176                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$23)
    7177                      .dwattr $C$DW$531, DW_AT_name("pxTopOfStack")
    7178                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_pxTopOfStack")
    7179                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7180                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    7181              $C$DW$532       .dwtag  DW_TAG_member
    7182                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$25)
    7183                      .dwattr $C$DW$532, DW_AT_name("pxTopOfSysStack")
    7184                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_pxTopOfSysStack")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  160

    7185                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7186                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    7187              $C$DW$533       .dwtag  DW_TAG_member
    7188                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$26)
    7189                      .dwattr $C$DW$533, DW_AT_name("xStateListItem")
    7190                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_xStateListItem")
    7191                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7192                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    7193              $C$DW$534       .dwtag  DW_TAG_member
    7194                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$26)
    7195                      .dwattr $C$DW$534, DW_AT_name("xEventListItem")
    7196                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_xEventListItem")
    7197                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7198                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    7199              $C$DW$535       .dwtag  DW_TAG_member
    7200                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$27)
    7201                      .dwattr $C$DW$535, DW_AT_name("uxPriority")
    7202                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_uxPriority")
    7203                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7204                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    7205              $C$DW$536       .dwtag  DW_TAG_member
    7206                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$28)
    7207                      .dwattr $C$DW$536, DW_AT_name("pxStack")
    7208                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_pxStack")
    7209                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7210                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    7211              $C$DW$537       .dwtag  DW_TAG_member
    7212                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$28)
    7213                      .dwattr $C$DW$537, DW_AT_name("pxSysStack")
    7214                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_pxSysStack")
    7215                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7216                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    7217              $C$DW$538       .dwtag  DW_TAG_member
    7218                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$30)
    7219                      .dwattr $C$DW$538, DW_AT_name("pcTaskName")
    7220                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_pcTaskName")
    7221                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7222                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    7223              $C$DW$539       .dwtag  DW_TAG_member
    7224                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$32)
    7225                      .dwattr $C$DW$539, DW_AT_name("ulNotifiedValue")
    7226                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_ulNotifiedValue")
    7227                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7228                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    7229              $C$DW$540       .dwtag  DW_TAG_member
    7230                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$34)
    7231                      .dwattr $C$DW$540, DW_AT_name("ucNotifyState")
    7232                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_ucNotifyState")
    7233                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7234                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    7235                      .dwendtag $C$DW$T$35
    7236              
    7237              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    7238                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$35)
    7239                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  161

    7240              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    7241                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    7242                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    7243              $C$DW$541       .dwtag  DW_TAG_TI_far_type
    7244                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$78)
    7245              $C$DW$T$122     .dwtag  DW_TAG_const_type
    7246                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$541)
    7247              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    7248                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    7249                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    7250              $C$DW$542       .dwtag  DW_TAG_TI_far_type
    7251                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$79)
    7252              $C$DW$T$80      .dwtag  DW_TAG_const_type
    7253                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$542)
    7254              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    7255                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
    7256                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    7257              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    7258                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    7259                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    7260              $C$DW$543       .dwtag  DW_TAG_TI_far_type
    7261                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$82)
    7262              $C$DW$T$152     .dwtag  DW_TAG_const_type
    7263                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$543)
    7264              $C$DW$T$153     .dwtag  DW_TAG_pointer_type
    7265                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
    7266                      .dwattr $C$DW$T$153, DW_AT_address_class(0x17)
    7267              $C$DW$544       .dwtag  DW_TAG_TI_far_type
    7268                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$153)
    7269              $C$DW$T$154     .dwtag  DW_TAG_const_type
    7270                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$544)
    7271              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    7272                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    7273                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    7274              $C$DW$545       .dwtag  DW_TAG_TI_far_type
    7275                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$83)
    7276              $C$DW$T$155     .dwtag  DW_TAG_volatile_type
    7277                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$545)
    7278              $C$DW$546       .dwtag  DW_TAG_TI_far_type
    7279                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$83)
    7280              $C$DW$T$156     .dwtag  DW_TAG_const_type
    7281                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$546)
    7282              
    7283              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7284                      .dwattr $C$DW$T$39, DW_AT_name("xLIST")
    7285                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    7286              $C$DW$547       .dwtag  DW_TAG_member
    7287                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$36)
    7288                      .dwattr $C$DW$547, DW_AT_name("uxNumberOfItems")
    7289                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_uxNumberOfItems")
    7290                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7291                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    7292              $C$DW$548       .dwtag  DW_TAG_member
    7293                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$37)
    7294                      .dwattr $C$DW$548, DW_AT_name("pxIndex")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  162

    7295                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_pxIndex")
    7296                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7297                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    7298              $C$DW$549       .dwtag  DW_TAG_member
    7299                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$38)
    7300                      .dwattr $C$DW$549, DW_AT_name("xListEnd")
    7301                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_xListEnd")
    7302                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7303                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    7304                      .dwendtag $C$DW$T$39
    7305              
    7306              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    7307                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$39)
    7308                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    7309              $C$DW$550       .dwtag  DW_TAG_TI_far_type
    7310                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$63)
    7311              $C$DW$T$126     .dwtag  DW_TAG_const_type
    7312                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$550)
    7313              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    7314                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    7315                      .dwattr $C$DW$T$127, DW_AT_address_class(0x17)
    7316              $C$DW$551       .dwtag  DW_TAG_TI_far_type
    7317                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$127)
    7318              $C$DW$T$128     .dwtag  DW_TAG_const_type
    7319                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$551)
    7320              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    7321                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    7322                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    7323              $C$DW$552       .dwtag  DW_TAG_TI_far_type
    7324                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$64)
    7325              $C$DW$T$65      .dwtag  DW_TAG_const_type
    7326                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$552)
    7327              $C$DW$553       .dwtag  DW_TAG_TI_far_type
    7328                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$64)
    7329              $C$DW$T$157     .dwtag  DW_TAG_volatile_type
    7330                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$553)
    7331              
    7332              $C$DW$T$158     .dwtag  DW_TAG_array_type
    7333                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$63)
    7334                      .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    7335                      .dwattr $C$DW$T$158, DW_AT_byte_size(0x28)
    7336              $C$DW$554       .dwtag  DW_TAG_subrange_type
    7337                      .dwattr $C$DW$554, DW_AT_upper_bound(0x03)
    7338                      .dwendtag $C$DW$T$158
    7339              
    7340              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    7341                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$39)
    7342                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    7343              
    7344              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7345                      .dwattr $C$DW$T$43, DW_AT_name("xLIST_ITEM")
    7346                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    7347              $C$DW$555       .dwtag  DW_TAG_member
    7348                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$40)
    7349                      .dwattr $C$DW$555, DW_AT_name("xItemValue")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  163

    7350                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_xItemValue")
    7351                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7352                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    7353              $C$DW$556       .dwtag  DW_TAG_member
    7354                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$41)
    7355                      .dwattr $C$DW$556, DW_AT_name("pxNext")
    7356                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_pxNext")
    7357                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7358                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    7359              $C$DW$557       .dwtag  DW_TAG_member
    7360                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$41)
    7361                      .dwattr $C$DW$557, DW_AT_name("pxPrevious")
    7362                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_pxPrevious")
    7363                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7364                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    7365              $C$DW$558       .dwtag  DW_TAG_member
    7366                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$3)
    7367                      .dwattr $C$DW$558, DW_AT_name("pvOwner")
    7368                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_pvOwner")
    7369                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7370                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    7371              $C$DW$559       .dwtag  DW_TAG_member
    7372                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$42)
    7373                      .dwattr $C$DW$559, DW_AT_name("pvContainer")
    7374                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_pvContainer")
    7375                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7376                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    7377                      .dwendtag $C$DW$T$43
    7378              
    7379              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    7380                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$43)
    7381                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    7382              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    7383                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$26)
    7384                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    7385              $C$DW$560       .dwtag  DW_TAG_TI_far_type
    7386                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$37)
    7387              $C$DW$T$68      .dwtag  DW_TAG_const_type
    7388                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$560)
    7389              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    7390                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$43)
    7391                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    7392              
    7393              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    7394                      .dwattr $C$DW$T$44, DW_AT_name("xMEMORY_REGION")
    7395                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
    7396              $C$DW$561       .dwtag  DW_TAG_member
    7397                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$3)
    7398                      .dwattr $C$DW$561, DW_AT_name("pvBaseAddress")
    7399                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_pvBaseAddress")
    7400                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7401                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    7402              $C$DW$562       .dwtag  DW_TAG_member
    7403                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$31)
    7404                      .dwattr $C$DW$562, DW_AT_name("ulLengthInBytes")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  164

    7405                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_ulLengthInBytes")
    7406                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7407                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    7408              $C$DW$563       .dwtag  DW_TAG_member
    7409                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$31)
    7410                      .dwattr $C$DW$563, DW_AT_name("ulParameters")
    7411                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_ulParameters")
    7412                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7413                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    7414                      .dwendtag $C$DW$T$44
    7415              
    7416              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    7417                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$44)
    7418                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    7419              $C$DW$564       .dwtag  DW_TAG_TI_far_type
    7420                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$84)
    7421              $C$DW$T$85      .dwtag  DW_TAG_const_type
    7422                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$564)
    7423              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    7424                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    7425                      .dwattr $C$DW$T$86, DW_AT_address_class(0x17)
    7426              $C$DW$565       .dwtag  DW_TAG_TI_far_type
    7427                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$86)
    7428              $C$DW$T$87      .dwtag  DW_TAG_const_type
    7429                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$565)
    7430              
    7431              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7432                      .dwattr $C$DW$T$45, DW_AT_name("xMINI_LIST_ITEM")
    7433                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x06)
    7434              $C$DW$566       .dwtag  DW_TAG_member
    7435                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$40)
    7436                      .dwattr $C$DW$566, DW_AT_name("xItemValue")
    7437                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_xItemValue")
    7438                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7439                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    7440              $C$DW$567       .dwtag  DW_TAG_member
    7441                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$41)
    7442                      .dwattr $C$DW$567, DW_AT_name("pxNext")
    7443                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_pxNext")
    7444                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7445                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    7446              $C$DW$568       .dwtag  DW_TAG_member
    7447                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$41)
    7448                      .dwattr $C$DW$568, DW_AT_name("pxPrevious")
    7449                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_pxPrevious")
    7450                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7451                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    7452                      .dwendtag $C$DW$T$45
    7453              
    7454              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    7455                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$45)
    7456                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7457              
    7458              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    7459                      .dwattr $C$DW$T$47, DW_AT_name("xTIME_OUT")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  165

    7460                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    7461              $C$DW$569       .dwtag  DW_TAG_member
    7462                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$46)
    7463                      .dwattr $C$DW$569, DW_AT_name("xOverflowCount")
    7464                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_xOverflowCount")
    7465                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7466                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    7467              $C$DW$570       .dwtag  DW_TAG_member
    7468                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$40)
    7469                      .dwattr $C$DW$570, DW_AT_name("xTimeOnEntering")
    7470                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_xTimeOnEntering")
    7471                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7472                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    7473                      .dwendtag $C$DW$T$47
    7474              
    7475              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    7476                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$47)
    7477                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    7478              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    7479                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    7480                      .dwattr $C$DW$T$103, DW_AT_address_class(0x17)
    7481              $C$DW$571       .dwtag  DW_TAG_TI_far_type
    7482                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$103)
    7483              $C$DW$T$104     .dwtag  DW_TAG_const_type
    7484                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$571)
    7485                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    7486              
    7487              ;***************************************************************
    7488              ;* DWARF CIE ENTRIES                                           *
    7489              ;***************************************************************
    7490              
    7491              $C$DW$CIE       .dwcie 91
    7492                      .dwcfi  cfa_register, 36
    7493                      .dwcfi  cfa_offset, 0
    7494                      .dwcfi  undefined, 0
    7495                      .dwcfi  undefined, 1
    7496                      .dwcfi  undefined, 2
    7497                      .dwcfi  undefined, 3
    7498                      .dwcfi  undefined, 4
    7499                      .dwcfi  undefined, 5
    7500                      .dwcfi  undefined, 6
    7501                      .dwcfi  undefined, 7
    7502                      .dwcfi  undefined, 8
    7503                      .dwcfi  undefined, 9
    7504                      .dwcfi  undefined, 10
    7505                      .dwcfi  undefined, 11
    7506                      .dwcfi  undefined, 12
    7507                      .dwcfi  undefined, 13
    7508                      .dwcfi  same_value, 14
    7509                      .dwcfi  same_value, 15
    7510                      .dwcfi  undefined, 16
    7511                      .dwcfi  undefined, 17
    7512                      .dwcfi  undefined, 18
    7513                      .dwcfi  undefined, 19
    7514                      .dwcfi  undefined, 20
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 04:48:39 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  166

    7515                      .dwcfi  undefined, 21
    7516                      .dwcfi  undefined, 22
    7517                      .dwcfi  undefined, 23
    7518                      .dwcfi  undefined, 24
    7519                      .dwcfi  undefined, 25
    7520                      .dwcfi  same_value, 26
    7521                      .dwcfi  same_value, 27
    7522                      .dwcfi  same_value, 28
    7523                      .dwcfi  same_value, 29
    7524                      .dwcfi  same_value, 30
    7525                      .dwcfi  same_value, 31
    7526                      .dwcfi  undefined, 32
    7527                      .dwcfi  undefined, 33
    7528                      .dwcfi  undefined, 34
    7529                      .dwcfi  undefined, 35
    7530                      .dwcfi  undefined, 36
    7531                      .dwcfi  undefined, 37
    7532                      .dwcfi  undefined, 38
    7533                      .dwcfi  undefined, 39
    7534                      .dwcfi  undefined, 40
    7535                      .dwcfi  undefined, 41
    7536                      .dwcfi  undefined, 42
    7537                      .dwcfi  undefined, 43
