TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE    1

    7826              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 14 03:54:02 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    7127              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    7128                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$40)
    7129                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    7130              $C$DW$527       .dwtag  DW_TAG_TI_far_type
    7131                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$93)
    7132              $C$DW$T$94      .dwtag  DW_TAG_const_type
    7133                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$527)
    7134              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    7135                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$13)
    7136                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    7137              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    7138                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$31)
    7139                      .dwattr $C$DW$T$131, DW_AT_address_class(0x17)
    7140              $C$DW$528       .dwtag  DW_TAG_TI_far_type
    7141                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$31)
    7142              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    7143                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$528)
    7144              $C$DW$529       .dwtag  DW_TAG_TI_far_type
    7145                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$31)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  161

    7146              $C$DW$T$76      .dwtag  DW_TAG_const_type
    7147                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$529)
    7148              $C$DW$T$14      .dwtag  DW_TAG_base_type
    7149                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    7150                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    7151                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    7152                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    7153                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    7154              $C$DW$T$15      .dwtag  DW_TAG_base_type
    7155                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    7156                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    7157                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    7158                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    7159                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    7160              $C$DW$T$16      .dwtag  DW_TAG_base_type
    7161                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    7162                      .dwattr $C$DW$T$16, DW_AT_name("float")
    7163                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    7164              $C$DW$T$17      .dwtag  DW_TAG_base_type
    7165                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    7166                      .dwattr $C$DW$T$17, DW_AT_name("double")
    7167                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    7168              $C$DW$T$18      .dwtag  DW_TAG_base_type
    7169                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    7170                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    7171                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    7172              $C$DW$T$29      .dwtag  DW_TAG_base_type
    7173                      .dwattr $C$DW$T$29, DW_AT_encoding(DW_ATE_signed_char)
    7174                      .dwattr $C$DW$T$29, DW_AT_name("signed char")
    7175                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    7176              
    7177              $C$DW$T$30      .dwtag  DW_TAG_array_type
    7178                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    7179                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    7180                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    7181              $C$DW$530       .dwtag  DW_TAG_subrange_type
    7182                      .dwattr $C$DW$530, DW_AT_upper_bound(0x07)
    7183                      .dwendtag $C$DW$T$30
    7184              
    7185              $C$DW$531       .dwtag  DW_TAG_TI_far_type
    7186                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$29)
    7187              $C$DW$T$73      .dwtag  DW_TAG_const_type
    7188                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$531)
    7189              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    7190                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    7191                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    7192              $C$DW$532       .dwtag  DW_TAG_TI_far_type
    7193                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$74)
    7194              $C$DW$T$75      .dwtag  DW_TAG_const_type
    7195                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$532)
    7196              $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    7197                      .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$29)
    7198                      .dwattr $C$DW$T$147, DW_AT_address_class(0x17)
    7199              
    7200              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  162

    7201                      .dwattr $C$DW$T$20, DW_AT_name("tagSTACKSTRUCT")
    7202                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    7203              $C$DW$533       .dwtag  DW_TAG_member
    7204                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$19)
    7205                      .dwattr $C$DW$533, DW_AT_name("pxTopOfStack")
    7206                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_pxTopOfStack")
    7207                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7208                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    7209              $C$DW$534       .dwtag  DW_TAG_member
    7210                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$19)
    7211                      .dwattr $C$DW$534, DW_AT_name("pxTopOfSysStack")
    7212                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    7213                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7214                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    7215                      .dwendtag $C$DW$T$20
    7216              
    7217              $C$DW$T$151     .dwtag  DW_TAG_pointer_type
    7218                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$20)
    7219                      .dwattr $C$DW$T$151, DW_AT_address_class(0x17)
    7220              
    7221              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7222                      .dwattr $C$DW$T$35, DW_AT_name("tskTaskControlBlock")
    7223                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x2a)
    7224              $C$DW$535       .dwtag  DW_TAG_member
    7225                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$23)
    7226                      .dwattr $C$DW$535, DW_AT_name("pxTopOfStack")
    7227                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_pxTopOfStack")
    7228                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7229                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    7230              $C$DW$536       .dwtag  DW_TAG_member
    7231                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$25)
    7232                      .dwattr $C$DW$536, DW_AT_name("pxTopOfSysStack")
    7233                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    7234                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7235                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    7236              $C$DW$537       .dwtag  DW_TAG_member
    7237                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$26)
    7238                      .dwattr $C$DW$537, DW_AT_name("xStateListItem")
    7239                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_xStateListItem")
    7240                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7241                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    7242              $C$DW$538       .dwtag  DW_TAG_member
    7243                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$26)
    7244                      .dwattr $C$DW$538, DW_AT_name("xEventListItem")
    7245                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_xEventListItem")
    7246                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7247                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    7248              $C$DW$539       .dwtag  DW_TAG_member
    7249                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$27)
    7250                      .dwattr $C$DW$539, DW_AT_name("uxPriority")
    7251                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_uxPriority")
    7252                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7253                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    7254              $C$DW$540       .dwtag  DW_TAG_member
    7255                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$28)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  163

    7256                      .dwattr $C$DW$540, DW_AT_name("pxStack")
    7257                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_pxStack")
    7258                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7259                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    7260              $C$DW$541       .dwtag  DW_TAG_member
    7261                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$28)
    7262                      .dwattr $C$DW$541, DW_AT_name("pxSysStack")
    7263                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_pxSysStack")
    7264                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7265                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    7266              $C$DW$542       .dwtag  DW_TAG_member
    7267                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$30)
    7268                      .dwattr $C$DW$542, DW_AT_name("pcTaskName")
    7269                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_pcTaskName")
    7270                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7271                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    7272              $C$DW$543       .dwtag  DW_TAG_member
    7273                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$32)
    7274                      .dwattr $C$DW$543, DW_AT_name("ulNotifiedValue")
    7275                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_ulNotifiedValue")
    7276                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7277                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    7278              $C$DW$544       .dwtag  DW_TAG_member
    7279                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$34)
    7280                      .dwattr $C$DW$544, DW_AT_name("ucNotifyState")
    7281                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_ucNotifyState")
    7282                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7283                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    7284                      .dwendtag $C$DW$T$35
    7285              
    7286              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    7287                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$35)
    7288                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    7289              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    7290                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    7291                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    7292              $C$DW$545       .dwtag  DW_TAG_TI_far_type
    7293                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$78)
    7294              $C$DW$T$122     .dwtag  DW_TAG_const_type
    7295                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$545)
    7296              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    7297                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    7298                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    7299              $C$DW$546       .dwtag  DW_TAG_TI_far_type
    7300                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$79)
    7301              $C$DW$T$80      .dwtag  DW_TAG_const_type
    7302                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$546)
    7303              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    7304                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
    7305                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    7306              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    7307                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    7308                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    7309              $C$DW$547       .dwtag  DW_TAG_TI_far_type
    7310                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$82)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  164

    7311              $C$DW$T$152     .dwtag  DW_TAG_const_type
    7312                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$547)
    7313              $C$DW$T$153     .dwtag  DW_TAG_pointer_type
    7314                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
    7315                      .dwattr $C$DW$T$153, DW_AT_address_class(0x17)
    7316              $C$DW$548       .dwtag  DW_TAG_TI_far_type
    7317                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$153)
    7318              $C$DW$T$154     .dwtag  DW_TAG_const_type
    7319                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$548)
    7320              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    7321                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    7322                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    7323              $C$DW$549       .dwtag  DW_TAG_TI_far_type
    7324                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$83)
    7325              $C$DW$T$155     .dwtag  DW_TAG_volatile_type
    7326                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$549)
    7327              $C$DW$550       .dwtag  DW_TAG_TI_far_type
    7328                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$83)
    7329              $C$DW$T$156     .dwtag  DW_TAG_const_type
    7330                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$550)
    7331              
    7332              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7333                      .dwattr $C$DW$T$39, DW_AT_name("xLIST")
    7334                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    7335              $C$DW$551       .dwtag  DW_TAG_member
    7336                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$36)
    7337                      .dwattr $C$DW$551, DW_AT_name("uxNumberOfItems")
    7338                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_uxNumberOfItems")
    7339                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7340                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    7341              $C$DW$552       .dwtag  DW_TAG_member
    7342                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$37)
    7343                      .dwattr $C$DW$552, DW_AT_name("pxIndex")
    7344                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_pxIndex")
    7345                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7346                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    7347              $C$DW$553       .dwtag  DW_TAG_member
    7348                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$38)
    7349                      .dwattr $C$DW$553, DW_AT_name("xListEnd")
    7350                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_xListEnd")
    7351                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7352                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    7353                      .dwendtag $C$DW$T$39
    7354              
    7355              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    7356                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$39)
    7357                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    7358              $C$DW$554       .dwtag  DW_TAG_TI_far_type
    7359                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$63)
    7360              $C$DW$T$126     .dwtag  DW_TAG_const_type
    7361                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$554)
    7362              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    7363                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    7364                      .dwattr $C$DW$T$127, DW_AT_address_class(0x17)
    7365              $C$DW$555       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  165

    7366                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$127)
    7367              $C$DW$T$128     .dwtag  DW_TAG_const_type
    7368                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$555)
    7369              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    7370                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    7371                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    7372              $C$DW$556       .dwtag  DW_TAG_TI_far_type
    7373                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$64)
    7374              $C$DW$T$65      .dwtag  DW_TAG_const_type
    7375                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$556)
    7376              $C$DW$557       .dwtag  DW_TAG_TI_far_type
    7377                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$64)
    7378              $C$DW$T$157     .dwtag  DW_TAG_volatile_type
    7379                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$557)
    7380              
    7381              $C$DW$T$158     .dwtag  DW_TAG_array_type
    7382                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$63)
    7383                      .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    7384                      .dwattr $C$DW$T$158, DW_AT_byte_size(0x28)
    7385              $C$DW$558       .dwtag  DW_TAG_subrange_type
    7386                      .dwattr $C$DW$558, DW_AT_upper_bound(0x03)
    7387                      .dwendtag $C$DW$T$158
    7388              
    7389              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    7390                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$39)
    7391                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    7392              
    7393              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7394                      .dwattr $C$DW$T$43, DW_AT_name("xLIST_ITEM")
    7395                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    7396              $C$DW$559       .dwtag  DW_TAG_member
    7397                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$40)
    7398                      .dwattr $C$DW$559, DW_AT_name("xItemValue")
    7399                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_xItemValue")
    7400                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7401                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    7402              $C$DW$560       .dwtag  DW_TAG_member
    7403                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$41)
    7404                      .dwattr $C$DW$560, DW_AT_name("pxNext")
    7405                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_pxNext")
    7406                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7407                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    7408              $C$DW$561       .dwtag  DW_TAG_member
    7409                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$41)
    7410                      .dwattr $C$DW$561, DW_AT_name("pxPrevious")
    7411                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_pxPrevious")
    7412                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7413                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    7414              $C$DW$562       .dwtag  DW_TAG_member
    7415                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$3)
    7416                      .dwattr $C$DW$562, DW_AT_name("pvOwner")
    7417                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_pvOwner")
    7418                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7419                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    7420              $C$DW$563       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  166

    7421                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$42)
    7422                      .dwattr $C$DW$563, DW_AT_name("pvContainer")
    7423                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_pvContainer")
    7424                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7425                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    7426                      .dwendtag $C$DW$T$43
    7427              
    7428              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    7429                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$43)
    7430                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    7431              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    7432                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$26)
    7433                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    7434              $C$DW$564       .dwtag  DW_TAG_TI_far_type
    7435                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$37)
    7436              $C$DW$T$68      .dwtag  DW_TAG_const_type
    7437                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$564)
    7438              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    7439                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$43)
    7440                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    7441              
    7442              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    7443                      .dwattr $C$DW$T$44, DW_AT_name("xMEMORY_REGION")
    7444                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
    7445              $C$DW$565       .dwtag  DW_TAG_member
    7446                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$3)
    7447                      .dwattr $C$DW$565, DW_AT_name("pvBaseAddress")
    7448                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_pvBaseAddress")
    7449                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7450                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    7451              $C$DW$566       .dwtag  DW_TAG_member
    7452                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$31)
    7453                      .dwattr $C$DW$566, DW_AT_name("ulLengthInBytes")
    7454                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_ulLengthInBytes")
    7455                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7456                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    7457              $C$DW$567       .dwtag  DW_TAG_member
    7458                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$31)
    7459                      .dwattr $C$DW$567, DW_AT_name("ulParameters")
    7460                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_ulParameters")
    7461                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7462                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    7463                      .dwendtag $C$DW$T$44
    7464              
    7465              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    7466                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$44)
    7467                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    7468              $C$DW$568       .dwtag  DW_TAG_TI_far_type
    7469                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$84)
    7470              $C$DW$T$85      .dwtag  DW_TAG_const_type
    7471                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$568)
    7472              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    7473                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    7474                      .dwattr $C$DW$T$86, DW_AT_address_class(0x17)
    7475              $C$DW$569       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  167

    7476                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$86)
    7477              $C$DW$T$87      .dwtag  DW_TAG_const_type
    7478                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$569)
    7479              
    7480              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7481                      .dwattr $C$DW$T$45, DW_AT_name("xMINI_LIST_ITEM")
    7482                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x06)
    7483              $C$DW$570       .dwtag  DW_TAG_member
    7484                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$40)
    7485                      .dwattr $C$DW$570, DW_AT_name("xItemValue")
    7486                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_xItemValue")
    7487                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7488                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    7489              $C$DW$571       .dwtag  DW_TAG_member
    7490                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$41)
    7491                      .dwattr $C$DW$571, DW_AT_name("pxNext")
    7492                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_pxNext")
    7493                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7494                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    7495              $C$DW$572       .dwtag  DW_TAG_member
    7496                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$41)
    7497                      .dwattr $C$DW$572, DW_AT_name("pxPrevious")
    7498                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_pxPrevious")
    7499                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7500                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    7501                      .dwendtag $C$DW$T$45
    7502              
    7503              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    7504                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$45)
    7505                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7506              
    7507              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    7508                      .dwattr $C$DW$T$47, DW_AT_name("xTIME_OUT")
    7509                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    7510              $C$DW$573       .dwtag  DW_TAG_member
    7511                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$46)
    7512                      .dwattr $C$DW$573, DW_AT_name("xOverflowCount")
    7513                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_xOverflowCount")
    7514                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7515                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    7516              $C$DW$574       .dwtag  DW_TAG_member
    7517                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$40)
    7518                      .dwattr $C$DW$574, DW_AT_name("xTimeOnEntering")
    7519                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_xTimeOnEntering")
    7520                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7521                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    7522                      .dwendtag $C$DW$T$47
    7523              
    7524              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    7525                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$47)
    7526                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    7527              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    7528                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    7529                      .dwattr $C$DW$T$103, DW_AT_address_class(0x17)
    7530              $C$DW$575       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:05 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  168

    7531                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$103)
    7532              $C$DW$T$104     .dwtag  DW_TAG_const_type
    7533                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$575)
    7534                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    7535              
    7536              ;***************************************************************
    7537              ;* DWARF CIE ENTRIES                                           *
    7538              ;***************************************************************
    7539              
    7540              $C$DW$CIE       .dwcie 91
    7541                      .dwcfi  cfa_register, 36
    7542                      .dwcfi  cfa_offset, 0
    7543                      .dwcfi  undefined, 0
    7544                      .dwcfi  undefined, 1
    7545                      .dwcfi  undefined, 2
    7546                      .dwcfi  undefined, 3
    7547                      .dwcfi  undefined, 4
    7548                      .dwcfi  undefined, 5
    7549                      .dwcfi  undefined, 6
    7550                      .dwcfi  undefined, 7
    7551                      .dwcfi  undefined, 8
    7552                      .dwcfi  undefined, 9
    7553                      .dwcfi  undefined, 10
    7554                      .dwcfi  undefined, 11
    7555                      .dwcfi  undefined, 12
    7556                      .dwcfi  undefined, 13
    7557                      .dwcfi  same_value, 14
    7558                      .dwcfi  same_value, 15
    7559                      .dwcfi  undefined, 16
    7560                      .dwcfi  undefined, 17
    7561                      .dwcfi  undefined, 18
    7562                      .dwcfi  undefined, 19
    7563                      .dwcfi  undefined, 20
    7564                      .dwcfi  undefined, 21
    7565                      .dwcfi  undefined, 22
    7566                      .dwcfi  undefined, 23
    7567                      .dwcfi  undefined, 24
    7568                      .dwcfi  undefined, 25
    7569                      .dwcfi  same_value, 26
    7570                      .dwcfi  same_value, 27
    7571                      .dwcfi  same_value, 28
    7572                      .dwcfi  same_value, 29
    7573                      .dwcfi  same_value, 30
    7574                      .dwcfi  same_value, 31
    7575                      .dwcfi  undefined, 32
    7576                      .dwcfi  undefined, 33
    7577                      .dwcfi  undefined, 34
    7578                      .dwcfi  undefined, 35
    7579                      .dwcfi  undefined, 36
    7580                      .dwcfi  undefined, 37
    7581                      .dwcfi  undefined, 38
    7582                      .dwcfi  undefined, 39
    7583                      .dwcfi  undefined, 40
    7584                      .dwcfi  undefined, 41
    7585                      .dwcfi  undefined, 42
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:05 2018

