TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:56 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE    1

    9724              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Sep 18 04:49:52 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    9007              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    9008                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    9009                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    9010              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    9011                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$28)
    9012                      .dwattr $C$DW$T$132, DW_AT_address_class(0x17)
    9013              $C$DW$652       .dwtag  DW_TAG_TI_far_type
    9014                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$28)
    9015              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    9016                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$652)
    9017              $C$DW$653       .dwtag  DW_TAG_TI_far_type
    9018                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$28)
    9019              $C$DW$T$78      .dwtag  DW_TAG_const_type
    9020                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$653)
    9021              $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    9022                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$78)
    9023                      .dwattr $C$DW$T$148, DW_AT_address_class(0x17)
    9024              $C$DW$654       .dwtag  DW_TAG_TI_far_type
    9025                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$148)
    9026              $C$DW$T$149     .dwtag  DW_TAG_const_type
    9027                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$654)
    9028              $C$DW$T$14      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:56 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  201

    9029                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    9030                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    9031                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    9032                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    9033                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    9034              $C$DW$T$15      .dwtag  DW_TAG_base_type
    9035                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    9036                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    9037                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    9038                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    9039                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    9040              $C$DW$T$16      .dwtag  DW_TAG_base_type
    9041                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    9042                      .dwattr $C$DW$T$16, DW_AT_name("float")
    9043                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    9044              $C$DW$T$17      .dwtag  DW_TAG_base_type
    9045                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    9046                      .dwattr $C$DW$T$17, DW_AT_name("double")
    9047                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    9048              $C$DW$T$18      .dwtag  DW_TAG_base_type
    9049                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    9050                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    9051                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    9052              $C$DW$T$26      .dwtag  DW_TAG_base_type
    9053                      .dwattr $C$DW$T$26, DW_AT_encoding(DW_ATE_signed_char)
    9054                      .dwattr $C$DW$T$26, DW_AT_name("signed char")
    9055                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    9056              
    9057              $C$DW$T$27      .dwtag  DW_TAG_array_type
    9058                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    9059                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    9060                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
    9061              $C$DW$655       .dwtag  DW_TAG_subrange_type
    9062                      .dwattr $C$DW$655, DW_AT_upper_bound(0x07)
    9063                      .dwendtag $C$DW$T$27
    9064              
    9065              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    9066                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$26)
    9067                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
    9068              $C$DW$656       .dwtag  DW_TAG_TI_far_type
    9069                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$26)
    9070              $C$DW$T$75      .dwtag  DW_TAG_const_type
    9071                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$656)
    9072              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    9073                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    9074                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
    9075              $C$DW$657       .dwtag  DW_TAG_TI_far_type
    9076                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$76)
    9077              $C$DW$T$77      .dwtag  DW_TAG_const_type
    9078                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$657)
    9079              
    9080              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    9081                      .dwattr $C$DW$T$21, DW_AT_name("tagSTACKSTRUCT")
    9082                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    9083              $C$DW$658       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:56 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  202

    9084                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$20)
    9085                      .dwattr $C$DW$658, DW_AT_name("pxTopOfStack")
    9086                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_pxTopOfStack")
    9087                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9088                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    9089              $C$DW$659       .dwtag  DW_TAG_member
    9090                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$20)
    9091                      .dwattr $C$DW$659, DW_AT_name("pxTopOfSysStack")
    9092                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    9093                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9094                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    9095                      .dwendtag $C$DW$T$21
    9096              
    9097              $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    9098                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$21)
    9099                      .dwattr $C$DW$T$154, DW_AT_address_class(0x17)
    9100              
    9101              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    9102                      .dwattr $C$DW$T$32, DW_AT_name("tskTaskControlBlock")
    9103                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x2e)
    9104              $C$DW$660       .dwtag  DW_TAG_member
    9105                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$23)
    9106                      .dwattr $C$DW$660, DW_AT_name("pxTopOfStack")
    9107                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_pxTopOfStack")
    9108                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9109                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    9110              $C$DW$661       .dwtag  DW_TAG_member
    9111                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$23)
    9112                      .dwattr $C$DW$661, DW_AT_name("pxTopOfSysStack")
    9113                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    9114                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9115                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    9116              $C$DW$662       .dwtag  DW_TAG_member
    9117                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$24)
    9118                      .dwattr $C$DW$662, DW_AT_name("xStateListItem")
    9119                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_xStateListItem")
    9120                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9121                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    9122              $C$DW$663       .dwtag  DW_TAG_member
    9123                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$24)
    9124                      .dwattr $C$DW$663, DW_AT_name("xEventListItem")
    9125                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_xEventListItem")
    9126                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9127                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    9128              $C$DW$664       .dwtag  DW_TAG_member
    9129                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$25)
    9130                      .dwattr $C$DW$664, DW_AT_name("uxPriority")
    9131                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_uxPriority")
    9132                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9133                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    9134              $C$DW$665       .dwtag  DW_TAG_member
    9135                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$20)
    9136                      .dwattr $C$DW$665, DW_AT_name("pxStack")
    9137                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_pxStack")
    9138                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:56 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  203

    9139                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    9140              $C$DW$666       .dwtag  DW_TAG_member
    9141                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$20)
    9142                      .dwattr $C$DW$666, DW_AT_name("pxSysStack")
    9143                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_pxSysStack")
    9144                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9145                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    9146              $C$DW$667       .dwtag  DW_TAG_member
    9147                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$27)
    9148                      .dwattr $C$DW$667, DW_AT_name("pcTaskName")
    9149                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_pcTaskName")
    9150                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9151                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    9152              $C$DW$668       .dwtag  DW_TAG_member
    9153                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$25)
    9154                      .dwattr $C$DW$668, DW_AT_name("uxCriticalNesting")
    9155                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_uxCriticalNesting")
    9156                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9157                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    9158              $C$DW$669       .dwtag  DW_TAG_member
    9159                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$25)
    9160                      .dwattr $C$DW$669, DW_AT_name("uxBasePriority")
    9161                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_uxBasePriority")
    9162                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    9163                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    9164              $C$DW$670       .dwtag  DW_TAG_member
    9165                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$25)
    9166                      .dwattr $C$DW$670, DW_AT_name("uxMutexesHeld")
    9167                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_uxMutexesHeld")
    9168                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9169                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    9170              $C$DW$671       .dwtag  DW_TAG_member
    9171                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$29)
    9172                      .dwattr $C$DW$671, DW_AT_name("ulNotifiedValue")
    9173                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_ulNotifiedValue")
    9174                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9175                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    9176              $C$DW$672       .dwtag  DW_TAG_member
    9177                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$31)
    9178                      .dwattr $C$DW$672, DW_AT_name("ucNotifyState")
    9179                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ucNotifyState")
    9180                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9181                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    9182                      .dwendtag $C$DW$T$32
    9183              
    9184              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    9185                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    9186                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    9187              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    9188                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    9189                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    9190              $C$DW$673       .dwtag  DW_TAG_TI_far_type
    9191                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$71)
    9192              $C$DW$T$107     .dwtag  DW_TAG_const_type
    9193                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$673)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:56 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  204

    9194              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9195                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$71)
    9196                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    9197              $C$DW$674       .dwtag  DW_TAG_TI_far_type
    9198                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$79)
    9199              $C$DW$T$80      .dwtag  DW_TAG_const_type
    9200                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$674)
    9201              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    9202                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$32)
    9203                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    9204              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    9205                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    9206                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    9207              $C$DW$675       .dwtag  DW_TAG_TI_far_type
    9208                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$82)
    9209              $C$DW$T$156     .dwtag  DW_TAG_const_type
    9210                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$675)
    9211              $C$DW$T$157     .dwtag  DW_TAG_pointer_type
    9212                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$156)
    9213                      .dwattr $C$DW$T$157, DW_AT_address_class(0x17)
    9214              $C$DW$676       .dwtag  DW_TAG_TI_far_type
    9215                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$157)
    9216              $C$DW$T$158     .dwtag  DW_TAG_const_type
    9217                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$676)
    9218              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    9219                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    9220                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    9221              $C$DW$677       .dwtag  DW_TAG_TI_far_type
    9222                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$83)
    9223              $C$DW$T$159     .dwtag  DW_TAG_volatile_type
    9224                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$677)
    9225              $C$DW$678       .dwtag  DW_TAG_TI_far_type
    9226                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$83)
    9227              $C$DW$T$160     .dwtag  DW_TAG_const_type
    9228                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$678)
    9229              
    9230              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    9231                      .dwattr $C$DW$T$36, DW_AT_name("xLIST")
    9232                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x0a)
    9233              $C$DW$679       .dwtag  DW_TAG_member
    9234                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$33)
    9235                      .dwattr $C$DW$679, DW_AT_name("uxNumberOfItems")
    9236                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_uxNumberOfItems")
    9237                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9238                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    9239              $C$DW$680       .dwtag  DW_TAG_member
    9240                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$34)
    9241                      .dwattr $C$DW$680, DW_AT_name("pxIndex")
    9242                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_pxIndex")
    9243                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9244                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    9245              $C$DW$681       .dwtag  DW_TAG_member
    9246                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$35)
    9247                      .dwattr $C$DW$681, DW_AT_name("xListEnd")
    9248                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_xListEnd")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:56 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  205

    9249                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9250                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    9251                      .dwendtag $C$DW$T$36
    9252              
    9253              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    9254                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$36)
    9255                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    9256              $C$DW$682       .dwtag  DW_TAG_TI_far_type
    9257                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$60)
    9258              $C$DW$T$127     .dwtag  DW_TAG_const_type
    9259                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$682)
    9260              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9261                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    9262                      .dwattr $C$DW$T$128, DW_AT_address_class(0x17)
    9263              $C$DW$683       .dwtag  DW_TAG_TI_far_type
    9264                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$128)
    9265              $C$DW$T$129     .dwtag  DW_TAG_const_type
    9266                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$683)
    9267              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    9268                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    9269                      .dwattr $C$DW$T$61, DW_AT_address_class(0x17)
    9270              $C$DW$684       .dwtag  DW_TAG_TI_far_type
    9271                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$61)
    9272              $C$DW$T$62      .dwtag  DW_TAG_const_type
    9273                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$684)
    9274              $C$DW$685       .dwtag  DW_TAG_TI_far_type
    9275                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$61)
    9276              $C$DW$T$161     .dwtag  DW_TAG_volatile_type
    9277                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$685)
    9278              
    9279              $C$DW$T$162     .dwtag  DW_TAG_array_type
    9280                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$60)
    9281                      .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    9282                      .dwattr $C$DW$T$162, DW_AT_byte_size(0x32)
    9283              $C$DW$686       .dwtag  DW_TAG_subrange_type
    9284                      .dwattr $C$DW$686, DW_AT_upper_bound(0x04)
    9285                      .dwendtag $C$DW$T$162
    9286              
    9287              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    9288                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    9289                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    9290              
    9291              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9292                      .dwattr $C$DW$T$40, DW_AT_name("xLIST_ITEM")
    9293                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    9294              $C$DW$687       .dwtag  DW_TAG_member
    9295                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$37)
    9296                      .dwattr $C$DW$687, DW_AT_name("xItemValue")
    9297                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_xItemValue")
    9298                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9299                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    9300              $C$DW$688       .dwtag  DW_TAG_member
    9301                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$38)
    9302                      .dwattr $C$DW$688, DW_AT_name("pxNext")
    9303                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_pxNext")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:56 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  206

    9304                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9305                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    9306              $C$DW$689       .dwtag  DW_TAG_member
    9307                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$38)
    9308                      .dwattr $C$DW$689, DW_AT_name("pxPrevious")
    9309                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_pxPrevious")
    9310                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9311                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    9312              $C$DW$690       .dwtag  DW_TAG_member
    9313                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$3)
    9314                      .dwattr $C$DW$690, DW_AT_name("pvOwner")
    9315                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_pvOwner")
    9316                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9317                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    9318              $C$DW$691       .dwtag  DW_TAG_member
    9319                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$39)
    9320                      .dwattr $C$DW$691, DW_AT_name("pvContainer")
    9321                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_pvContainer")
    9322                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9323                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    9324                      .dwendtag $C$DW$T$40
    9325              
    9326              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    9327                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$40)
    9328                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    9329              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    9330                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$24)
    9331                      .dwattr $C$DW$T$34, DW_AT_address_class(0x17)
    9332              $C$DW$692       .dwtag  DW_TAG_TI_far_type
    9333                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$34)
    9334              $C$DW$T$65      .dwtag  DW_TAG_const_type
    9335                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$692)
    9336              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    9337                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$40)
    9338                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    9339              
    9340              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9341                      .dwattr $C$DW$T$41, DW_AT_name("xMEMORY_REGION")
    9342                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
    9343              $C$DW$693       .dwtag  DW_TAG_member
    9344                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$3)
    9345                      .dwattr $C$DW$693, DW_AT_name("pvBaseAddress")
    9346                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_pvBaseAddress")
    9347                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9348                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    9349              $C$DW$694       .dwtag  DW_TAG_member
    9350                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$28)
    9351                      .dwattr $C$DW$694, DW_AT_name("ulLengthInBytes")
    9352                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ulLengthInBytes")
    9353                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9354                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    9355              $C$DW$695       .dwtag  DW_TAG_member
    9356                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$28)
    9357                      .dwattr $C$DW$695, DW_AT_name("ulParameters")
    9358                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ulParameters")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:56 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  207

    9359                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9360                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    9361                      .dwendtag $C$DW$T$41
    9362              
    9363              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    9364                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$41)
    9365                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    9366              $C$DW$696       .dwtag  DW_TAG_TI_far_type
    9367                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$84)
    9368              $C$DW$T$85      .dwtag  DW_TAG_const_type
    9369                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$696)
    9370              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    9371                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    9372                      .dwattr $C$DW$T$86, DW_AT_address_class(0x17)
    9373              $C$DW$697       .dwtag  DW_TAG_TI_far_type
    9374                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$86)
    9375              $C$DW$T$87      .dwtag  DW_TAG_const_type
    9376                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$697)
    9377              
    9378              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    9379                      .dwattr $C$DW$T$42, DW_AT_name("xMINI_LIST_ITEM")
    9380                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x06)
    9381              $C$DW$698       .dwtag  DW_TAG_member
    9382                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$37)
    9383                      .dwattr $C$DW$698, DW_AT_name("xItemValue")
    9384                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_xItemValue")
    9385                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9386                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    9387              $C$DW$699       .dwtag  DW_TAG_member
    9388                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$38)
    9389                      .dwattr $C$DW$699, DW_AT_name("pxNext")
    9390                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_pxNext")
    9391                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9392                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    9393              $C$DW$700       .dwtag  DW_TAG_member
    9394                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$38)
    9395                      .dwattr $C$DW$700, DW_AT_name("pxPrevious")
    9396                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_pxPrevious")
    9397                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9398                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    9399                      .dwendtag $C$DW$T$42
    9400              
    9401              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    9402                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$42)
    9403                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    9404              
    9405              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9406                      .dwattr $C$DW$T$44, DW_AT_name("xTIME_OUT")
    9407                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    9408              $C$DW$701       .dwtag  DW_TAG_member
    9409                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$43)
    9410                      .dwattr $C$DW$701, DW_AT_name("xOverflowCount")
    9411                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_xOverflowCount")
    9412                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9413                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:56 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  208

    9414              $C$DW$702       .dwtag  DW_TAG_member
    9415                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$37)
    9416                      .dwattr $C$DW$702, DW_AT_name("xTimeOnEntering")
    9417                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_xTimeOnEntering")
    9418                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9419                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    9420                      .dwendtag $C$DW$T$44
    9421              
    9422              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    9423                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$44)
    9424                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    9425              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    9426                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    9427                      .dwattr $C$DW$T$103, DW_AT_address_class(0x17)
    9428              $C$DW$703       .dwtag  DW_TAG_TI_far_type
    9429                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$103)
    9430              $C$DW$T$104     .dwtag  DW_TAG_const_type
    9431                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$703)
    9432                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    9433              
    9434              ;***************************************************************
    9435              ;* DWARF CIE ENTRIES                                           *
    9436              ;***************************************************************
    9437              
    9438              $C$DW$CIE       .dwcie 91
    9439                      .dwcfi  cfa_register, 36
    9440                      .dwcfi  cfa_offset, 0
    9441                      .dwcfi  undefined, 0
    9442                      .dwcfi  undefined, 1
    9443                      .dwcfi  undefined, 2
    9444                      .dwcfi  undefined, 3
    9445                      .dwcfi  undefined, 4
    9446                      .dwcfi  undefined, 5
    9447                      .dwcfi  undefined, 6
    9448                      .dwcfi  undefined, 7
    9449                      .dwcfi  undefined, 8
    9450                      .dwcfi  undefined, 9
    9451                      .dwcfi  undefined, 10
    9452                      .dwcfi  undefined, 11
    9453                      .dwcfi  undefined, 12
    9454                      .dwcfi  undefined, 13
    9455                      .dwcfi  same_value, 14
    9456                      .dwcfi  same_value, 15
    9457                      .dwcfi  undefined, 16
    9458                      .dwcfi  undefined, 17
    9459                      .dwcfi  undefined, 18
    9460                      .dwcfi  undefined, 19
    9461                      .dwcfi  undefined, 20
    9462                      .dwcfi  undefined, 21
    9463                      .dwcfi  undefined, 22
    9464                      .dwcfi  undefined, 23
    9465                      .dwcfi  undefined, 24
    9466                      .dwcfi  undefined, 25
    9467                      .dwcfi  same_value, 26
    9468                      .dwcfi  same_value, 27
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:49:56 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  209

    9469                      .dwcfi  same_value, 28
    9470                      .dwcfi  same_value, 29
    9471                      .dwcfi  same_value, 30
    9472                      .dwcfi  same_value, 31
    9473                      .dwcfi  undefined, 32
    9474                      .dwcfi  undefined, 33
    9475                      .dwcfi  undefined, 34
    9476                      .dwcfi  undefined, 35
    9477                      .dwcfi  undefined, 36
    9478                      .dwcfi  undefined, 37
    9479                      .dwcfi  undefined, 38
    9480                      .dwcfi  undefined, 39
    9481                      .dwcfi  undefined, 40
    9482                      .dwcfi  undefined, 41
    9483                      .dwcfi  undefined, 42
    9484                      .dwcfi  undefined, 43
