TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:12:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE    1

    9524              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 15 05:11:57 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:12:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  196

    8813              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    8814                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$40)
    8815                      .dwattr $C$DW$T$93, DW_AT_address_class(0x17)
    8816              $C$DW$640       .dwtag  DW_TAG_TI_far_type
    8817                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$93)
    8818              $C$DW$T$94      .dwtag  DW_TAG_const_type
    8819                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$640)
    8820              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    8821                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$13)
    8822                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    8823              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    8824                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$31)
    8825                      .dwattr $C$DW$T$132, DW_AT_address_class(0x17)
    8826              $C$DW$641       .dwtag  DW_TAG_TI_far_type
    8827                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$31)
    8828              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    8829                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$641)
    8830              $C$DW$642       .dwtag  DW_TAG_TI_far_type
    8831                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$31)
    8832              $C$DW$T$76      .dwtag  DW_TAG_const_type
    8833                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$642)
    8834              $C$DW$T$14      .dwtag  DW_TAG_base_type
    8835                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    8836                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    8837                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    8838                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    8839                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    8840              $C$DW$T$15      .dwtag  DW_TAG_base_type
    8841                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    8842                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    8843                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    8844                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    8845                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    8846              $C$DW$T$16      .dwtag  DW_TAG_base_type
    8847                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    8848                      .dwattr $C$DW$T$16, DW_AT_name("float")
    8849                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    8850              $C$DW$T$17      .dwtag  DW_TAG_base_type
    8851                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    8852                      .dwattr $C$DW$T$17, DW_AT_name("double")
    8853                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    8854              $C$DW$T$18      .dwtag  DW_TAG_base_type
    8855                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    8856                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    8857                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    8858              $C$DW$T$29      .dwtag  DW_TAG_base_type
    8859                      .dwattr $C$DW$T$29, DW_AT_encoding(DW_ATE_signed_char)
    8860                      .dwattr $C$DW$T$29, DW_AT_name("signed char")
    8861                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    8862              
    8863              $C$DW$T$30      .dwtag  DW_TAG_array_type
    8864                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    8865                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    8866                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    8867              $C$DW$643       .dwtag  DW_TAG_subrange_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:12:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  197

    8868                      .dwattr $C$DW$643, DW_AT_upper_bound(0x07)
    8869                      .dwendtag $C$DW$T$30
    8870              
    8871              $C$DW$644       .dwtag  DW_TAG_TI_far_type
    8872                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$29)
    8873              $C$DW$T$73      .dwtag  DW_TAG_const_type
    8874                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$644)
    8875              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    8876                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    8877                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    8878              $C$DW$645       .dwtag  DW_TAG_TI_far_type
    8879                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$74)
    8880              $C$DW$T$75      .dwtag  DW_TAG_const_type
    8881                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$645)
    8882              $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    8883                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$29)
    8884                      .dwattr $C$DW$T$148, DW_AT_address_class(0x17)
    8885              
    8886              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8887                      .dwattr $C$DW$T$20, DW_AT_name("tagSTACKSTRUCT")
    8888                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    8889              $C$DW$646       .dwtag  DW_TAG_member
    8890                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$19)
    8891                      .dwattr $C$DW$646, DW_AT_name("pxTopOfStack")
    8892                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_pxTopOfStack")
    8893                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8894                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    8895              $C$DW$647       .dwtag  DW_TAG_member
    8896                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$19)
    8897                      .dwattr $C$DW$647, DW_AT_name("pxTopOfSysStack")
    8898                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    8899                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8900                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    8901                      .dwendtag $C$DW$T$20
    8902              
    8903              $C$DW$T$152     .dwtag  DW_TAG_pointer_type
    8904                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$20)
    8905                      .dwattr $C$DW$T$152, DW_AT_address_class(0x17)
    8906              
    8907              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8908                      .dwattr $C$DW$T$35, DW_AT_name("tskTaskControlBlock")
    8909                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x2c)
    8910              $C$DW$648       .dwtag  DW_TAG_member
    8911                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$23)
    8912                      .dwattr $C$DW$648, DW_AT_name("pxTopOfStack")
    8913                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_pxTopOfStack")
    8914                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8915                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    8916              $C$DW$649       .dwtag  DW_TAG_member
    8917                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$25)
    8918                      .dwattr $C$DW$649, DW_AT_name("pxTopOfSysStack")
    8919                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    8920                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8921                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    8922              $C$DW$650       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:12:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  198

    8923                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$26)
    8924                      .dwattr $C$DW$650, DW_AT_name("xStateListItem")
    8925                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_xStateListItem")
    8926                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8927                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    8928              $C$DW$651       .dwtag  DW_TAG_member
    8929                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$26)
    8930                      .dwattr $C$DW$651, DW_AT_name("xEventListItem")
    8931                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_xEventListItem")
    8932                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8933                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    8934              $C$DW$652       .dwtag  DW_TAG_member
    8935                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$27)
    8936                      .dwattr $C$DW$652, DW_AT_name("uxPriority")
    8937                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_uxPriority")
    8938                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8939                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    8940              $C$DW$653       .dwtag  DW_TAG_member
    8941                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$28)
    8942                      .dwattr $C$DW$653, DW_AT_name("pxStack")
    8943                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_pxStack")
    8944                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8945                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    8946              $C$DW$654       .dwtag  DW_TAG_member
    8947                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$28)
    8948                      .dwattr $C$DW$654, DW_AT_name("pxSysStack")
    8949                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_pxSysStack")
    8950                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8951                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    8952              $C$DW$655       .dwtag  DW_TAG_member
    8953                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$30)
    8954                      .dwattr $C$DW$655, DW_AT_name("pcTaskName")
    8955                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_pcTaskName")
    8956                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8957                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    8958              $C$DW$656       .dwtag  DW_TAG_member
    8959                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$27)
    8960                      .dwattr $C$DW$656, DW_AT_name("uxBasePriority")
    8961                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_uxBasePriority")
    8962                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    8963                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    8964              $C$DW$657       .dwtag  DW_TAG_member
    8965                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$27)
    8966                      .dwattr $C$DW$657, DW_AT_name("uxMutexesHeld")
    8967                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_uxMutexesHeld")
    8968                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    8969                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    8970              $C$DW$658       .dwtag  DW_TAG_member
    8971                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$32)
    8972                      .dwattr $C$DW$658, DW_AT_name("ulNotifiedValue")
    8973                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_ulNotifiedValue")
    8974                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8975                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    8976              $C$DW$659       .dwtag  DW_TAG_member
    8977                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$34)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:12:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  199

    8978                      .dwattr $C$DW$659, DW_AT_name("ucNotifyState")
    8979                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_ucNotifyState")
    8980                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    8981                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    8982                      .dwendtag $C$DW$T$35
    8983              
    8984              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    8985                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$35)
    8986                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    8987              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("TaskHandle_t")
    8988                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    8989                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    8990              $C$DW$660       .dwtag  DW_TAG_TI_far_type
    8991                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$78)
    8992              $C$DW$T$107     .dwtag  DW_TAG_const_type
    8993                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$660)
    8994              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    8995                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    8996                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    8997              $C$DW$661       .dwtag  DW_TAG_TI_far_type
    8998                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$79)
    8999              $C$DW$T$80      .dwtag  DW_TAG_const_type
    9000                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$661)
    9001              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    9002                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
    9003                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    9004              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("TCB_t")
    9005                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    9006                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    9007              $C$DW$662       .dwtag  DW_TAG_TI_far_type
    9008                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$82)
    9009              $C$DW$T$154     .dwtag  DW_TAG_const_type
    9010                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$662)
    9011              $C$DW$T$155     .dwtag  DW_TAG_pointer_type
    9012                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    9013                      .dwattr $C$DW$T$155, DW_AT_address_class(0x17)
    9014              $C$DW$663       .dwtag  DW_TAG_TI_far_type
    9015                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$155)
    9016              $C$DW$T$156     .dwtag  DW_TAG_const_type
    9017                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$663)
    9018              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    9019                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    9020                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    9021              $C$DW$664       .dwtag  DW_TAG_TI_far_type
    9022                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$83)
    9023              $C$DW$T$157     .dwtag  DW_TAG_volatile_type
    9024                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$664)
    9025              $C$DW$665       .dwtag  DW_TAG_TI_far_type
    9026                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$83)
    9027              $C$DW$T$158     .dwtag  DW_TAG_const_type
    9028                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$665)
    9029              
    9030              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    9031                      .dwattr $C$DW$T$39, DW_AT_name("xLIST")
    9032                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:12:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  200

    9033              $C$DW$666       .dwtag  DW_TAG_member
    9034                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$36)
    9035                      .dwattr $C$DW$666, DW_AT_name("uxNumberOfItems")
    9036                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_uxNumberOfItems")
    9037                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9038                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    9039              $C$DW$667       .dwtag  DW_TAG_member
    9040                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$37)
    9041                      .dwattr $C$DW$667, DW_AT_name("pxIndex")
    9042                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_pxIndex")
    9043                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9044                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    9045              $C$DW$668       .dwtag  DW_TAG_member
    9046                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$38)
    9047                      .dwattr $C$DW$668, DW_AT_name("xListEnd")
    9048                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_xListEnd")
    9049                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9050                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    9051                      .dwendtag $C$DW$T$39
    9052              
    9053              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("List_t")
    9054                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$39)
    9055                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    9056              $C$DW$669       .dwtag  DW_TAG_TI_far_type
    9057                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$63)
    9058              $C$DW$T$127     .dwtag  DW_TAG_const_type
    9059                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$669)
    9060              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    9061                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    9062                      .dwattr $C$DW$T$128, DW_AT_address_class(0x17)
    9063              $C$DW$670       .dwtag  DW_TAG_TI_far_type
    9064                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$128)
    9065              $C$DW$T$129     .dwtag  DW_TAG_const_type
    9066                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$670)
    9067              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    9068                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    9069                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    9070              $C$DW$671       .dwtag  DW_TAG_TI_far_type
    9071                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$64)
    9072              $C$DW$T$65      .dwtag  DW_TAG_const_type
    9073                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$671)
    9074              $C$DW$672       .dwtag  DW_TAG_TI_far_type
    9075                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$64)
    9076              $C$DW$T$159     .dwtag  DW_TAG_volatile_type
    9077                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$672)
    9078              
    9079              $C$DW$T$160     .dwtag  DW_TAG_array_type
    9080                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$63)
    9081                      .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    9082                      .dwattr $C$DW$T$160, DW_AT_byte_size(0x32)
    9083              $C$DW$673       .dwtag  DW_TAG_subrange_type
    9084                      .dwattr $C$DW$673, DW_AT_upper_bound(0x04)
    9085                      .dwendtag $C$DW$T$160
    9086              
    9087              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:12:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  201

    9088                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$39)
    9089                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    9090              
    9091              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    9092                      .dwattr $C$DW$T$43, DW_AT_name("xLIST_ITEM")
    9093                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    9094              $C$DW$674       .dwtag  DW_TAG_member
    9095                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$40)
    9096                      .dwattr $C$DW$674, DW_AT_name("xItemValue")
    9097                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_xItemValue")
    9098                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9099                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    9100              $C$DW$675       .dwtag  DW_TAG_member
    9101                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$41)
    9102                      .dwattr $C$DW$675, DW_AT_name("pxNext")
    9103                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_pxNext")
    9104                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9105                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    9106              $C$DW$676       .dwtag  DW_TAG_member
    9107                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$41)
    9108                      .dwattr $C$DW$676, DW_AT_name("pxPrevious")
    9109                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_pxPrevious")
    9110                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9111                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    9112              $C$DW$677       .dwtag  DW_TAG_member
    9113                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$3)
    9114                      .dwattr $C$DW$677, DW_AT_name("pvOwner")
    9115                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_pvOwner")
    9116                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9117                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    9118              $C$DW$678       .dwtag  DW_TAG_member
    9119                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$42)
    9120                      .dwattr $C$DW$678, DW_AT_name("pvContainer")
    9121                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_pvContainer")
    9122                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9123                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    9124                      .dwendtag $C$DW$T$43
    9125              
    9126              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    9127                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$43)
    9128                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    9129              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    9130                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$26)
    9131                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    9132              $C$DW$679       .dwtag  DW_TAG_TI_far_type
    9133                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$37)
    9134              $C$DW$T$68      .dwtag  DW_TAG_const_type
    9135                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$679)
    9136              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    9137                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$43)
    9138                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    9139              
    9140              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    9141                      .dwattr $C$DW$T$44, DW_AT_name("xMEMORY_REGION")
    9142                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:12:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  202

    9143              $C$DW$680       .dwtag  DW_TAG_member
    9144                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$3)
    9145                      .dwattr $C$DW$680, DW_AT_name("pvBaseAddress")
    9146                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_pvBaseAddress")
    9147                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9148                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    9149              $C$DW$681       .dwtag  DW_TAG_member
    9150                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$31)
    9151                      .dwattr $C$DW$681, DW_AT_name("ulLengthInBytes")
    9152                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_ulLengthInBytes")
    9153                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9154                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    9155              $C$DW$682       .dwtag  DW_TAG_member
    9156                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$31)
    9157                      .dwattr $C$DW$682, DW_AT_name("ulParameters")
    9158                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ulParameters")
    9159                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9160                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    9161                      .dwendtag $C$DW$T$44
    9162              
    9163              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("MemoryRegion_t")
    9164                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$44)
    9165                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    9166              $C$DW$683       .dwtag  DW_TAG_TI_far_type
    9167                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$84)
    9168              $C$DW$T$85      .dwtag  DW_TAG_const_type
    9169                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$683)
    9170              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    9171                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    9172                      .dwattr $C$DW$T$86, DW_AT_address_class(0x17)
    9173              $C$DW$684       .dwtag  DW_TAG_TI_far_type
    9174                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$86)
    9175              $C$DW$T$87      .dwtag  DW_TAG_const_type
    9176                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$684)
    9177              
    9178              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    9179                      .dwattr $C$DW$T$45, DW_AT_name("xMINI_LIST_ITEM")
    9180                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x06)
    9181              $C$DW$685       .dwtag  DW_TAG_member
    9182                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$40)
    9183                      .dwattr $C$DW$685, DW_AT_name("xItemValue")
    9184                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_xItemValue")
    9185                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9186                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    9187              $C$DW$686       .dwtag  DW_TAG_member
    9188                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$41)
    9189                      .dwattr $C$DW$686, DW_AT_name("pxNext")
    9190                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_pxNext")
    9191                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9192                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    9193              $C$DW$687       .dwtag  DW_TAG_member
    9194                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$41)
    9195                      .dwattr $C$DW$687, DW_AT_name("pxPrevious")
    9196                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_pxPrevious")
    9197                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:12:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  203

    9198                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    9199                      .dwendtag $C$DW$T$45
    9200              
    9201              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    9202                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$45)
    9203                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    9204              
    9205              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    9206                      .dwattr $C$DW$T$47, DW_AT_name("xTIME_OUT")
    9207                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    9208              $C$DW$688       .dwtag  DW_TAG_member
    9209                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$46)
    9210                      .dwattr $C$DW$688, DW_AT_name("xOverflowCount")
    9211                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_xOverflowCount")
    9212                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9213                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    9214              $C$DW$689       .dwtag  DW_TAG_member
    9215                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$40)
    9216                      .dwattr $C$DW$689, DW_AT_name("xTimeOnEntering")
    9217                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_xTimeOnEntering")
    9218                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9219                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    9220                      .dwendtag $C$DW$T$47
    9221              
    9222              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("TimeOut_t")
    9223                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$47)
    9224                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    9225              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    9226                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    9227                      .dwattr $C$DW$T$103, DW_AT_address_class(0x17)
    9228              $C$DW$690       .dwtag  DW_TAG_TI_far_type
    9229                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$103)
    9230              $C$DW$T$104     .dwtag  DW_TAG_const_type
    9231                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$690)
    9232                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    9233              
    9234              ;***************************************************************
    9235              ;* DWARF CIE ENTRIES                                           *
    9236              ;***************************************************************
    9237              
    9238              $C$DW$CIE       .dwcie 91
    9239                      .dwcfi  cfa_register, 36
    9240                      .dwcfi  cfa_offset, 0
    9241                      .dwcfi  undefined, 0
    9242                      .dwcfi  undefined, 1
    9243                      .dwcfi  undefined, 2
    9244                      .dwcfi  undefined, 3
    9245                      .dwcfi  undefined, 4
    9246                      .dwcfi  undefined, 5
    9247                      .dwcfi  undefined, 6
    9248                      .dwcfi  undefined, 7
    9249                      .dwcfi  undefined, 8
    9250                      .dwcfi  undefined, 9
    9251                      .dwcfi  undefined, 10
    9252                      .dwcfi  undefined, 11
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 05:12:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks_sysStk.asm                                                     PAGE  204

    9253                      .dwcfi  undefined, 12
    9254                      .dwcfi  undefined, 13
    9255                      .dwcfi  same_value, 14
    9256                      .dwcfi  same_value, 15
    9257                      .dwcfi  undefined, 16
    9258                      .dwcfi  undefined, 17
    9259                      .dwcfi  undefined, 18
    9260                      .dwcfi  undefined, 19
    9261                      .dwcfi  undefined, 20
    9262                      .dwcfi  undefined, 21
    9263                      .dwcfi  undefined, 22
    9264                      .dwcfi  undefined, 23
    9265                      .dwcfi  undefined, 24
    9266                      .dwcfi  undefined, 25
    9267                      .dwcfi  same_value, 26
    9268                      .dwcfi  same_value, 27
    9269                      .dwcfi  same_value, 28
    9270                      .dwcfi  same_value, 29
    9271                      .dwcfi  same_value, 30
    9272                      .dwcfi  same_value, 31
    9273                      .dwcfi  undefined, 32
    9274                      .dwcfi  undefined, 33
    9275                      .dwcfi  undefined, 34
    9276                      .dwcfi  undefined, 35
    9277                      .dwcfi  undefined, 36
    9278                      .dwcfi  undefined, 37
    9279                      .dwcfi  undefined, 38
    9280                      .dwcfi  undefined, 39
    9281                      .dwcfi  undefined, 40
    9282                      .dwcfi  undefined, 41
    9283                      .dwcfi  undefined, 42
    9284                      .dwcfi  undefined, 43
