TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:31 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

    1316                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$11)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   29

    1317                      .dwattr $C$DW$T$46, DW_AT_address_class(0x17)
    1318              $C$DW$107       .dwtag  DW_TAG_TI_far_type
    1319                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1320              $C$DW$T$86      .dwtag  DW_TAG_const_type
    1321                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$107)
    1322              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1323                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$11)
    1324                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1325                      .dwattr $C$DW$T$87, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1326                      .dwattr $C$DW$T$87, DW_AT_decl_line(0x27)
    1327                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x1a)
    1328              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1329                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1330                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1331                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1332              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    1333                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$12)
    1334                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1335                      .dwattr $C$DW$T$88, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1336                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x11)
    1337                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x1c)
    1338              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1339                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1340                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1341                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1342              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1343                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$13)
    1344                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1345                      .dwattr $C$DW$T$21, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1346                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x55)
    1347                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x1c)
    1348              $C$DW$108       .dwtag  DW_TAG_TI_far_type
    1349                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
    1350              $C$DW$T$89      .dwtag  DW_TAG_const_type
    1351                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$108)
    1352              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1353                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$13)
    1354                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1355                      .dwattr $C$DW$T$51, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1356                      .dwattr $C$DW$T$51, DW_AT_decl_line(0x21)
    1357                      .dwattr $C$DW$T$51, DW_AT_decl_column(0x19)
    1358              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1359                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1360                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1361                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1362                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1363                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1364              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1365                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1366                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1367                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1368                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1369                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1370              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1371                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   30

    1372                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1373                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1374              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1375                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1376                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1377                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1378              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1379                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1380                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1381                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1382              
    1383              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1384                      .dwattr $C$DW$T$19, DW_AT_name("xMEMORY_REGION")
    1385                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x06)
    1386              $C$DW$109       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$3)
    1388                      .dwattr $C$DW$109, DW_AT_name("pvBaseAddress")
    1389                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_pvBaseAddress")
    1390                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1392                      .dwattr $C$DW$109, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1393                      .dwattr $C$DW$109, DW_AT_decl_line(0x67)
    1394                      .dwattr $C$DW$109, DW_AT_decl_column(0x08)
    1395              $C$DW$110       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$13)
    1397                      .dwattr $C$DW$110, DW_AT_name("ulLengthInBytes")
    1398                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_ulLengthInBytes")
    1399                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1400                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1401                      .dwattr $C$DW$110, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1402                      .dwattr $C$DW$110, DW_AT_decl_line(0x68)
    1403                      .dwattr $C$DW$110, DW_AT_decl_column(0x10)
    1404              $C$DW$111       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$13)
    1406                      .dwattr $C$DW$111, DW_AT_name("ulParameters")
    1407                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ulParameters")
    1408                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1409                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1410                      .dwattr $C$DW$111, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1411                      .dwattr $C$DW$111, DW_AT_decl_line(0x69)
    1412                      .dwattr $C$DW$111, DW_AT_decl_column(0x10)
    1413                      .dwendtag $C$DW$T$19
    1414              
    1415                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1416                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x65)
    1417                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    1418              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1419                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$19)
    1420                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1421                      .dwattr $C$DW$T$47, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1422                      .dwattr $C$DW$T$47, DW_AT_decl_line(0x6a)
    1423                      .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    1424              
    1425              $C$DW$T$48      .dwtag  DW_TAG_array_type
    1426                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   31

    1427                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1428                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x06)
    1429              $C$DW$112       .dwtag  DW_TAG_subrange_type
    1430                      .dwattr $C$DW$112, DW_AT_upper_bound(0x00)
    1431                      .dwendtag $C$DW$T$48
    1432              
    1433              $C$DW$113       .dwtag  DW_TAG_TI_far_type
    1434                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$47)
    1435              $C$DW$T$67      .dwtag  DW_TAG_const_type
    1436                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$113)
    1437              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    1438                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1439                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    1440              $C$DW$114       .dwtag  DW_TAG_TI_far_type
    1441                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$68)
    1442              $C$DW$T$69      .dwtag  DW_TAG_const_type
    1443                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$114)
    1444              
    1445              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1446                      .dwattr $C$DW$T$24, DW_AT_name("BLOCKING_QUEUE_PARAMETERS")
    1447                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x06)
    1448              $C$DW$115       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    1450                      .dwattr $C$DW$115, DW_AT_name("xQueue")
    1451                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_xQueue")
    1452                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1454                      .dwattr $C$DW$115, DW_AT_decl_file("../FreeRTOS/Demo/Common/Minimal/BlockQ.c")
    1455                      .dwattr $C$DW$115, DW_AT_decl_line(0x67)
    1456                      .dwattr $C$DW$115, DW_AT_decl_column(0x0f)
    1457              $C$DW$116       .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
    1459                      .dwattr $C$DW$116, DW_AT_name("xBlockTime")
    1460                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_xBlockTime")
    1461                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1462                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1463                      .dwattr $C$DW$116, DW_AT_decl_file("../FreeRTOS/Demo/Common/Minimal/BlockQ.c")
    1464                      .dwattr $C$DW$116, DW_AT_decl_line(0x68)
    1465                      .dwattr $C$DW$116, DW_AT_decl_column(0x0f)
    1466              $C$DW$117       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$23)
    1468                      .dwattr $C$DW$117, DW_AT_name("psCheckVariable")
    1469                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_psCheckVariable")
    1470                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1471                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1472                      .dwattr $C$DW$117, DW_AT_decl_file("../FreeRTOS/Demo/Common/Minimal/BlockQ.c")
    1473                      .dwattr $C$DW$117, DW_AT_decl_line(0x69)
    1474                      .dwattr $C$DW$117, DW_AT_decl_column(0x12)
    1475                      .dwendtag $C$DW$T$24
    1476              
    1477                      .dwattr $C$DW$T$24, DW_AT_decl_file("../FreeRTOS/Demo/Common/Minimal/BlockQ.c")
    1478                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x65)
    1479                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1480              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("xBlockingQueueParameters")
    1481                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$24)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   32

    1482                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1483                      .dwattr $C$DW$T$93, DW_AT_decl_file("../FreeRTOS/Demo/Common/Minimal/BlockQ.c")
    1484                      .dwattr $C$DW$T$93, DW_AT_decl_line(0x6a)
    1485                      .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    1486              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    1487                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    1488                      .dwattr $C$DW$T$94, DW_AT_address_class(0x17)
    1489              
    1490              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1491                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1492              $C$DW$118       .dwtag  DW_TAG_member
    1493                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$10)
    1494                      .dwattr $C$DW$118, DW_AT_name("quot")
    1495                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_quot")
    1496                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1497                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1498                      .dwattr $C$DW$118, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1499                      .dwattr $C$DW$118, DW_AT_decl_line(0x12)
    1500                      .dwattr $C$DW$118, DW_AT_decl_column(0x16)
    1501              $C$DW$119       .dwtag  DW_TAG_member
    1502                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$10)
    1503                      .dwattr $C$DW$119, DW_AT_name("rem")
    1504                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rem")
    1505                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1506                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1507                      .dwattr $C$DW$119, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1508                      .dwattr $C$DW$119, DW_AT_decl_line(0x12)
    1509                      .dwattr $C$DW$119, DW_AT_decl_column(0x1c)
    1510                      .dwendtag $C$DW$T$25
    1511              
    1512                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1513                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x12)
    1514                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1515              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    1516                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$25)
    1517                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    1518                      .dwattr $C$DW$T$96, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1519                      .dwattr $C$DW$T$96, DW_AT_decl_line(0x12)
    1520                      .dwattr $C$DW$T$96, DW_AT_decl_column(0x23)
    1521              
    1522              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1523                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1524              $C$DW$120       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$12)
    1526                      .dwattr $C$DW$120, DW_AT_name("quot")
    1527                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_quot")
    1528                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1529                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1530                      .dwattr $C$DW$120, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1531                      .dwattr $C$DW$120, DW_AT_decl_line(0x14)
    1532                      .dwattr $C$DW$120, DW_AT_decl_column(0x17)
    1533              $C$DW$121       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$12)
    1535                      .dwattr $C$DW$121, DW_AT_name("rem")
    1536                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rem")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   33

    1537                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1538                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1539                      .dwattr $C$DW$121, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1540                      .dwattr $C$DW$121, DW_AT_decl_line(0x14)
    1541                      .dwattr $C$DW$121, DW_AT_decl_column(0x1d)
    1542                      .dwendtag $C$DW$T$26
    1543              
    1544                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1545                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x14)
    1546                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    1547              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    1548                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$26)
    1549                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1550                      .dwattr $C$DW$T$97, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1551                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x14)
    1552                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x24)
    1553              
    1554              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1555                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
    1556              $C$DW$122       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$14)
    1558                      .dwattr $C$DW$122, DW_AT_name("quot")
    1559                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_quot")
    1560                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1561                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1562                      .dwattr $C$DW$122, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1563                      .dwattr $C$DW$122, DW_AT_decl_line(0x17)
    1564                      .dwattr $C$DW$122, DW_AT_decl_column(0x1c)
    1565              $C$DW$123       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$14)
    1567                      .dwattr $C$DW$123, DW_AT_name("rem")
    1568                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rem")
    1569                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1570                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1571                      .dwattr $C$DW$123, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1572                      .dwattr $C$DW$123, DW_AT_decl_line(0x17)
    1573                      .dwattr $C$DW$123, DW_AT_decl_column(0x22)
    1574                      .dwendtag $C$DW$T$27
    1575              
    1576                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1577                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x17)
    1578                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1579              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    1580                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$27)
    1581                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    1582                      .dwattr $C$DW$T$98, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1583                      .dwattr $C$DW$T$98, DW_AT_decl_line(0x17)
    1584                      .dwattr $C$DW$T$98, DW_AT_decl_column(0x29)
    1585              
    1586              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1587                      .dwattr $C$DW$T$30, DW_AT_name("xLIST_ITEM")
    1588                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    1589              $C$DW$124       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    1591                      .dwattr $C$DW$124, DW_AT_name("xItemValue")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   34

    1592                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_xItemValue")
    1593                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1595                      .dwattr $C$DW$124, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1596                      .dwattr $C$DW$124, DW_AT_decl_line(0x64)
    1597                      .dwattr $C$DW$124, DW_AT_decl_column(0x0f)
    1598              $C$DW$125       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$29)
    1600                      .dwattr $C$DW$125, DW_AT_name("pxNext")
    1601                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_pxNext")
    1602                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1603                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1604                      .dwattr $C$DW$125, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1605                      .dwattr $C$DW$125, DW_AT_decl_line(0x65)
    1606                      .dwattr $C$DW$125, DW_AT_decl_column(0x1f)
    1607              $C$DW$126       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$29)
    1609                      .dwattr $C$DW$126, DW_AT_name("pxPrevious")
    1610                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_pxPrevious")
    1611                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1612                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1613                      .dwattr $C$DW$126, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1614                      .dwattr $C$DW$126, DW_AT_decl_line(0x66)
    1615                      .dwattr $C$DW$126, DW_AT_decl_column(0x1f)
    1616              $C$DW$127       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$3)
    1618                      .dwattr $C$DW$127, DW_AT_name("pvOwner")
    1619                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_pvOwner")
    1620                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1621                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1622                      .dwattr $C$DW$127, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1623                      .dwattr $C$DW$127, DW_AT_decl_line(0x67)
    1624                      .dwattr $C$DW$127, DW_AT_decl_column(0x09)
    1625              $C$DW$128       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$3)
    1627                      .dwattr $C$DW$128, DW_AT_name("pvContainer")
    1628                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_pvContainer")
    1629                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1630                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1631                      .dwattr $C$DW$128, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1632                      .dwattr $C$DW$128, DW_AT_decl_line(0x68)
    1633                      .dwattr $C$DW$128, DW_AT_decl_column(0x09)
    1634                      .dwendtag $C$DW$T$30
    1635              
    1636                      .dwattr $C$DW$T$30, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1637                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x62)
    1638                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x08)
    1639              $C$DW$129       .dwtag  DW_TAG_TI_far_type
    1640                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$30)
    1641              $C$DW$T$28      .dwtag  DW_TAG_volatile_type
    1642                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$129)
    1643              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    1644                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1645                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    1646              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   35

    1647                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
    1648                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1649                      .dwattr $C$DW$T$33, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1650                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x6a)
    1651                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x1b)
    1652              $C$DW$130       .dwtag  DW_TAG_TI_far_type
    1653                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$33)
    1654              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    1655                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$130)
    1656              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1657                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1658                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1659              
    1660              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1661                      .dwattr $C$DW$T$31, DW_AT_name("xMINI_LIST_ITEM")
    1662                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x06)
    1663              $C$DW$131       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$21)
    1665                      .dwattr $C$DW$131, DW_AT_name("xItemValue")
    1666                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_xItemValue")
    1667                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1668                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1669                      .dwattr $C$DW$131, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1670                      .dwattr $C$DW$131, DW_AT_decl_line(0x6e)
    1671                      .dwattr $C$DW$131, DW_AT_decl_column(0x0f)
    1672              $C$DW$132       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$29)
    1674                      .dwattr $C$DW$132, DW_AT_name("pxNext")
    1675                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_pxNext")
    1676                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1677                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1678                      .dwattr $C$DW$132, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1679                      .dwattr $C$DW$132, DW_AT_decl_line(0x6f)
    1680                      .dwattr $C$DW$132, DW_AT_decl_column(0x1e)
    1681              $C$DW$133       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$29)
    1683                      .dwattr $C$DW$133, DW_AT_name("pxPrevious")
    1684                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_pxPrevious")
    1685                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1686                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1687                      .dwattr $C$DW$133, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1688                      .dwattr $C$DW$133, DW_AT_decl_line(0x70)
    1689                      .dwattr $C$DW$133, DW_AT_decl_column(0x1e)
    1690                      .dwendtag $C$DW$T$31
    1691              
    1692                      .dwattr $C$DW$T$31, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1693                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x6c)
    1694                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x08)
    1695              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1696                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$31)
    1697                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1698                      .dwattr $C$DW$T$36, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1699                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x72)
    1700                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x20)
    1701              $C$DW$134       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   36

    1702                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$36)
    1703              $C$DW$T$37      .dwtag  DW_TAG_volatile_type
    1704                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$134)
    1705              
    1706              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1707                      .dwattr $C$DW$T$38, DW_AT_name("xLIST")
    1708                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0a)
    1709              $C$DW$135       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$32)
    1711                      .dwattr $C$DW$135, DW_AT_name("uxNumberOfItems")
    1712                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1713                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1715                      .dwattr $C$DW$135, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1716                      .dwattr $C$DW$135, DW_AT_decl_line(0x79)
    1717                      .dwattr $C$DW$135, DW_AT_decl_column(0x22)
    1718              $C$DW$136       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$35)
    1720                      .dwattr $C$DW$136, DW_AT_name("pxIndex")
    1721                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_pxIndex")
    1722                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1723                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1724                      .dwattr $C$DW$136, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1725                      .dwattr $C$DW$136, DW_AT_decl_line(0x7a)
    1726                      .dwattr $C$DW$136, DW_AT_decl_column(0x17)
    1727              $C$DW$137       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$37)
    1729                      .dwattr $C$DW$137, DW_AT_name("xListEnd")
    1730                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_xListEnd")
    1731                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1732                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1733                      .dwattr $C$DW$137, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1734                      .dwattr $C$DW$137, DW_AT_decl_line(0x7b)
    1735                      .dwattr $C$DW$137, DW_AT_decl_column(0x19)
    1736                      .dwendtag $C$DW$T$38
    1737              
    1738                      .dwattr $C$DW$T$38, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1739                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x77)
    1740                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    1741              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1742                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$38)
    1743                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1744                      .dwattr $C$DW$T$99, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1745                      .dwattr $C$DW$T$99, DW_AT_decl_line(0x7c)
    1746                      .dwattr $C$DW$T$99, DW_AT_decl_column(0x03)
    1747              
    1748              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1749                      .dwattr $C$DW$T$39, DW_AT_name("xTIME_OUT")
    1750                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1751              $C$DW$138       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$10)
    1753                      .dwattr $C$DW$138, DW_AT_name("xOverflowCount")
    1754                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_xOverflowCount")
    1755                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   37

    1757                      .dwattr $C$DW$138, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1758                      .dwattr $C$DW$138, DW_AT_decl_line(0x5e)
    1759                      .dwattr $C$DW$138, DW_AT_decl_column(0x10)
    1760              $C$DW$139       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    1762                      .dwattr $C$DW$139, DW_AT_name("xTimeOnEntering")
    1763                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_xTimeOnEntering")
    1764                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1765                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1766                      .dwattr $C$DW$139, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1767                      .dwattr $C$DW$139, DW_AT_decl_line(0x5f)
    1768                      .dwattr $C$DW$139, DW_AT_decl_column(0x10)
    1769                      .dwendtag $C$DW$T$39
    1770              
    1771                      .dwattr $C$DW$T$39, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1772                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x5c)
    1773                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1774              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1775                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$39)
    1776                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    1777                      .dwattr $C$DW$T$100, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/
    1778                      .dwattr $C$DW$T$100, DW_AT_decl_line(0x60)
    1779                      .dwattr $C$DW$T$100, DW_AT_decl_column(0x03)
    1780              
    1781              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1782                      .dwattr $C$DW$T$49, DW_AT_name("xTASK_PARAMTERS")
    1783                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x12)
    1784              $C$DW$140       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$42)
    1786                      .dwattr $C$DW$140, DW_AT_name("pvTaskCode")
    1787                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_pvTaskCode")
    1788                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1789                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1790                      .dwattr $C$DW$140, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1791                      .dwattr $C$DW$140, DW_AT_decl_line(0x71)
    1792                      .dwattr $C$DW$140, DW_AT_decl_column(0x0e)
    1793              $C$DW$141       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$45)
    1795                      .dwattr $C$DW$141, DW_AT_name("pcName")
    1796                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_pcName")
    1797                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1798                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1799                      .dwattr $C$DW$141, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1800                      .dwattr $C$DW$141, DW_AT_decl_line(0x72)
    1801                      .dwattr $C$DW$141, DW_AT_decl_column(0x1c)
    1802              $C$DW$142       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$9)
    1804                      .dwattr $C$DW$142, DW_AT_name("usStackDepth")
    1805                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_usStackDepth")
    1806                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1807                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1808                      .dwattr $C$DW$142, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1809                      .dwattr $C$DW$142, DW_AT_decl_line(0x73)
    1810                      .dwattr $C$DW$142, DW_AT_decl_column(0x11)
    1811              $C$DW$143       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   38

    1812                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$3)
    1813                      .dwattr $C$DW$143, DW_AT_name("pvParameters")
    1814                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_pvParameters")
    1815                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1816                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1817                      .dwattr $C$DW$143, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1818                      .dwattr $C$DW$143, DW_AT_decl_line(0x74)
    1819                      .dwattr $C$DW$143, DW_AT_decl_column(0x08)
    1820              $C$DW$144       .dwtag  DW_TAG_member
    1821                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$11)
    1822                      .dwattr $C$DW$144, DW_AT_name("uxPriority")
    1823                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_uxPriority")
    1824                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1825                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1826                      .dwattr $C$DW$144, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1827                      .dwattr $C$DW$144, DW_AT_decl_line(0x75)
    1828                      .dwattr $C$DW$144, DW_AT_decl_column(0x19)
    1829              $C$DW$145       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$46)
    1831                      .dwattr $C$DW$145, DW_AT_name("puxStackBuffer")
    1832                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_puxStackBuffer")
    1833                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1834                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1835                      .dwattr $C$DW$145, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1836                      .dwattr $C$DW$145, DW_AT_decl_line(0x76)
    1837                      .dwattr $C$DW$145, DW_AT_decl_column(0x12)
    1838              $C$DW$146       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$48)
    1840                      .dwattr $C$DW$146, DW_AT_name("xRegions")
    1841                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_xRegions")
    1842                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1843                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1844                      .dwattr $C$DW$146, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1845                      .dwattr $C$DW$146, DW_AT_decl_line(0x77)
    1846                      .dwattr $C$DW$146, DW_AT_decl_column(0x10)
    1847                      .dwendtag $C$DW$T$49
    1848              
    1849                      .dwattr $C$DW$T$49, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1850                      .dwattr $C$DW$T$49, DW_AT_decl_line(0x6f)
    1851                      .dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
    1852              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1853                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$49)
    1854                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    1855                      .dwattr $C$DW$T$101, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/
    1856                      .dwattr $C$DW$T$101, DW_AT_decl_line(0x78)
    1857                      .dwattr $C$DW$T$101, DW_AT_decl_column(0x03)
    1858                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1859              
    1860              ;***************************************************************
    1861              ;* DWARF CIE ENTRIES                                           *
    1862              ;***************************************************************
    1863              
    1864              $C$DW$CIE       .dwcie 91
    1865                      .dwcfi  cfa_register, 36
    1866                      .dwcfi  cfa_offset, 0
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
BlockQ.asm                                                           PAGE   39

    1867                      .dwcfi  undefined, 0
    1868                      .dwcfi  undefined, 1
    1869                      .dwcfi  undefined, 2
    1870                      .dwcfi  undefined, 3
    1871                      .dwcfi  undefined, 4
    1872                      .dwcfi  undefined, 5
    1873                      .dwcfi  undefined, 6
    1874                      .dwcfi  undefined, 7
    1875                      .dwcfi  undefined, 8
    1876                      .dwcfi  undefined, 9
    1877                      .dwcfi  undefined, 10
    1878                      .dwcfi  undefined, 11
    1879                      .dwcfi  undefined, 12
    1880                      .dwcfi  undefined, 13
    1881                      .dwcfi  same_value, 14
    1882                      .dwcfi  same_value, 15
    1883                      .dwcfi  undefined, 16
    1884                      .dwcfi  undefined, 17
    1885                      .dwcfi  undefined, 18
    1886                      .dwcfi  undefined, 19
    1887                      .dwcfi  undefined, 20
    1888                      .dwcfi  undefined, 21
    1889                      .dwcfi  undefined, 22
    1890                      .dwcfi  undefined, 23
    1891                      .dwcfi  undefined, 24
    1892                      .dwcfi  undefined, 25
    1893                      .dwcfi  same_value, 26
    1894                      .dwcfi  same_value, 27
    1895                      .dwcfi  same_value, 28
    1896                      .dwcfi  same_value, 29
    1897                      .dwcfi  same_value, 30
    1898                      .dwcfi  same_value, 31
    1899                      .dwcfi  undefined, 32
    1900                      .dwcfi  undefined, 33
    1901                      .dwcfi  undefined, 34
    1902                      .dwcfi  undefined, 35
    1903                      .dwcfi  undefined, 36
    1904                      .dwcfi  undefined, 37
