TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
blocktim.asm                                                         PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:33 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

    2055                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x19)
    2056              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2057                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2058                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2059                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2060              $C$DW$181       .dwtag  DW_TAG_TI_far_type
    2061                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$11)
    2062              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    2063                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$181)
    2064              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    2065                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$11)
    2066                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    2067              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    2068                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$11)
    2069                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2070                      .dwattr $C$DW$T$78, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2071                      .dwattr $C$DW$T$78, DW_AT_decl_line(0x1c)
    2072                      .dwattr $C$DW$T$78, DW_AT_decl_column(0x1a)
    2073              $C$DW$T$12      .dwtag  DW_TAG_base_type
    2074                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2075                      .dwattr $C$DW$T$12, DW_AT_name("long")
    2076                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    2077              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    2078                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$12)
    2079                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2080                      .dwattr $C$DW$T$79, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2081                      .dwattr $C$DW$T$79, DW_AT_decl_line(0x11)
    2082                      .dwattr $C$DW$T$79, DW_AT_decl_column(0x1c)
    2083              $C$DW$T$13      .dwtag  DW_TAG_base_type
    2084                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
blocktim.asm                                                         PAGE   45

    2085                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2086                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    2087              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    2088                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$13)
    2089                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2090                      .dwattr $C$DW$T$20, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2091                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x55)
    2092                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)
    2093              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    2094                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$13)
    2095                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2096                      .dwattr $C$DW$T$81, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2097                      .dwattr $C$DW$T$81, DW_AT_decl_line(0x15)
    2098                      .dwattr $C$DW$T$81, DW_AT_decl_column(0x19)
    2099              $C$DW$T$14      .dwtag  DW_TAG_base_type
    2100                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2101                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    2102                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    2103                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    2104                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    2105              $C$DW$T$15      .dwtag  DW_TAG_base_type
    2106                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    2107                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    2108                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    2109                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    2110                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    2111              $C$DW$T$16      .dwtag  DW_TAG_base_type
    2112                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2113                      .dwattr $C$DW$T$16, DW_AT_name("float")
    2114                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    2115              $C$DW$T$17      .dwtag  DW_TAG_base_type
    2116                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2117                      .dwattr $C$DW$T$17, DW_AT_name("double")
    2118                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    2119              $C$DW$T$18      .dwtag  DW_TAG_base_type
    2120                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2121                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    2122                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    2123              
    2124              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2125                      .dwattr $C$DW$T$19, DW_AT_name("xMEMORY_REGION")
    2126                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x06)
    2127              $C$DW$182       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$3)
    2129                      .dwattr $C$DW$182, DW_AT_name("pvBaseAddress")
    2130                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_pvBaseAddress")
    2131                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2133                      .dwattr $C$DW$182, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2134                      .dwattr $C$DW$182, DW_AT_decl_line(0x67)
    2135                      .dwattr $C$DW$182, DW_AT_decl_column(0x08)
    2136              $C$DW$183       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$13)
    2138                      .dwattr $C$DW$183, DW_AT_name("ulLengthInBytes")
    2139                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ulLengthInBytes")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
blocktim.asm                                                         PAGE   46

    2140                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2141                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2142                      .dwattr $C$DW$183, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2143                      .dwattr $C$DW$183, DW_AT_decl_line(0x68)
    2144                      .dwattr $C$DW$183, DW_AT_decl_column(0x10)
    2145              $C$DW$184       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$13)
    2147                      .dwattr $C$DW$184, DW_AT_name("ulParameters")
    2148                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ulParameters")
    2149                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2150                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2151                      .dwattr $C$DW$184, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2152                      .dwattr $C$DW$184, DW_AT_decl_line(0x69)
    2153                      .dwattr $C$DW$184, DW_AT_decl_column(0x10)
    2154                      .dwendtag $C$DW$T$19
    2155              
    2156                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2157                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x65)
    2158                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    2159              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    2160                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$19)
    2161                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2162                      .dwattr $C$DW$T$40, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2163                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x6a)
    2164                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x03)
    2165              
    2166              $C$DW$T$41      .dwtag  DW_TAG_array_type
    2167                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2168                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2169                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
    2170              $C$DW$185       .dwtag  DW_TAG_subrange_type
    2171                      .dwattr $C$DW$185, DW_AT_upper_bound(0x00)
    2172                      .dwendtag $C$DW$T$41
    2173              
    2174              $C$DW$186       .dwtag  DW_TAG_TI_far_type
    2175                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$40)
    2176              $C$DW$T$62      .dwtag  DW_TAG_const_type
    2177                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$186)
    2178              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    2179                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    2180                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
    2181              $C$DW$187       .dwtag  DW_TAG_TI_far_type
    2182                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$63)
    2183              $C$DW$T$64      .dwtag  DW_TAG_const_type
    2184                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$187)
    2185              
    2186              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2187                      .dwattr $C$DW$T$23, DW_AT_name("xLIST_ITEM")
    2188                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    2189              $C$DW$188       .dwtag  DW_TAG_member
    2190                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    2191                      .dwattr $C$DW$188, DW_AT_name("xItemValue")
    2192                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_xItemValue")
    2193                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2194                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
blocktim.asm                                                         PAGE   47

    2195                      .dwattr $C$DW$188, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2196                      .dwattr $C$DW$188, DW_AT_decl_line(0x64)
    2197                      .dwattr $C$DW$188, DW_AT_decl_column(0x0f)
    2198              $C$DW$189       .dwtag  DW_TAG_member
    2199                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2200                      .dwattr $C$DW$189, DW_AT_name("pxNext")
    2201                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_pxNext")
    2202                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2203                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2204                      .dwattr $C$DW$189, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2205                      .dwattr $C$DW$189, DW_AT_decl_line(0x65)
    2206                      .dwattr $C$DW$189, DW_AT_decl_column(0x1f)
    2207              $C$DW$190       .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    2209                      .dwattr $C$DW$190, DW_AT_name("pxPrevious")
    2210                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_pxPrevious")
    2211                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2212                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2213                      .dwattr $C$DW$190, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2214                      .dwattr $C$DW$190, DW_AT_decl_line(0x66)
    2215                      .dwattr $C$DW$190, DW_AT_decl_column(0x1f)
    2216              $C$DW$191       .dwtag  DW_TAG_member
    2217                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$3)
    2218                      .dwattr $C$DW$191, DW_AT_name("pvOwner")
    2219                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_pvOwner")
    2220                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2221                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2222                      .dwattr $C$DW$191, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2223                      .dwattr $C$DW$191, DW_AT_decl_line(0x67)
    2224                      .dwattr $C$DW$191, DW_AT_decl_column(0x09)
    2225              $C$DW$192       .dwtag  DW_TAG_member
    2226                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$3)
    2227                      .dwattr $C$DW$192, DW_AT_name("pvContainer")
    2228                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_pvContainer")
    2229                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2230                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2231                      .dwattr $C$DW$192, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2232                      .dwattr $C$DW$192, DW_AT_decl_line(0x68)
    2233                      .dwattr $C$DW$192, DW_AT_decl_column(0x09)
    2234                      .dwendtag $C$DW$T$23
    2235              
    2236                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2237                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x62)
    2238                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x08)
    2239              $C$DW$193       .dwtag  DW_TAG_TI_far_type
    2240                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$23)
    2241              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
    2242                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$193)
    2243              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    2244                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    2245                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    2246              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    2247                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$23)
    2248                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2249                      .dwattr $C$DW$T$26, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
blocktim.asm                                                         PAGE   48

    2250                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x6a)
    2251                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x1b)
    2252              $C$DW$194       .dwtag  DW_TAG_TI_far_type
    2253                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$26)
    2254              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    2255                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$194)
    2256              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    2257                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2258                      .dwattr $C$DW$T$28, DW_AT_address_class(0x17)
    2259              
    2260              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2261                      .dwattr $C$DW$T$24, DW_AT_name("xMINI_LIST_ITEM")
    2262                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x06)
    2263              $C$DW$195       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$20)
    2265                      .dwattr $C$DW$195, DW_AT_name("xItemValue")
    2266                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_xItemValue")
    2267                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2268                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2269                      .dwattr $C$DW$195, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2270                      .dwattr $C$DW$195, DW_AT_decl_line(0x6e)
    2271                      .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    2272              $C$DW$196       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2274                      .dwattr $C$DW$196, DW_AT_name("pxNext")
    2275                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_pxNext")
    2276                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2277                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2278                      .dwattr $C$DW$196, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2279                      .dwattr $C$DW$196, DW_AT_decl_line(0x6f)
    2280                      .dwattr $C$DW$196, DW_AT_decl_column(0x1e)
    2281              $C$DW$197       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
    2283                      .dwattr $C$DW$197, DW_AT_name("pxPrevious")
    2284                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_pxPrevious")
    2285                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2286                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2287                      .dwattr $C$DW$197, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2288                      .dwattr $C$DW$197, DW_AT_decl_line(0x70)
    2289                      .dwattr $C$DW$197, DW_AT_decl_column(0x1e)
    2290                      .dwendtag $C$DW$T$24
    2291              
    2292                      .dwattr $C$DW$T$24, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2293                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x6c)
    2294                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x08)
    2295              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    2296                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$24)
    2297                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2298                      .dwattr $C$DW$T$29, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2299                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x72)
    2300                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x20)
    2301              $C$DW$198       .dwtag  DW_TAG_TI_far_type
    2302                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$29)
    2303              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    2304                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$198)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
blocktim.asm                                                         PAGE   49

    2305              
    2306              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2307                      .dwattr $C$DW$T$31, DW_AT_name("xLIST")
    2308                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    2309              $C$DW$199       .dwtag  DW_TAG_member
    2310                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$25)
    2311                      .dwattr $C$DW$199, DW_AT_name("uxNumberOfItems")
    2312                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_uxNumberOfItems")
    2313                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2315                      .dwattr $C$DW$199, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2316                      .dwattr $C$DW$199, DW_AT_decl_line(0x79)
    2317                      .dwattr $C$DW$199, DW_AT_decl_column(0x22)
    2318              $C$DW$200       .dwtag  DW_TAG_member
    2319                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$28)
    2320                      .dwattr $C$DW$200, DW_AT_name("pxIndex")
    2321                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_pxIndex")
    2322                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2323                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2324                      .dwattr $C$DW$200, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2325                      .dwattr $C$DW$200, DW_AT_decl_line(0x7a)
    2326                      .dwattr $C$DW$200, DW_AT_decl_column(0x17)
    2327              $C$DW$201       .dwtag  DW_TAG_member
    2328                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$30)
    2329                      .dwattr $C$DW$201, DW_AT_name("xListEnd")
    2330                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_xListEnd")
    2331                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2332                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2333                      .dwattr $C$DW$201, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2334                      .dwattr $C$DW$201, DW_AT_decl_line(0x7b)
    2335                      .dwattr $C$DW$201, DW_AT_decl_column(0x19)
    2336                      .dwendtag $C$DW$T$31
    2337              
    2338                      .dwattr $C$DW$T$31, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2339                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x77)
    2340                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2341              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    2342                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$31)
    2343                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2344                      .dwattr $C$DW$T$86, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2345                      .dwattr $C$DW$T$86, DW_AT_decl_line(0x7c)
    2346                      .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    2347              
    2348              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2349                      .dwattr $C$DW$T$32, DW_AT_name("xTIME_OUT")
    2350                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    2351              $C$DW$202       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$10)
    2353                      .dwattr $C$DW$202, DW_AT_name("xOverflowCount")
    2354                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_xOverflowCount")
    2355                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2356                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2357                      .dwattr $C$DW$202, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2358                      .dwattr $C$DW$202, DW_AT_decl_line(0x5e)
    2359                      .dwattr $C$DW$202, DW_AT_decl_column(0x10)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
blocktim.asm                                                         PAGE   50

    2360              $C$DW$203       .dwtag  DW_TAG_member
    2361                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    2362                      .dwattr $C$DW$203, DW_AT_name("xTimeOnEntering")
    2363                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_xTimeOnEntering")
    2364                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2365                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2366                      .dwattr $C$DW$203, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2367                      .dwattr $C$DW$203, DW_AT_decl_line(0x5f)
    2368                      .dwattr $C$DW$203, DW_AT_decl_column(0x10)
    2369                      .dwendtag $C$DW$T$32
    2370              
    2371                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2372                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x5c)
    2373                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    2374              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    2375                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$32)
    2376                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2377                      .dwattr $C$DW$T$87, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2378                      .dwattr $C$DW$T$87, DW_AT_decl_line(0x60)
    2379                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    2380              
    2381              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2382                      .dwattr $C$DW$T$42, DW_AT_name("xTASK_PARAMTERS")
    2383                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x12)
    2384              $C$DW$204       .dwtag  DW_TAG_member
    2385                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$35)
    2386                      .dwattr $C$DW$204, DW_AT_name("pvTaskCode")
    2387                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_pvTaskCode")
    2388                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2389                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2390                      .dwattr $C$DW$204, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2391                      .dwattr $C$DW$204, DW_AT_decl_line(0x71)
    2392                      .dwattr $C$DW$204, DW_AT_decl_column(0x0e)
    2393              $C$DW$205       .dwtag  DW_TAG_member
    2394                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$38)
    2395                      .dwattr $C$DW$205, DW_AT_name("pcName")
    2396                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_pcName")
    2397                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2398                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2399                      .dwattr $C$DW$205, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2400                      .dwattr $C$DW$205, DW_AT_decl_line(0x72)
    2401                      .dwattr $C$DW$205, DW_AT_decl_column(0x1c)
    2402              $C$DW$206       .dwtag  DW_TAG_member
    2403                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$9)
    2404                      .dwattr $C$DW$206, DW_AT_name("usStackDepth")
    2405                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_usStackDepth")
    2406                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2407                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2408                      .dwattr $C$DW$206, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2409                      .dwattr $C$DW$206, DW_AT_decl_line(0x73)
    2410                      .dwattr $C$DW$206, DW_AT_decl_column(0x11)
    2411              $C$DW$207       .dwtag  DW_TAG_member
    2412                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$3)
    2413                      .dwattr $C$DW$207, DW_AT_name("pvParameters")
    2414                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_pvParameters")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
blocktim.asm                                                         PAGE   51

    2415                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2416                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2417                      .dwattr $C$DW$207, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2418                      .dwattr $C$DW$207, DW_AT_decl_line(0x74)
    2419                      .dwattr $C$DW$207, DW_AT_decl_column(0x08)
    2420              $C$DW$208       .dwtag  DW_TAG_member
    2421                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$11)
    2422                      .dwattr $C$DW$208, DW_AT_name("uxPriority")
    2423                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_uxPriority")
    2424                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2425                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2426                      .dwattr $C$DW$208, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2427                      .dwattr $C$DW$208, DW_AT_decl_line(0x75)
    2428                      .dwattr $C$DW$208, DW_AT_decl_column(0x19)
    2429              $C$DW$209       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$39)
    2431                      .dwattr $C$DW$209, DW_AT_name("puxStackBuffer")
    2432                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_puxStackBuffer")
    2433                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2434                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2435                      .dwattr $C$DW$209, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2436                      .dwattr $C$DW$209, DW_AT_decl_line(0x76)
    2437                      .dwattr $C$DW$209, DW_AT_decl_column(0x12)
    2438              $C$DW$210       .dwtag  DW_TAG_member
    2439                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$41)
    2440                      .dwattr $C$DW$210, DW_AT_name("xRegions")
    2441                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_xRegions")
    2442                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2443                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2444                      .dwattr $C$DW$210, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2445                      .dwattr $C$DW$210, DW_AT_decl_line(0x77)
    2446                      .dwattr $C$DW$210, DW_AT_decl_column(0x10)
    2447                      .dwendtag $C$DW$T$42
    2448              
    2449                      .dwattr $C$DW$T$42, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2450                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x6f)
    2451                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2452              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    2453                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$42)
    2454                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2455                      .dwattr $C$DW$T$88, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2456                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x78)
    2457                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    2458                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2459              
    2460              ;***************************************************************
    2461              ;* DWARF CIE ENTRIES                                           *
    2462              ;***************************************************************
    2463              
    2464              $C$DW$CIE       .dwcie 91
    2465                      .dwcfi  cfa_register, 36
    2466                      .dwcfi  cfa_offset, 0
    2467                      .dwcfi  undefined, 0
    2468                      .dwcfi  undefined, 1
    2469                      .dwcfi  undefined, 2
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
blocktim.asm                                                         PAGE   52

    2470                      .dwcfi  undefined, 3
    2471                      .dwcfi  undefined, 4
    2472                      .dwcfi  undefined, 5
    2473                      .dwcfi  undefined, 6
    2474                      .dwcfi  undefined, 7
    2475                      .dwcfi  undefined, 8
    2476                      .dwcfi  undefined, 9
    2477                      .dwcfi  undefined, 10
    2478                      .dwcfi  undefined, 11
    2479                      .dwcfi  undefined, 12
    2480                      .dwcfi  undefined, 13
    2481                      .dwcfi  same_value, 14
    2482                      .dwcfi  same_value, 15
    2483                      .dwcfi  undefined, 16
    2484                      .dwcfi  undefined, 17
    2485                      .dwcfi  undefined, 18
    2486                      .dwcfi  undefined, 19
    2487                      .dwcfi  undefined, 20
    2488                      .dwcfi  undefined, 21
    2489                      .dwcfi  undefined, 22
    2490                      .dwcfi  undefined, 23
    2491                      .dwcfi  undefined, 24
    2492                      .dwcfi  undefined, 25
    2493                      .dwcfi  same_value, 26
    2494                      .dwcfi  same_value, 27
    2495                      .dwcfi  same_value, 28
    2496                      .dwcfi  same_value, 29
    2497                      .dwcfi  same_value, 30
    2498                      .dwcfi  same_value, 31
    2499                      .dwcfi  undefined, 32
    2500                      .dwcfi  undefined, 33
    2501                      .dwcfi  undefined, 34
    2502                      .dwcfi  undefined, 35
    2503                      .dwcfi  undefined, 36
    2504                      .dwcfi  undefined, 37
