TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:24 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
croutine.asm                                                         PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:24 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

    1745                      .dwattr $C$DW$T$71, DW_AT_decl_column(0x19)
    1746              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1747                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1748                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1749                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1750              $C$DW$124       .dwtag  DW_TAG_TI_far_type
    1751                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1752              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    1753                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$124)
    1754              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1755                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$11)
    1756                      .dwattr $C$DW$T$44, DW_AT_address_class(0x17)
    1757              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1758                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$11)
    1759                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1760                      .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1761                      .dwattr $C$DW$T$74, DW_AT_decl_line(0x1c)
    1762                      .dwattr $C$DW$T$74, DW_AT_decl_column(0x1a)
    1763              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1764                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1765                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1766                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1767              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    1768                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$12)
    1769                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1770                      .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1771                      .dwattr $C$DW$T$75, DW_AT_decl_line(0x11)
    1772                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x1c)
    1773              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1774                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1775                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1776                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1777              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1778                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$13)
    1779                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1780                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1781                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x55)
    1782                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    1783              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1784                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$13)
    1785                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1786                      .dwattr $C$DW$T$48, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1787                      .dwattr $C$DW$T$48, DW_AT_decl_line(0x15)
    1788                      .dwattr $C$DW$T$48, DW_AT_decl_column(0x19)
    1789              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1790                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1791                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1792                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1793                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1794                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1795              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1796                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1797                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1798                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:24 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
croutine.asm                                                         PAGE   39

    1799                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1800                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1801              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1802                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1803                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1804                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1805              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1806                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1807                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1808                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1809              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1810                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1811                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1812                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1813              
    1814              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1815                      .dwattr $C$DW$T$22, DW_AT_name("xLIST_ITEM")
    1816                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0a)
    1817              $C$DW$125       .dwtag  DW_TAG_member
    1818                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1819                      .dwattr $C$DW$125, DW_AT_name("xItemValue")
    1820                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_xItemValue")
    1821                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1823                      .dwattr $C$DW$125, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1824                      .dwattr $C$DW$125, DW_AT_decl_line(0x64)
    1825                      .dwattr $C$DW$125, DW_AT_decl_column(0x0f)
    1826              $C$DW$126       .dwtag  DW_TAG_member
    1827                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$21)
    1828                      .dwattr $C$DW$126, DW_AT_name("pxNext")
    1829                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_pxNext")
    1830                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1831                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1832                      .dwattr $C$DW$126, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1833                      .dwattr $C$DW$126, DW_AT_decl_line(0x65)
    1834                      .dwattr $C$DW$126, DW_AT_decl_column(0x1f)
    1835              $C$DW$127       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$21)
    1837                      .dwattr $C$DW$127, DW_AT_name("pxPrevious")
    1838                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_pxPrevious")
    1839                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1840                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1841                      .dwattr $C$DW$127, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1842                      .dwattr $C$DW$127, DW_AT_decl_line(0x66)
    1843                      .dwattr $C$DW$127, DW_AT_decl_column(0x1f)
    1844              $C$DW$128       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$3)
    1846                      .dwattr $C$DW$128, DW_AT_name("pvOwner")
    1847                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_pvOwner")
    1848                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1849                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1850                      .dwattr $C$DW$128, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1851                      .dwattr $C$DW$128, DW_AT_decl_line(0x67)
    1852                      .dwattr $C$DW$128, DW_AT_decl_column(0x09)
    1853              $C$DW$129       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:24 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
croutine.asm                                                         PAGE   40

    1854                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$3)
    1855                      .dwattr $C$DW$129, DW_AT_name("pvContainer")
    1856                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_pvContainer")
    1857                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1858                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1859                      .dwattr $C$DW$129, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1860                      .dwattr $C$DW$129, DW_AT_decl_line(0x68)
    1861                      .dwattr $C$DW$129, DW_AT_decl_column(0x09)
    1862                      .dwendtag $C$DW$T$22
    1863              
    1864                      .dwattr $C$DW$T$22, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1865                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x62)
    1866                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x08)
    1867              $C$DW$130       .dwtag  DW_TAG_TI_far_type
    1868                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$22)
    1869              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    1870                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$130)
    1871              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    1872                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    1873                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    1874              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1875                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
    1876                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1877                      .dwattr $C$DW$T$25, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1878                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x6a)
    1879                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x1b)
    1880              $C$DW$131       .dwtag  DW_TAG_TI_far_type
    1881                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$25)
    1882              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    1883                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$131)
    1884              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    1885                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1886                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
    1887              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    1888                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$25)
    1889                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
    1890              
    1891              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1892                      .dwattr $C$DW$T$23, DW_AT_name("xMINI_LIST_ITEM")
    1893                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    1894              $C$DW$132       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$132, DW_AT_name("xItemValue")
    1897                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_xItemValue")
    1898                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1899                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1900                      .dwattr $C$DW$132, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1901                      .dwattr $C$DW$132, DW_AT_decl_line(0x6e)
    1902                      .dwattr $C$DW$132, DW_AT_decl_column(0x0f)
    1903              $C$DW$133       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$21)
    1905                      .dwattr $C$DW$133, DW_AT_name("pxNext")
    1906                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_pxNext")
    1907                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1908                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:24 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
croutine.asm                                                         PAGE   41

    1909                      .dwattr $C$DW$133, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1910                      .dwattr $C$DW$133, DW_AT_decl_line(0x6f)
    1911                      .dwattr $C$DW$133, DW_AT_decl_column(0x1e)
    1912              $C$DW$134       .dwtag  DW_TAG_member
    1913                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
    1914                      .dwattr $C$DW$134, DW_AT_name("pxPrevious")
    1915                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_pxPrevious")
    1916                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1917                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1918                      .dwattr $C$DW$134, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1919                      .dwattr $C$DW$134, DW_AT_decl_line(0x70)
    1920                      .dwattr $C$DW$134, DW_AT_decl_column(0x1e)
    1921                      .dwendtag $C$DW$T$23
    1922              
    1923                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1924                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x6c)
    1925                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x08)
    1926              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1927                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
    1928                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1929                      .dwattr $C$DW$T$28, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1930                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
    1931                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x20)
    1932              $C$DW$135       .dwtag  DW_TAG_TI_far_type
    1933                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$28)
    1934              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    1935                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$135)
    1936              
    1937              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1938                      .dwattr $C$DW$T$30, DW_AT_name("xLIST")
    1939                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    1940              $C$DW$136       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$24)
    1942                      .dwattr $C$DW$136, DW_AT_name("uxNumberOfItems")
    1943                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1944                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1946                      .dwattr $C$DW$136, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1947                      .dwattr $C$DW$136, DW_AT_decl_line(0x79)
    1948                      .dwattr $C$DW$136, DW_AT_decl_column(0x22)
    1949              $C$DW$137       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    1951                      .dwattr $C$DW$137, DW_AT_name("pxIndex")
    1952                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_pxIndex")
    1953                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1954                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1955                      .dwattr $C$DW$137, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1956                      .dwattr $C$DW$137, DW_AT_decl_line(0x7a)
    1957                      .dwattr $C$DW$137, DW_AT_decl_column(0x17)
    1958              $C$DW$138       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$29)
    1960                      .dwattr $C$DW$138, DW_AT_name("xListEnd")
    1961                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_xListEnd")
    1962                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1963                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:24 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
croutine.asm                                                         PAGE   42

    1964                      .dwattr $C$DW$138, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1965                      .dwattr $C$DW$138, DW_AT_decl_line(0x7b)
    1966                      .dwattr $C$DW$138, DW_AT_decl_column(0x19)
    1967                      .dwendtag $C$DW$T$30
    1968              
    1969                      .dwattr $C$DW$T$30, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1970                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x77)
    1971                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1972              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1973                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$30)
    1974                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1975                      .dwattr $C$DW$T$55, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1976                      .dwattr $C$DW$T$55, DW_AT_decl_line(0x7c)
    1977                      .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    1978              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    1979                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    1980                      .dwattr $C$DW$T$56, DW_AT_address_class(0x17)
    1981              $C$DW$139       .dwtag  DW_TAG_TI_far_type
    1982                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$56)
    1983              $C$DW$T$87      .dwtag  DW_TAG_const_type
    1984                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$139)
    1985              $C$DW$140       .dwtag  DW_TAG_TI_far_type
    1986                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$55)
    1987              $C$DW$T$66      .dwtag  DW_TAG_const_type
    1988                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$140)
    1989              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    1990                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    1991                      .dwattr $C$DW$T$67, DW_AT_address_class(0x17)
    1992              
    1993              $C$DW$T$88      .dwtag  DW_TAG_array_type
    1994                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$55)
    1995                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1996                      .dwattr $C$DW$T$88, DW_AT_byte_size(0x14)
    1997              $C$DW$141       .dwtag  DW_TAG_subrange_type
    1998                      .dwattr $C$DW$141, DW_AT_upper_bound(0x01)
    1999                      .dwendtag $C$DW$T$88
    2000              
    2001              
    2002              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2003                      .dwattr $C$DW$T$35, DW_AT_name("corCoRoutineControlBlock")
    2004                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x1a)
    2005              $C$DW$142       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$34)
    2007                      .dwattr $C$DW$142, DW_AT_name("pxCoRoutineFunction")
    2008                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_pxCoRoutineFunction")
    2009                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2011                      .dwattr $C$DW$142, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2012                      .dwattr $C$DW$142, DW_AT_decl_line(0x50)
    2013                      .dwattr $C$DW$142, DW_AT_decl_column(0x15)
    2014              $C$DW$143       .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$25)
    2016                      .dwattr $C$DW$143, DW_AT_name("xGenericListItem")
    2017                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_xGenericListItem")
    2018                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:24 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
croutine.asm                                                         PAGE   43

    2019                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2020                      .dwattr $C$DW$143, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2021                      .dwattr $C$DW$143, DW_AT_decl_line(0x51)
    2022                      .dwattr $C$DW$143, DW_AT_decl_column(0x0f)
    2023              $C$DW$144       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$25)
    2025                      .dwattr $C$DW$144, DW_AT_name("xEventListItem")
    2026                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_xEventListItem")
    2027                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2028                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2029                      .dwattr $C$DW$144, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2030                      .dwattr $C$DW$144, DW_AT_decl_line(0x52)
    2031                      .dwattr $C$DW$144, DW_AT_decl_column(0x0f)
    2032              $C$DW$145       .dwtag  DW_TAG_member
    2033                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$11)
    2034                      .dwattr $C$DW$145, DW_AT_name("uxPriority")
    2035                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_uxPriority")
    2036                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2037                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2038                      .dwattr $C$DW$145, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2039                      .dwattr $C$DW$145, DW_AT_decl_line(0x53)
    2040                      .dwattr $C$DW$145, DW_AT_decl_column(0x1a)
    2041              $C$DW$146       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$11)
    2043                      .dwattr $C$DW$146, DW_AT_name("uxIndex")
    2044                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_uxIndex")
    2045                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2046                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2047                      .dwattr $C$DW$146, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2048                      .dwattr $C$DW$146, DW_AT_decl_line(0x54)
    2049                      .dwattr $C$DW$146, DW_AT_decl_column(0x1a)
    2050              $C$DW$147       .dwtag  DW_TAG_member
    2051                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$9)
    2052                      .dwattr $C$DW$147, DW_AT_name("uxState")
    2053                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_uxState")
    2054                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2055                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2056                      .dwattr $C$DW$147, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2057                      .dwattr $C$DW$147, DW_AT_decl_line(0x55)
    2058                      .dwattr $C$DW$147, DW_AT_decl_column(0x13)
    2059                      .dwendtag $C$DW$T$35
    2060              
    2061                      .dwattr $C$DW$T$35, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2062                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x4e)
    2063                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2064              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("corCRCB")
    2065                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$35)
    2066                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2067                      .dwattr $C$DW$T$94, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2068                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x56)
    2069                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x03)
    2070              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    2071                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    2072                      .dwattr $C$DW$T$95, DW_AT_address_class(0x17)
    2073              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:24 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
croutine.asm                                                         PAGE   44

    2074                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$35)
    2075                      .dwattr $C$DW$T$96, DW_AT_address_class(0x17)
    2076              
    2077              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2078                      .dwattr $C$DW$T$36, DW_AT_name("xTIME_OUT")
    2079                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2080              $C$DW$148       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$10)
    2082                      .dwattr $C$DW$148, DW_AT_name("xOverflowCount")
    2083                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_xOverflowCount")
    2084                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2085                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2086                      .dwattr $C$DW$148, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2087                      .dwattr $C$DW$148, DW_AT_decl_line(0x5e)
    2088                      .dwattr $C$DW$148, DW_AT_decl_column(0x10)
    2089              $C$DW$149       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2091                      .dwattr $C$DW$149, DW_AT_name("xTimeOnEntering")
    2092                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_xTimeOnEntering")
    2093                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2094                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2095                      .dwattr $C$DW$149, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2096                      .dwattr $C$DW$149, DW_AT_decl_line(0x5f)
    2097                      .dwattr $C$DW$149, DW_AT_decl_column(0x10)
    2098                      .dwendtag $C$DW$T$36
    2099              
    2100                      .dwattr $C$DW$T$36, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2101                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x5c)
    2102                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    2103              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    2104                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$36)
    2105                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2106                      .dwattr $C$DW$T$97, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2107                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x60)
    2108                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x03)
    2109              
    2110              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2111                      .dwattr $C$DW$T$37, DW_AT_name("xMEMORY_REGION")
    2112                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    2113              $C$DW$150       .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$3)
    2115                      .dwattr $C$DW$150, DW_AT_name("pvBaseAddress")
    2116                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_pvBaseAddress")
    2117                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2118                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2119                      .dwattr $C$DW$150, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2120                      .dwattr $C$DW$150, DW_AT_decl_line(0x67)
    2121                      .dwattr $C$DW$150, DW_AT_decl_column(0x08)
    2122              $C$DW$151       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$13)
    2124                      .dwattr $C$DW$151, DW_AT_name("ulLengthInBytes")
    2125                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ulLengthInBytes")
    2126                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2127                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2128                      .dwattr $C$DW$151, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:24 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
croutine.asm                                                         PAGE   45

    2129                      .dwattr $C$DW$151, DW_AT_decl_line(0x68)
    2130                      .dwattr $C$DW$151, DW_AT_decl_column(0x10)
    2131              $C$DW$152       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$13)
    2133                      .dwattr $C$DW$152, DW_AT_name("ulParameters")
    2134                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ulParameters")
    2135                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2136                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2137                      .dwattr $C$DW$152, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2138                      .dwattr $C$DW$152, DW_AT_decl_line(0x69)
    2139                      .dwattr $C$DW$152, DW_AT_decl_column(0x10)
    2140                      .dwendtag $C$DW$T$37
    2141              
    2142                      .dwattr $C$DW$T$37, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2143                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x65)
    2144                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    2145              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    2146                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$37)
    2147                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2148                      .dwattr $C$DW$T$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2149                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x6a)
    2150                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    2151              
    2152              $C$DW$T$46      .dwtag  DW_TAG_array_type
    2153                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2154                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2155                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x06)
    2156              $C$DW$153       .dwtag  DW_TAG_subrange_type
    2157                      .dwattr $C$DW$153, DW_AT_upper_bound(0x00)
    2158                      .dwendtag $C$DW$T$46
    2159              
    2160              
    2161              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2162                      .dwattr $C$DW$T$47, DW_AT_name("xTASK_PARAMTERS")
    2163                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x12)
    2164              $C$DW$154       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$40)
    2166                      .dwattr $C$DW$154, DW_AT_name("pvTaskCode")
    2167                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_pvTaskCode")
    2168                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2169                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2170                      .dwattr $C$DW$154, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2171                      .dwattr $C$DW$154, DW_AT_decl_line(0x71)
    2172                      .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    2173              $C$DW$155       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$43)
    2175                      .dwattr $C$DW$155, DW_AT_name("pcName")
    2176                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_pcName")
    2177                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2178                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2179                      .dwattr $C$DW$155, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2180                      .dwattr $C$DW$155, DW_AT_decl_line(0x72)
    2181                      .dwattr $C$DW$155, DW_AT_decl_column(0x1c)
    2182              $C$DW$156       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$9)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:24 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
croutine.asm                                                         PAGE   46

    2184                      .dwattr $C$DW$156, DW_AT_name("usStackDepth")
    2185                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_usStackDepth")
    2186                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2187                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2188                      .dwattr $C$DW$156, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2189                      .dwattr $C$DW$156, DW_AT_decl_line(0x73)
    2190                      .dwattr $C$DW$156, DW_AT_decl_column(0x11)
    2191              $C$DW$157       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$3)
    2193                      .dwattr $C$DW$157, DW_AT_name("pvParameters")
    2194                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_pvParameters")
    2195                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2196                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2197                      .dwattr $C$DW$157, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2198                      .dwattr $C$DW$157, DW_AT_decl_line(0x74)
    2199                      .dwattr $C$DW$157, DW_AT_decl_column(0x08)
    2200              $C$DW$158       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$11)
    2202                      .dwattr $C$DW$158, DW_AT_name("uxPriority")
    2203                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_uxPriority")
    2204                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2205                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2206                      .dwattr $C$DW$158, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2207                      .dwattr $C$DW$158, DW_AT_decl_line(0x75)
    2208                      .dwattr $C$DW$158, DW_AT_decl_column(0x19)
    2209              $C$DW$159       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$44)
    2211                      .dwattr $C$DW$159, DW_AT_name("puxStackBuffer")
    2212                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_puxStackBuffer")
    2213                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2214                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2215                      .dwattr $C$DW$159, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2216                      .dwattr $C$DW$159, DW_AT_decl_line(0x76)
    2217                      .dwattr $C$DW$159, DW_AT_decl_column(0x12)
    2218              $C$DW$160       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$46)
    2220                      .dwattr $C$DW$160, DW_AT_name("xRegions")
    2221                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_xRegions")
    2222                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2223                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2224                      .dwattr $C$DW$160, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2225                      .dwattr $C$DW$160, DW_AT_decl_line(0x77)
    2226                      .dwattr $C$DW$160, DW_AT_decl_column(0x10)
    2227                      .dwendtag $C$DW$T$47
    2228              
    2229                      .dwattr $C$DW$T$47, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2230                      .dwattr $C$DW$T$47, DW_AT_decl_line(0x6f)
    2231                      .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    2232              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    2233                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$47)
    2234                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2235                      .dwattr $C$DW$T$98, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2236                      .dwattr $C$DW$T$98, DW_AT_decl_line(0x78)
    2237                      .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    2238                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:24 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
croutine.asm                                                         PAGE   47

    2239              
    2240              ;***************************************************************
    2241              ;* DWARF CIE ENTRIES                                           *
    2242              ;***************************************************************
    2243              
    2244              $C$DW$CIE       .dwcie 91
    2245                      .dwcfi  cfa_register, 36
    2246                      .dwcfi  cfa_offset, 0
    2247                      .dwcfi  undefined, 0
    2248                      .dwcfi  undefined, 1
    2249                      .dwcfi  undefined, 2
    2250                      .dwcfi  undefined, 3
    2251                      .dwcfi  undefined, 4
    2252                      .dwcfi  undefined, 5
    2253                      .dwcfi  undefined, 6
    2254                      .dwcfi  undefined, 7
    2255                      .dwcfi  undefined, 8
    2256                      .dwcfi  undefined, 9
    2257                      .dwcfi  undefined, 10
    2258                      .dwcfi  undefined, 11
    2259                      .dwcfi  undefined, 12
    2260                      .dwcfi  undefined, 13
    2261                      .dwcfi  same_value, 14
    2262                      .dwcfi  same_value, 15
    2263                      .dwcfi  undefined, 16
    2264                      .dwcfi  undefined, 17
    2265                      .dwcfi  undefined, 18
    2266                      .dwcfi  undefined, 19
    2267                      .dwcfi  undefined, 20
    2268                      .dwcfi  undefined, 21
    2269                      .dwcfi  undefined, 22
    2270                      .dwcfi  undefined, 23
    2271                      .dwcfi  undefined, 24
    2272                      .dwcfi  undefined, 25
    2273                      .dwcfi  same_value, 26
    2274                      .dwcfi  same_value, 27
    2275                      .dwcfi  same_value, 28
    2276                      .dwcfi  same_value, 29
    2277                      .dwcfi  same_value, 30
    2278                      .dwcfi  same_value, 31
    2279                      .dwcfi  undefined, 32
    2280                      .dwcfi  undefined, 33
    2281                      .dwcfi  undefined, 34
    2282                      .dwcfi  undefined, 35
    2283                      .dwcfi  undefined, 36
    2284                      .dwcfi  undefined, 37
