TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:33 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

     907              $C$DW$T$72      .dwtag  DW_TAG_const_type
     908                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$69)
     909              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
     910                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$11)
     911                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
     912                      .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     913                      .dwattr $C$DW$T$73, DW_AT_decl_line(0x27)
     914                      .dwattr $C$DW$T$73, DW_AT_decl_column(0x1a)
     915              $C$DW$T$12      .dwtag  DW_TAG_base_type
     916                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     917                      .dwattr $C$DW$T$12, DW_AT_name("long")
     918                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     919              $C$DW$70        .dwtag  DW_TAG_TI_far_type
     920                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$12)
     921              $C$DW$T$74      .dwtag  DW_TAG_volatile_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE   20

     922                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$70)
     923              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
     924                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$12)
     925                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
     926                      .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     927                      .dwattr $C$DW$T$75, DW_AT_decl_line(0x11)
     928                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x1c)
     929              $C$DW$T$13      .dwtag  DW_TAG_base_type
     930                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     931                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     932                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     933              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     934                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$13)
     935                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     936                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     937                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x55)
     938                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x1c)
     939              $C$DW$71        .dwtag  DW_TAG_TI_far_type
     940                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$23)
     941              $C$DW$T$76      .dwtag  DW_TAG_const_type
     942                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$71)
     943              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     944                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$13)
     945                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     946                      .dwattr $C$DW$T$46, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     947                      .dwattr $C$DW$T$46, DW_AT_decl_line(0x21)
     948                      .dwattr $C$DW$T$46, DW_AT_decl_column(0x19)
     949              $C$DW$T$14      .dwtag  DW_TAG_base_type
     950                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     951                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     952                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     953                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     954                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     955              $C$DW$T$15      .dwtag  DW_TAG_base_type
     956                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     957                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     958                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     959                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     960                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     961              $C$DW$T$16      .dwtag  DW_TAG_base_type
     962                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     963                      .dwattr $C$DW$T$16, DW_AT_name("float")
     964                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     965              $C$DW$T$17      .dwtag  DW_TAG_base_type
     966                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     967                      .dwattr $C$DW$T$17, DW_AT_name("double")
     968                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     969              $C$DW$T$18      .dwtag  DW_TAG_base_type
     970                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     971                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     972                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     973              
     974              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     975                      .dwattr $C$DW$T$19, DW_AT_name("xMEMORY_REGION")
     976                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x06)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE   21

     977              $C$DW$72        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$3)
     979                      .dwattr $C$DW$72, DW_AT_name("pvBaseAddress")
     980                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_pvBaseAddress")
     981                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     983                      .dwattr $C$DW$72, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     984                      .dwattr $C$DW$72, DW_AT_decl_line(0x67)
     985                      .dwattr $C$DW$72, DW_AT_decl_column(0x08)
     986              $C$DW$73        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$13)
     988                      .dwattr $C$DW$73, DW_AT_name("ulLengthInBytes")
     989                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ulLengthInBytes")
     990                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     991                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     992                      .dwattr $C$DW$73, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     993                      .dwattr $C$DW$73, DW_AT_decl_line(0x68)
     994                      .dwattr $C$DW$73, DW_AT_decl_column(0x10)
     995              $C$DW$74        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$13)
     997                      .dwattr $C$DW$74, DW_AT_name("ulParameters")
     998                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ulParameters")
     999                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1000                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1001                      .dwattr $C$DW$74, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1002                      .dwattr $C$DW$74, DW_AT_decl_line(0x69)
    1003                      .dwattr $C$DW$74, DW_AT_decl_column(0x10)
    1004                      .dwendtag $C$DW$T$19
    1005              
    1006                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1007                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x65)
    1008                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    1009              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1010                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1012                      .dwattr $C$DW$T$43, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1013                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x6a)
    1014                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    1015              
    1016              $C$DW$T$44      .dwtag  DW_TAG_array_type
    1017                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1018                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1019                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
    1020              $C$DW$75        .dwtag  DW_TAG_subrange_type
    1021                      .dwattr $C$DW$75, DW_AT_upper_bound(0x00)
    1022                      .dwendtag $C$DW$T$44
    1023              
    1024              $C$DW$76        .dwtag  DW_TAG_TI_far_type
    1025                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$43)
    1026              $C$DW$T$59      .dwtag  DW_TAG_const_type
    1027                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$76)
    1028              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    1029                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    1030                      .dwattr $C$DW$T$60, DW_AT_address_class(0x17)
    1031              $C$DW$77        .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE   22

    1032                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$60)
    1033              $C$DW$T$61      .dwtag  DW_TAG_const_type
    1034                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$77)
    1035              
    1036              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1037                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1038              $C$DW$78        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$10)
    1040                      .dwattr $C$DW$78, DW_AT_name("quot")
    1041                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_quot")
    1042                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1044                      .dwattr $C$DW$78, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
    1045                      .dwattr $C$DW$78, DW_AT_decl_line(0x12)
    1046                      .dwattr $C$DW$78, DW_AT_decl_column(0x16)
    1047              $C$DW$79        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$10)
    1049                      .dwattr $C$DW$79, DW_AT_name("rem")
    1050                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rem")
    1051                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1052                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1053                      .dwattr $C$DW$79, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
    1054                      .dwattr $C$DW$79, DW_AT_decl_line(0x12)
    1055                      .dwattr $C$DW$79, DW_AT_decl_column(0x1c)
    1056                      .dwendtag $C$DW$T$20
    1057              
    1058                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1059                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x12)
    1060                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    1061              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    1062                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$20)
    1063                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1064                      .dwattr $C$DW$T$80, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1065                      .dwattr $C$DW$T$80, DW_AT_decl_line(0x12)
    1066                      .dwattr $C$DW$T$80, DW_AT_decl_column(0x23)
    1067              
    1068              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1069                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1070              $C$DW$80        .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$12)
    1072                      .dwattr $C$DW$80, DW_AT_name("quot")
    1073                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_quot")
    1074                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1076                      .dwattr $C$DW$80, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
    1077                      .dwattr $C$DW$80, DW_AT_decl_line(0x14)
    1078                      .dwattr $C$DW$80, DW_AT_decl_column(0x17)
    1079              $C$DW$81        .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$12)
    1081                      .dwattr $C$DW$81, DW_AT_name("rem")
    1082                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rem")
    1083                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1084                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1085                      .dwattr $C$DW$81, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
    1086                      .dwattr $C$DW$81, DW_AT_decl_line(0x14)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE   23

    1087                      .dwattr $C$DW$81, DW_AT_decl_column(0x1d)
    1088                      .dwendtag $C$DW$T$21
    1089              
    1090                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1091                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
    1092                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1093              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    1094                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$21)
    1095                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1096                      .dwattr $C$DW$T$81, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1097                      .dwattr $C$DW$T$81, DW_AT_decl_line(0x14)
    1098                      .dwattr $C$DW$T$81, DW_AT_decl_column(0x24)
    1099              
    1100              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1101                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    1102              $C$DW$82        .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$14)
    1104                      .dwattr $C$DW$82, DW_AT_name("quot")
    1105                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_quot")
    1106                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1108                      .dwattr $C$DW$82, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
    1109                      .dwattr $C$DW$82, DW_AT_decl_line(0x17)
    1110                      .dwattr $C$DW$82, DW_AT_decl_column(0x1c)
    1111              $C$DW$83        .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$14)
    1113                      .dwattr $C$DW$83, DW_AT_name("rem")
    1114                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rem")
    1115                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1116                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1117                      .dwattr $C$DW$83, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
    1118                      .dwattr $C$DW$83, DW_AT_decl_line(0x17)
    1119                      .dwattr $C$DW$83, DW_AT_decl_column(0x22)
    1120                      .dwendtag $C$DW$T$22
    1121              
    1122                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1123                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x17)
    1124                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    1125              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    1126                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$22)
    1127                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1128                      .dwattr $C$DW$T$82, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1129                      .dwattr $C$DW$T$82, DW_AT_decl_line(0x17)
    1130                      .dwattr $C$DW$T$82, DW_AT_decl_column(0x29)
    1131              
    1132              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1133                      .dwattr $C$DW$T$26, DW_AT_name("xLIST_ITEM")
    1134                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    1135              $C$DW$84        .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$23)
    1137                      .dwattr $C$DW$84, DW_AT_name("xItemValue")
    1138                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_xItemValue")
    1139                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1140                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1141                      .dwattr $C$DW$84, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE   24

    1142                      .dwattr $C$DW$84, DW_AT_decl_line(0x64)
    1143                      .dwattr $C$DW$84, DW_AT_decl_column(0x0f)
    1144              $C$DW$85        .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$25)
    1146                      .dwattr $C$DW$85, DW_AT_name("pxNext")
    1147                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_pxNext")
    1148                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1149                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1150                      .dwattr $C$DW$85, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1151                      .dwattr $C$DW$85, DW_AT_decl_line(0x65)
    1152                      .dwattr $C$DW$85, DW_AT_decl_column(0x1f)
    1153              $C$DW$86        .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$25)
    1155                      .dwattr $C$DW$86, DW_AT_name("pxPrevious")
    1156                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_pxPrevious")
    1157                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1158                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1159                      .dwattr $C$DW$86, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1160                      .dwattr $C$DW$86, DW_AT_decl_line(0x66)
    1161                      .dwattr $C$DW$86, DW_AT_decl_column(0x1f)
    1162              $C$DW$87        .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$3)
    1164                      .dwattr $C$DW$87, DW_AT_name("pvOwner")
    1165                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_pvOwner")
    1166                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1167                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1168                      .dwattr $C$DW$87, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1169                      .dwattr $C$DW$87, DW_AT_decl_line(0x67)
    1170                      .dwattr $C$DW$87, DW_AT_decl_column(0x09)
    1171              $C$DW$88        .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$3)
    1173                      .dwattr $C$DW$88, DW_AT_name("pvContainer")
    1174                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_pvContainer")
    1175                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1176                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1177                      .dwattr $C$DW$88, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1178                      .dwattr $C$DW$88, DW_AT_decl_line(0x68)
    1179                      .dwattr $C$DW$88, DW_AT_decl_column(0x09)
    1180                      .dwendtag $C$DW$T$26
    1181              
    1182                      .dwattr $C$DW$T$26, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1183                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x62)
    1184                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x08)
    1185              $C$DW$89        .dwtag  DW_TAG_TI_far_type
    1186                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$26)
    1187              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    1188                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$89)
    1189              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    1190                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1191                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
    1192              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1193                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1194                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1195                      .dwattr $C$DW$T$29, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1196                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x6a)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE   25

    1197                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x1b)
    1198              $C$DW$90        .dwtag  DW_TAG_TI_far_type
    1199                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$29)
    1200              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    1201                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$90)
    1202              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1203                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1204                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
    1205              
    1206              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1207                      .dwattr $C$DW$T$27, DW_AT_name("xMINI_LIST_ITEM")
    1208                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x06)
    1209              $C$DW$91        .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$23)
    1211                      .dwattr $C$DW$91, DW_AT_name("xItemValue")
    1212                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_xItemValue")
    1213                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1215                      .dwattr $C$DW$91, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1216                      .dwattr $C$DW$91, DW_AT_decl_line(0x6e)
    1217                      .dwattr $C$DW$91, DW_AT_decl_column(0x0f)
    1218              $C$DW$92        .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$25)
    1220                      .dwattr $C$DW$92, DW_AT_name("pxNext")
    1221                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_pxNext")
    1222                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1223                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1224                      .dwattr $C$DW$92, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1225                      .dwattr $C$DW$92, DW_AT_decl_line(0x6f)
    1226                      .dwattr $C$DW$92, DW_AT_decl_column(0x1e)
    1227              $C$DW$93        .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    1229                      .dwattr $C$DW$93, DW_AT_name("pxPrevious")
    1230                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_pxPrevious")
    1231                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1232                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1233                      .dwattr $C$DW$93, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1234                      .dwattr $C$DW$93, DW_AT_decl_line(0x70)
    1235                      .dwattr $C$DW$93, DW_AT_decl_column(0x1e)
    1236                      .dwendtag $C$DW$T$27
    1237              
    1238                      .dwattr $C$DW$T$27, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1239                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x6c)
    1240                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x08)
    1241              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1242                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
    1243                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1244                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1245                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x72)
    1246                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x20)
    1247              $C$DW$94        .dwtag  DW_TAG_TI_far_type
    1248                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$32)
    1249              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    1250                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$94)
    1251              
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE   26

    1252              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1253                      .dwattr $C$DW$T$34, DW_AT_name("xLIST")
    1254                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    1255              $C$DW$95        .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$28)
    1257                      .dwattr $C$DW$95, DW_AT_name("uxNumberOfItems")
    1258                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1259                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1261                      .dwattr $C$DW$95, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1262                      .dwattr $C$DW$95, DW_AT_decl_line(0x79)
    1263                      .dwattr $C$DW$95, DW_AT_decl_column(0x22)
    1264              $C$DW$96        .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$31)
    1266                      .dwattr $C$DW$96, DW_AT_name("pxIndex")
    1267                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_pxIndex")
    1268                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1269                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1270                      .dwattr $C$DW$96, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1271                      .dwattr $C$DW$96, DW_AT_decl_line(0x7a)
    1272                      .dwattr $C$DW$96, DW_AT_decl_column(0x17)
    1273              $C$DW$97        .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$33)
    1275                      .dwattr $C$DW$97, DW_AT_name("xListEnd")
    1276                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_xListEnd")
    1277                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1278                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1279                      .dwattr $C$DW$97, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1280                      .dwattr $C$DW$97, DW_AT_decl_line(0x7b)
    1281                      .dwattr $C$DW$97, DW_AT_decl_column(0x19)
    1282                      .dwendtag $C$DW$T$34
    1283              
    1284                      .dwattr $C$DW$T$34, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1285                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x77)
    1286                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    1287              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1288                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$34)
    1289                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1290                      .dwattr $C$DW$T$83, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1291                      .dwattr $C$DW$T$83, DW_AT_decl_line(0x7c)
    1292                      .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    1293              
    1294              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1295                      .dwattr $C$DW$T$35, DW_AT_name("xTIME_OUT")
    1296                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1297              $C$DW$98        .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$10)
    1299                      .dwattr $C$DW$98, DW_AT_name("xOverflowCount")
    1300                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_xOverflowCount")
    1301                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1302                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1303                      .dwattr $C$DW$98, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1304                      .dwattr $C$DW$98, DW_AT_decl_line(0x5e)
    1305                      .dwattr $C$DW$98, DW_AT_decl_column(0x10)
    1306              $C$DW$99        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE   27

    1307                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$23)
    1308                      .dwattr $C$DW$99, DW_AT_name("xTimeOnEntering")
    1309                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_xTimeOnEntering")
    1310                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1311                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1312                      .dwattr $C$DW$99, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1313                      .dwattr $C$DW$99, DW_AT_decl_line(0x5f)
    1314                      .dwattr $C$DW$99, DW_AT_decl_column(0x10)
    1315                      .dwendtag $C$DW$T$35
    1316              
    1317                      .dwattr $C$DW$T$35, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1318                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x5c)
    1319                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1320              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1321                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$35)
    1322                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1323                      .dwattr $C$DW$T$84, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1324                      .dwattr $C$DW$T$84, DW_AT_decl_line(0x60)
    1325                      .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    1326              
    1327              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1328                      .dwattr $C$DW$T$45, DW_AT_name("xTASK_PARAMTERS")
    1329                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x12)
    1330              $C$DW$100       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$38)
    1332                      .dwattr $C$DW$100, DW_AT_name("pvTaskCode")
    1333                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_pvTaskCode")
    1334                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1336                      .dwattr $C$DW$100, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1337                      .dwattr $C$DW$100, DW_AT_decl_line(0x71)
    1338                      .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1339              $C$DW$101       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$41)
    1341                      .dwattr $C$DW$101, DW_AT_name("pcName")
    1342                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_pcName")
    1343                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1344                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1345                      .dwattr $C$DW$101, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1346                      .dwattr $C$DW$101, DW_AT_decl_line(0x72)
    1347                      .dwattr $C$DW$101, DW_AT_decl_column(0x1c)
    1348              $C$DW$102       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$9)
    1350                      .dwattr $C$DW$102, DW_AT_name("usStackDepth")
    1351                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_usStackDepth")
    1352                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1353                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1354                      .dwattr $C$DW$102, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1355                      .dwattr $C$DW$102, DW_AT_decl_line(0x73)
    1356                      .dwattr $C$DW$102, DW_AT_decl_column(0x11)
    1357              $C$DW$103       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$3)
    1359                      .dwattr $C$DW$103, DW_AT_name("pvParameters")
    1360                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_pvParameters")
    1361                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE   28

    1362                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1363                      .dwattr $C$DW$103, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1364                      .dwattr $C$DW$103, DW_AT_decl_line(0x74)
    1365                      .dwattr $C$DW$103, DW_AT_decl_column(0x08)
    1366              $C$DW$104       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1368                      .dwattr $C$DW$104, DW_AT_name("uxPriority")
    1369                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_uxPriority")
    1370                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1371                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1372                      .dwattr $C$DW$104, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1373                      .dwattr $C$DW$104, DW_AT_decl_line(0x75)
    1374                      .dwattr $C$DW$104, DW_AT_decl_column(0x19)
    1375              $C$DW$105       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$42)
    1377                      .dwattr $C$DW$105, DW_AT_name("puxStackBuffer")
    1378                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_puxStackBuffer")
    1379                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1380                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1381                      .dwattr $C$DW$105, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1382                      .dwattr $C$DW$105, DW_AT_decl_line(0x76)
    1383                      .dwattr $C$DW$105, DW_AT_decl_column(0x12)
    1384              $C$DW$106       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$44)
    1386                      .dwattr $C$DW$106, DW_AT_name("xRegions")
    1387                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_xRegions")
    1388                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1389                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1390                      .dwattr $C$DW$106, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1391                      .dwattr $C$DW$106, DW_AT_decl_line(0x77)
    1392                      .dwattr $C$DW$106, DW_AT_decl_column(0x10)
    1393                      .dwendtag $C$DW$T$45
    1394              
    1395                      .dwattr $C$DW$T$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1396                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x6f)
    1397                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    1398              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1399                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$45)
    1400                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1401                      .dwattr $C$DW$T$85, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1402                      .dwattr $C$DW$T$85, DW_AT_decl_line(0x78)
    1403                      .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1404                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1405              
    1406              ;***************************************************************
    1407              ;* DWARF CIE ENTRIES                                           *
    1408              ;***************************************************************
    1409              
    1410              $C$DW$CIE       .dwcie 91
    1411                      .dwcfi  cfa_register, 36
    1412                      .dwcfi  cfa_offset, 0
    1413                      .dwcfi  undefined, 0
    1414                      .dwcfi  undefined, 1
    1415                      .dwcfi  undefined, 2
    1416                      .dwcfi  undefined, 3
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
death.asm                                                            PAGE   29

    1417                      .dwcfi  undefined, 4
    1418                      .dwcfi  undefined, 5
    1419                      .dwcfi  undefined, 6
    1420                      .dwcfi  undefined, 7
    1421                      .dwcfi  undefined, 8
    1422                      .dwcfi  undefined, 9
    1423                      .dwcfi  undefined, 10
    1424                      .dwcfi  undefined, 11
    1425                      .dwcfi  undefined, 12
    1426                      .dwcfi  undefined, 13
    1427                      .dwcfi  same_value, 14
    1428                      .dwcfi  same_value, 15
    1429                      .dwcfi  undefined, 16
    1430                      .dwcfi  undefined, 17
    1431                      .dwcfi  undefined, 18
    1432                      .dwcfi  undefined, 19
    1433                      .dwcfi  undefined, 20
    1434                      .dwcfi  undefined, 21
    1435                      .dwcfi  undefined, 22
    1436                      .dwcfi  undefined, 23
    1437                      .dwcfi  undefined, 24
    1438                      .dwcfi  undefined, 25
    1439                      .dwcfi  same_value, 26
    1440                      .dwcfi  same_value, 27
    1441                      .dwcfi  same_value, 28
    1442                      .dwcfi  same_value, 29
    1443                      .dwcfi  same_value, 30
    1444                      .dwcfi  same_value, 31
    1445                      .dwcfi  undefined, 32
    1446                      .dwcfi  undefined, 33
    1447                      .dwcfi  undefined, 34
    1448                      .dwcfi  undefined, 35
    1449                      .dwcfi  undefined, 36
    1450                      .dwcfi  undefined, 37
