TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:34 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

     561                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     562              $C$DW$T$28      .dwtag  DW_TAG_volatile_type
     563                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$44)
     564              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
     565                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$11)
     566                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
     567              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
     568                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$11)
     569                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     570                      .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     571                      .dwattr $C$DW$T$68, DW_AT_decl_line(0x27)
     572                      .dwattr $C$DW$T$68, DW_AT_decl_column(0x1a)
     573              $C$DW$T$12      .dwtag  DW_TAG_base_type
     574                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     575                      .dwattr $C$DW$T$12, DW_AT_name("long")
     576                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     577              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
     578                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$12)
     579                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     580                      .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     581                      .dwattr $C$DW$T$69, DW_AT_decl_line(0x11)
     582                      .dwattr $C$DW$T$69, DW_AT_decl_column(0x1c)
     583              $C$DW$T$13      .dwtag  DW_TAG_base_type
     584                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     585                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     586                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     587              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     588                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$13)
     589                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     590                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     591                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x55)
     592                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x1c)
     593              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
     594                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$23)
     595                      .dwattr $C$DW$T$50, DW_AT_address_class(0x17)
     596              $C$DW$45        .dwtag  DW_TAG_TI_far_type
     597                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$50)
     598              $C$DW$T$51      .dwtag  DW_TAG_const_type
     599                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$45)
     600              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     601                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$13)
     602                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     603                      .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     604                      .dwattr $C$DW$T$71, DW_AT_decl_line(0x21)
     605                      .dwattr $C$DW$T$71, DW_AT_decl_column(0x19)
     606              $C$DW$T$14      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE   13

     607                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     608                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     609                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     610                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     611                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     612              $C$DW$T$15      .dwtag  DW_TAG_base_type
     613                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     614                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     615                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     616                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     617                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     618              $C$DW$T$16      .dwtag  DW_TAG_base_type
     619                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     620                      .dwattr $C$DW$T$16, DW_AT_name("float")
     621                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     622              $C$DW$T$17      .dwtag  DW_TAG_base_type
     623                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     624                      .dwattr $C$DW$T$17, DW_AT_name("double")
     625                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     626              $C$DW$T$18      .dwtag  DW_TAG_base_type
     627                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     628                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     629                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     630              
     631              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     632                      .dwattr $C$DW$T$19, DW_AT_name("xMEMORY_REGION")
     633                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x06)
     634              $C$DW$46        .dwtag  DW_TAG_member
     635                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$3)
     636                      .dwattr $C$DW$46, DW_AT_name("pvBaseAddress")
     637                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_pvBaseAddress")
     638                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     640                      .dwattr $C$DW$46, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     641                      .dwattr $C$DW$46, DW_AT_decl_line(0x67)
     642                      .dwattr $C$DW$46, DW_AT_decl_column(0x08)
     643              $C$DW$47        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$13)
     645                      .dwattr $C$DW$47, DW_AT_name("ulLengthInBytes")
     646                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_ulLengthInBytes")
     647                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     648                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     649                      .dwattr $C$DW$47, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     650                      .dwattr $C$DW$47, DW_AT_decl_line(0x68)
     651                      .dwattr $C$DW$47, DW_AT_decl_column(0x10)
     652              $C$DW$48        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$13)
     654                      .dwattr $C$DW$48, DW_AT_name("ulParameters")
     655                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_ulParameters")
     656                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     657                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     658                      .dwattr $C$DW$48, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     659                      .dwattr $C$DW$48, DW_AT_decl_line(0x69)
     660                      .dwattr $C$DW$48, DW_AT_decl_column(0x10)
     661                      .dwendtag $C$DW$T$19
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE   14

     662              
     663                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     664                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x65)
     665                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
     666              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
     667                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$19)
     668                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     669                      .dwattr $C$DW$T$43, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     670                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x6a)
     671                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
     672              
     673              $C$DW$T$44      .dwtag  DW_TAG_array_type
     674                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
     675                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     676                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
     677              $C$DW$49        .dwtag  DW_TAG_subrange_type
     678                      .dwattr $C$DW$49, DW_AT_upper_bound(0x00)
     679                      .dwendtag $C$DW$T$44
     680              
     681              $C$DW$50        .dwtag  DW_TAG_TI_far_type
     682                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$43)
     683              $C$DW$T$57      .dwtag  DW_TAG_const_type
     684                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$50)
     685              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
     686                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
     687                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
     688              $C$DW$51        .dwtag  DW_TAG_TI_far_type
     689                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$58)
     690              $C$DW$T$59      .dwtag  DW_TAG_const_type
     691                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$51)
     692              
     693              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     694                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     695              $C$DW$52        .dwtag  DW_TAG_member
     696                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$10)
     697                      .dwattr $C$DW$52, DW_AT_name("quot")
     698                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_quot")
     699                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     700                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     701                      .dwattr $C$DW$52, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     702                      .dwattr $C$DW$52, DW_AT_decl_line(0x12)
     703                      .dwattr $C$DW$52, DW_AT_decl_column(0x16)
     704              $C$DW$53        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$10)
     706                      .dwattr $C$DW$53, DW_AT_name("rem")
     707                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rem")
     708                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     709                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     710                      .dwattr $C$DW$53, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     711                      .dwattr $C$DW$53, DW_AT_decl_line(0x12)
     712                      .dwattr $C$DW$53, DW_AT_decl_column(0x1c)
     713                      .dwendtag $C$DW$T$20
     714              
     715                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     716                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x12)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE   15

     717                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     718              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
     719                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$20)
     720                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
     721                      .dwattr $C$DW$T$77, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     722                      .dwattr $C$DW$T$77, DW_AT_decl_line(0x12)
     723                      .dwattr $C$DW$T$77, DW_AT_decl_column(0x23)
     724              
     725              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     726                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     727              $C$DW$54        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$12)
     729                      .dwattr $C$DW$54, DW_AT_name("quot")
     730                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_quot")
     731                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     733                      .dwattr $C$DW$54, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     734                      .dwattr $C$DW$54, DW_AT_decl_line(0x14)
     735                      .dwattr $C$DW$54, DW_AT_decl_column(0x17)
     736              $C$DW$55        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$12)
     738                      .dwattr $C$DW$55, DW_AT_name("rem")
     739                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rem")
     740                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     741                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     742                      .dwattr $C$DW$55, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     743                      .dwattr $C$DW$55, DW_AT_decl_line(0x14)
     744                      .dwattr $C$DW$55, DW_AT_decl_column(0x1d)
     745                      .dwendtag $C$DW$T$21
     746              
     747                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     748                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
     749                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     750              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
     751                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$21)
     752                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
     753                      .dwattr $C$DW$T$78, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     754                      .dwattr $C$DW$T$78, DW_AT_decl_line(0x14)
     755                      .dwattr $C$DW$T$78, DW_AT_decl_column(0x24)
     756              
     757              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     758                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
     759              $C$DW$56        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$14)
     761                      .dwattr $C$DW$56, DW_AT_name("quot")
     762                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_quot")
     763                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     765                      .dwattr $C$DW$56, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     766                      .dwattr $C$DW$56, DW_AT_decl_line(0x17)
     767                      .dwattr $C$DW$56, DW_AT_decl_column(0x1c)
     768              $C$DW$57        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$14)
     770                      .dwattr $C$DW$57, DW_AT_name("rem")
     771                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rem")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE   16

     772                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     773                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     774                      .dwattr $C$DW$57, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     775                      .dwattr $C$DW$57, DW_AT_decl_line(0x17)
     776                      .dwattr $C$DW$57, DW_AT_decl_column(0x22)
     777                      .dwendtag $C$DW$T$22
     778              
     779                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     780                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x17)
     781                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
     782              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
     783                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$22)
     784                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
     785                      .dwattr $C$DW$T$79, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     786                      .dwattr $C$DW$T$79, DW_AT_decl_line(0x17)
     787                      .dwattr $C$DW$T$79, DW_AT_decl_column(0x29)
     788              
     789              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     790                      .dwattr $C$DW$T$26, DW_AT_name("xLIST_ITEM")
     791                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
     792              $C$DW$58        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$23)
     794                      .dwattr $C$DW$58, DW_AT_name("xItemValue")
     795                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_xItemValue")
     796                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     797                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     798                      .dwattr $C$DW$58, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     799                      .dwattr $C$DW$58, DW_AT_decl_line(0x64)
     800                      .dwattr $C$DW$58, DW_AT_decl_column(0x0f)
     801              $C$DW$59        .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$25)
     803                      .dwattr $C$DW$59, DW_AT_name("pxNext")
     804                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_pxNext")
     805                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     806                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     807                      .dwattr $C$DW$59, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     808                      .dwattr $C$DW$59, DW_AT_decl_line(0x65)
     809                      .dwattr $C$DW$59, DW_AT_decl_column(0x1f)
     810              $C$DW$60        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$25)
     812                      .dwattr $C$DW$60, DW_AT_name("pxPrevious")
     813                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_pxPrevious")
     814                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     815                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     816                      .dwattr $C$DW$60, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     817                      .dwattr $C$DW$60, DW_AT_decl_line(0x66)
     818                      .dwattr $C$DW$60, DW_AT_decl_column(0x1f)
     819              $C$DW$61        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$3)
     821                      .dwattr $C$DW$61, DW_AT_name("pvOwner")
     822                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_pvOwner")
     823                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     824                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     825                      .dwattr $C$DW$61, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     826                      .dwattr $C$DW$61, DW_AT_decl_line(0x67)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE   17

     827                      .dwattr $C$DW$61, DW_AT_decl_column(0x09)
     828              $C$DW$62        .dwtag  DW_TAG_member
     829                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$3)
     830                      .dwattr $C$DW$62, DW_AT_name("pvContainer")
     831                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_pvContainer")
     832                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     833                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     834                      .dwattr $C$DW$62, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     835                      .dwattr $C$DW$62, DW_AT_decl_line(0x68)
     836                      .dwattr $C$DW$62, DW_AT_decl_column(0x09)
     837                      .dwendtag $C$DW$T$26
     838              
     839                      .dwattr $C$DW$T$26, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     840                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x62)
     841                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x08)
     842              $C$DW$63        .dwtag  DW_TAG_TI_far_type
     843                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$26)
     844              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
     845                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$63)
     846              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
     847                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     848                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
     849              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     850                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
     851                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     852                      .dwattr $C$DW$T$29, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     853                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x6a)
     854                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x1b)
     855              $C$DW$64        .dwtag  DW_TAG_TI_far_type
     856                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$29)
     857              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
     858                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$64)
     859              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
     860                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     861                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
     862              
     863              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     864                      .dwattr $C$DW$T$27, DW_AT_name("xMINI_LIST_ITEM")
     865                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x06)
     866              $C$DW$65        .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$23)
     868                      .dwattr $C$DW$65, DW_AT_name("xItemValue")
     869                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_xItemValue")
     870                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     871                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     872                      .dwattr $C$DW$65, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     873                      .dwattr $C$DW$65, DW_AT_decl_line(0x6e)
     874                      .dwattr $C$DW$65, DW_AT_decl_column(0x0f)
     875              $C$DW$66        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$25)
     877                      .dwattr $C$DW$66, DW_AT_name("pxNext")
     878                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_pxNext")
     879                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     880                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     881                      .dwattr $C$DW$66, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE   18

     882                      .dwattr $C$DW$66, DW_AT_decl_line(0x6f)
     883                      .dwattr $C$DW$66, DW_AT_decl_column(0x1e)
     884              $C$DW$67        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$25)
     886                      .dwattr $C$DW$67, DW_AT_name("pxPrevious")
     887                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_pxPrevious")
     888                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     889                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     890                      .dwattr $C$DW$67, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     891                      .dwattr $C$DW$67, DW_AT_decl_line(0x70)
     892                      .dwattr $C$DW$67, DW_AT_decl_column(0x1e)
     893                      .dwendtag $C$DW$T$27
     894              
     895                      .dwattr $C$DW$T$27, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     896                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x6c)
     897                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x08)
     898              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
     899                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
     900                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     901                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     902                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x72)
     903                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x20)
     904              $C$DW$68        .dwtag  DW_TAG_TI_far_type
     905                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$32)
     906              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
     907                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$68)
     908              
     909              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     910                      .dwattr $C$DW$T$34, DW_AT_name("xLIST")
     911                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
     912              $C$DW$69        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$28)
     914                      .dwattr $C$DW$69, DW_AT_name("uxNumberOfItems")
     915                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_uxNumberOfItems")
     916                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     917                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     918                      .dwattr $C$DW$69, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     919                      .dwattr $C$DW$69, DW_AT_decl_line(0x79)
     920                      .dwattr $C$DW$69, DW_AT_decl_column(0x22)
     921              $C$DW$70        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$31)
     923                      .dwattr $C$DW$70, DW_AT_name("pxIndex")
     924                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_pxIndex")
     925                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     926                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     927                      .dwattr $C$DW$70, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     928                      .dwattr $C$DW$70, DW_AT_decl_line(0x7a)
     929                      .dwattr $C$DW$70, DW_AT_decl_column(0x17)
     930              $C$DW$71        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$33)
     932                      .dwattr $C$DW$71, DW_AT_name("xListEnd")
     933                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_xListEnd")
     934                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     935                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     936                      .dwattr $C$DW$71, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE   19

     937                      .dwattr $C$DW$71, DW_AT_decl_line(0x7b)
     938                      .dwattr $C$DW$71, DW_AT_decl_column(0x19)
     939                      .dwendtag $C$DW$T$34
     940              
     941                      .dwattr $C$DW$T$34, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     942                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x77)
     943                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
     944              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
     945                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
     946                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     947                      .dwattr $C$DW$T$80, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     948                      .dwattr $C$DW$T$80, DW_AT_decl_line(0x7c)
     949                      .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
     950              
     951              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     952                      .dwattr $C$DW$T$35, DW_AT_name("xTIME_OUT")
     953                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
     954              $C$DW$72        .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$10)
     956                      .dwattr $C$DW$72, DW_AT_name("xOverflowCount")
     957                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_xOverflowCount")
     958                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     959                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     960                      .dwattr $C$DW$72, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     961                      .dwattr $C$DW$72, DW_AT_decl_line(0x5e)
     962                      .dwattr $C$DW$72, DW_AT_decl_column(0x10)
     963              $C$DW$73        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$23)
     965                      .dwattr $C$DW$73, DW_AT_name("xTimeOnEntering")
     966                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_xTimeOnEntering")
     967                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     968                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     969                      .dwattr $C$DW$73, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     970                      .dwattr $C$DW$73, DW_AT_decl_line(0x5f)
     971                      .dwattr $C$DW$73, DW_AT_decl_column(0x10)
     972                      .dwendtag $C$DW$T$35
     973              
     974                      .dwattr $C$DW$T$35, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     975                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x5c)
     976                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
     977              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
     978                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
     979                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
     980                      .dwattr $C$DW$T$81, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     981                      .dwattr $C$DW$T$81, DW_AT_decl_line(0x60)
     982                      .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
     983              
     984              $C$DW$T$45      .dwtag  DW_TAG_structure_type
     985                      .dwattr $C$DW$T$45, DW_AT_name("xTASK_PARAMTERS")
     986                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x12)
     987              $C$DW$74        .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$38)
     989                      .dwattr $C$DW$74, DW_AT_name("pvTaskCode")
     990                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_pvTaskCode")
     991                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE   20

     992                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     993                      .dwattr $C$DW$74, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     994                      .dwattr $C$DW$74, DW_AT_decl_line(0x71)
     995                      .dwattr $C$DW$74, DW_AT_decl_column(0x0e)
     996              $C$DW$75        .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$41)
     998                      .dwattr $C$DW$75, DW_AT_name("pcName")
     999                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_pcName")
    1000                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1001                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1002                      .dwattr $C$DW$75, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1003                      .dwattr $C$DW$75, DW_AT_decl_line(0x72)
    1004                      .dwattr $C$DW$75, DW_AT_decl_column(0x1c)
    1005              $C$DW$76        .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$9)
    1007                      .dwattr $C$DW$76, DW_AT_name("usStackDepth")
    1008                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_usStackDepth")
    1009                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1010                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1011                      .dwattr $C$DW$76, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1012                      .dwattr $C$DW$76, DW_AT_decl_line(0x73)
    1013                      .dwattr $C$DW$76, DW_AT_decl_column(0x11)
    1014              $C$DW$77        .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$3)
    1016                      .dwattr $C$DW$77, DW_AT_name("pvParameters")
    1017                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_pvParameters")
    1018                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1019                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1020                      .dwattr $C$DW$77, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1021                      .dwattr $C$DW$77, DW_AT_decl_line(0x74)
    1022                      .dwattr $C$DW$77, DW_AT_decl_column(0x08)
    1023              $C$DW$78        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1025                      .dwattr $C$DW$78, DW_AT_name("uxPriority")
    1026                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_uxPriority")
    1027                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1028                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1029                      .dwattr $C$DW$78, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1030                      .dwattr $C$DW$78, DW_AT_decl_line(0x75)
    1031                      .dwattr $C$DW$78, DW_AT_decl_column(0x19)
    1032              $C$DW$79        .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$42)
    1034                      .dwattr $C$DW$79, DW_AT_name("puxStackBuffer")
    1035                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_puxStackBuffer")
    1036                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1037                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1038                      .dwattr $C$DW$79, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1039                      .dwattr $C$DW$79, DW_AT_decl_line(0x76)
    1040                      .dwattr $C$DW$79, DW_AT_decl_column(0x12)
    1041              $C$DW$80        .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$44)
    1043                      .dwattr $C$DW$80, DW_AT_name("xRegions")
    1044                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_xRegions")
    1045                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1046                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE   21

    1047                      .dwattr $C$DW$80, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1048                      .dwattr $C$DW$80, DW_AT_decl_line(0x77)
    1049                      .dwattr $C$DW$80, DW_AT_decl_column(0x10)
    1050                      .dwendtag $C$DW$T$45
    1051              
    1052                      .dwattr $C$DW$T$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1053                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x6f)
    1054                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    1055              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1056                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$45)
    1057                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1058                      .dwattr $C$DW$T$82, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1059                      .dwattr $C$DW$T$82, DW_AT_decl_line(0x78)
    1060                      .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    1061                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1062              
    1063              ;***************************************************************
    1064              ;* DWARF CIE ENTRIES                                           *
    1065              ;***************************************************************
    1066              
    1067              $C$DW$CIE       .dwcie 91
    1068                      .dwcfi  cfa_register, 36
    1069                      .dwcfi  cfa_offset, 0
    1070                      .dwcfi  undefined, 0
    1071                      .dwcfi  undefined, 1
    1072                      .dwcfi  undefined, 2
    1073                      .dwcfi  undefined, 3
    1074                      .dwcfi  undefined, 4
    1075                      .dwcfi  undefined, 5
    1076                      .dwcfi  undefined, 6
    1077                      .dwcfi  undefined, 7
    1078                      .dwcfi  undefined, 8
    1079                      .dwcfi  undefined, 9
    1080                      .dwcfi  undefined, 10
    1081                      .dwcfi  undefined, 11
    1082                      .dwcfi  undefined, 12
    1083                      .dwcfi  undefined, 13
    1084                      .dwcfi  same_value, 14
    1085                      .dwcfi  same_value, 15
    1086                      .dwcfi  undefined, 16
    1087                      .dwcfi  undefined, 17
    1088                      .dwcfi  undefined, 18
    1089                      .dwcfi  undefined, 19
    1090                      .dwcfi  undefined, 20
    1091                      .dwcfi  undefined, 21
    1092                      .dwcfi  undefined, 22
    1093                      .dwcfi  undefined, 23
    1094                      .dwcfi  undefined, 24
    1095                      .dwcfi  undefined, 25
    1096                      .dwcfi  same_value, 26
    1097                      .dwcfi  same_value, 27
    1098                      .dwcfi  same_value, 28
    1099                      .dwcfi  same_value, 29
    1100                      .dwcfi  same_value, 30
    1101                      .dwcfi  same_value, 31
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flash.asm                                                            PAGE   22

    1102                      .dwcfi  undefined, 32
    1103                      .dwcfi  undefined, 33
