TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:34 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

    1839                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    1840              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1841                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$11)
    1842                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1843                      .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1844                      .dwattr $C$DW$T$71, DW_AT_decl_line(0x27)
    1845                      .dwattr $C$DW$T$71, DW_AT_decl_column(0x1a)
    1846              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1847                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1848                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1849                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1850              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    1851                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$12)
    1852                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1853                      .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1854                      .dwattr $C$DW$T$73, DW_AT_decl_line(0x11)
    1855                      .dwattr $C$DW$T$73, DW_AT_decl_column(0x1c)
    1856              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1857                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1858                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1859                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1860              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1861                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$13)
    1862                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1863                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1864                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x55)
    1865                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x1c)
    1866              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1867                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$13)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE   42

    1868                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1869                      .dwattr $C$DW$T$46, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1870                      .dwattr $C$DW$T$46, DW_AT_decl_line(0x21)
    1871                      .dwattr $C$DW$T$46, DW_AT_decl_column(0x19)
    1872              $C$DW$148       .dwtag  DW_TAG_TI_far_type
    1873                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$46)
    1874              $C$DW$T$74      .dwtag  DW_TAG_const_type
    1875                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$148)
    1876              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1877                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1878                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1879                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1880                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1881                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1882              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1883                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1884                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1885                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1886                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1887                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1888              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1889                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1890                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1891                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1892              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1893                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1894                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1895                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1896              $C$DW$149       .dwtag  DW_TAG_TI_far_type
    1897                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$17)
    1898              $C$DW$T$79      .dwtag  DW_TAG_volatile_type
    1899                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$149)
    1900              $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    1901                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    1902                      .dwattr $C$DW$T$80, DW_AT_address_class(0x17)
    1903              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1904                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1905                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1906                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1907              
    1908              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1909                      .dwattr $C$DW$T$19, DW_AT_name("xMEMORY_REGION")
    1910                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x06)
    1911              $C$DW$150       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$3)
    1913                      .dwattr $C$DW$150, DW_AT_name("pvBaseAddress")
    1914                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_pvBaseAddress")
    1915                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1917                      .dwattr $C$DW$150, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1918                      .dwattr $C$DW$150, DW_AT_decl_line(0x67)
    1919                      .dwattr $C$DW$150, DW_AT_decl_column(0x08)
    1920              $C$DW$151       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$13)
    1922                      .dwattr $C$DW$151, DW_AT_name("ulLengthInBytes")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE   43

    1923                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ulLengthInBytes")
    1924                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1925                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1926                      .dwattr $C$DW$151, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1927                      .dwattr $C$DW$151, DW_AT_decl_line(0x68)
    1928                      .dwattr $C$DW$151, DW_AT_decl_column(0x10)
    1929              $C$DW$152       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$13)
    1931                      .dwattr $C$DW$152, DW_AT_name("ulParameters")
    1932                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ulParameters")
    1933                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1934                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1935                      .dwattr $C$DW$152, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1936                      .dwattr $C$DW$152, DW_AT_decl_line(0x69)
    1937                      .dwattr $C$DW$152, DW_AT_decl_column(0x10)
    1938                      .dwendtag $C$DW$T$19
    1939              
    1940                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1941                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x65)
    1942                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    1943              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1944                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$19)
    1945                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1946                      .dwattr $C$DW$T$43, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1947                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x6a)
    1948                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    1949              
    1950              $C$DW$T$44      .dwtag  DW_TAG_array_type
    1951                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1952                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1953                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
    1954              $C$DW$153       .dwtag  DW_TAG_subrange_type
    1955                      .dwattr $C$DW$153, DW_AT_upper_bound(0x00)
    1956                      .dwendtag $C$DW$T$44
    1957              
    1958              $C$DW$154       .dwtag  DW_TAG_TI_far_type
    1959                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$43)
    1960              $C$DW$T$58      .dwtag  DW_TAG_const_type
    1961                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$154)
    1962              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    1963                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1964                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
    1965              $C$DW$155       .dwtag  DW_TAG_TI_far_type
    1966                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$59)
    1967              $C$DW$T$60      .dwtag  DW_TAG_const_type
    1968                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$155)
    1969              
    1970              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1971                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1972              $C$DW$156       .dwtag  DW_TAG_member
    1973                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$10)
    1974                      .dwattr $C$DW$156, DW_AT_name("quot")
    1975                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_quot")
    1976                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE   44

    1978                      .dwattr $C$DW$156, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1979                      .dwattr $C$DW$156, DW_AT_decl_line(0x12)
    1980                      .dwattr $C$DW$156, DW_AT_decl_column(0x16)
    1981              $C$DW$157       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$10)
    1983                      .dwattr $C$DW$157, DW_AT_name("rem")
    1984                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rem")
    1985                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1986                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1987                      .dwattr $C$DW$157, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1988                      .dwattr $C$DW$157, DW_AT_decl_line(0x12)
    1989                      .dwattr $C$DW$157, DW_AT_decl_column(0x1c)
    1990                      .dwendtag $C$DW$T$20
    1991              
    1992                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1993                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x12)
    1994                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    1995              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    1996                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$20)
    1997                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1998                      .dwattr $C$DW$T$83, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1999                      .dwattr $C$DW$T$83, DW_AT_decl_line(0x12)
    2000                      .dwattr $C$DW$T$83, DW_AT_decl_column(0x23)
    2001              
    2002              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2003                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    2004              $C$DW$158       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$12)
    2006                      .dwattr $C$DW$158, DW_AT_name("quot")
    2007                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_quot")
    2008                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2009                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2010                      .dwattr $C$DW$158, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2011                      .dwattr $C$DW$158, DW_AT_decl_line(0x14)
    2012                      .dwattr $C$DW$158, DW_AT_decl_column(0x17)
    2013              $C$DW$159       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$12)
    2015                      .dwattr $C$DW$159, DW_AT_name("rem")
    2016                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rem")
    2017                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2018                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2019                      .dwattr $C$DW$159, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2020                      .dwattr $C$DW$159, DW_AT_decl_line(0x14)
    2021                      .dwattr $C$DW$159, DW_AT_decl_column(0x1d)
    2022                      .dwendtag $C$DW$T$21
    2023              
    2024                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2025                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
    2026                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2027              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    2028                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$21)
    2029                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2030                      .dwattr $C$DW$T$84, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2031                      .dwattr $C$DW$T$84, DW_AT_decl_line(0x14)
    2032                      .dwattr $C$DW$T$84, DW_AT_decl_column(0x24)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE   45

    2033              
    2034              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2035                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    2036              $C$DW$160       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$14)
    2038                      .dwattr $C$DW$160, DW_AT_name("quot")
    2039                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_quot")
    2040                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2041                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2042                      .dwattr $C$DW$160, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2043                      .dwattr $C$DW$160, DW_AT_decl_line(0x17)
    2044                      .dwattr $C$DW$160, DW_AT_decl_column(0x1c)
    2045              $C$DW$161       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$14)
    2047                      .dwattr $C$DW$161, DW_AT_name("rem")
    2048                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rem")
    2049                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2050                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2051                      .dwattr $C$DW$161, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2052                      .dwattr $C$DW$161, DW_AT_decl_line(0x17)
    2053                      .dwattr $C$DW$161, DW_AT_decl_column(0x22)
    2054                      .dwendtag $C$DW$T$22
    2055              
    2056                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2057                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x17)
    2058                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2059              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    2060                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$22)
    2061                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2062                      .dwattr $C$DW$T$85, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2063                      .dwattr $C$DW$T$85, DW_AT_decl_line(0x17)
    2064                      .dwattr $C$DW$T$85, DW_AT_decl_column(0x29)
    2065              
    2066              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2067                      .dwattr $C$DW$T$26, DW_AT_name("xLIST_ITEM")
    2068                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    2069              $C$DW$162       .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$23)
    2071                      .dwattr $C$DW$162, DW_AT_name("xItemValue")
    2072                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_xItemValue")
    2073                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2074                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2075                      .dwattr $C$DW$162, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2076                      .dwattr $C$DW$162, DW_AT_decl_line(0x64)
    2077                      .dwattr $C$DW$162, DW_AT_decl_column(0x0f)
    2078              $C$DW$163       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$25)
    2080                      .dwattr $C$DW$163, DW_AT_name("pxNext")
    2081                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_pxNext")
    2082                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2083                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2084                      .dwattr $C$DW$163, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2085                      .dwattr $C$DW$163, DW_AT_decl_line(0x65)
    2086                      .dwattr $C$DW$163, DW_AT_decl_column(0x1f)
    2087              $C$DW$164       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE   46

    2088                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$25)
    2089                      .dwattr $C$DW$164, DW_AT_name("pxPrevious")
    2090                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_pxPrevious")
    2091                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2092                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2093                      .dwattr $C$DW$164, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2094                      .dwattr $C$DW$164, DW_AT_decl_line(0x66)
    2095                      .dwattr $C$DW$164, DW_AT_decl_column(0x1f)
    2096              $C$DW$165       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$3)
    2098                      .dwattr $C$DW$165, DW_AT_name("pvOwner")
    2099                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_pvOwner")
    2100                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2101                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2102                      .dwattr $C$DW$165, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2103                      .dwattr $C$DW$165, DW_AT_decl_line(0x67)
    2104                      .dwattr $C$DW$165, DW_AT_decl_column(0x09)
    2105              $C$DW$166       .dwtag  DW_TAG_member
    2106                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$3)
    2107                      .dwattr $C$DW$166, DW_AT_name("pvContainer")
    2108                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_pvContainer")
    2109                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2110                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2111                      .dwattr $C$DW$166, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2112                      .dwattr $C$DW$166, DW_AT_decl_line(0x68)
    2113                      .dwattr $C$DW$166, DW_AT_decl_column(0x09)
    2114                      .dwendtag $C$DW$T$26
    2115              
    2116                      .dwattr $C$DW$T$26, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2117                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x62)
    2118                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x08)
    2119              $C$DW$167       .dwtag  DW_TAG_TI_far_type
    2120                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$26)
    2121              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    2122                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$167)
    2123              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    2124                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2125                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
    2126              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    2127                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    2128                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2129                      .dwattr $C$DW$T$29, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2130                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x6a)
    2131                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x1b)
    2132              $C$DW$168       .dwtag  DW_TAG_TI_far_type
    2133                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$29)
    2134              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    2135                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$168)
    2136              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2137                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2138                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
    2139              
    2140              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2141                      .dwattr $C$DW$T$27, DW_AT_name("xMINI_LIST_ITEM")
    2142                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x06)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE   47

    2143              $C$DW$169       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
    2145                      .dwattr $C$DW$169, DW_AT_name("xItemValue")
    2146                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_xItemValue")
    2147                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2148                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2149                      .dwattr $C$DW$169, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2150                      .dwattr $C$DW$169, DW_AT_decl_line(0x6e)
    2151                      .dwattr $C$DW$169, DW_AT_decl_column(0x0f)
    2152              $C$DW$170       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$25)
    2154                      .dwattr $C$DW$170, DW_AT_name("pxNext")
    2155                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_pxNext")
    2156                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2157                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2158                      .dwattr $C$DW$170, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2159                      .dwattr $C$DW$170, DW_AT_decl_line(0x6f)
    2160                      .dwattr $C$DW$170, DW_AT_decl_column(0x1e)
    2161              $C$DW$171       .dwtag  DW_TAG_member
    2162                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$25)
    2163                      .dwattr $C$DW$171, DW_AT_name("pxPrevious")
    2164                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_pxPrevious")
    2165                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2166                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2167                      .dwattr $C$DW$171, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2168                      .dwattr $C$DW$171, DW_AT_decl_line(0x70)
    2169                      .dwattr $C$DW$171, DW_AT_decl_column(0x1e)
    2170                      .dwendtag $C$DW$T$27
    2171              
    2172                      .dwattr $C$DW$T$27, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2173                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x6c)
    2174                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x08)
    2175              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    2176                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
    2177                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2178                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2179                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x72)
    2180                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x20)
    2181              $C$DW$172       .dwtag  DW_TAG_TI_far_type
    2182                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$32)
    2183              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    2184                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$172)
    2185              
    2186              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2187                      .dwattr $C$DW$T$34, DW_AT_name("xLIST")
    2188                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    2189              $C$DW$173       .dwtag  DW_TAG_member
    2190                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$28)
    2191                      .dwattr $C$DW$173, DW_AT_name("uxNumberOfItems")
    2192                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_uxNumberOfItems")
    2193                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2194                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2195                      .dwattr $C$DW$173, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2196                      .dwattr $C$DW$173, DW_AT_decl_line(0x79)
    2197                      .dwattr $C$DW$173, DW_AT_decl_column(0x22)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE   48

    2198              $C$DW$174       .dwtag  DW_TAG_member
    2199                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
    2200                      .dwattr $C$DW$174, DW_AT_name("pxIndex")
    2201                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_pxIndex")
    2202                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2203                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2204                      .dwattr $C$DW$174, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2205                      .dwattr $C$DW$174, DW_AT_decl_line(0x7a)
    2206                      .dwattr $C$DW$174, DW_AT_decl_column(0x17)
    2207              $C$DW$175       .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$33)
    2209                      .dwattr $C$DW$175, DW_AT_name("xListEnd")
    2210                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_xListEnd")
    2211                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2212                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2213                      .dwattr $C$DW$175, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2214                      .dwattr $C$DW$175, DW_AT_decl_line(0x7b)
    2215                      .dwattr $C$DW$175, DW_AT_decl_column(0x19)
    2216                      .dwendtag $C$DW$T$34
    2217              
    2218                      .dwattr $C$DW$T$34, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2219                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x77)
    2220                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    2221              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    2222                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$34)
    2223                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2224                      .dwattr $C$DW$T$86, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2225                      .dwattr $C$DW$T$86, DW_AT_decl_line(0x7c)
    2226                      .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    2227              
    2228              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2229                      .dwattr $C$DW$T$35, DW_AT_name("xTIME_OUT")
    2230                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    2231              $C$DW$176       .dwtag  DW_TAG_member
    2232                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$10)
    2233                      .dwattr $C$DW$176, DW_AT_name("xOverflowCount")
    2234                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_xOverflowCount")
    2235                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2236                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2237                      .dwattr $C$DW$176, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2238                      .dwattr $C$DW$176, DW_AT_decl_line(0x5e)
    2239                      .dwattr $C$DW$176, DW_AT_decl_column(0x10)
    2240              $C$DW$177       .dwtag  DW_TAG_member
    2241                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
    2242                      .dwattr $C$DW$177, DW_AT_name("xTimeOnEntering")
    2243                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_xTimeOnEntering")
    2244                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2245                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2246                      .dwattr $C$DW$177, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2247                      .dwattr $C$DW$177, DW_AT_decl_line(0x5f)
    2248                      .dwattr $C$DW$177, DW_AT_decl_column(0x10)
    2249                      .dwendtag $C$DW$T$35
    2250              
    2251                      .dwattr $C$DW$T$35, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2252                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x5c)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE   49

    2253                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2254              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    2255                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$35)
    2256                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2257                      .dwattr $C$DW$T$87, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2258                      .dwattr $C$DW$T$87, DW_AT_decl_line(0x60)
    2259                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    2260              
    2261              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2262                      .dwattr $C$DW$T$45, DW_AT_name("xTASK_PARAMTERS")
    2263                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x12)
    2264              $C$DW$178       .dwtag  DW_TAG_member
    2265                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$38)
    2266                      .dwattr $C$DW$178, DW_AT_name("pvTaskCode")
    2267                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_pvTaskCode")
    2268                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2270                      .dwattr $C$DW$178, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2271                      .dwattr $C$DW$178, DW_AT_decl_line(0x71)
    2272                      .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    2273              $C$DW$179       .dwtag  DW_TAG_member
    2274                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$41)
    2275                      .dwattr $C$DW$179, DW_AT_name("pcName")
    2276                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_pcName")
    2277                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2278                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2279                      .dwattr $C$DW$179, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2280                      .dwattr $C$DW$179, DW_AT_decl_line(0x72)
    2281                      .dwattr $C$DW$179, DW_AT_decl_column(0x1c)
    2282              $C$DW$180       .dwtag  DW_TAG_member
    2283                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$9)
    2284                      .dwattr $C$DW$180, DW_AT_name("usStackDepth")
    2285                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_usStackDepth")
    2286                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2287                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2288                      .dwattr $C$DW$180, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2289                      .dwattr $C$DW$180, DW_AT_decl_line(0x73)
    2290                      .dwattr $C$DW$180, DW_AT_decl_column(0x11)
    2291              $C$DW$181       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$3)
    2293                      .dwattr $C$DW$181, DW_AT_name("pvParameters")
    2294                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_pvParameters")
    2295                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2296                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2297                      .dwattr $C$DW$181, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2298                      .dwattr $C$DW$181, DW_AT_decl_line(0x74)
    2299                      .dwattr $C$DW$181, DW_AT_decl_column(0x08)
    2300              $C$DW$182       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$11)
    2302                      .dwattr $C$DW$182, DW_AT_name("uxPriority")
    2303                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_uxPriority")
    2304                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2305                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2306                      .dwattr $C$DW$182, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2307                      .dwattr $C$DW$182, DW_AT_decl_line(0x75)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE   50

    2308                      .dwattr $C$DW$182, DW_AT_decl_column(0x19)
    2309              $C$DW$183       .dwtag  DW_TAG_member
    2310                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$42)
    2311                      .dwattr $C$DW$183, DW_AT_name("puxStackBuffer")
    2312                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_puxStackBuffer")
    2313                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2314                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2315                      .dwattr $C$DW$183, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2316                      .dwattr $C$DW$183, DW_AT_decl_line(0x76)
    2317                      .dwattr $C$DW$183, DW_AT_decl_column(0x12)
    2318              $C$DW$184       .dwtag  DW_TAG_member
    2319                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$44)
    2320                      .dwattr $C$DW$184, DW_AT_name("xRegions")
    2321                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_xRegions")
    2322                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2323                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2324                      .dwattr $C$DW$184, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2325                      .dwattr $C$DW$184, DW_AT_decl_line(0x77)
    2326                      .dwattr $C$DW$184, DW_AT_decl_column(0x10)
    2327                      .dwendtag $C$DW$T$45
    2328              
    2329                      .dwattr $C$DW$T$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2330                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x6f)
    2331                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    2332              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    2333                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$45)
    2334                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2335                      .dwattr $C$DW$T$88, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2336                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x78)
    2337                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    2338                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2339              
    2340              ;***************************************************************
    2341              ;* DWARF CIE ENTRIES                                           *
    2342              ;***************************************************************
    2343              
    2344              $C$DW$CIE       .dwcie 91
    2345                      .dwcfi  cfa_register, 36
    2346                      .dwcfi  cfa_offset, 0
    2347                      .dwcfi  undefined, 0
    2348                      .dwcfi  undefined, 1
    2349                      .dwcfi  undefined, 2
    2350                      .dwcfi  undefined, 3
    2351                      .dwcfi  undefined, 4
    2352                      .dwcfi  undefined, 5
    2353                      .dwcfi  undefined, 6
    2354                      .dwcfi  undefined, 7
    2355                      .dwcfi  undefined, 8
    2356                      .dwcfi  undefined, 9
    2357                      .dwcfi  undefined, 10
    2358                      .dwcfi  undefined, 11
    2359                      .dwcfi  undefined, 12
    2360                      .dwcfi  undefined, 13
    2361                      .dwcfi  same_value, 14
    2362                      .dwcfi  same_value, 15
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:34 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
flop.asm                                                             PAGE   51

    2363                      .dwcfi  undefined, 16
    2364                      .dwcfi  undefined, 17
    2365                      .dwcfi  undefined, 18
    2366                      .dwcfi  undefined, 19
    2367                      .dwcfi  undefined, 20
    2368                      .dwcfi  undefined, 21
    2369                      .dwcfi  undefined, 22
    2370                      .dwcfi  undefined, 23
    2371                      .dwcfi  undefined, 24
    2372                      .dwcfi  undefined, 25
    2373                      .dwcfi  same_value, 26
    2374                      .dwcfi  same_value, 27
    2375                      .dwcfi  same_value, 28
    2376                      .dwcfi  same_value, 29
    2377                      .dwcfi  same_value, 30
    2378                      .dwcfi  same_value, 31
    2379                      .dwcfi  undefined, 32
    2380                      .dwcfi  undefined, 33
    2381                      .dwcfi  undefined, 34
    2382                      .dwcfi  undefined, 35
    2383                      .dwcfi  undefined, 36
    2384                      .dwcfi  undefined, 37
