TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE    1

    1686              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:29 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     842                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     843              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
     844                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$50)
     845              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
     846                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$11)
     847                      .dwattr $C$DW$T$48, DW_AT_address_class(0x17)
     848              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
     849                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$11)
     850                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     851                      .dwattr $C$DW$T$63, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     852                      .dwattr $C$DW$T$63, DW_AT_decl_line(0x27)
     853                      .dwattr $C$DW$T$63, DW_AT_decl_column(0x1a)
     854              $C$DW$T$12      .dwtag  DW_TAG_base_type
     855                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     856                      .dwattr $C$DW$T$12, DW_AT_name("long")
     857                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     858              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
     859                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$12)
     860                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   19

     861                      .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     862                      .dwattr $C$DW$T$67, DW_AT_decl_line(0x11)
     863                      .dwattr $C$DW$T$67, DW_AT_decl_column(0x1c)
     864              $C$DW$T$13      .dwtag  DW_TAG_base_type
     865                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     866                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     867                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     868              $C$DW$51        .dwtag  DW_TAG_TI_far_type
     869                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$13)
     870              $C$DW$T$19      .dwtag  DW_TAG_volatile_type
     871                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$51)
     872              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     873                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$13)
     874                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     875                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     876                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x21)
     877                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x19)
     878              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     879                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
     880                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     881                      .dwattr $C$DW$T$28, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     882                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x55)
     883                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x1c)
     884              $C$DW$T$14      .dwtag  DW_TAG_base_type
     885                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     886                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     887                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     888                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     889                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     890              $C$DW$T$15      .dwtag  DW_TAG_base_type
     891                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     892                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     893                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     894                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     895                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     896              $C$DW$T$16      .dwtag  DW_TAG_base_type
     897                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     898                      .dwattr $C$DW$T$16, DW_AT_name("float")
     899                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     900              $C$DW$T$17      .dwtag  DW_TAG_base_type
     901                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     902                      .dwattr $C$DW$T$17, DW_AT_name("double")
     903                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     904              $C$DW$T$18      .dwtag  DW_TAG_base_type
     905                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     906                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     907                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     908              
     909              $C$DW$T$21      .dwtag  DW_TAG_union_type
     910                      .dwattr $C$DW$T$21, DW_AT_name("xRTOS_HEAP")
     911                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x1388)
     912              $C$DW$52        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$52, DW_AT_name("ulDummy")
     915                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_ulDummy")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   20

     916                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     917                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     918                      .dwattr $C$DW$52, DW_AT_decl_file("../FreeRTOS/Source/portable/MemMang/heap_2.c")
     919                      .dwattr $C$DW$52, DW_AT_decl_line(0x51)
     920                      .dwattr $C$DW$52, DW_AT_decl_column(0x1a)
     921              $C$DW$53        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$20)
     923                      .dwattr $C$DW$53, DW_AT_name("ucHeap")
     924                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_ucHeap")
     925                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     927                      .dwattr $C$DW$53, DW_AT_decl_file("../FreeRTOS/Source/portable/MemMang/heap_2.c")
     928                      .dwattr $C$DW$53, DW_AT_decl_line(0x53)
     929                      .dwattr $C$DW$53, DW_AT_decl_column(0x10)
     930                      .dwendtag $C$DW$T$21
     931              
     932                      .dwattr $C$DW$T$21, DW_AT_decl_file("../FreeRTOS/Source/portable/MemMang/heap_2.c")
     933                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x4c)
     934                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x0e)
     935              
     936              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     937                      .dwattr $C$DW$T$24, DW_AT_name("A_BLOCK_LINK")
     938                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     939              $C$DW$54        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$22)
     941                      .dwattr $C$DW$54, DW_AT_name("pxNextFreeBlock")
     942                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_pxNextFreeBlock")
     943                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     944                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     945                      .dwattr $C$DW$54, DW_AT_decl_file("../FreeRTOS/Source/portable/MemMang/heap_2.c")
     946                      .dwattr $C$DW$54, DW_AT_decl_line(0x5a)
     947                      .dwattr $C$DW$54, DW_AT_decl_column(0x17)
     948              $C$DW$55        .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$23)
     950                      .dwattr $C$DW$55, DW_AT_name("xBlockSize")
     951                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_xBlockSize")
     952                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     953                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     954                      .dwattr $C$DW$55, DW_AT_decl_file("../FreeRTOS/Source/portable/MemMang/heap_2.c")
     955                      .dwattr $C$DW$55, DW_AT_decl_line(0x5b)
     956                      .dwattr $C$DW$55, DW_AT_decl_column(0x09)
     957                      .dwendtag $C$DW$T$24
     958              
     959                      .dwattr $C$DW$T$24, DW_AT_decl_file("../FreeRTOS/Source/portable/MemMang/heap_2.c")
     960                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x58)
     961                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
     962              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     963                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$24)
     964                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
     965              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("xBlockLink")
     966                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$24)
     967                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     968                      .dwattr $C$DW$T$71, DW_AT_decl_file("../FreeRTOS/Source/portable/MemMang/heap_2.c")
     969                      .dwattr $C$DW$T$71, DW_AT_decl_line(0x5c)
     970                      .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   21

     971              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
     972                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
     973                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
     974              
     975              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     976                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     977              $C$DW$56        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$10)
     979                      .dwattr $C$DW$56, DW_AT_name("quot")
     980                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_quot")
     981                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     983                      .dwattr $C$DW$56, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     984                      .dwattr $C$DW$56, DW_AT_decl_line(0x12)
     985                      .dwattr $C$DW$56, DW_AT_decl_column(0x16)
     986              $C$DW$57        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$10)
     988                      .dwattr $C$DW$57, DW_AT_name("rem")
     989                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rem")
     990                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     991                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     992                      .dwattr $C$DW$57, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     993                      .dwattr $C$DW$57, DW_AT_decl_line(0x12)
     994                      .dwattr $C$DW$57, DW_AT_decl_column(0x1c)
     995                      .dwendtag $C$DW$T$25
     996              
     997                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     998                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x12)
     999                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1000              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    1001                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$25)
    1002                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1003                      .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1004                      .dwattr $C$DW$T$73, DW_AT_decl_line(0x12)
    1005                      .dwattr $C$DW$T$73, DW_AT_decl_column(0x23)
    1006              
    1007              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1008                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1009              $C$DW$58        .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$12)
    1011                      .dwattr $C$DW$58, DW_AT_name("quot")
    1012                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_quot")
    1013                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1015                      .dwattr $C$DW$58, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
    1016                      .dwattr $C$DW$58, DW_AT_decl_line(0x14)
    1017                      .dwattr $C$DW$58, DW_AT_decl_column(0x17)
    1018              $C$DW$59        .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$12)
    1020                      .dwattr $C$DW$59, DW_AT_name("rem")
    1021                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rem")
    1022                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1023                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1024                      .dwattr $C$DW$59, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
    1025                      .dwattr $C$DW$59, DW_AT_decl_line(0x14)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   22

    1026                      .dwattr $C$DW$59, DW_AT_decl_column(0x1d)
    1027                      .dwendtag $C$DW$T$26
    1028              
    1029                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1030                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x14)
    1031                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    1032              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    1033                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$26)
    1034                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1035                      .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1036                      .dwattr $C$DW$T$74, DW_AT_decl_line(0x14)
    1037                      .dwattr $C$DW$T$74, DW_AT_decl_column(0x24)
    1038              
    1039              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1040                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
    1041              $C$DW$60        .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$14)
    1043                      .dwattr $C$DW$60, DW_AT_name("quot")
    1044                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_quot")
    1045                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1047                      .dwattr $C$DW$60, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
    1048                      .dwattr $C$DW$60, DW_AT_decl_line(0x17)
    1049                      .dwattr $C$DW$60, DW_AT_decl_column(0x1c)
    1050              $C$DW$61        .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$14)
    1052                      .dwattr $C$DW$61, DW_AT_name("rem")
    1053                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rem")
    1054                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1055                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1056                      .dwattr $C$DW$61, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
    1057                      .dwattr $C$DW$61, DW_AT_decl_line(0x17)
    1058                      .dwattr $C$DW$61, DW_AT_decl_column(0x22)
    1059                      .dwendtag $C$DW$T$27
    1060              
    1061                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1062                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x17)
    1063                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1064              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    1065                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$27)
    1066                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1067                      .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1068                      .dwattr $C$DW$T$75, DW_AT_decl_line(0x17)
    1069                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x29)
    1070              
    1071              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1072                      .dwattr $C$DW$T$31, DW_AT_name("xLIST_ITEM")
    1073                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    1074              $C$DW$62        .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$28)
    1076                      .dwattr $C$DW$62, DW_AT_name("xItemValue")
    1077                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_xItemValue")
    1078                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1080                      .dwattr $C$DW$62, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   23

    1081                      .dwattr $C$DW$62, DW_AT_decl_line(0x64)
    1082                      .dwattr $C$DW$62, DW_AT_decl_column(0x0f)
    1083              $C$DW$63        .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$30)
    1085                      .dwattr $C$DW$63, DW_AT_name("pxNext")
    1086                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_pxNext")
    1087                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1088                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1089                      .dwattr $C$DW$63, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1090                      .dwattr $C$DW$63, DW_AT_decl_line(0x65)
    1091                      .dwattr $C$DW$63, DW_AT_decl_column(0x1f)
    1092              $C$DW$64        .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$30)
    1094                      .dwattr $C$DW$64, DW_AT_name("pxPrevious")
    1095                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_pxPrevious")
    1096                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1097                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1098                      .dwattr $C$DW$64, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1099                      .dwattr $C$DW$64, DW_AT_decl_line(0x66)
    1100                      .dwattr $C$DW$64, DW_AT_decl_column(0x1f)
    1101              $C$DW$65        .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$3)
    1103                      .dwattr $C$DW$65, DW_AT_name("pvOwner")
    1104                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_pvOwner")
    1105                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1106                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1107                      .dwattr $C$DW$65, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1108                      .dwattr $C$DW$65, DW_AT_decl_line(0x67)
    1109                      .dwattr $C$DW$65, DW_AT_decl_column(0x09)
    1110              $C$DW$66        .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$3)
    1112                      .dwattr $C$DW$66, DW_AT_name("pvContainer")
    1113                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_pvContainer")
    1114                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1115                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1116                      .dwattr $C$DW$66, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1117                      .dwattr $C$DW$66, DW_AT_decl_line(0x68)
    1118                      .dwattr $C$DW$66, DW_AT_decl_column(0x09)
    1119                      .dwendtag $C$DW$T$31
    1120              
    1121                      .dwattr $C$DW$T$31, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1122                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x62)
    1123                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x08)
    1124              $C$DW$67        .dwtag  DW_TAG_TI_far_type
    1125                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$31)
    1126              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    1127                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$67)
    1128              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    1129                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1130                      .dwattr $C$DW$T$30, DW_AT_address_class(0x17)
    1131              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1132                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    1133                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1134                      .dwattr $C$DW$T$34, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1135                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x6a)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   24

    1136                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x1b)
    1137              $C$DW$68        .dwtag  DW_TAG_TI_far_type
    1138                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$34)
    1139              $C$DW$T$35      .dwtag  DW_TAG_volatile_type
    1140                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$68)
    1141              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1142                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1143                      .dwattr $C$DW$T$36, DW_AT_address_class(0x17)
    1144              
    1145              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1146                      .dwattr $C$DW$T$32, DW_AT_name("xMINI_LIST_ITEM")
    1147                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x06)
    1148              $C$DW$69        .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$28)
    1150                      .dwattr $C$DW$69, DW_AT_name("xItemValue")
    1151                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_xItemValue")
    1152                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1154                      .dwattr $C$DW$69, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1155                      .dwattr $C$DW$69, DW_AT_decl_line(0x6e)
    1156                      .dwattr $C$DW$69, DW_AT_decl_column(0x0f)
    1157              $C$DW$70        .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$30)
    1159                      .dwattr $C$DW$70, DW_AT_name("pxNext")
    1160                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_pxNext")
    1161                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1162                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1163                      .dwattr $C$DW$70, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1164                      .dwattr $C$DW$70, DW_AT_decl_line(0x6f)
    1165                      .dwattr $C$DW$70, DW_AT_decl_column(0x1e)
    1166              $C$DW$71        .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$30)
    1168                      .dwattr $C$DW$71, DW_AT_name("pxPrevious")
    1169                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_pxPrevious")
    1170                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1171                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1172                      .dwattr $C$DW$71, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1173                      .dwattr $C$DW$71, DW_AT_decl_line(0x70)
    1174                      .dwattr $C$DW$71, DW_AT_decl_column(0x1e)
    1175                      .dwendtag $C$DW$T$32
    1176              
    1177                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1178                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x6c)
    1179                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x08)
    1180              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1181                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$32)
    1182                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1183                      .dwattr $C$DW$T$37, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1184                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x72)
    1185                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x20)
    1186              $C$DW$72        .dwtag  DW_TAG_TI_far_type
    1187                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$37)
    1188              $C$DW$T$38      .dwtag  DW_TAG_volatile_type
    1189                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$72)
    1190              
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   25

    1191              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1192                      .dwattr $C$DW$T$39, DW_AT_name("xLIST")
    1193                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    1194              $C$DW$73        .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$33)
    1196                      .dwattr $C$DW$73, DW_AT_name("uxNumberOfItems")
    1197                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1198                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1200                      .dwattr $C$DW$73, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1201                      .dwattr $C$DW$73, DW_AT_decl_line(0x79)
    1202                      .dwattr $C$DW$73, DW_AT_decl_column(0x22)
    1203              $C$DW$74        .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$36)
    1205                      .dwattr $C$DW$74, DW_AT_name("pxIndex")
    1206                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_pxIndex")
    1207                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1208                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1209                      .dwattr $C$DW$74, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1210                      .dwattr $C$DW$74, DW_AT_decl_line(0x7a)
    1211                      .dwattr $C$DW$74, DW_AT_decl_column(0x17)
    1212              $C$DW$75        .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$38)
    1214                      .dwattr $C$DW$75, DW_AT_name("xListEnd")
    1215                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_xListEnd")
    1216                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1217                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1218                      .dwattr $C$DW$75, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1219                      .dwattr $C$DW$75, DW_AT_decl_line(0x7b)
    1220                      .dwattr $C$DW$75, DW_AT_decl_column(0x19)
    1221                      .dwendtag $C$DW$T$39
    1222              
    1223                      .dwattr $C$DW$T$39, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1224                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x77)
    1225                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1226              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1227                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$39)
    1228                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1229                      .dwattr $C$DW$T$76, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1230                      .dwattr $C$DW$T$76, DW_AT_decl_line(0x7c)
    1231                      .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    1232              
    1233              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1234                      .dwattr $C$DW$T$40, DW_AT_name("xTIME_OUT")
    1235                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1236              $C$DW$76        .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$10)
    1238                      .dwattr $C$DW$76, DW_AT_name("xOverflowCount")
    1239                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_xOverflowCount")
    1240                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1242                      .dwattr $C$DW$76, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1243                      .dwattr $C$DW$76, DW_AT_decl_line(0x5e)
    1244                      .dwattr $C$DW$76, DW_AT_decl_column(0x10)
    1245              $C$DW$77        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   26

    1246                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$28)
    1247                      .dwattr $C$DW$77, DW_AT_name("xTimeOnEntering")
    1248                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_xTimeOnEntering")
    1249                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1250                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1251                      .dwattr $C$DW$77, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1252                      .dwattr $C$DW$77, DW_AT_decl_line(0x5f)
    1253                      .dwattr $C$DW$77, DW_AT_decl_column(0x10)
    1254                      .dwendtag $C$DW$T$40
    1255              
    1256                      .dwattr $C$DW$T$40, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1257                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x5c)
    1258                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1259              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1260                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$40)
    1261                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1262                      .dwattr $C$DW$T$77, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1263                      .dwattr $C$DW$T$77, DW_AT_decl_line(0x60)
    1264                      .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    1265              
    1266              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1267                      .dwattr $C$DW$T$41, DW_AT_name("xMEMORY_REGION")
    1268                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
    1269              $C$DW$78        .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$3)
    1271                      .dwattr $C$DW$78, DW_AT_name("pvBaseAddress")
    1272                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_pvBaseAddress")
    1273                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1275                      .dwattr $C$DW$78, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1276                      .dwattr $C$DW$78, DW_AT_decl_line(0x67)
    1277                      .dwattr $C$DW$78, DW_AT_decl_column(0x08)
    1278              $C$DW$79        .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$13)
    1280                      .dwattr $C$DW$79, DW_AT_name("ulLengthInBytes")
    1281                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_ulLengthInBytes")
    1282                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1283                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1284                      .dwattr $C$DW$79, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1285                      .dwattr $C$DW$79, DW_AT_decl_line(0x68)
    1286                      .dwattr $C$DW$79, DW_AT_decl_column(0x10)
    1287              $C$DW$80        .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$13)
    1289                      .dwattr $C$DW$80, DW_AT_name("ulParameters")
    1290                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_ulParameters")
    1291                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1292                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1293                      .dwattr $C$DW$80, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1294                      .dwattr $C$DW$80, DW_AT_decl_line(0x69)
    1295                      .dwattr $C$DW$80, DW_AT_decl_column(0x10)
    1296                      .dwendtag $C$DW$T$41
    1297              
    1298                      .dwattr $C$DW$T$41, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1299                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x65)
    1300                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   27

    1301              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1302                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$41)
    1303                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1304                      .dwattr $C$DW$T$49, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1305                      .dwattr $C$DW$T$49, DW_AT_decl_line(0x6a)
    1306                      .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    1307              
    1308              $C$DW$T$50      .dwtag  DW_TAG_array_type
    1309                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    1310                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1311                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x06)
    1312              $C$DW$81        .dwtag  DW_TAG_subrange_type
    1313                      .dwattr $C$DW$81, DW_AT_upper_bound(0x00)
    1314                      .dwendtag $C$DW$T$50
    1315              
    1316              
    1317              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1318                      .dwattr $C$DW$T$51, DW_AT_name("xTASK_PARAMTERS")
    1319                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x12)
    1320              $C$DW$82        .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$44)
    1322                      .dwattr $C$DW$82, DW_AT_name("pvTaskCode")
    1323                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_pvTaskCode")
    1324                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1326                      .dwattr $C$DW$82, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1327                      .dwattr $C$DW$82, DW_AT_decl_line(0x71)
    1328                      .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1329              $C$DW$83        .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$47)
    1331                      .dwattr $C$DW$83, DW_AT_name("pcName")
    1332                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_pcName")
    1333                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1334                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1335                      .dwattr $C$DW$83, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1336                      .dwattr $C$DW$83, DW_AT_decl_line(0x72)
    1337                      .dwattr $C$DW$83, DW_AT_decl_column(0x1c)
    1338              $C$DW$84        .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$9)
    1340                      .dwattr $C$DW$84, DW_AT_name("usStackDepth")
    1341                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_usStackDepth")
    1342                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1343                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1344                      .dwattr $C$DW$84, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1345                      .dwattr $C$DW$84, DW_AT_decl_line(0x73)
    1346                      .dwattr $C$DW$84, DW_AT_decl_column(0x11)
    1347              $C$DW$85        .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$3)
    1349                      .dwattr $C$DW$85, DW_AT_name("pvParameters")
    1350                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_pvParameters")
    1351                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1352                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1353                      .dwattr $C$DW$85, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1354                      .dwattr $C$DW$85, DW_AT_decl_line(0x74)
    1355                      .dwattr $C$DW$85, DW_AT_decl_column(0x08)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   28

    1356              $C$DW$86        .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1358                      .dwattr $C$DW$86, DW_AT_name("uxPriority")
    1359                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_uxPriority")
    1360                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1361                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1362                      .dwattr $C$DW$86, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1363                      .dwattr $C$DW$86, DW_AT_decl_line(0x75)
    1364                      .dwattr $C$DW$86, DW_AT_decl_column(0x19)
    1365              $C$DW$87        .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$48)
    1367                      .dwattr $C$DW$87, DW_AT_name("puxStackBuffer")
    1368                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_puxStackBuffer")
    1369                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1370                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1371                      .dwattr $C$DW$87, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1372                      .dwattr $C$DW$87, DW_AT_decl_line(0x76)
    1373                      .dwattr $C$DW$87, DW_AT_decl_column(0x12)
    1374              $C$DW$88        .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$50)
    1376                      .dwattr $C$DW$88, DW_AT_name("xRegions")
    1377                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_xRegions")
    1378                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1379                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1380                      .dwattr $C$DW$88, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1381                      .dwattr $C$DW$88, DW_AT_decl_line(0x77)
    1382                      .dwattr $C$DW$88, DW_AT_decl_column(0x10)
    1383                      .dwendtag $C$DW$T$51
    1384              
    1385                      .dwattr $C$DW$T$51, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1386                      .dwattr $C$DW$T$51, DW_AT_decl_line(0x6f)
    1387                      .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    1388              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1389                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$51)
    1390                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1391                      .dwattr $C$DW$T$78, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1392                      .dwattr $C$DW$T$78, DW_AT_decl_line(0x78)
    1393                      .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1394                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1395              
    1396              ;***************************************************************
    1397              ;* DWARF CIE ENTRIES                                           *
    1398              ;***************************************************************
    1399              
    1400              $C$DW$CIE       .dwcie 91
    1401                      .dwcfi  cfa_register, 36
    1402                      .dwcfi  cfa_offset, 0
    1403                      .dwcfi  undefined, 0
    1404                      .dwcfi  undefined, 1
    1405                      .dwcfi  undefined, 2
    1406                      .dwcfi  undefined, 3
    1407                      .dwcfi  undefined, 4
    1408                      .dwcfi  undefined, 5
    1409                      .dwcfi  undefined, 6
    1410                      .dwcfi  undefined, 7
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   29

    1411                      .dwcfi  undefined, 8
    1412                      .dwcfi  undefined, 9
    1413                      .dwcfi  undefined, 10
    1414                      .dwcfi  undefined, 11
    1415                      .dwcfi  undefined, 12
    1416                      .dwcfi  undefined, 13
    1417                      .dwcfi  same_value, 14
    1418                      .dwcfi  same_value, 15
    1419                      .dwcfi  undefined, 16
    1420                      .dwcfi  undefined, 17
    1421                      .dwcfi  undefined, 18
    1422                      .dwcfi  undefined, 19
    1423                      .dwcfi  undefined, 20
    1424                      .dwcfi  undefined, 21
    1425                      .dwcfi  undefined, 22
    1426                      .dwcfi  undefined, 23
    1427                      .dwcfi  undefined, 24
    1428                      .dwcfi  undefined, 25
    1429                      .dwcfi  same_value, 26
    1430                      .dwcfi  same_value, 27
    1431                      .dwcfi  same_value, 28
    1432                      .dwcfi  same_value, 29
    1433                      .dwcfi  same_value, 30
    1434                      .dwcfi  same_value, 31
    1435                      .dwcfi  undefined, 32
    1436                      .dwcfi  undefined, 33
    1437                      .dwcfi  undefined, 34
    1438                      .dwcfi  undefined, 35
    1439                      .dwcfi  undefined, 36
    1440                      .dwcfi  undefined, 37
