TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:35 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

     678                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     679                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     680              $C$DW$50        .dwtag  DW_TAG_TI_far_type
     681                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     682              $C$DW$T$28      .dwtag  DW_TAG_volatile_type
     683                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$50)
     684              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
     685                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$11)
     686                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
     687              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
     688                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$11)
     689                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     690                      .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     691                      .dwattr $C$DW$T$67, DW_AT_decl_line(0x27)
     692                      .dwattr $C$DW$T$67, DW_AT_decl_column(0x1a)
     693              $C$DW$T$12      .dwtag  DW_TAG_base_type
     694                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     695                      .dwattr $C$DW$T$12, DW_AT_name("long")
     696                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     697              $C$DW$51        .dwtag  DW_TAG_TI_far_type
     698                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$12)
     699              $C$DW$T$68      .dwtag  DW_TAG_volatile_type
     700                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$51)
     701              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
     702                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$12)
     703                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     704                      .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     705                      .dwattr $C$DW$T$69, DW_AT_decl_line(0x11)
     706                      .dwattr $C$DW$T$69, DW_AT_decl_column(0x1c)
     707              $C$DW$T$13      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE   15

     708                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     709                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     710                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     711              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     712                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$13)
     713                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     714                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     715                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x55)
     716                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x1c)
     717              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     718                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$13)
     719                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
     720                      .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     721                      .dwattr $C$DW$T$70, DW_AT_decl_line(0x21)
     722                      .dwattr $C$DW$T$70, DW_AT_decl_column(0x19)
     723              $C$DW$T$14      .dwtag  DW_TAG_base_type
     724                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     725                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     726                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     727                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     728                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     729              $C$DW$T$15      .dwtag  DW_TAG_base_type
     730                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     731                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     732                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     733                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     734                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     735              $C$DW$T$16      .dwtag  DW_TAG_base_type
     736                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     737                      .dwattr $C$DW$T$16, DW_AT_name("float")
     738                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     739              $C$DW$T$17      .dwtag  DW_TAG_base_type
     740                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     741                      .dwattr $C$DW$T$17, DW_AT_name("double")
     742                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     743              $C$DW$T$18      .dwtag  DW_TAG_base_type
     744                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     745                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     746                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     747              
     748              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     749                      .dwattr $C$DW$T$19, DW_AT_name("xMEMORY_REGION")
     750                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x06)
     751              $C$DW$52        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$3)
     753                      .dwattr $C$DW$52, DW_AT_name("pvBaseAddress")
     754                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_pvBaseAddress")
     755                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     756                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     757                      .dwattr $C$DW$52, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     758                      .dwattr $C$DW$52, DW_AT_decl_line(0x67)
     759                      .dwattr $C$DW$52, DW_AT_decl_column(0x08)
     760              $C$DW$53        .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$13)
     762                      .dwattr $C$DW$53, DW_AT_name("ulLengthInBytes")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE   16

     763                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_ulLengthInBytes")
     764                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     765                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     766                      .dwattr $C$DW$53, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     767                      .dwattr $C$DW$53, DW_AT_decl_line(0x68)
     768                      .dwattr $C$DW$53, DW_AT_decl_column(0x10)
     769              $C$DW$54        .dwtag  DW_TAG_member
     770                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$13)
     771                      .dwattr $C$DW$54, DW_AT_name("ulParameters")
     772                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_ulParameters")
     773                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     774                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     775                      .dwattr $C$DW$54, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     776                      .dwattr $C$DW$54, DW_AT_decl_line(0x69)
     777                      .dwattr $C$DW$54, DW_AT_decl_column(0x10)
     778                      .dwendtag $C$DW$T$19
     779              
     780                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     781                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x65)
     782                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
     783              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
     784                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$19)
     785                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     786                      .dwattr $C$DW$T$43, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     787                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x6a)
     788                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
     789              
     790              $C$DW$T$44      .dwtag  DW_TAG_array_type
     791                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
     792                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     793                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
     794              $C$DW$55        .dwtag  DW_TAG_subrange_type
     795                      .dwattr $C$DW$55, DW_AT_upper_bound(0x00)
     796                      .dwendtag $C$DW$T$44
     797              
     798              $C$DW$56        .dwtag  DW_TAG_TI_far_type
     799                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$43)
     800              $C$DW$T$52      .dwtag  DW_TAG_const_type
     801                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$56)
     802              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
     803                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
     804                      .dwattr $C$DW$T$53, DW_AT_address_class(0x17)
     805              $C$DW$57        .dwtag  DW_TAG_TI_far_type
     806                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$53)
     807              $C$DW$T$54      .dwtag  DW_TAG_const_type
     808                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$57)
     809              
     810              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     811                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     812              $C$DW$58        .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$10)
     814                      .dwattr $C$DW$58, DW_AT_name("quot")
     815                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_quot")
     816                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE   17

     818                      .dwattr $C$DW$58, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     819                      .dwattr $C$DW$58, DW_AT_decl_line(0x12)
     820                      .dwattr $C$DW$58, DW_AT_decl_column(0x16)
     821              $C$DW$59        .dwtag  DW_TAG_member
     822                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$10)
     823                      .dwattr $C$DW$59, DW_AT_name("rem")
     824                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rem")
     825                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     826                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     827                      .dwattr $C$DW$59, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     828                      .dwattr $C$DW$59, DW_AT_decl_line(0x12)
     829                      .dwattr $C$DW$59, DW_AT_decl_column(0x1c)
     830                      .dwendtag $C$DW$T$20
     831              
     832                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     833                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x12)
     834                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     835              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
     836                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$20)
     837                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
     838                      .dwattr $C$DW$T$73, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     839                      .dwattr $C$DW$T$73, DW_AT_decl_line(0x12)
     840                      .dwattr $C$DW$T$73, DW_AT_decl_column(0x23)
     841              
     842              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     843                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     844              $C$DW$60        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$12)
     846                      .dwattr $C$DW$60, DW_AT_name("quot")
     847                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_quot")
     848                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     850                      .dwattr $C$DW$60, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     851                      .dwattr $C$DW$60, DW_AT_decl_line(0x14)
     852                      .dwattr $C$DW$60, DW_AT_decl_column(0x17)
     853              $C$DW$61        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$12)
     855                      .dwattr $C$DW$61, DW_AT_name("rem")
     856                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rem")
     857                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     858                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     859                      .dwattr $C$DW$61, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     860                      .dwattr $C$DW$61, DW_AT_decl_line(0x14)
     861                      .dwattr $C$DW$61, DW_AT_decl_column(0x1d)
     862                      .dwendtag $C$DW$T$21
     863              
     864                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     865                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
     866                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     867              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
     868                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$21)
     869                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
     870                      .dwattr $C$DW$T$74, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     871                      .dwattr $C$DW$T$74, DW_AT_decl_line(0x14)
     872                      .dwattr $C$DW$T$74, DW_AT_decl_column(0x24)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE   18

     873              
     874              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     875                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
     876              $C$DW$62        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$14)
     878                      .dwattr $C$DW$62, DW_AT_name("quot")
     879                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_quot")
     880                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     882                      .dwattr $C$DW$62, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     883                      .dwattr $C$DW$62, DW_AT_decl_line(0x17)
     884                      .dwattr $C$DW$62, DW_AT_decl_column(0x1c)
     885              $C$DW$63        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$14)
     887                      .dwattr $C$DW$63, DW_AT_name("rem")
     888                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rem")
     889                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     890                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     891                      .dwattr $C$DW$63, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     892                      .dwattr $C$DW$63, DW_AT_decl_line(0x17)
     893                      .dwattr $C$DW$63, DW_AT_decl_column(0x22)
     894                      .dwendtag $C$DW$T$22
     895              
     896                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     897                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x17)
     898                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
     899              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
     900                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$22)
     901                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
     902                      .dwattr $C$DW$T$75, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     903                      .dwattr $C$DW$T$75, DW_AT_decl_line(0x17)
     904                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x29)
     905              
     906              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     907                      .dwattr $C$DW$T$26, DW_AT_name("xLIST_ITEM")
     908                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
     909              $C$DW$64        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$23)
     911                      .dwattr $C$DW$64, DW_AT_name("xItemValue")
     912                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_xItemValue")
     913                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     915                      .dwattr $C$DW$64, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     916                      .dwattr $C$DW$64, DW_AT_decl_line(0x64)
     917                      .dwattr $C$DW$64, DW_AT_decl_column(0x0f)
     918              $C$DW$65        .dwtag  DW_TAG_member
     919                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$25)
     920                      .dwattr $C$DW$65, DW_AT_name("pxNext")
     921                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_pxNext")
     922                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     923                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     924                      .dwattr $C$DW$65, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     925                      .dwattr $C$DW$65, DW_AT_decl_line(0x65)
     926                      .dwattr $C$DW$65, DW_AT_decl_column(0x1f)
     927              $C$DW$66        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE   19

     928                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$25)
     929                      .dwattr $C$DW$66, DW_AT_name("pxPrevious")
     930                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_pxPrevious")
     931                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     932                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     933                      .dwattr $C$DW$66, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     934                      .dwattr $C$DW$66, DW_AT_decl_line(0x66)
     935                      .dwattr $C$DW$66, DW_AT_decl_column(0x1f)
     936              $C$DW$67        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$3)
     938                      .dwattr $C$DW$67, DW_AT_name("pvOwner")
     939                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_pvOwner")
     940                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     941                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     942                      .dwattr $C$DW$67, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     943                      .dwattr $C$DW$67, DW_AT_decl_line(0x67)
     944                      .dwattr $C$DW$67, DW_AT_decl_column(0x09)
     945              $C$DW$68        .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$3)
     947                      .dwattr $C$DW$68, DW_AT_name("pvContainer")
     948                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_pvContainer")
     949                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     950                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     951                      .dwattr $C$DW$68, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     952                      .dwattr $C$DW$68, DW_AT_decl_line(0x68)
     953                      .dwattr $C$DW$68, DW_AT_decl_column(0x09)
     954                      .dwendtag $C$DW$T$26
     955              
     956                      .dwattr $C$DW$T$26, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     957                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x62)
     958                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x08)
     959              $C$DW$69        .dwtag  DW_TAG_TI_far_type
     960                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$26)
     961              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
     962                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$69)
     963              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
     964                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     965                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
     966              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     967                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
     968                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     969                      .dwattr $C$DW$T$29, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     970                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x6a)
     971                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x1b)
     972              $C$DW$70        .dwtag  DW_TAG_TI_far_type
     973                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$29)
     974              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
     975                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$70)
     976              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
     977                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     978                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
     979              
     980              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     981                      .dwattr $C$DW$T$27, DW_AT_name("xMINI_LIST_ITEM")
     982                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x06)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE   20

     983              $C$DW$71        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$23)
     985                      .dwattr $C$DW$71, DW_AT_name("xItemValue")
     986                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_xItemValue")
     987                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     989                      .dwattr $C$DW$71, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     990                      .dwattr $C$DW$71, DW_AT_decl_line(0x6e)
     991                      .dwattr $C$DW$71, DW_AT_decl_column(0x0f)
     992              $C$DW$72        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$25)
     994                      .dwattr $C$DW$72, DW_AT_name("pxNext")
     995                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_pxNext")
     996                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     997                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     998                      .dwattr $C$DW$72, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     999                      .dwattr $C$DW$72, DW_AT_decl_line(0x6f)
    1000                      .dwattr $C$DW$72, DW_AT_decl_column(0x1e)
    1001              $C$DW$73        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$25)
    1003                      .dwattr $C$DW$73, DW_AT_name("pxPrevious")
    1004                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_pxPrevious")
    1005                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1006                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1007                      .dwattr $C$DW$73, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1008                      .dwattr $C$DW$73, DW_AT_decl_line(0x70)
    1009                      .dwattr $C$DW$73, DW_AT_decl_column(0x1e)
    1010                      .dwendtag $C$DW$T$27
    1011              
    1012                      .dwattr $C$DW$T$27, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1013                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x6c)
    1014                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x08)
    1015              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1016                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
    1017                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1018                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1019                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x72)
    1020                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x20)
    1021              $C$DW$74        .dwtag  DW_TAG_TI_far_type
    1022                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$32)
    1023              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    1024                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$74)
    1025              
    1026              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1027                      .dwattr $C$DW$T$34, DW_AT_name("xLIST")
    1028                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    1029              $C$DW$75        .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$28)
    1031                      .dwattr $C$DW$75, DW_AT_name("uxNumberOfItems")
    1032                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1033                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1035                      .dwattr $C$DW$75, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1036                      .dwattr $C$DW$75, DW_AT_decl_line(0x79)
    1037                      .dwattr $C$DW$75, DW_AT_decl_column(0x22)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE   21

    1038              $C$DW$76        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$31)
    1040                      .dwattr $C$DW$76, DW_AT_name("pxIndex")
    1041                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_pxIndex")
    1042                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1043                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1044                      .dwattr $C$DW$76, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1045                      .dwattr $C$DW$76, DW_AT_decl_line(0x7a)
    1046                      .dwattr $C$DW$76, DW_AT_decl_column(0x17)
    1047              $C$DW$77        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$33)
    1049                      .dwattr $C$DW$77, DW_AT_name("xListEnd")
    1050                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_xListEnd")
    1051                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1052                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1053                      .dwattr $C$DW$77, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1054                      .dwattr $C$DW$77, DW_AT_decl_line(0x7b)
    1055                      .dwattr $C$DW$77, DW_AT_decl_column(0x19)
    1056                      .dwendtag $C$DW$T$34
    1057              
    1058                      .dwattr $C$DW$T$34, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1059                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x77)
    1060                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    1061              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1062                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$34)
    1063                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1064                      .dwattr $C$DW$T$76, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1065                      .dwattr $C$DW$T$76, DW_AT_decl_line(0x7c)
    1066                      .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    1067              
    1068              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1069                      .dwattr $C$DW$T$35, DW_AT_name("xTIME_OUT")
    1070                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1071              $C$DW$78        .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$10)
    1073                      .dwattr $C$DW$78, DW_AT_name("xOverflowCount")
    1074                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_xOverflowCount")
    1075                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1077                      .dwattr $C$DW$78, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1078                      .dwattr $C$DW$78, DW_AT_decl_line(0x5e)
    1079                      .dwattr $C$DW$78, DW_AT_decl_column(0x10)
    1080              $C$DW$79        .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$23)
    1082                      .dwattr $C$DW$79, DW_AT_name("xTimeOnEntering")
    1083                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_xTimeOnEntering")
    1084                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1085                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1086                      .dwattr $C$DW$79, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1087                      .dwattr $C$DW$79, DW_AT_decl_line(0x5f)
    1088                      .dwattr $C$DW$79, DW_AT_decl_column(0x10)
    1089                      .dwendtag $C$DW$T$35
    1090              
    1091                      .dwattr $C$DW$T$35, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1092                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x5c)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE   22

    1093                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1094              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1095                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$35)
    1096                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1097                      .dwattr $C$DW$T$77, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1098                      .dwattr $C$DW$T$77, DW_AT_decl_line(0x60)
    1099                      .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    1100              
    1101              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1102                      .dwattr $C$DW$T$45, DW_AT_name("xTASK_PARAMTERS")
    1103                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x12)
    1104              $C$DW$80        .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$38)
    1106                      .dwattr $C$DW$80, DW_AT_name("pvTaskCode")
    1107                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_pvTaskCode")
    1108                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1110                      .dwattr $C$DW$80, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1111                      .dwattr $C$DW$80, DW_AT_decl_line(0x71)
    1112                      .dwattr $C$DW$80, DW_AT_decl_column(0x0e)
    1113              $C$DW$81        .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$41)
    1115                      .dwattr $C$DW$81, DW_AT_name("pcName")
    1116                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_pcName")
    1117                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1118                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1119                      .dwattr $C$DW$81, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1120                      .dwattr $C$DW$81, DW_AT_decl_line(0x72)
    1121                      .dwattr $C$DW$81, DW_AT_decl_column(0x1c)
    1122              $C$DW$82        .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$9)
    1124                      .dwattr $C$DW$82, DW_AT_name("usStackDepth")
    1125                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_usStackDepth")
    1126                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1127                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1128                      .dwattr $C$DW$82, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1129                      .dwattr $C$DW$82, DW_AT_decl_line(0x73)
    1130                      .dwattr $C$DW$82, DW_AT_decl_column(0x11)
    1131              $C$DW$83        .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$3)
    1133                      .dwattr $C$DW$83, DW_AT_name("pvParameters")
    1134                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_pvParameters")
    1135                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1136                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1137                      .dwattr $C$DW$83, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1138                      .dwattr $C$DW$83, DW_AT_decl_line(0x74)
    1139                      .dwattr $C$DW$83, DW_AT_decl_column(0x08)
    1140              $C$DW$84        .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1142                      .dwattr $C$DW$84, DW_AT_name("uxPriority")
    1143                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_uxPriority")
    1144                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1145                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1146                      .dwattr $C$DW$84, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1147                      .dwattr $C$DW$84, DW_AT_decl_line(0x75)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE   23

    1148                      .dwattr $C$DW$84, DW_AT_decl_column(0x19)
    1149              $C$DW$85        .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$42)
    1151                      .dwattr $C$DW$85, DW_AT_name("puxStackBuffer")
    1152                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_puxStackBuffer")
    1153                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1154                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1155                      .dwattr $C$DW$85, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1156                      .dwattr $C$DW$85, DW_AT_decl_line(0x76)
    1157                      .dwattr $C$DW$85, DW_AT_decl_column(0x12)
    1158              $C$DW$86        .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$44)
    1160                      .dwattr $C$DW$86, DW_AT_name("xRegions")
    1161                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_xRegions")
    1162                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1163                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1164                      .dwattr $C$DW$86, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1165                      .dwattr $C$DW$86, DW_AT_decl_line(0x77)
    1166                      .dwattr $C$DW$86, DW_AT_decl_column(0x10)
    1167                      .dwendtag $C$DW$T$45
    1168              
    1169                      .dwattr $C$DW$T$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1170                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x6f)
    1171                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    1172              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1173                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$45)
    1174                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1175                      .dwattr $C$DW$T$78, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1176                      .dwattr $C$DW$T$78, DW_AT_decl_line(0x78)
    1177                      .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1178                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1179              
    1180              ;***************************************************************
    1181              ;* DWARF CIE ENTRIES                                           *
    1182              ;***************************************************************
    1183              
    1184              $C$DW$CIE       .dwcie 91
    1185                      .dwcfi  cfa_register, 36
    1186                      .dwcfi  cfa_offset, 0
    1187                      .dwcfi  undefined, 0
    1188                      .dwcfi  undefined, 1
    1189                      .dwcfi  undefined, 2
    1190                      .dwcfi  undefined, 3
    1191                      .dwcfi  undefined, 4
    1192                      .dwcfi  undefined, 5
    1193                      .dwcfi  undefined, 6
    1194                      .dwcfi  undefined, 7
    1195                      .dwcfi  undefined, 8
    1196                      .dwcfi  undefined, 9
    1197                      .dwcfi  undefined, 10
    1198                      .dwcfi  undefined, 11
    1199                      .dwcfi  undefined, 12
    1200                      .dwcfi  undefined, 13
    1201                      .dwcfi  same_value, 14
    1202                      .dwcfi  same_value, 15
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
integer.asm                                                          PAGE   24

    1203                      .dwcfi  undefined, 16
    1204                      .dwcfi  undefined, 17
    1205                      .dwcfi  undefined, 18
    1206                      .dwcfi  undefined, 19
    1207                      .dwcfi  undefined, 20
    1208                      .dwcfi  undefined, 21
    1209                      .dwcfi  undefined, 22
    1210                      .dwcfi  undefined, 23
    1211                      .dwcfi  undefined, 24
    1212                      .dwcfi  undefined, 25
    1213                      .dwcfi  same_value, 26
    1214                      .dwcfi  same_value, 27
    1215                      .dwcfi  same_value, 28
    1216                      .dwcfi  same_value, 29
    1217                      .dwcfi  same_value, 30
    1218                      .dwcfi  same_value, 31
    1219                      .dwcfi  undefined, 32
    1220                      .dwcfi  undefined, 33
    1221                      .dwcfi  undefined, 34
    1222                      .dwcfi  undefined, 35
    1223                      .dwcfi  undefined, 36
    1224                      .dwcfi  undefined, 37
