TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:25 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
list.asm                                                             PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:25 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

     598                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
     599                      .dwattr $C$DW$T$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     600                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x4b)
     601                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x19)
     602              $C$DW$T$11      .dwtag  DW_TAG_base_type
     603                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     604                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     605                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     606              $C$DW$33        .dwtag  DW_TAG_TI_far_type
     607                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     608              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
     609                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$33)
     610              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
     611                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$11)
     612                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
     613                      .dwattr $C$DW$T$46, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     614                      .dwattr $C$DW$T$46, DW_AT_decl_line(0x27)
     615                      .dwattr $C$DW$T$46, DW_AT_decl_column(0x1a)
     616              $C$DW$T$12      .dwtag  DW_TAG_base_type
     617                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     618                      .dwattr $C$DW$T$12, DW_AT_name("long")
     619                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     620              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
     621                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$12)
     622                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
     623                      .dwattr $C$DW$T$47, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     624                      .dwattr $C$DW$T$47, DW_AT_decl_line(0x11)
     625                      .dwattr $C$DW$T$47, DW_AT_decl_column(0x1c)
     626              $C$DW$T$13      .dwtag  DW_TAG_base_type
     627                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     628                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     629                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     630              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     631                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$13)
     632                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     633                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     634                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x55)
     635                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
     636              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     637                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$13)
     638                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
     639                      .dwattr $C$DW$T$48, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     640                      .dwattr $C$DW$T$48, DW_AT_decl_line(0x21)
     641                      .dwattr $C$DW$T$48, DW_AT_decl_column(0x19)
     642              $C$DW$T$14      .dwtag  DW_TAG_base_type
     643                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     644                      .dwattr $C$DW$T$14, DW_AT_name("long long")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:25 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
list.asm                                                             PAGE   14

     645                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     646                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     647                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     648              $C$DW$T$15      .dwtag  DW_TAG_base_type
     649                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     650                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     651                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     652                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     653                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     654              $C$DW$T$16      .dwtag  DW_TAG_base_type
     655                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     656                      .dwattr $C$DW$T$16, DW_AT_name("float")
     657                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     658              $C$DW$T$17      .dwtag  DW_TAG_base_type
     659                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     660                      .dwattr $C$DW$T$17, DW_AT_name("double")
     661                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     662              $C$DW$T$18      .dwtag  DW_TAG_base_type
     663                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     664                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     665                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     666              
     667              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     668                      .dwattr $C$DW$T$22, DW_AT_name("xLIST_ITEM")
     669                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0a)
     670              $C$DW$34        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     672                      .dwattr $C$DW$34, DW_AT_name("xItemValue")
     673                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_xItemValue")
     674                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     675                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     676                      .dwattr $C$DW$34, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     677                      .dwattr $C$DW$34, DW_AT_decl_line(0x64)
     678                      .dwattr $C$DW$34, DW_AT_decl_column(0x0f)
     679              $C$DW$35        .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$21)
     681                      .dwattr $C$DW$35, DW_AT_name("pxNext")
     682                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_pxNext")
     683                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     684                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     685                      .dwattr $C$DW$35, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     686                      .dwattr $C$DW$35, DW_AT_decl_line(0x65)
     687                      .dwattr $C$DW$35, DW_AT_decl_column(0x1f)
     688              $C$DW$36        .dwtag  DW_TAG_member
     689                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$21)
     690                      .dwattr $C$DW$36, DW_AT_name("pxPrevious")
     691                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_pxPrevious")
     692                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     693                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     694                      .dwattr $C$DW$36, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     695                      .dwattr $C$DW$36, DW_AT_decl_line(0x66)
     696                      .dwattr $C$DW$36, DW_AT_decl_column(0x1f)
     697              $C$DW$37        .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$3)
     699                      .dwattr $C$DW$37, DW_AT_name("pvOwner")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:25 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
list.asm                                                             PAGE   15

     700                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_pvOwner")
     701                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     702                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     703                      .dwattr $C$DW$37, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     704                      .dwattr $C$DW$37, DW_AT_decl_line(0x67)
     705                      .dwattr $C$DW$37, DW_AT_decl_column(0x09)
     706              $C$DW$38        .dwtag  DW_TAG_member
     707                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$3)
     708                      .dwattr $C$DW$38, DW_AT_name("pvContainer")
     709                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_pvContainer")
     710                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     711                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     712                      .dwattr $C$DW$38, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     713                      .dwattr $C$DW$38, DW_AT_decl_line(0x68)
     714                      .dwattr $C$DW$38, DW_AT_decl_column(0x09)
     715                      .dwendtag $C$DW$T$22
     716              
     717                      .dwattr $C$DW$T$22, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     718                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x62)
     719                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x08)
     720              $C$DW$39        .dwtag  DW_TAG_TI_far_type
     721                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$22)
     722              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
     723                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$39)
     724              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
     725                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     726                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
     727              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     728                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
     729                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     730                      .dwattr $C$DW$T$25, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     731                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x6a)
     732                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x1b)
     733              $C$DW$40        .dwtag  DW_TAG_TI_far_type
     734                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$25)
     735              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
     736                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$40)
     737              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
     738                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     739                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
     740              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
     741                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$25)
     742                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
     743              
     744              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     745                      .dwattr $C$DW$T$23, DW_AT_name("xMINI_LIST_ITEM")
     746                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
     747              $C$DW$41        .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     749                      .dwattr $C$DW$41, DW_AT_name("xItemValue")
     750                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_xItemValue")
     751                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     753                      .dwattr $C$DW$41, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     754                      .dwattr $C$DW$41, DW_AT_decl_line(0x6e)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:25 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
list.asm                                                             PAGE   16

     755                      .dwattr $C$DW$41, DW_AT_decl_column(0x0f)
     756              $C$DW$42        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$21)
     758                      .dwattr $C$DW$42, DW_AT_name("pxNext")
     759                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_pxNext")
     760                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     761                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     762                      .dwattr $C$DW$42, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     763                      .dwattr $C$DW$42, DW_AT_decl_line(0x6f)
     764                      .dwattr $C$DW$42, DW_AT_decl_column(0x1e)
     765              $C$DW$43        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$21)
     767                      .dwattr $C$DW$43, DW_AT_name("pxPrevious")
     768                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_pxPrevious")
     769                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     770                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     771                      .dwattr $C$DW$43, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     772                      .dwattr $C$DW$43, DW_AT_decl_line(0x70)
     773                      .dwattr $C$DW$43, DW_AT_decl_column(0x1e)
     774                      .dwendtag $C$DW$T$23
     775              
     776                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     777                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x6c)
     778                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x08)
     779              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
     780                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
     781                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     782                      .dwattr $C$DW$T$28, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     783                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
     784                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x20)
     785              $C$DW$44        .dwtag  DW_TAG_TI_far_type
     786                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$28)
     787              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
     788                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$44)
     789              
     790              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     791                      .dwattr $C$DW$T$30, DW_AT_name("xLIST")
     792                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
     793              $C$DW$45        .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$24)
     795                      .dwattr $C$DW$45, DW_AT_name("uxNumberOfItems")
     796                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_uxNumberOfItems")
     797                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     799                      .dwattr $C$DW$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     800                      .dwattr $C$DW$45, DW_AT_decl_line(0x79)
     801                      .dwattr $C$DW$45, DW_AT_decl_column(0x22)
     802              $C$DW$46        .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$27)
     804                      .dwattr $C$DW$46, DW_AT_name("pxIndex")
     805                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_pxIndex")
     806                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     807                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     808                      .dwattr $C$DW$46, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     809                      .dwattr $C$DW$46, DW_AT_decl_line(0x7a)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:25 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
list.asm                                                             PAGE   17

     810                      .dwattr $C$DW$46, DW_AT_decl_column(0x17)
     811              $C$DW$47        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$29)
     813                      .dwattr $C$DW$47, DW_AT_name("xListEnd")
     814                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_xListEnd")
     815                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     816                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     817                      .dwattr $C$DW$47, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     818                      .dwattr $C$DW$47, DW_AT_decl_line(0x7b)
     819                      .dwattr $C$DW$47, DW_AT_decl_column(0x19)
     820                      .dwendtag $C$DW$T$30
     821              
     822                      .dwattr $C$DW$T$30, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     823                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x77)
     824                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     825              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
     826                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$30)
     827                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     828                      .dwattr $C$DW$T$34, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     829                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x7c)
     830                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x03)
     831              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     832                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
     833                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
     834              
     835              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     836                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     837              $C$DW$48        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$10)
     839                      .dwattr $C$DW$48, DW_AT_name("quot")
     840                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_quot")
     841                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     843                      .dwattr $C$DW$48, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     844                      .dwattr $C$DW$48, DW_AT_decl_line(0x12)
     845                      .dwattr $C$DW$48, DW_AT_decl_column(0x16)
     846              $C$DW$49        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$10)
     848                      .dwattr $C$DW$49, DW_AT_name("rem")
     849                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rem")
     850                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     851                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     852                      .dwattr $C$DW$49, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     853                      .dwattr $C$DW$49, DW_AT_decl_line(0x12)
     854                      .dwattr $C$DW$49, DW_AT_decl_column(0x1c)
     855                      .dwendtag $C$DW$T$31
     856              
     857                      .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     858                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x12)
     859                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
     860              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
     861                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$31)
     862                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     863                      .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     864                      .dwattr $C$DW$T$57, DW_AT_decl_line(0x12)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:25 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
list.asm                                                             PAGE   18

     865                      .dwattr $C$DW$T$57, DW_AT_decl_column(0x23)
     866              
     867              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     868                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
     869              $C$DW$50        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$12)
     871                      .dwattr $C$DW$50, DW_AT_name("quot")
     872                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_quot")
     873                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     875                      .dwattr $C$DW$50, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     876                      .dwattr $C$DW$50, DW_AT_decl_line(0x14)
     877                      .dwattr $C$DW$50, DW_AT_decl_column(0x17)
     878              $C$DW$51        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$12)
     880                      .dwattr $C$DW$51, DW_AT_name("rem")
     881                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rem")
     882                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     883                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     884                      .dwattr $C$DW$51, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     885                      .dwattr $C$DW$51, DW_AT_decl_line(0x14)
     886                      .dwattr $C$DW$51, DW_AT_decl_column(0x1d)
     887                      .dwendtag $C$DW$T$32
     888              
     889                      .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     890                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x14)
     891                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
     892              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
     893                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$32)
     894                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
     895                      .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     896                      .dwattr $C$DW$T$58, DW_AT_decl_line(0x14)
     897                      .dwattr $C$DW$T$58, DW_AT_decl_column(0x24)
     898              
     899              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     900                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
     901              $C$DW$52        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$14)
     903                      .dwattr $C$DW$52, DW_AT_name("quot")
     904                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_quot")
     905                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     907                      .dwattr $C$DW$52, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     908                      .dwattr $C$DW$52, DW_AT_decl_line(0x17)
     909                      .dwattr $C$DW$52, DW_AT_decl_column(0x1c)
     910              $C$DW$53        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$14)
     912                      .dwattr $C$DW$53, DW_AT_name("rem")
     913                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rem")
     914                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     915                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     916                      .dwattr $C$DW$53, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     917                      .dwattr $C$DW$53, DW_AT_decl_line(0x17)
     918                      .dwattr $C$DW$53, DW_AT_decl_column(0x22)
     919                      .dwendtag $C$DW$T$33
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:25 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
list.asm                                                             PAGE   19

     920              
     921                      .dwattr $C$DW$T$33, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     922                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x17)
     923                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
     924              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
     925                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$33)
     926                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     927                      .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     928                      .dwattr $C$DW$T$59, DW_AT_decl_line(0x17)
     929                      .dwattr $C$DW$T$59, DW_AT_decl_column(0x29)
     930                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
     931              
     932              ;***************************************************************
     933              ;* DWARF CIE ENTRIES                                           *
     934              ;***************************************************************
     935              
     936              $C$DW$CIE       .dwcie 91
     937                      .dwcfi  cfa_register, 36
     938                      .dwcfi  cfa_offset, 0
     939                      .dwcfi  undefined, 0
     940                      .dwcfi  undefined, 1
     941                      .dwcfi  undefined, 2
     942                      .dwcfi  undefined, 3
     943                      .dwcfi  undefined, 4
     944                      .dwcfi  undefined, 5
     945                      .dwcfi  undefined, 6
     946                      .dwcfi  undefined, 7
     947                      .dwcfi  undefined, 8
     948                      .dwcfi  undefined, 9
     949                      .dwcfi  undefined, 10
     950                      .dwcfi  undefined, 11
     951                      .dwcfi  undefined, 12
     952                      .dwcfi  undefined, 13
     953                      .dwcfi  same_value, 14
     954                      .dwcfi  same_value, 15
     955                      .dwcfi  undefined, 16
     956                      .dwcfi  undefined, 17
     957                      .dwcfi  undefined, 18
     958                      .dwcfi  undefined, 19
     959                      .dwcfi  undefined, 20
     960                      .dwcfi  undefined, 21
     961                      .dwcfi  undefined, 22
     962                      .dwcfi  undefined, 23
     963                      .dwcfi  undefined, 24
     964                      .dwcfi  undefined, 25
     965                      .dwcfi  same_value, 26
     966                      .dwcfi  same_value, 27
     967                      .dwcfi  same_value, 28
     968                      .dwcfi  same_value, 29
     969                      .dwcfi  same_value, 30
     970                      .dwcfi  same_value, 31
     971                      .dwcfi  undefined, 32
     972                      .dwcfi  undefined, 33
     973                      .dwcfi  undefined, 34
     974                      .dwcfi  undefined, 35
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:25 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
