TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:31 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   37

    1787                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$13)
    1788                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1789                      .dwattr $C$DW$T$86, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1790                      .dwattr $C$DW$T$86, DW_AT_decl_line(0xf2)
    1791                      .dwattr $C$DW$T$86, DW_AT_decl_column(0x1a)
    1792              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
    1793                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$13)
    1794                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1795                      .dwattr $C$DW$T$87, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/inc/data_types.h")
    1796                      .dwattr $C$DW$T$87, DW_AT_decl_line(0x18)
    1797                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x1d)
    1798              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1799                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1800                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1801                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1802                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1803                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1804              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    1805                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$14)
    1806                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1807                      .dwattr $C$DW$T$88, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1808                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x228)
    1809                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x13)
    1810              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("Int40")
    1811                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$14)
    1812                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1813                      .dwattr $C$DW$T$89, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/inc/data_types.h")
    1814                      .dwattr $C$DW$T$89, DW_AT_decl_line(0x16)
    1815                      .dwattr $C$DW$T$89, DW_AT_decl_column(0x1d)
    1816              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1817                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1818                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1819                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1820                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1821                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1822              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    1823                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$15)
    1824                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1825                      .dwattr $C$DW$T$90, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1826                      .dwattr $C$DW$T$90, DW_AT_decl_line(0x229)
    1827                      .dwattr $C$DW$T$90, DW_AT_decl_column(0x14)
    1828              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("Uint40")
    1829                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$15)
    1830                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1831                      .dwattr $C$DW$T$91, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/inc/data_types.h")
    1832                      .dwattr $C$DW$T$91, DW_AT_decl_line(0x19)
    1833                      .dwattr $C$DW$T$91, DW_AT_decl_column(0x1d)
    1834              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1835                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1836                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1837                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1838              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("Float32")
    1839                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$16)
    1840                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1841                      .dwattr $C$DW$T$92, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/inc/data_types.h")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   38

    1842                      .dwattr $C$DW$T$92, DW_AT_decl_line(0x1a)
    1843                      .dwattr $C$DW$T$92, DW_AT_decl_column(0x1d)
    1844              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1845                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1846                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1847                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1848              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1849                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1850                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1851                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1852              
    1853              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1854                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
    1855              $C$DW$109       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$10)
    1857                      .dwattr $C$DW$109, DW_AT_name("fd")
    1858                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_fd")
    1859                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1860                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1861                      .dwattr $C$DW$109, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1862                      .dwattr $C$DW$109, DW_AT_decl_line(0x1d)
    1863                      .dwattr $C$DW$109, DW_AT_decl_column(0x0b)
    1864              $C$DW$110       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1866                      .dwattr $C$DW$110, DW_AT_name("buf")
    1867                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_buf")
    1868                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1869                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1870                      .dwattr $C$DW$110, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1871                      .dwattr $C$DW$110, DW_AT_decl_line(0x1e)
    1872                      .dwattr $C$DW$110, DW_AT_decl_column(0x16)
    1873              $C$DW$111       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$111, DW_AT_name("pos")
    1876                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_pos")
    1877                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1878                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1879                      .dwattr $C$DW$111, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1880                      .dwattr $C$DW$111, DW_AT_decl_line(0x1f)
    1881                      .dwattr $C$DW$111, DW_AT_decl_column(0x16)
    1882              $C$DW$112       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1884                      .dwattr $C$DW$112, DW_AT_name("bufend")
    1885                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bufend")
    1886                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1887                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1888                      .dwattr $C$DW$112, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1889                      .dwattr $C$DW$112, DW_AT_decl_line(0x20)
    1890                      .dwattr $C$DW$112, DW_AT_decl_column(0x16)
    1891              $C$DW$113       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1893                      .dwattr $C$DW$113, DW_AT_name("buff_stop")
    1894                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_buff_stop")
    1895                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1896                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   39

    1897                      .dwattr $C$DW$113, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1898                      .dwattr $C$DW$113, DW_AT_decl_line(0x21)
    1899                      .dwattr $C$DW$113, DW_AT_decl_column(0x16)
    1900              $C$DW$114       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1902                      .dwattr $C$DW$114, DW_AT_name("flags")
    1903                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_flags")
    1904                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1905                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1906                      .dwattr $C$DW$114, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1907                      .dwattr $C$DW$114, DW_AT_decl_line(0x22)
    1908                      .dwattr $C$DW$114, DW_AT_decl_column(0x16)
    1909                      .dwendtag $C$DW$T$20
    1910              
    1911                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1912                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x1c)
    1913                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    1914              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    1915                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$20)
    1916                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1917                      .dwattr $C$DW$T$93, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1918                      .dwattr $C$DW$T$93, DW_AT_decl_line(0x23)
    1919                      .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    1920              
    1921              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1922                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
    1923              $C$DW$115       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$10)
    1925                      .dwattr $C$DW$115, DW_AT_name("quot")
    1926                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_quot")
    1927                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1929                      .dwattr $C$DW$115, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1930                      .dwattr $C$DW$115, DW_AT_decl_line(0x12)
    1931                      .dwattr $C$DW$115, DW_AT_decl_column(0x16)
    1932              $C$DW$116       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$10)
    1934                      .dwattr $C$DW$116, DW_AT_name("rem")
    1935                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rem")
    1936                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1937                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1938                      .dwattr $C$DW$116, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1939                      .dwattr $C$DW$116, DW_AT_decl_line(0x12)
    1940                      .dwattr $C$DW$116, DW_AT_decl_column(0x1c)
    1941                      .dwendtag $C$DW$T$21
    1942              
    1943                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1944                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x12)
    1945                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1946              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    1947                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$21)
    1948                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    1949                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1950                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x12)
    1951                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x23)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   40

    1952              
    1953              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1954                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1955              $C$DW$117       .dwtag  DW_TAG_member
    1956                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$12)
    1957                      .dwattr $C$DW$117, DW_AT_name("quot")
    1958                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_quot")
    1959                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1960                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1961                      .dwattr $C$DW$117, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1962                      .dwattr $C$DW$117, DW_AT_decl_line(0x14)
    1963                      .dwattr $C$DW$117, DW_AT_decl_column(0x17)
    1964              $C$DW$118       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$12)
    1966                      .dwattr $C$DW$118, DW_AT_name("rem")
    1967                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rem")
    1968                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1969                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1970                      .dwattr $C$DW$118, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1971                      .dwattr $C$DW$118, DW_AT_decl_line(0x14)
    1972                      .dwattr $C$DW$118, DW_AT_decl_column(0x1d)
    1973                      .dwendtag $C$DW$T$22
    1974              
    1975                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1976                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x14)
    1977                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    1978              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    1979                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$22)
    1980                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1981                      .dwattr $C$DW$T$95, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1982                      .dwattr $C$DW$T$95, DW_AT_decl_line(0x14)
    1983                      .dwattr $C$DW$T$95, DW_AT_decl_column(0x24)
    1984              
    1985              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1986                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    1987              $C$DW$119       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$14)
    1989                      .dwattr $C$DW$119, DW_AT_name("quot")
    1990                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_quot")
    1991                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1993                      .dwattr $C$DW$119, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1994                      .dwattr $C$DW$119, DW_AT_decl_line(0x17)
    1995                      .dwattr $C$DW$119, DW_AT_decl_column(0x1c)
    1996              $C$DW$120       .dwtag  DW_TAG_member
    1997                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$14)
    1998                      .dwattr $C$DW$120, DW_AT_name("rem")
    1999                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rem")
    2000                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2001                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2002                      .dwattr $C$DW$120, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2003                      .dwattr $C$DW$120, DW_AT_decl_line(0x17)
    2004                      .dwattr $C$DW$120, DW_AT_decl_column(0x22)
    2005                      .dwendtag $C$DW$T$23
    2006              
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   41

    2007                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2008                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x17)
    2009                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    2010              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    2011                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$23)
    2012                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2013                      .dwattr $C$DW$T$96, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2014                      .dwattr $C$DW$T$96, DW_AT_decl_line(0x17)
    2015                      .dwattr $C$DW$T$96, DW_AT_decl_column(0x29)
    2016              
    2017              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2018                      .dwattr $C$DW$T$27, DW_AT_name("xLIST_ITEM")
    2019                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    2020              $C$DW$121       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$24)
    2022                      .dwattr $C$DW$121, DW_AT_name("xItemValue")
    2023                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_xItemValue")
    2024                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2025                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2026                      .dwattr $C$DW$121, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2027                      .dwattr $C$DW$121, DW_AT_decl_line(0x64)
    2028                      .dwattr $C$DW$121, DW_AT_decl_column(0x0f)
    2029              $C$DW$122       .dwtag  DW_TAG_member
    2030                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$26)
    2031                      .dwattr $C$DW$122, DW_AT_name("pxNext")
    2032                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_pxNext")
    2033                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2034                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2035                      .dwattr $C$DW$122, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2036                      .dwattr $C$DW$122, DW_AT_decl_line(0x65)
    2037                      .dwattr $C$DW$122, DW_AT_decl_column(0x1f)
    2038              $C$DW$123       .dwtag  DW_TAG_member
    2039                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$26)
    2040                      .dwattr $C$DW$123, DW_AT_name("pxPrevious")
    2041                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_pxPrevious")
    2042                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2043                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2044                      .dwattr $C$DW$123, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2045                      .dwattr $C$DW$123, DW_AT_decl_line(0x66)
    2046                      .dwattr $C$DW$123, DW_AT_decl_column(0x1f)
    2047              $C$DW$124       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$3)
    2049                      .dwattr $C$DW$124, DW_AT_name("pvOwner")
    2050                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_pvOwner")
    2051                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2052                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2053                      .dwattr $C$DW$124, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2054                      .dwattr $C$DW$124, DW_AT_decl_line(0x67)
    2055                      .dwattr $C$DW$124, DW_AT_decl_column(0x09)
    2056              $C$DW$125       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$3)
    2058                      .dwattr $C$DW$125, DW_AT_name("pvContainer")
    2059                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_pvContainer")
    2060                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2061                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   42

    2062                      .dwattr $C$DW$125, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2063                      .dwattr $C$DW$125, DW_AT_decl_line(0x68)
    2064                      .dwattr $C$DW$125, DW_AT_decl_column(0x09)
    2065                      .dwendtag $C$DW$T$27
    2066              
    2067                      .dwattr $C$DW$T$27, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2068                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x62)
    2069                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x08)
    2070              $C$DW$126       .dwtag  DW_TAG_TI_far_type
    2071                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$27)
    2072              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    2073                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$126)
    2074              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2075                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2076                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    2077              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    2078                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    2079                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2080                      .dwattr $C$DW$T$30, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2081                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x6a)
    2082                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x1b)
    2083              $C$DW$127       .dwtag  DW_TAG_TI_far_type
    2084                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$30)
    2085              $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    2086                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$127)
    2087              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    2088                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    2089                      .dwattr $C$DW$T$32, DW_AT_address_class(0x17)
    2090              
    2091              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2092                      .dwattr $C$DW$T$28, DW_AT_name("xMINI_LIST_ITEM")
    2093                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x06)
    2094              $C$DW$128       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$24)
    2096                      .dwattr $C$DW$128, DW_AT_name("xItemValue")
    2097                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_xItemValue")
    2098                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2100                      .dwattr $C$DW$128, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2101                      .dwattr $C$DW$128, DW_AT_decl_line(0x6e)
    2102                      .dwattr $C$DW$128, DW_AT_decl_column(0x0f)
    2103              $C$DW$129       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$26)
    2105                      .dwattr $C$DW$129, DW_AT_name("pxNext")
    2106                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_pxNext")
    2107                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2108                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2109                      .dwattr $C$DW$129, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2110                      .dwattr $C$DW$129, DW_AT_decl_line(0x6f)
    2111                      .dwattr $C$DW$129, DW_AT_decl_column(0x1e)
    2112              $C$DW$130       .dwtag  DW_TAG_member
    2113                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$26)
    2114                      .dwattr $C$DW$130, DW_AT_name("pxPrevious")
    2115                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_pxPrevious")
    2116                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   43

    2117                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2118                      .dwattr $C$DW$130, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2119                      .dwattr $C$DW$130, DW_AT_decl_line(0x70)
    2120                      .dwattr $C$DW$130, DW_AT_decl_column(0x1e)
    2121                      .dwendtag $C$DW$T$28
    2122              
    2123                      .dwattr $C$DW$T$28, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2124                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x6c)
    2125                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x08)
    2126              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    2127                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$28)
    2128                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2129                      .dwattr $C$DW$T$33, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2130                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x72)
    2131                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x20)
    2132              $C$DW$131       .dwtag  DW_TAG_TI_far_type
    2133                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$33)
    2134              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    2135                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$131)
    2136              
    2137              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2138                      .dwattr $C$DW$T$35, DW_AT_name("xLIST")
    2139                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
    2140              $C$DW$132       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$29)
    2142                      .dwattr $C$DW$132, DW_AT_name("uxNumberOfItems")
    2143                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_uxNumberOfItems")
    2144                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2146                      .dwattr $C$DW$132, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2147                      .dwattr $C$DW$132, DW_AT_decl_line(0x79)
    2148                      .dwattr $C$DW$132, DW_AT_decl_column(0x22)
    2149              $C$DW$133       .dwtag  DW_TAG_member
    2150                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$32)
    2151                      .dwattr $C$DW$133, DW_AT_name("pxIndex")
    2152                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_pxIndex")
    2153                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2154                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2155                      .dwattr $C$DW$133, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2156                      .dwattr $C$DW$133, DW_AT_decl_line(0x7a)
    2157                      .dwattr $C$DW$133, DW_AT_decl_column(0x17)
    2158              $C$DW$134       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$34)
    2160                      .dwattr $C$DW$134, DW_AT_name("xListEnd")
    2161                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_xListEnd")
    2162                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2163                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2164                      .dwattr $C$DW$134, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2165                      .dwattr $C$DW$134, DW_AT_decl_line(0x7b)
    2166                      .dwattr $C$DW$134, DW_AT_decl_column(0x19)
    2167                      .dwendtag $C$DW$T$35
    2168              
    2169                      .dwattr $C$DW$T$35, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2170                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x77)
    2171                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   44

    2172              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    2173                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$35)
    2174                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2175                      .dwattr $C$DW$T$97, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2176                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x7c)
    2177                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x03)
    2178              
    2179              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2180                      .dwattr $C$DW$T$36, DW_AT_name("xTIME_OUT")
    2181                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2182              $C$DW$135       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$10)
    2184                      .dwattr $C$DW$135, DW_AT_name("xOverflowCount")
    2185                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_xOverflowCount")
    2186                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2187                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2188                      .dwattr $C$DW$135, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2189                      .dwattr $C$DW$135, DW_AT_decl_line(0x5e)
    2190                      .dwattr $C$DW$135, DW_AT_decl_column(0x10)
    2191              $C$DW$136       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$24)
    2193                      .dwattr $C$DW$136, DW_AT_name("xTimeOnEntering")
    2194                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_xTimeOnEntering")
    2195                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2196                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2197                      .dwattr $C$DW$136, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2198                      .dwattr $C$DW$136, DW_AT_decl_line(0x5f)
    2199                      .dwattr $C$DW$136, DW_AT_decl_column(0x10)
    2200                      .dwendtag $C$DW$T$36
    2201              
    2202                      .dwattr $C$DW$T$36, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2203                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x5c)
    2204                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    2205              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    2206                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$36)
    2207                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2208                      .dwattr $C$DW$T$98, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2209                      .dwattr $C$DW$T$98, DW_AT_decl_line(0x60)
    2210                      .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    2211              
    2212              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2213                      .dwattr $C$DW$T$37, DW_AT_name("xMEMORY_REGION")
    2214                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    2215              $C$DW$137       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$3)
    2217                      .dwattr $C$DW$137, DW_AT_name("pvBaseAddress")
    2218                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_pvBaseAddress")
    2219                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2221                      .dwattr $C$DW$137, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2222                      .dwattr $C$DW$137, DW_AT_decl_line(0x67)
    2223                      .dwattr $C$DW$137, DW_AT_decl_column(0x08)
    2224              $C$DW$138       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$13)
    2226                      .dwattr $C$DW$138, DW_AT_name("ulLengthInBytes")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   45

    2227                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ulLengthInBytes")
    2228                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2229                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2230                      .dwattr $C$DW$138, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2231                      .dwattr $C$DW$138, DW_AT_decl_line(0x68)
    2232                      .dwattr $C$DW$138, DW_AT_decl_column(0x10)
    2233              $C$DW$139       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$13)
    2235                      .dwattr $C$DW$139, DW_AT_name("ulParameters")
    2236                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ulParameters")
    2237                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2238                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2239                      .dwattr $C$DW$139, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2240                      .dwattr $C$DW$139, DW_AT_decl_line(0x69)
    2241                      .dwattr $C$DW$139, DW_AT_decl_column(0x10)
    2242                      .dwendtag $C$DW$T$37
    2243              
    2244                      .dwattr $C$DW$T$37, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2245                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x65)
    2246                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    2247              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    2248                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$37)
    2249                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2250                      .dwattr $C$DW$T$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2251                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x6a)
    2252                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    2253              
    2254              $C$DW$T$46      .dwtag  DW_TAG_array_type
    2255                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2256                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2257                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x06)
    2258              $C$DW$140       .dwtag  DW_TAG_subrange_type
    2259                      .dwattr $C$DW$140, DW_AT_upper_bound(0x00)
    2260                      .dwendtag $C$DW$T$46
    2261              
    2262              
    2263              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2264                      .dwattr $C$DW$T$47, DW_AT_name("xTASK_PARAMTERS")
    2265                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x12)
    2266              $C$DW$141       .dwtag  DW_TAG_member
    2267                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$40)
    2268                      .dwattr $C$DW$141, DW_AT_name("pvTaskCode")
    2269                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_pvTaskCode")
    2270                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2271                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2272                      .dwattr $C$DW$141, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2273                      .dwattr $C$DW$141, DW_AT_decl_line(0x71)
    2274                      .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    2275              $C$DW$142       .dwtag  DW_TAG_member
    2276                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$43)
    2277                      .dwattr $C$DW$142, DW_AT_name("pcName")
    2278                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_pcName")
    2279                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2280                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2281                      .dwattr $C$DW$142, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   46

    2282                      .dwattr $C$DW$142, DW_AT_decl_line(0x72)
    2283                      .dwattr $C$DW$142, DW_AT_decl_column(0x1c)
    2284              $C$DW$143       .dwtag  DW_TAG_member
    2285                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$9)
    2286                      .dwattr $C$DW$143, DW_AT_name("usStackDepth")
    2287                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_usStackDepth")
    2288                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2289                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2290                      .dwattr $C$DW$143, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2291                      .dwattr $C$DW$143, DW_AT_decl_line(0x73)
    2292                      .dwattr $C$DW$143, DW_AT_decl_column(0x11)
    2293              $C$DW$144       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$3)
    2295                      .dwattr $C$DW$144, DW_AT_name("pvParameters")
    2296                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_pvParameters")
    2297                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2298                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2299                      .dwattr $C$DW$144, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2300                      .dwattr $C$DW$144, DW_AT_decl_line(0x74)
    2301                      .dwattr $C$DW$144, DW_AT_decl_column(0x08)
    2302              $C$DW$145       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$11)
    2304                      .dwattr $C$DW$145, DW_AT_name("uxPriority")
    2305                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_uxPriority")
    2306                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2307                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2308                      .dwattr $C$DW$145, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2309                      .dwattr $C$DW$145, DW_AT_decl_line(0x75)
    2310                      .dwattr $C$DW$145, DW_AT_decl_column(0x19)
    2311              $C$DW$146       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$44)
    2313                      .dwattr $C$DW$146, DW_AT_name("puxStackBuffer")
    2314                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_puxStackBuffer")
    2315                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2316                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2317                      .dwattr $C$DW$146, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2318                      .dwattr $C$DW$146, DW_AT_decl_line(0x76)
    2319                      .dwattr $C$DW$146, DW_AT_decl_column(0x12)
    2320              $C$DW$147       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$46)
    2322                      .dwattr $C$DW$147, DW_AT_name("xRegions")
    2323                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_xRegions")
    2324                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2325                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2326                      .dwattr $C$DW$147, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2327                      .dwattr $C$DW$147, DW_AT_decl_line(0x77)
    2328                      .dwattr $C$DW$147, DW_AT_decl_column(0x10)
    2329                      .dwendtag $C$DW$T$47
    2330              
    2331                      .dwattr $C$DW$T$47, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2332                      .dwattr $C$DW$T$47, DW_AT_decl_line(0x6f)
    2333                      .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    2334              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    2335                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$47)
    2336                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
main.asm                                                             PAGE   47

    2337                      .dwattr $C$DW$T$99, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2338                      .dwattr $C$DW$T$99, DW_AT_decl_line(0x78)
    2339                      .dwattr $C$DW$T$99, DW_AT_decl_column(0x03)
    2340              $C$DW$T$100     .dwtag  DW_TAG_base_type
    2341                      .dwattr $C$DW$T$100, DW_AT_encoding(DW_ATE_signed_char)
    2342                      .dwattr $C$DW$T$100, DW_AT_name("signed char")
    2343                      .dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
    2344              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    2345                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    2346                      .dwattr $C$DW$T$101, DW_AT_address_class(0x17)
    2347              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    2348                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    2349                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    2350                      .dwattr $C$DW$T$102, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    2351                      .dwattr $C$DW$T$102, DW_AT_decl_line(0x0d)
    2352                      .dwattr $C$DW$T$102, DW_AT_decl_column(0x0f)
    2353              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("_Va_list")
    2354                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    2355                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    2356                      .dwattr $C$DW$T$103, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    2357                      .dwattr $C$DW$T$103, DW_AT_decl_line(0x280)
    2358                      .dwattr $C$DW$T$103, DW_AT_decl_column(0x17)
    2359              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("_Sysch_t")
    2360                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$100)
    2361                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    2362                      .dwattr $C$DW$T$104, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    2363                      .dwattr $C$DW$T$104, DW_AT_decl_line(0x2a1)
    2364                      .dwattr $C$DW$T$104, DW_AT_decl_column(0x0e)
    2365                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2366              
    2367              ;***************************************************************
    2368              ;* DWARF CIE ENTRIES                                           *
    2369              ;***************************************************************
    2370              
    2371              $C$DW$CIE       .dwcie 91
