TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
ParTest.asm                                                          PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:31 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

     696                      .dwattr $C$DW$T$65, DW_AT_decl_line(0x11)
     697                      .dwattr $C$DW$T$65, DW_AT_decl_column(0x1c)
     698              $C$DW$T$13      .dwtag  DW_TAG_base_type
     699                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     700                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     701                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     702              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     703                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$13)
     704                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
     705                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     706                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x55)
     707                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
     708              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
     709                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$13)
     710                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     711                      .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     712                      .dwattr $C$DW$T$66, DW_AT_decl_line(0xe4)
     713                      .dwattr $C$DW$T$66, DW_AT_decl_column(0x17)
     714              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
     715                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$13)
     716                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     717                      .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     718                      .dwattr $C$DW$T$67, DW_AT_decl_line(0xf2)
     719                      .dwattr $C$DW$T$67, DW_AT_decl_column(0x1a)
     720              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     721                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$13)
     722                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     723                      .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     724                      .dwattr $C$DW$T$68, DW_AT_decl_line(0x15)
     725                      .dwattr $C$DW$T$68, DW_AT_decl_column(0x19)
     726              $C$DW$T$14      .dwtag  DW_TAG_base_type
     727                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     728                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     729                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     730                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     731                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     732              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
     733                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$14)
     734                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     735                      .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     736                      .dwattr $C$DW$T$69, DW_AT_decl_line(0x228)
     737                      .dwattr $C$DW$T$69, DW_AT_decl_column(0x13)
     738              $C$DW$T$15      .dwtag  DW_TAG_base_type
     739                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     740                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     741                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
ParTest.asm                                                          PAGE   15

     742                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     743                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     744              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
     745                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$15)
     746                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
     747                      .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     748                      .dwattr $C$DW$T$70, DW_AT_decl_line(0x229)
     749                      .dwattr $C$DW$T$70, DW_AT_decl_column(0x14)
     750              $C$DW$T$16      .dwtag  DW_TAG_base_type
     751                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     752                      .dwattr $C$DW$T$16, DW_AT_name("float")
     753                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     754              $C$DW$T$17      .dwtag  DW_TAG_base_type
     755                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     756                      .dwattr $C$DW$T$17, DW_AT_name("double")
     757                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     758              $C$DW$T$18      .dwtag  DW_TAG_base_type
     759                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     760                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     761                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     762              
     763              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     764                      .dwattr $C$DW$T$22, DW_AT_name("xLIST_ITEM")
     765                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0a)
     766              $C$DW$39        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$39, DW_AT_name("xItemValue")
     769                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_xItemValue")
     770                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     771                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     772                      .dwattr $C$DW$39, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     773                      .dwattr $C$DW$39, DW_AT_decl_line(0x64)
     774                      .dwattr $C$DW$39, DW_AT_decl_column(0x0f)
     775              $C$DW$40        .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$21)
     777                      .dwattr $C$DW$40, DW_AT_name("pxNext")
     778                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_pxNext")
     779                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     780                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     781                      .dwattr $C$DW$40, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     782                      .dwattr $C$DW$40, DW_AT_decl_line(0x65)
     783                      .dwattr $C$DW$40, DW_AT_decl_column(0x1f)
     784              $C$DW$41        .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$21)
     786                      .dwattr $C$DW$41, DW_AT_name("pxPrevious")
     787                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_pxPrevious")
     788                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     789                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     790                      .dwattr $C$DW$41, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     791                      .dwattr $C$DW$41, DW_AT_decl_line(0x66)
     792                      .dwattr $C$DW$41, DW_AT_decl_column(0x1f)
     793              $C$DW$42        .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$3)
     795                      .dwattr $C$DW$42, DW_AT_name("pvOwner")
     796                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_pvOwner")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
ParTest.asm                                                          PAGE   16

     797                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     798                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     799                      .dwattr $C$DW$42, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     800                      .dwattr $C$DW$42, DW_AT_decl_line(0x67)
     801                      .dwattr $C$DW$42, DW_AT_decl_column(0x09)
     802              $C$DW$43        .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$3)
     804                      .dwattr $C$DW$43, DW_AT_name("pvContainer")
     805                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_pvContainer")
     806                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     807                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     808                      .dwattr $C$DW$43, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     809                      .dwattr $C$DW$43, DW_AT_decl_line(0x68)
     810                      .dwattr $C$DW$43, DW_AT_decl_column(0x09)
     811                      .dwendtag $C$DW$T$22
     812              
     813                      .dwattr $C$DW$T$22, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     814                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x62)
     815                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x08)
     816              $C$DW$44        .dwtag  DW_TAG_TI_far_type
     817                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$22)
     818              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
     819                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$44)
     820              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
     821                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     822                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
     823              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     824                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
     825                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     826                      .dwattr $C$DW$T$25, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     827                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x6a)
     828                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x1b)
     829              $C$DW$45        .dwtag  DW_TAG_TI_far_type
     830                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$25)
     831              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
     832                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$45)
     833              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
     834                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     835                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
     836              
     837              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     838                      .dwattr $C$DW$T$23, DW_AT_name("xMINI_LIST_ITEM")
     839                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
     840              $C$DW$46        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     842                      .dwattr $C$DW$46, DW_AT_name("xItemValue")
     843                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_xItemValue")
     844                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     846                      .dwattr $C$DW$46, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     847                      .dwattr $C$DW$46, DW_AT_decl_line(0x6e)
     848                      .dwattr $C$DW$46, DW_AT_decl_column(0x0f)
     849              $C$DW$47        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$21)
     851                      .dwattr $C$DW$47, DW_AT_name("pxNext")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
ParTest.asm                                                          PAGE   17

     852                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_pxNext")
     853                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     854                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     855                      .dwattr $C$DW$47, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     856                      .dwattr $C$DW$47, DW_AT_decl_line(0x6f)
     857                      .dwattr $C$DW$47, DW_AT_decl_column(0x1e)
     858              $C$DW$48        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$21)
     860                      .dwattr $C$DW$48, DW_AT_name("pxPrevious")
     861                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_pxPrevious")
     862                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     863                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     864                      .dwattr $C$DW$48, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     865                      .dwattr $C$DW$48, DW_AT_decl_line(0x70)
     866                      .dwattr $C$DW$48, DW_AT_decl_column(0x1e)
     867                      .dwendtag $C$DW$T$23
     868              
     869                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     870                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x6c)
     871                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x08)
     872              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
     873                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
     874                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     875                      .dwattr $C$DW$T$28, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     876                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
     877                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x20)
     878              $C$DW$49        .dwtag  DW_TAG_TI_far_type
     879                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$28)
     880              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
     881                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$49)
     882              
     883              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     884                      .dwattr $C$DW$T$30, DW_AT_name("xLIST")
     885                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
     886              $C$DW$50        .dwtag  DW_TAG_member
     887                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$24)
     888                      .dwattr $C$DW$50, DW_AT_name("uxNumberOfItems")
     889                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_uxNumberOfItems")
     890                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     891                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     892                      .dwattr $C$DW$50, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     893                      .dwattr $C$DW$50, DW_AT_decl_line(0x79)
     894                      .dwattr $C$DW$50, DW_AT_decl_column(0x22)
     895              $C$DW$51        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$27)
     897                      .dwattr $C$DW$51, DW_AT_name("pxIndex")
     898                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_pxIndex")
     899                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     900                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     901                      .dwattr $C$DW$51, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     902                      .dwattr $C$DW$51, DW_AT_decl_line(0x7a)
     903                      .dwattr $C$DW$51, DW_AT_decl_column(0x17)
     904              $C$DW$52        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$29)
     906                      .dwattr $C$DW$52, DW_AT_name("xListEnd")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
ParTest.asm                                                          PAGE   18

     907                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_xListEnd")
     908                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     909                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     910                      .dwattr $C$DW$52, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     911                      .dwattr $C$DW$52, DW_AT_decl_line(0x7b)
     912                      .dwattr $C$DW$52, DW_AT_decl_column(0x19)
     913                      .dwendtag $C$DW$T$30
     914              
     915                      .dwattr $C$DW$T$30, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     916                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x77)
     917                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     918              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
     919                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$30)
     920                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     921                      .dwattr $C$DW$T$71, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     922                      .dwattr $C$DW$T$71, DW_AT_decl_line(0x7c)
     923                      .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
     924              
     925              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     926                      .dwattr $C$DW$T$31, DW_AT_name("xTIME_OUT")
     927                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
     928              $C$DW$53        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$10)
     930                      .dwattr $C$DW$53, DW_AT_name("xOverflowCount")
     931                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_xOverflowCount")
     932                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     934                      .dwattr $C$DW$53, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     935                      .dwattr $C$DW$53, DW_AT_decl_line(0x5e)
     936                      .dwattr $C$DW$53, DW_AT_decl_column(0x10)
     937              $C$DW$54        .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     939                      .dwattr $C$DW$54, DW_AT_name("xTimeOnEntering")
     940                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_xTimeOnEntering")
     941                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     942                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     943                      .dwattr $C$DW$54, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     944                      .dwattr $C$DW$54, DW_AT_decl_line(0x5f)
     945                      .dwattr $C$DW$54, DW_AT_decl_column(0x10)
     946                      .dwendtag $C$DW$T$31
     947              
     948                      .dwattr $C$DW$T$31, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     949                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x5c)
     950                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
     951              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
     952                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$31)
     953                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
     954                      .dwattr $C$DW$T$72, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     955                      .dwattr $C$DW$T$72, DW_AT_decl_line(0x60)
     956                      .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
     957              
     958              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     959                      .dwattr $C$DW$T$32, DW_AT_name("xMEMORY_REGION")
     960                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x06)
     961              $C$DW$55        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
ParTest.asm                                                          PAGE   19

     962                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$3)
     963                      .dwattr $C$DW$55, DW_AT_name("pvBaseAddress")
     964                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_pvBaseAddress")
     965                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     967                      .dwattr $C$DW$55, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     968                      .dwattr $C$DW$55, DW_AT_decl_line(0x67)
     969                      .dwattr $C$DW$55, DW_AT_decl_column(0x08)
     970              $C$DW$56        .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$13)
     972                      .dwattr $C$DW$56, DW_AT_name("ulLengthInBytes")
     973                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_ulLengthInBytes")
     974                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     975                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     976                      .dwattr $C$DW$56, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     977                      .dwattr $C$DW$56, DW_AT_decl_line(0x68)
     978                      .dwattr $C$DW$56, DW_AT_decl_column(0x10)
     979              $C$DW$57        .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$13)
     981                      .dwattr $C$DW$57, DW_AT_name("ulParameters")
     982                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_ulParameters")
     983                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     984                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     985                      .dwattr $C$DW$57, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
     986                      .dwattr $C$DW$57, DW_AT_decl_line(0x69)
     987                      .dwattr $C$DW$57, DW_AT_decl_column(0x10)
     988                      .dwendtag $C$DW$T$32
     989              
     990                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     991                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x65)
     992                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
     993              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
     994                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$32)
     995                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     996                      .dwattr $C$DW$T$40, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
     997                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x6a)
     998                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x03)
     999              
    1000              $C$DW$T$41      .dwtag  DW_TAG_array_type
    1001                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1002                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1003                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x06)
    1004              $C$DW$58        .dwtag  DW_TAG_subrange_type
    1005                      .dwattr $C$DW$58, DW_AT_upper_bound(0x00)
    1006                      .dwendtag $C$DW$T$41
    1007              
    1008              
    1009              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1010                      .dwattr $C$DW$T$42, DW_AT_name("xTASK_PARAMTERS")
    1011                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x12)
    1012              $C$DW$59        .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$35)
    1014                      .dwattr $C$DW$59, DW_AT_name("pvTaskCode")
    1015                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_pvTaskCode")
    1016                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
ParTest.asm                                                          PAGE   20

    1017                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1018                      .dwattr $C$DW$59, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1019                      .dwattr $C$DW$59, DW_AT_decl_line(0x71)
    1020                      .dwattr $C$DW$59, DW_AT_decl_column(0x0e)
    1021              $C$DW$60        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$38)
    1023                      .dwattr $C$DW$60, DW_AT_name("pcName")
    1024                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_pcName")
    1025                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1026                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1027                      .dwattr $C$DW$60, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1028                      .dwattr $C$DW$60, DW_AT_decl_line(0x72)
    1029                      .dwattr $C$DW$60, DW_AT_decl_column(0x1c)
    1030              $C$DW$61        .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$9)
    1032                      .dwattr $C$DW$61, DW_AT_name("usStackDepth")
    1033                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_usStackDepth")
    1034                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1035                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1036                      .dwattr $C$DW$61, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1037                      .dwattr $C$DW$61, DW_AT_decl_line(0x73)
    1038                      .dwattr $C$DW$61, DW_AT_decl_column(0x11)
    1039              $C$DW$62        .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$3)
    1041                      .dwattr $C$DW$62, DW_AT_name("pvParameters")
    1042                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_pvParameters")
    1043                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1044                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1045                      .dwattr $C$DW$62, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1046                      .dwattr $C$DW$62, DW_AT_decl_line(0x74)
    1047                      .dwattr $C$DW$62, DW_AT_decl_column(0x08)
    1048              $C$DW$63        .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
    1050                      .dwattr $C$DW$63, DW_AT_name("uxPriority")
    1051                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_uxPriority")
    1052                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1053                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1054                      .dwattr $C$DW$63, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1055                      .dwattr $C$DW$63, DW_AT_decl_line(0x75)
    1056                      .dwattr $C$DW$63, DW_AT_decl_column(0x19)
    1057              $C$DW$64        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$39)
    1059                      .dwattr $C$DW$64, DW_AT_name("puxStackBuffer")
    1060                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_puxStackBuffer")
    1061                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1062                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1063                      .dwattr $C$DW$64, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1064                      .dwattr $C$DW$64, DW_AT_decl_line(0x76)
    1065                      .dwattr $C$DW$64, DW_AT_decl_column(0x12)
    1066              $C$DW$65        .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$41)
    1068                      .dwattr $C$DW$65, DW_AT_name("xRegions")
    1069                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_xRegions")
    1070                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1071                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:31 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
ParTest.asm                                                          PAGE   21

    1072                      .dwattr $C$DW$65, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1073                      .dwattr $C$DW$65, DW_AT_decl_line(0x77)
    1074                      .dwattr $C$DW$65, DW_AT_decl_column(0x10)
    1075                      .dwendtag $C$DW$T$42
    1076              
    1077                      .dwattr $C$DW$T$42, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1078                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x6f)
    1079                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    1080              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1081                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$42)
    1082                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1083                      .dwattr $C$DW$T$73, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1084                      .dwattr $C$DW$T$73, DW_AT_decl_line(0x78)
    1085                      .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    1086              $C$DW$T$74      .dwtag  DW_TAG_base_type
    1087                      .dwattr $C$DW$T$74, DW_AT_encoding(DW_ATE_signed_char)
    1088                      .dwattr $C$DW$T$74, DW_AT_name("signed char")
    1089                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    1090              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    1091                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    1092                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    1093              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    1094                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    1095                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1096                      .dwattr $C$DW$T$76, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1097                      .dwattr $C$DW$T$76, DW_AT_decl_line(0x0d)
    1098                      .dwattr $C$DW$T$76, DW_AT_decl_column(0x0f)
    1099              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("_Va_list")
    1100                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    1101                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1102                      .dwattr $C$DW$T$77, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1103                      .dwattr $C$DW$T$77, DW_AT_decl_line(0x280)
    1104                      .dwattr $C$DW$T$77, DW_AT_decl_column(0x17)
    1105              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("_Sysch_t")
    1106                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$74)
    1107                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1108                      .dwattr $C$DW$T$78, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1109                      .dwattr $C$DW$T$78, DW_AT_decl_line(0x2a1)
    1110                      .dwattr $C$DW$T$78, DW_AT_decl_column(0x0e)
    1111                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1112              
    1113              ;***************************************************************
    1114              ;* DWARF CIE ENTRIES                                           *
    1115              ;***************************************************************
    1116              
    1117              $C$DW$CIE       .dwcie 91
