TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:32 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

    1076                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1077                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1078                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1079              $C$DW$95        .dwtag  DW_TAG_TI_far_type
    1080                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1081              $C$DW$T$28      .dwtag  DW_TAG_volatile_type
    1082                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$95)
    1083              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1084                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$11)
    1085                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    1086              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1087                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$11)
    1088                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1089                      .dwattr $C$DW$T$82, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1090                      .dwattr $C$DW$T$82, DW_AT_decl_line(0x27)
    1091                      .dwattr $C$DW$T$82, DW_AT_decl_column(0x1a)
    1092              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1093                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE   23

    1094                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1095                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1096              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    1097                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$12)
    1098                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1099                      .dwattr $C$DW$T$83, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1100                      .dwattr $C$DW$T$83, DW_AT_decl_line(0x11)
    1101                      .dwattr $C$DW$T$83, DW_AT_decl_column(0x1c)
    1102              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1103                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1104                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1105                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1106              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1107                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$13)
    1108                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1109                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1110                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x55)
    1111                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x1c)
    1112              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1113                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$13)
    1114                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1115                      .dwattr $C$DW$T$84, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1116                      .dwattr $C$DW$T$84, DW_AT_decl_line(0x21)
    1117                      .dwattr $C$DW$T$84, DW_AT_decl_column(0x19)
    1118              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1119                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1120                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1121                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1122                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1123                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1124              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1125                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1126                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1127                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1128                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1129                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1130              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1131                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1132                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1133                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1134              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1135                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1136                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1137                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1138              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1139                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1140                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1141                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1142              
    1143              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1144                      .dwattr $C$DW$T$19, DW_AT_name("xMEMORY_REGION")
    1145                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x06)
    1146              $C$DW$96        .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$3)
    1148                      .dwattr $C$DW$96, DW_AT_name("pvBaseAddress")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE   24

    1149                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_pvBaseAddress")
    1150                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1152                      .dwattr $C$DW$96, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1153                      .dwattr $C$DW$96, DW_AT_decl_line(0x67)
    1154                      .dwattr $C$DW$96, DW_AT_decl_column(0x08)
    1155              $C$DW$97        .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$13)
    1157                      .dwattr $C$DW$97, DW_AT_name("ulLengthInBytes")
    1158                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ulLengthInBytes")
    1159                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1160                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1161                      .dwattr $C$DW$97, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1162                      .dwattr $C$DW$97, DW_AT_decl_line(0x68)
    1163                      .dwattr $C$DW$97, DW_AT_decl_column(0x10)
    1164              $C$DW$98        .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$13)
    1166                      .dwattr $C$DW$98, DW_AT_name("ulParameters")
    1167                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ulParameters")
    1168                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1169                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1170                      .dwattr $C$DW$98, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1171                      .dwattr $C$DW$98, DW_AT_decl_line(0x69)
    1172                      .dwattr $C$DW$98, DW_AT_decl_column(0x10)
    1173                      .dwendtag $C$DW$T$19
    1174              
    1175                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1176                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x65)
    1177                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    1178              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1179                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$19)
    1180                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1181                      .dwattr $C$DW$T$43, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1182                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x6a)
    1183                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    1184              
    1185              $C$DW$T$44      .dwtag  DW_TAG_array_type
    1186                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1187                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1188                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
    1189              $C$DW$99        .dwtag  DW_TAG_subrange_type
    1190                      .dwattr $C$DW$99, DW_AT_upper_bound(0x00)
    1191                      .dwendtag $C$DW$T$44
    1192              
    1193              $C$DW$100       .dwtag  DW_TAG_TI_far_type
    1194                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$43)
    1195              $C$DW$T$63      .dwtag  DW_TAG_const_type
    1196                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$100)
    1197              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    1198                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1199                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    1200              $C$DW$101       .dwtag  DW_TAG_TI_far_type
    1201                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$64)
    1202              $C$DW$T$65      .dwtag  DW_TAG_const_type
    1203                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$101)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE   25

    1204              
    1205              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1206                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1207              $C$DW$102       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$10)
    1209                      .dwattr $C$DW$102, DW_AT_name("quot")
    1210                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_quot")
    1211                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1212                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1213                      .dwattr $C$DW$102, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1214                      .dwattr $C$DW$102, DW_AT_decl_line(0x12)
    1215                      .dwattr $C$DW$102, DW_AT_decl_column(0x16)
    1216              $C$DW$103       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$10)
    1218                      .dwattr $C$DW$103, DW_AT_name("rem")
    1219                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rem")
    1220                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1221                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1222                      .dwattr $C$DW$103, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1223                      .dwattr $C$DW$103, DW_AT_decl_line(0x12)
    1224                      .dwattr $C$DW$103, DW_AT_decl_column(0x1c)
    1225                      .dwendtag $C$DW$T$20
    1226              
    1227                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1228                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x12)
    1229                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    1230              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    1231                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$20)
    1232                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1233                      .dwattr $C$DW$T$87, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1234                      .dwattr $C$DW$T$87, DW_AT_decl_line(0x12)
    1235                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x23)
    1236              
    1237              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1238                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1239              $C$DW$104       .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$12)
    1241                      .dwattr $C$DW$104, DW_AT_name("quot")
    1242                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_quot")
    1243                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1244                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1245                      .dwattr $C$DW$104, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1246                      .dwattr $C$DW$104, DW_AT_decl_line(0x14)
    1247                      .dwattr $C$DW$104, DW_AT_decl_column(0x17)
    1248              $C$DW$105       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$12)
    1250                      .dwattr $C$DW$105, DW_AT_name("rem")
    1251                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rem")
    1252                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1253                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1254                      .dwattr $C$DW$105, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1255                      .dwattr $C$DW$105, DW_AT_decl_line(0x14)
    1256                      .dwattr $C$DW$105, DW_AT_decl_column(0x1d)
    1257                      .dwendtag $C$DW$T$21
    1258              
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE   26

    1259                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1260                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
    1261                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1262              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    1263                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$21)
    1264                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1265                      .dwattr $C$DW$T$88, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1266                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x14)
    1267                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x24)
    1268              
    1269              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1270                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    1271              $C$DW$106       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$14)
    1273                      .dwattr $C$DW$106, DW_AT_name("quot")
    1274                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_quot")
    1275                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1277                      .dwattr $C$DW$106, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1278                      .dwattr $C$DW$106, DW_AT_decl_line(0x17)
    1279                      .dwattr $C$DW$106, DW_AT_decl_column(0x1c)
    1280              $C$DW$107       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$14)
    1282                      .dwattr $C$DW$107, DW_AT_name("rem")
    1283                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rem")
    1284                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1285                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1286                      .dwattr $C$DW$107, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1287                      .dwattr $C$DW$107, DW_AT_decl_line(0x17)
    1288                      .dwattr $C$DW$107, DW_AT_decl_column(0x22)
    1289                      .dwendtag $C$DW$T$22
    1290              
    1291                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1292                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x17)
    1293                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    1294              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    1295                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$22)
    1296                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1297                      .dwattr $C$DW$T$89, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1298                      .dwattr $C$DW$T$89, DW_AT_decl_line(0x17)
    1299                      .dwattr $C$DW$T$89, DW_AT_decl_column(0x29)
    1300              
    1301              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1302                      .dwattr $C$DW$T$26, DW_AT_name("xLIST_ITEM")
    1303                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    1304              $C$DW$108       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$23)
    1306                      .dwattr $C$DW$108, DW_AT_name("xItemValue")
    1307                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_xItemValue")
    1308                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1309                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1310                      .dwattr $C$DW$108, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1311                      .dwattr $C$DW$108, DW_AT_decl_line(0x64)
    1312                      .dwattr $C$DW$108, DW_AT_decl_column(0x0f)
    1313              $C$DW$109       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE   27

    1314                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$25)
    1315                      .dwattr $C$DW$109, DW_AT_name("pxNext")
    1316                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_pxNext")
    1317                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1318                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1319                      .dwattr $C$DW$109, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1320                      .dwattr $C$DW$109, DW_AT_decl_line(0x65)
    1321                      .dwattr $C$DW$109, DW_AT_decl_column(0x1f)
    1322              $C$DW$110       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$25)
    1324                      .dwattr $C$DW$110, DW_AT_name("pxPrevious")
    1325                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_pxPrevious")
    1326                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1327                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1328                      .dwattr $C$DW$110, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1329                      .dwattr $C$DW$110, DW_AT_decl_line(0x66)
    1330                      .dwattr $C$DW$110, DW_AT_decl_column(0x1f)
    1331              $C$DW$111       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$3)
    1333                      .dwattr $C$DW$111, DW_AT_name("pvOwner")
    1334                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_pvOwner")
    1335                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1336                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1337                      .dwattr $C$DW$111, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1338                      .dwattr $C$DW$111, DW_AT_decl_line(0x67)
    1339                      .dwattr $C$DW$111, DW_AT_decl_column(0x09)
    1340              $C$DW$112       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$3)
    1342                      .dwattr $C$DW$112, DW_AT_name("pvContainer")
    1343                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_pvContainer")
    1344                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1345                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1346                      .dwattr $C$DW$112, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1347                      .dwattr $C$DW$112, DW_AT_decl_line(0x68)
    1348                      .dwattr $C$DW$112, DW_AT_decl_column(0x09)
    1349                      .dwendtag $C$DW$T$26
    1350              
    1351                      .dwattr $C$DW$T$26, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1352                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x62)
    1353                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x08)
    1354              $C$DW$113       .dwtag  DW_TAG_TI_far_type
    1355                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$26)
    1356              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    1357                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$113)
    1358              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    1359                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1360                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
    1361              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1362                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1363                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1364                      .dwattr $C$DW$T$29, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1365                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x6a)
    1366                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x1b)
    1367              $C$DW$114       .dwtag  DW_TAG_TI_far_type
    1368                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$29)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE   28

    1369              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    1370                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$114)
    1371              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1372                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1373                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
    1374              
    1375              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1376                      .dwattr $C$DW$T$27, DW_AT_name("xMINI_LIST_ITEM")
    1377                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x06)
    1378              $C$DW$115       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$23)
    1380                      .dwattr $C$DW$115, DW_AT_name("xItemValue")
    1381                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_xItemValue")
    1382                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1384                      .dwattr $C$DW$115, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1385                      .dwattr $C$DW$115, DW_AT_decl_line(0x6e)
    1386                      .dwattr $C$DW$115, DW_AT_decl_column(0x0f)
    1387              $C$DW$116       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$25)
    1389                      .dwattr $C$DW$116, DW_AT_name("pxNext")
    1390                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_pxNext")
    1391                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1392                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1393                      .dwattr $C$DW$116, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1394                      .dwattr $C$DW$116, DW_AT_decl_line(0x6f)
    1395                      .dwattr $C$DW$116, DW_AT_decl_column(0x1e)
    1396              $C$DW$117       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$25)
    1398                      .dwattr $C$DW$117, DW_AT_name("pxPrevious")
    1399                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_pxPrevious")
    1400                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1401                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1402                      .dwattr $C$DW$117, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1403                      .dwattr $C$DW$117, DW_AT_decl_line(0x70)
    1404                      .dwattr $C$DW$117, DW_AT_decl_column(0x1e)
    1405                      .dwendtag $C$DW$T$27
    1406              
    1407                      .dwattr $C$DW$T$27, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1408                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x6c)
    1409                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x08)
    1410              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1411                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
    1412                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1413                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1414                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x72)
    1415                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x20)
    1416              $C$DW$118       .dwtag  DW_TAG_TI_far_type
    1417                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$32)
    1418              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    1419                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$118)
    1420              
    1421              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1422                      .dwattr $C$DW$T$34, DW_AT_name("xLIST")
    1423                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE   29

    1424              $C$DW$119       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$28)
    1426                      .dwattr $C$DW$119, DW_AT_name("uxNumberOfItems")
    1427                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1428                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1430                      .dwattr $C$DW$119, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1431                      .dwattr $C$DW$119, DW_AT_decl_line(0x79)
    1432                      .dwattr $C$DW$119, DW_AT_decl_column(0x22)
    1433              $C$DW$120       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$31)
    1435                      .dwattr $C$DW$120, DW_AT_name("pxIndex")
    1436                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_pxIndex")
    1437                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1438                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1439                      .dwattr $C$DW$120, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1440                      .dwattr $C$DW$120, DW_AT_decl_line(0x7a)
    1441                      .dwattr $C$DW$120, DW_AT_decl_column(0x17)
    1442              $C$DW$121       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$33)
    1444                      .dwattr $C$DW$121, DW_AT_name("xListEnd")
    1445                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_xListEnd")
    1446                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1447                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1448                      .dwattr $C$DW$121, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1449                      .dwattr $C$DW$121, DW_AT_decl_line(0x7b)
    1450                      .dwattr $C$DW$121, DW_AT_decl_column(0x19)
    1451                      .dwendtag $C$DW$T$34
    1452              
    1453                      .dwattr $C$DW$T$34, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1454                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x77)
    1455                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    1456              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1457                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$34)
    1458                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1459                      .dwattr $C$DW$T$90, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1460                      .dwattr $C$DW$T$90, DW_AT_decl_line(0x7c)
    1461                      .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    1462              
    1463              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1464                      .dwattr $C$DW$T$35, DW_AT_name("xTIME_OUT")
    1465                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1466              $C$DW$122       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$10)
    1468                      .dwattr $C$DW$122, DW_AT_name("xOverflowCount")
    1469                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_xOverflowCount")
    1470                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1472                      .dwattr $C$DW$122, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1473                      .dwattr $C$DW$122, DW_AT_decl_line(0x5e)
    1474                      .dwattr $C$DW$122, DW_AT_decl_column(0x10)
    1475              $C$DW$123       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$23)
    1477                      .dwattr $C$DW$123, DW_AT_name("xTimeOnEntering")
    1478                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_xTimeOnEntering")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE   30

    1479                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1480                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1481                      .dwattr $C$DW$123, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1482                      .dwattr $C$DW$123, DW_AT_decl_line(0x5f)
    1483                      .dwattr $C$DW$123, DW_AT_decl_column(0x10)
    1484                      .dwendtag $C$DW$T$35
    1485              
    1486                      .dwattr $C$DW$T$35, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1487                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x5c)
    1488                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1489              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1490                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$35)
    1491                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1492                      .dwattr $C$DW$T$91, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1493                      .dwattr $C$DW$T$91, DW_AT_decl_line(0x60)
    1494                      .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    1495              
    1496              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1497                      .dwattr $C$DW$T$45, DW_AT_name("xTASK_PARAMTERS")
    1498                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x12)
    1499              $C$DW$124       .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$38)
    1501                      .dwattr $C$DW$124, DW_AT_name("pvTaskCode")
    1502                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_pvTaskCode")
    1503                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1505                      .dwattr $C$DW$124, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1506                      .dwattr $C$DW$124, DW_AT_decl_line(0x71)
    1507                      .dwattr $C$DW$124, DW_AT_decl_column(0x0e)
    1508              $C$DW$125       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$41)
    1510                      .dwattr $C$DW$125, DW_AT_name("pcName")
    1511                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_pcName")
    1512                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1513                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1514                      .dwattr $C$DW$125, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1515                      .dwattr $C$DW$125, DW_AT_decl_line(0x72)
    1516                      .dwattr $C$DW$125, DW_AT_decl_column(0x1c)
    1517              $C$DW$126       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$9)
    1519                      .dwattr $C$DW$126, DW_AT_name("usStackDepth")
    1520                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_usStackDepth")
    1521                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1522                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1523                      .dwattr $C$DW$126, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1524                      .dwattr $C$DW$126, DW_AT_decl_line(0x73)
    1525                      .dwattr $C$DW$126, DW_AT_decl_column(0x11)
    1526              $C$DW$127       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$3)
    1528                      .dwattr $C$DW$127, DW_AT_name("pvParameters")
    1529                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_pvParameters")
    1530                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1531                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1532                      .dwattr $C$DW$127, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1533                      .dwattr $C$DW$127, DW_AT_decl_line(0x74)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE   31

    1534                      .dwattr $C$DW$127, DW_AT_decl_column(0x08)
    1535              $C$DW$128       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1537                      .dwattr $C$DW$128, DW_AT_name("uxPriority")
    1538                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_uxPriority")
    1539                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1540                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1541                      .dwattr $C$DW$128, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1542                      .dwattr $C$DW$128, DW_AT_decl_line(0x75)
    1543                      .dwattr $C$DW$128, DW_AT_decl_column(0x19)
    1544              $C$DW$129       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$42)
    1546                      .dwattr $C$DW$129, DW_AT_name("puxStackBuffer")
    1547                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_puxStackBuffer")
    1548                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1549                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1550                      .dwattr $C$DW$129, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1551                      .dwattr $C$DW$129, DW_AT_decl_line(0x76)
    1552                      .dwattr $C$DW$129, DW_AT_decl_column(0x12)
    1553              $C$DW$130       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$44)
    1555                      .dwattr $C$DW$130, DW_AT_name("xRegions")
    1556                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_xRegions")
    1557                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1558                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1559                      .dwattr $C$DW$130, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1560                      .dwattr $C$DW$130, DW_AT_decl_line(0x77)
    1561                      .dwattr $C$DW$130, DW_AT_decl_column(0x10)
    1562                      .dwendtag $C$DW$T$45
    1563              
    1564                      .dwattr $C$DW$T$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1565                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x6f)
    1566                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    1567              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1568                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$45)
    1569                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1570                      .dwattr $C$DW$T$92, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1571                      .dwattr $C$DW$T$92, DW_AT_decl_line(0x78)
    1572                      .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    1573                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1574              
    1575              ;***************************************************************
    1576              ;* DWARF CIE ENTRIES                                           *
    1577              ;***************************************************************
    1578              
    1579              $C$DW$CIE       .dwcie 91
    1580                      .dwcfi  cfa_register, 36
    1581                      .dwcfi  cfa_offset, 0
    1582                      .dwcfi  undefined, 0
    1583                      .dwcfi  undefined, 1
    1584                      .dwcfi  undefined, 2
    1585                      .dwcfi  undefined, 3
    1586                      .dwcfi  undefined, 4
    1587                      .dwcfi  undefined, 5
    1588                      .dwcfi  undefined, 6
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:32 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
PollQ.asm                                                            PAGE   32

    1589                      .dwcfi  undefined, 7
    1590                      .dwcfi  undefined, 8
    1591                      .dwcfi  undefined, 9
    1592                      .dwcfi  undefined, 10
    1593                      .dwcfi  undefined, 11
    1594                      .dwcfi  undefined, 12
    1595                      .dwcfi  undefined, 13
    1596                      .dwcfi  same_value, 14
    1597                      .dwcfi  same_value, 15
    1598                      .dwcfi  undefined, 16
    1599                      .dwcfi  undefined, 17
    1600                      .dwcfi  undefined, 18
    1601                      .dwcfi  undefined, 19
    1602                      .dwcfi  undefined, 20
    1603                      .dwcfi  undefined, 21
    1604                      .dwcfi  undefined, 22
    1605                      .dwcfi  undefined, 23
    1606                      .dwcfi  undefined, 24
    1607                      .dwcfi  undefined, 25
    1608                      .dwcfi  same_value, 26
    1609                      .dwcfi  same_value, 27
    1610                      .dwcfi  same_value, 28
    1611                      .dwcfi  same_value, 29
    1612                      .dwcfi  same_value, 30
    1613                      .dwcfi  same_value, 31
    1614                      .dwcfi  undefined, 32
    1615                      .dwcfi  undefined, 33
    1616                      .dwcfi  undefined, 34
    1617                      .dwcfi  undefined, 35
    1618                      .dwcfi  undefined, 36
    1619                      .dwcfi  undefined, 37
