TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
port.asm                                                             PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:30 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

     703                      .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     704                      .dwattr $C$DW$T$64, DW_AT_decl_line(0x11)
     705                      .dwattr $C$DW$T$64, DW_AT_decl_column(0x1c)
     706              $C$DW$T$13      .dwtag  DW_TAG_base_type
     707                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     708                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     709                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     710              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     711                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$13)
     712                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     713                      .dwattr $C$DW$T$22, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     714                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x55)
     715                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x1c)
     716              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     717                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$13)
     718                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     719                      .dwattr $C$DW$T$65, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     720                      .dwattr $C$DW$T$65, DW_AT_decl_line(0x21)
     721                      .dwattr $C$DW$T$65, DW_AT_decl_column(0x19)
     722              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
     723                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$13)
     724                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     725                      .dwattr $C$DW$T$66, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     726                      .dwattr $C$DW$T$66, DW_AT_decl_line(0xe4)
     727                      .dwattr $C$DW$T$66, DW_AT_decl_column(0x17)
     728              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
     729                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$13)
     730                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     731                      .dwattr $C$DW$T$67, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     732                      .dwattr $C$DW$T$67, DW_AT_decl_line(0xf2)
     733                      .dwattr $C$DW$T$67, DW_AT_decl_column(0x1a)
     734              $C$DW$T$14      .dwtag  DW_TAG_base_type
     735                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     736                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     737                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     738                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     739                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     740              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
     741                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$14)
     742                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     743                      .dwattr $C$DW$T$68, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     744                      .dwattr $C$DW$T$68, DW_AT_decl_line(0x228)
     745                      .dwattr $C$DW$T$68, DW_AT_decl_column(0x13)
     746              $C$DW$T$15      .dwtag  DW_TAG_base_type
     747                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     748                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     749                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     750                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     751                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     752              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
     753                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$15)
     754                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     755                      .dwattr $C$DW$T$69, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
port.asm                                                             PAGE   16

     756                      .dwattr $C$DW$T$69, DW_AT_decl_line(0x229)
     757                      .dwattr $C$DW$T$69, DW_AT_decl_column(0x14)
     758              $C$DW$T$16      .dwtag  DW_TAG_base_type
     759                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     760                      .dwattr $C$DW$T$16, DW_AT_name("float")
     761                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     762              $C$DW$T$17      .dwtag  DW_TAG_base_type
     763                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     764                      .dwattr $C$DW$T$17, DW_AT_name("double")
     765                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     766              $C$DW$T$18      .dwtag  DW_TAG_base_type
     767                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     768                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     769                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     770              
     771              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     772                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x02)
     773              $C$DW$35        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$10)
     775                      .dwattr $C$DW$35, DW_AT_name("quot")
     776                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_quot")
     777                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     778                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     779                      .dwattr $C$DW$35, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     780                      .dwattr $C$DW$35, DW_AT_decl_line(0x12)
     781                      .dwattr $C$DW$35, DW_AT_decl_column(0x16)
     782              $C$DW$36        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$10)
     784                      .dwattr $C$DW$36, DW_AT_name("rem")
     785                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rem")
     786                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     787                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     788                      .dwattr $C$DW$36, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     789                      .dwattr $C$DW$36, DW_AT_decl_line(0x12)
     790                      .dwattr $C$DW$36, DW_AT_decl_column(0x1c)
     791                      .dwendtag $C$DW$T$19
     792              
     793                      .dwattr $C$DW$T$19, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     794                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x12)
     795                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
     796              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
     797                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$19)
     798                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
     799                      .dwattr $C$DW$T$70, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     800                      .dwattr $C$DW$T$70, DW_AT_decl_line(0x12)
     801                      .dwattr $C$DW$T$70, DW_AT_decl_column(0x23)
     802              
     803              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     804                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     805              $C$DW$37        .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$12)
     807                      .dwattr $C$DW$37, DW_AT_name("quot")
     808                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_quot")
     809                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     810                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
port.asm                                                             PAGE   17

     811                      .dwattr $C$DW$37, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     812                      .dwattr $C$DW$37, DW_AT_decl_line(0x14)
     813                      .dwattr $C$DW$37, DW_AT_decl_column(0x17)
     814              $C$DW$38        .dwtag  DW_TAG_member
     815                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$12)
     816                      .dwattr $C$DW$38, DW_AT_name("rem")
     817                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rem")
     818                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     819                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     820                      .dwattr $C$DW$38, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     821                      .dwattr $C$DW$38, DW_AT_decl_line(0x14)
     822                      .dwattr $C$DW$38, DW_AT_decl_column(0x1d)
     823                      .dwendtag $C$DW$T$20
     824              
     825                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     826                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x14)
     827                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     828              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
     829                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$20)
     830                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     831                      .dwattr $C$DW$T$71, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     832                      .dwattr $C$DW$T$71, DW_AT_decl_line(0x14)
     833                      .dwattr $C$DW$T$71, DW_AT_decl_column(0x24)
     834              
     835              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     836                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
     837              $C$DW$39        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$14)
     839                      .dwattr $C$DW$39, DW_AT_name("quot")
     840                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_quot")
     841                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     843                      .dwattr $C$DW$39, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     844                      .dwattr $C$DW$39, DW_AT_decl_line(0x17)
     845                      .dwattr $C$DW$39, DW_AT_decl_column(0x1c)
     846              $C$DW$40        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$14)
     848                      .dwattr $C$DW$40, DW_AT_name("rem")
     849                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rem")
     850                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     851                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     852                      .dwattr $C$DW$40, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Generat
     853                      .dwattr $C$DW$40, DW_AT_decl_line(0x17)
     854                      .dwattr $C$DW$40, DW_AT_decl_column(0x22)
     855                      .dwendtag $C$DW$T$21
     856              
     857                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     858                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x17)
     859                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     860              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
     861                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$21)
     862                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
     863                      .dwattr $C$DW$T$72, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
     864                      .dwattr $C$DW$T$72, DW_AT_decl_line(0x17)
     865                      .dwattr $C$DW$T$72, DW_AT_decl_column(0x29)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
port.asm                                                             PAGE   18

     866              
     867              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     868                      .dwattr $C$DW$T$25, DW_AT_name("xLIST_ITEM")
     869                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
     870              $C$DW$41        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
     872                      .dwattr $C$DW$41, DW_AT_name("xItemValue")
     873                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_xItemValue")
     874                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     876                      .dwattr $C$DW$41, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     877                      .dwattr $C$DW$41, DW_AT_decl_line(0x64)
     878                      .dwattr $C$DW$41, DW_AT_decl_column(0x0f)
     879              $C$DW$42        .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$24)
     881                      .dwattr $C$DW$42, DW_AT_name("pxNext")
     882                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_pxNext")
     883                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     884                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     885                      .dwattr $C$DW$42, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     886                      .dwattr $C$DW$42, DW_AT_decl_line(0x65)
     887                      .dwattr $C$DW$42, DW_AT_decl_column(0x1f)
     888              $C$DW$43        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$24)
     890                      .dwattr $C$DW$43, DW_AT_name("pxPrevious")
     891                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_pxPrevious")
     892                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     893                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     894                      .dwattr $C$DW$43, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     895                      .dwattr $C$DW$43, DW_AT_decl_line(0x66)
     896                      .dwattr $C$DW$43, DW_AT_decl_column(0x1f)
     897              $C$DW$44        .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$3)
     899                      .dwattr $C$DW$44, DW_AT_name("pvOwner")
     900                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_pvOwner")
     901                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     902                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     903                      .dwattr $C$DW$44, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     904                      .dwattr $C$DW$44, DW_AT_decl_line(0x67)
     905                      .dwattr $C$DW$44, DW_AT_decl_column(0x09)
     906              $C$DW$45        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$3)
     908                      .dwattr $C$DW$45, DW_AT_name("pvContainer")
     909                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_pvContainer")
     910                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     911                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     912                      .dwattr $C$DW$45, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     913                      .dwattr $C$DW$45, DW_AT_decl_line(0x68)
     914                      .dwattr $C$DW$45, DW_AT_decl_column(0x09)
     915                      .dwendtag $C$DW$T$25
     916              
     917                      .dwattr $C$DW$T$25, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     918                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x62)
     919                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x08)
     920              $C$DW$46        .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
port.asm                                                             PAGE   19

     921                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$25)
     922              $C$DW$T$23      .dwtag  DW_TAG_volatile_type
     923                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$46)
     924              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     925                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     926                      .dwattr $C$DW$T$24, DW_AT_address_class(0x17)
     927              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     928                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
     929                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     930                      .dwattr $C$DW$T$28, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     931                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x6a)
     932                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x1b)
     933              $C$DW$47        .dwtag  DW_TAG_TI_far_type
     934                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$28)
     935              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
     936                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$47)
     937              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
     938                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
     939                      .dwattr $C$DW$T$30, DW_AT_address_class(0x17)
     940              
     941              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     942                      .dwattr $C$DW$T$26, DW_AT_name("xMINI_LIST_ITEM")
     943                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x06)
     944              $C$DW$48        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
     946                      .dwattr $C$DW$48, DW_AT_name("xItemValue")
     947                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_xItemValue")
     948                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     949                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     950                      .dwattr $C$DW$48, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     951                      .dwattr $C$DW$48, DW_AT_decl_line(0x6e)
     952                      .dwattr $C$DW$48, DW_AT_decl_column(0x0f)
     953              $C$DW$49        .dwtag  DW_TAG_member
     954                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$24)
     955                      .dwattr $C$DW$49, DW_AT_name("pxNext")
     956                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_pxNext")
     957                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     958                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     959                      .dwattr $C$DW$49, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     960                      .dwattr $C$DW$49, DW_AT_decl_line(0x6f)
     961                      .dwattr $C$DW$49, DW_AT_decl_column(0x1e)
     962              $C$DW$50        .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$24)
     964                      .dwattr $C$DW$50, DW_AT_name("pxPrevious")
     965                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_pxPrevious")
     966                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     967                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     968                      .dwattr $C$DW$50, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     969                      .dwattr $C$DW$50, DW_AT_decl_line(0x70)
     970                      .dwattr $C$DW$50, DW_AT_decl_column(0x1e)
     971                      .dwendtag $C$DW$T$26
     972              
     973                      .dwattr $C$DW$T$26, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     974                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x6c)
     975                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x08)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
port.asm                                                             PAGE   20

     976              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
     977                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$26)
     978                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
     979                      .dwattr $C$DW$T$31, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
     980                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x72)
     981                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x20)
     982              $C$DW$51        .dwtag  DW_TAG_TI_far_type
     983                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$31)
     984              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
     985                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$51)
     986              
     987              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     988                      .dwattr $C$DW$T$33, DW_AT_name("xLIST")
     989                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x0a)
     990              $C$DW$52        .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$27)
     992                      .dwattr $C$DW$52, DW_AT_name("uxNumberOfItems")
     993                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_uxNumberOfItems")
     994                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     996                      .dwattr $C$DW$52, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
     997                      .dwattr $C$DW$52, DW_AT_decl_line(0x79)
     998                      .dwattr $C$DW$52, DW_AT_decl_column(0x22)
     999              $C$DW$53        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$30)
    1001                      .dwattr $C$DW$53, DW_AT_name("pxIndex")
    1002                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_pxIndex")
    1003                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1004                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1005                      .dwattr $C$DW$53, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1006                      .dwattr $C$DW$53, DW_AT_decl_line(0x7a)
    1007                      .dwattr $C$DW$53, DW_AT_decl_column(0x17)
    1008              $C$DW$54        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$32)
    1010                      .dwattr $C$DW$54, DW_AT_name("xListEnd")
    1011                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_xListEnd")
    1012                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1013                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1014                      .dwattr $C$DW$54, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\inc
    1015                      .dwattr $C$DW$54, DW_AT_decl_line(0x7b)
    1016                      .dwattr $C$DW$54, DW_AT_decl_column(0x19)
    1017                      .dwendtag $C$DW$T$33
    1018              
    1019                      .dwattr $C$DW$T$33, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1020                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x77)
    1021                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    1022              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1023                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$33)
    1024                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1025                      .dwattr $C$DW$T$73, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1026                      .dwattr $C$DW$T$73, DW_AT_decl_line(0x7c)
    1027                      .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    1028              
    1029              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1030                      .dwattr $C$DW$T$34, DW_AT_name("xTIME_OUT")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
port.asm                                                             PAGE   21

    1031                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
    1032              $C$DW$55        .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$10)
    1034                      .dwattr $C$DW$55, DW_AT_name("xOverflowCount")
    1035                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_xOverflowCount")
    1036                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1038                      .dwattr $C$DW$55, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1039                      .dwattr $C$DW$55, DW_AT_decl_line(0x5e)
    1040                      .dwattr $C$DW$55, DW_AT_decl_column(0x10)
    1041              $C$DW$56        .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
    1043                      .dwattr $C$DW$56, DW_AT_name("xTimeOnEntering")
    1044                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_xTimeOnEntering")
    1045                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1046                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1047                      .dwattr $C$DW$56, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1048                      .dwattr $C$DW$56, DW_AT_decl_line(0x5f)
    1049                      .dwattr $C$DW$56, DW_AT_decl_column(0x10)
    1050                      .dwendtag $C$DW$T$34
    1051              
    1052                      .dwattr $C$DW$T$34, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1053                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x5c)
    1054                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    1055              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1056                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$34)
    1057                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1058                      .dwattr $C$DW$T$74, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1059                      .dwattr $C$DW$T$74, DW_AT_decl_line(0x60)
    1060                      .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    1061              
    1062              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1063                      .dwattr $C$DW$T$35, DW_AT_name("xMEMORY_REGION")
    1064                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    1065              $C$DW$57        .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$3)
    1067                      .dwattr $C$DW$57, DW_AT_name("pvBaseAddress")
    1068                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_pvBaseAddress")
    1069                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1071                      .dwattr $C$DW$57, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1072                      .dwattr $C$DW$57, DW_AT_decl_line(0x67)
    1073                      .dwattr $C$DW$57, DW_AT_decl_column(0x08)
    1074              $C$DW$58        .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$13)
    1076                      .dwattr $C$DW$58, DW_AT_name("ulLengthInBytes")
    1077                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_ulLengthInBytes")
    1078                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1079                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1080                      .dwattr $C$DW$58, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1081                      .dwattr $C$DW$58, DW_AT_decl_line(0x68)
    1082                      .dwattr $C$DW$58, DW_AT_decl_column(0x10)
    1083              $C$DW$59        .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$13)
    1085                      .dwattr $C$DW$59, DW_AT_name("ulParameters")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
port.asm                                                             PAGE   22

    1086                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_ulParameters")
    1087                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1088                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1089                      .dwattr $C$DW$59, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1090                      .dwattr $C$DW$59, DW_AT_decl_line(0x69)
    1091                      .dwattr $C$DW$59, DW_AT_decl_column(0x10)
    1092                      .dwendtag $C$DW$T$35
    1093              
    1094                      .dwattr $C$DW$T$35, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1095                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x65)
    1096                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1097              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1098                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$35)
    1099                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1100                      .dwattr $C$DW$T$43, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1101                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x6a)
    1102                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    1103              
    1104              $C$DW$T$44      .dwtag  DW_TAG_array_type
    1105                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1106                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1107                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
    1108              $C$DW$60        .dwtag  DW_TAG_subrange_type
    1109                      .dwattr $C$DW$60, DW_AT_upper_bound(0x00)
    1110                      .dwendtag $C$DW$T$44
    1111              
    1112              
    1113              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1114                      .dwattr $C$DW$T$45, DW_AT_name("xTASK_PARAMTERS")
    1115                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x12)
    1116              $C$DW$61        .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$38)
    1118                      .dwattr $C$DW$61, DW_AT_name("pvTaskCode")
    1119                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_pvTaskCode")
    1120                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1121                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1122                      .dwattr $C$DW$61, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1123                      .dwattr $C$DW$61, DW_AT_decl_line(0x71)
    1124                      .dwattr $C$DW$61, DW_AT_decl_column(0x0e)
    1125              $C$DW$62        .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$41)
    1127                      .dwattr $C$DW$62, DW_AT_name("pcName")
    1128                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_pcName")
    1129                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1130                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1131                      .dwattr $C$DW$62, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1132                      .dwattr $C$DW$62, DW_AT_decl_line(0x72)
    1133                      .dwattr $C$DW$62, DW_AT_decl_column(0x1c)
    1134              $C$DW$63        .dwtag  DW_TAG_member
    1135                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$9)
    1136                      .dwattr $C$DW$63, DW_AT_name("usStackDepth")
    1137                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_usStackDepth")
    1138                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1139                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1140                      .dwattr $C$DW$63, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
port.asm                                                             PAGE   23

    1141                      .dwattr $C$DW$63, DW_AT_decl_line(0x73)
    1142                      .dwattr $C$DW$63, DW_AT_decl_column(0x11)
    1143              $C$DW$64        .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$3)
    1145                      .dwattr $C$DW$64, DW_AT_name("pvParameters")
    1146                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_pvParameters")
    1147                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1148                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1149                      .dwattr $C$DW$64, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1150                      .dwattr $C$DW$64, DW_AT_decl_line(0x74)
    1151                      .dwattr $C$DW$64, DW_AT_decl_column(0x08)
    1152              $C$DW$65        .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1154                      .dwattr $C$DW$65, DW_AT_name("uxPriority")
    1155                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_uxPriority")
    1156                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1157                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1158                      .dwattr $C$DW$65, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1159                      .dwattr $C$DW$65, DW_AT_decl_line(0x75)
    1160                      .dwattr $C$DW$65, DW_AT_decl_column(0x19)
    1161              $C$DW$66        .dwtag  DW_TAG_member
    1162                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$42)
    1163                      .dwattr $C$DW$66, DW_AT_name("puxStackBuffer")
    1164                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_puxStackBuffer")
    1165                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1166                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1167                      .dwattr $C$DW$66, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1168                      .dwattr $C$DW$66, DW_AT_decl_line(0x76)
    1169                      .dwattr $C$DW$66, DW_AT_decl_column(0x12)
    1170              $C$DW$67        .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$44)
    1172                      .dwattr $C$DW$67, DW_AT_name("xRegions")
    1173                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_xRegions")
    1174                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1175                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1176                      .dwattr $C$DW$67, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/inc
    1177                      .dwattr $C$DW$67, DW_AT_decl_line(0x77)
    1178                      .dwattr $C$DW$67, DW_AT_decl_column(0x10)
    1179                      .dwendtag $C$DW$T$45
    1180              
    1181                      .dwattr $C$DW$T$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1182                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x6f)
    1183                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    1184              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1185                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$45)
    1186                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1187                      .dwattr $C$DW$T$75, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1188                      .dwattr $C$DW$T$75, DW_AT_decl_line(0x78)
    1189                      .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    1190              $C$DW$T$76      .dwtag  DW_TAG_base_type
    1191                      .dwattr $C$DW$T$76, DW_AT_encoding(DW_ATE_signed_char)
    1192                      .dwattr $C$DW$T$76, DW_AT_name("signed char")
    1193                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x01)
    1194              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    1195                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:30 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
port.asm                                                             PAGE   24

    1196                      .dwattr $C$DW$T$77, DW_AT_address_class(0x17)
    1197              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    1198                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    1199                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1200                      .dwattr $C$DW$T$78, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1201                      .dwattr $C$DW$T$78, DW_AT_decl_line(0x0d)
    1202                      .dwattr $C$DW$T$78, DW_AT_decl_column(0x0f)
    1203              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("_Va_list")
    1204                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    1205                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1206                      .dwattr $C$DW$T$79, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1207                      .dwattr $C$DW$T$79, DW_AT_decl_line(0x280)
    1208                      .dwattr $C$DW$T$79, DW_AT_decl_column(0x17)
    1209              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("_Sysch_t")
    1210                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$76)
    1211                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1212                      .dwattr $C$DW$T$80, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1213                      .dwattr $C$DW$T$80, DW_AT_decl_line(0x2a1)
    1214                      .dwattr $C$DW$T$80, DW_AT_decl_column(0x0e)
    1215                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1216              
    1217              ;***************************************************************
    1218              ;* DWARF CIE ENTRIES                                           *
    1219              ;***************************************************************
    1220              
    1221              $C$DW$CIE       .dwcie 91
