TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:32 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

    1901                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    1902              $C$DW$T$28      .dwtag  DW_TAG_volatile_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE   41

    1903                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$161)
    1904              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1905                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$11)
    1906                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    1907              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1908                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$11)
    1909                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1910                      .dwattr $C$DW$T$83, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1911                      .dwattr $C$DW$T$83, DW_AT_decl_line(0x27)
    1912                      .dwattr $C$DW$T$83, DW_AT_decl_column(0x1a)
    1913              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1914                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1915                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1916                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1917              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    1918                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$12)
    1919                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1920                      .dwattr $C$DW$T$84, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1921                      .dwattr $C$DW$T$84, DW_AT_decl_line(0x11)
    1922                      .dwattr $C$DW$T$84, DW_AT_decl_column(0x1c)
    1923              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1924                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1925                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1926                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1927              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1928                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$13)
    1929                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1930                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1931                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x55)
    1932                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x1c)
    1933              $C$DW$162       .dwtag  DW_TAG_TI_far_type
    1934                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$13)
    1935              $C$DW$T$85      .dwtag  DW_TAG_volatile_type
    1936                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$162)
    1937              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1938                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$13)
    1939                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1940                      .dwattr $C$DW$T$87, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1941                      .dwattr $C$DW$T$87, DW_AT_decl_line(0x21)
    1942                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x19)
    1943              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1944                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1945                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1946                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1947                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1948                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1949              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1950                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1951                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1952                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1953                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1954                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1955              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1956                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1957                      .dwattr $C$DW$T$16, DW_AT_name("float")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE   42

    1958                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1959              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1960                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1961                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1962                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1963              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1964                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1965                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1966                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1967              
    1968              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1969                      .dwattr $C$DW$T$19, DW_AT_name("xMEMORY_REGION")
    1970                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x06)
    1971              $C$DW$163       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$3)
    1973                      .dwattr $C$DW$163, DW_AT_name("pvBaseAddress")
    1974                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_pvBaseAddress")
    1975                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1976                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1977                      .dwattr $C$DW$163, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1978                      .dwattr $C$DW$163, DW_AT_decl_line(0x67)
    1979                      .dwattr $C$DW$163, DW_AT_decl_column(0x08)
    1980              $C$DW$164       .dwtag  DW_TAG_member
    1981                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$13)
    1982                      .dwattr $C$DW$164, DW_AT_name("ulLengthInBytes")
    1983                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ulLengthInBytes")
    1984                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1985                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1986                      .dwattr $C$DW$164, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1987                      .dwattr $C$DW$164, DW_AT_decl_line(0x68)
    1988                      .dwattr $C$DW$164, DW_AT_decl_column(0x10)
    1989              $C$DW$165       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$13)
    1991                      .dwattr $C$DW$165, DW_AT_name("ulParameters")
    1992                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_ulParameters")
    1993                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1994                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1995                      .dwattr $C$DW$165, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1996                      .dwattr $C$DW$165, DW_AT_decl_line(0x69)
    1997                      .dwattr $C$DW$165, DW_AT_decl_column(0x10)
    1998                      .dwendtag $C$DW$T$19
    1999              
    2000                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2001                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x65)
    2002                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    2003              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    2004                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2006                      .dwattr $C$DW$T$43, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2007                      .dwattr $C$DW$T$43, DW_AT_decl_line(0x6a)
    2008                      .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    2009              
    2010              $C$DW$T$44      .dwtag  DW_TAG_array_type
    2011                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2012                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE   43

    2013                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x06)
    2014              $C$DW$166       .dwtag  DW_TAG_subrange_type
    2015                      .dwattr $C$DW$166, DW_AT_upper_bound(0x00)
    2016                      .dwendtag $C$DW$T$44
    2017              
    2018              $C$DW$167       .dwtag  DW_TAG_TI_far_type
    2019                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$43)
    2020              $C$DW$T$65      .dwtag  DW_TAG_const_type
    2021                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$167)
    2022              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    2023                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    2024                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    2025              $C$DW$168       .dwtag  DW_TAG_TI_far_type
    2026                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$66)
    2027              $C$DW$T$67      .dwtag  DW_TAG_const_type
    2028                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$168)
    2029              
    2030              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2031                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    2032              $C$DW$169       .dwtag  DW_TAG_member
    2033                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$10)
    2034                      .dwattr $C$DW$169, DW_AT_name("quot")
    2035                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_quot")
    2036                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2038                      .dwattr $C$DW$169, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2039                      .dwattr $C$DW$169, DW_AT_decl_line(0x12)
    2040                      .dwattr $C$DW$169, DW_AT_decl_column(0x16)
    2041              $C$DW$170       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$10)
    2043                      .dwattr $C$DW$170, DW_AT_name("rem")
    2044                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rem")
    2045                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2046                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2047                      .dwattr $C$DW$170, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2048                      .dwattr $C$DW$170, DW_AT_decl_line(0x12)
    2049                      .dwattr $C$DW$170, DW_AT_decl_column(0x1c)
    2050                      .dwendtag $C$DW$T$20
    2051              
    2052                      .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2053                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x12)
    2054                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    2055              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    2056                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$20)
    2057                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2058                      .dwattr $C$DW$T$90, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2059                      .dwattr $C$DW$T$90, DW_AT_decl_line(0x12)
    2060                      .dwattr $C$DW$T$90, DW_AT_decl_column(0x23)
    2061              
    2062              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2063                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    2064              $C$DW$171       .dwtag  DW_TAG_member
    2065                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$12)
    2066                      .dwattr $C$DW$171, DW_AT_name("quot")
    2067                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_quot")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE   44

    2068                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2070                      .dwattr $C$DW$171, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2071                      .dwattr $C$DW$171, DW_AT_decl_line(0x14)
    2072                      .dwattr $C$DW$171, DW_AT_decl_column(0x17)
    2073              $C$DW$172       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$12)
    2075                      .dwattr $C$DW$172, DW_AT_name("rem")
    2076                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rem")
    2077                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2078                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2079                      .dwattr $C$DW$172, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2080                      .dwattr $C$DW$172, DW_AT_decl_line(0x14)
    2081                      .dwattr $C$DW$172, DW_AT_decl_column(0x1d)
    2082                      .dwendtag $C$DW$T$21
    2083              
    2084                      .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2085                      .dwattr $C$DW$T$21, DW_AT_decl_line(0x14)
    2086                      .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2087              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    2088                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$21)
    2089                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2090                      .dwattr $C$DW$T$91, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2091                      .dwattr $C$DW$T$91, DW_AT_decl_line(0x14)
    2092                      .dwattr $C$DW$T$91, DW_AT_decl_column(0x24)
    2093              
    2094              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2095                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    2096              $C$DW$173       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$14)
    2098                      .dwattr $C$DW$173, DW_AT_name("quot")
    2099                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_quot")
    2100                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2101                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2102                      .dwattr $C$DW$173, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2103                      .dwattr $C$DW$173, DW_AT_decl_line(0x17)
    2104                      .dwattr $C$DW$173, DW_AT_decl_column(0x1c)
    2105              $C$DW$174       .dwtag  DW_TAG_member
    2106                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$14)
    2107                      .dwattr $C$DW$174, DW_AT_name("rem")
    2108                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rem")
    2109                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2110                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2111                      .dwattr $C$DW$174, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    2112                      .dwattr $C$DW$174, DW_AT_decl_line(0x17)
    2113                      .dwattr $C$DW$174, DW_AT_decl_column(0x22)
    2114                      .dwendtag $C$DW$T$22
    2115              
    2116                      .dwattr $C$DW$T$22, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    2117                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x17)
    2118                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    2119              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    2120                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$22)
    2121                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2122                      .dwattr $C$DW$T$92, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE   45

    2123                      .dwattr $C$DW$T$92, DW_AT_decl_line(0x17)
    2124                      .dwattr $C$DW$T$92, DW_AT_decl_column(0x29)
    2125              
    2126              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2127                      .dwattr $C$DW$T$26, DW_AT_name("xLIST_ITEM")
    2128                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    2129              $C$DW$175       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    2131                      .dwattr $C$DW$175, DW_AT_name("xItemValue")
    2132                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_xItemValue")
    2133                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2134                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2135                      .dwattr $C$DW$175, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2136                      .dwattr $C$DW$175, DW_AT_decl_line(0x64)
    2137                      .dwattr $C$DW$175, DW_AT_decl_column(0x0f)
    2138              $C$DW$176       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$25)
    2140                      .dwattr $C$DW$176, DW_AT_name("pxNext")
    2141                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_pxNext")
    2142                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2143                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2144                      .dwattr $C$DW$176, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2145                      .dwattr $C$DW$176, DW_AT_decl_line(0x65)
    2146                      .dwattr $C$DW$176, DW_AT_decl_column(0x1f)
    2147              $C$DW$177       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$25)
    2149                      .dwattr $C$DW$177, DW_AT_name("pxPrevious")
    2150                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_pxPrevious")
    2151                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2152                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2153                      .dwattr $C$DW$177, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2154                      .dwattr $C$DW$177, DW_AT_decl_line(0x66)
    2155                      .dwattr $C$DW$177, DW_AT_decl_column(0x1f)
    2156              $C$DW$178       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$3)
    2158                      .dwattr $C$DW$178, DW_AT_name("pvOwner")
    2159                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_pvOwner")
    2160                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2161                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2162                      .dwattr $C$DW$178, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2163                      .dwattr $C$DW$178, DW_AT_decl_line(0x67)
    2164                      .dwattr $C$DW$178, DW_AT_decl_column(0x09)
    2165              $C$DW$179       .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$3)
    2167                      .dwattr $C$DW$179, DW_AT_name("pvContainer")
    2168                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_pvContainer")
    2169                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2170                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2171                      .dwattr $C$DW$179, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2172                      .dwattr $C$DW$179, DW_AT_decl_line(0x68)
    2173                      .dwattr $C$DW$179, DW_AT_decl_column(0x09)
    2174                      .dwendtag $C$DW$T$26
    2175              
    2176                      .dwattr $C$DW$T$26, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2177                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x62)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE   46

    2178                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x08)
    2179              $C$DW$180       .dwtag  DW_TAG_TI_far_type
    2180                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$26)
    2181              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    2182                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$180)
    2183              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    2184                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2185                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
    2186              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    2187                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    2188                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2189                      .dwattr $C$DW$T$29, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2190                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x6a)
    2191                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x1b)
    2192              $C$DW$181       .dwtag  DW_TAG_TI_far_type
    2193                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$29)
    2194              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    2195                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$181)
    2196              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2197                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2198                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
    2199              
    2200              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2201                      .dwattr $C$DW$T$27, DW_AT_name("xMINI_LIST_ITEM")
    2202                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x06)
    2203              $C$DW$182       .dwtag  DW_TAG_member
    2204                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$23)
    2205                      .dwattr $C$DW$182, DW_AT_name("xItemValue")
    2206                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_xItemValue")
    2207                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2208                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2209                      .dwattr $C$DW$182, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2210                      .dwattr $C$DW$182, DW_AT_decl_line(0x6e)
    2211                      .dwattr $C$DW$182, DW_AT_decl_column(0x0f)
    2212              $C$DW$183       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$25)
    2214                      .dwattr $C$DW$183, DW_AT_name("pxNext")
    2215                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_pxNext")
    2216                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2217                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2218                      .dwattr $C$DW$183, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2219                      .dwattr $C$DW$183, DW_AT_decl_line(0x6f)
    2220                      .dwattr $C$DW$183, DW_AT_decl_column(0x1e)
    2221              $C$DW$184       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$25)
    2223                      .dwattr $C$DW$184, DW_AT_name("pxPrevious")
    2224                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_pxPrevious")
    2225                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2226                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2227                      .dwattr $C$DW$184, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2228                      .dwattr $C$DW$184, DW_AT_decl_line(0x70)
    2229                      .dwattr $C$DW$184, DW_AT_decl_column(0x1e)
    2230                      .dwendtag $C$DW$T$27
    2231              
    2232                      .dwattr $C$DW$T$27, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE   47

    2233                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x6c)
    2234                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x08)
    2235              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    2236                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
    2237                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2238                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2239                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x72)
    2240                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x20)
    2241              $C$DW$185       .dwtag  DW_TAG_TI_far_type
    2242                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$32)
    2243              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    2244                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$185)
    2245              
    2246              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2247                      .dwattr $C$DW$T$34, DW_AT_name("xLIST")
    2248                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    2249              $C$DW$186       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$28)
    2251                      .dwattr $C$DW$186, DW_AT_name("uxNumberOfItems")
    2252                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_uxNumberOfItems")
    2253                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2254                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2255                      .dwattr $C$DW$186, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2256                      .dwattr $C$DW$186, DW_AT_decl_line(0x79)
    2257                      .dwattr $C$DW$186, DW_AT_decl_column(0x22)
    2258              $C$DW$187       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    2260                      .dwattr $C$DW$187, DW_AT_name("pxIndex")
    2261                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_pxIndex")
    2262                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2263                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2264                      .dwattr $C$DW$187, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2265                      .dwattr $C$DW$187, DW_AT_decl_line(0x7a)
    2266                      .dwattr $C$DW$187, DW_AT_decl_column(0x17)
    2267              $C$DW$188       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$33)
    2269                      .dwattr $C$DW$188, DW_AT_name("xListEnd")
    2270                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_xListEnd")
    2271                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2272                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2273                      .dwattr $C$DW$188, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    2274                      .dwattr $C$DW$188, DW_AT_decl_line(0x7b)
    2275                      .dwattr $C$DW$188, DW_AT_decl_column(0x19)
    2276                      .dwendtag $C$DW$T$34
    2277              
    2278                      .dwattr $C$DW$T$34, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2279                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x77)
    2280                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    2281              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    2282                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$34)
    2283                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2284                      .dwattr $C$DW$T$93, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    2285                      .dwattr $C$DW$T$93, DW_AT_decl_line(0x7c)
    2286                      .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    2287              
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE   48

    2288              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2289                      .dwattr $C$DW$T$35, DW_AT_name("xTIME_OUT")
    2290                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    2291              $C$DW$189       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$10)
    2293                      .dwattr $C$DW$189, DW_AT_name("xOverflowCount")
    2294                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_xOverflowCount")
    2295                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2297                      .dwattr $C$DW$189, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2298                      .dwattr $C$DW$189, DW_AT_decl_line(0x5e)
    2299                      .dwattr $C$DW$189, DW_AT_decl_column(0x10)
    2300              $C$DW$190       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$23)
    2302                      .dwattr $C$DW$190, DW_AT_name("xTimeOnEntering")
    2303                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_xTimeOnEntering")
    2304                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2305                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2306                      .dwattr $C$DW$190, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2307                      .dwattr $C$DW$190, DW_AT_decl_line(0x5f)
    2308                      .dwattr $C$DW$190, DW_AT_decl_column(0x10)
    2309                      .dwendtag $C$DW$T$35
    2310              
    2311                      .dwattr $C$DW$T$35, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2312                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x5c)
    2313                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2314              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    2315                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$35)
    2316                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2317                      .dwattr $C$DW$T$94, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2318                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x60)
    2319                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x03)
    2320              
    2321              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2322                      .dwattr $C$DW$T$45, DW_AT_name("xTASK_PARAMTERS")
    2323                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x12)
    2324              $C$DW$191       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$38)
    2326                      .dwattr $C$DW$191, DW_AT_name("pvTaskCode")
    2327                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_pvTaskCode")
    2328                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2329                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2330                      .dwattr $C$DW$191, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2331                      .dwattr $C$DW$191, DW_AT_decl_line(0x71)
    2332                      .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    2333              $C$DW$192       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$41)
    2335                      .dwattr $C$DW$192, DW_AT_name("pcName")
    2336                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_pcName")
    2337                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2338                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2339                      .dwattr $C$DW$192, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2340                      .dwattr $C$DW$192, DW_AT_decl_line(0x72)
    2341                      .dwattr $C$DW$192, DW_AT_decl_column(0x1c)
    2342              $C$DW$193       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE   49

    2343                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$9)
    2344                      .dwattr $C$DW$193, DW_AT_name("usStackDepth")
    2345                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_usStackDepth")
    2346                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2347                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2348                      .dwattr $C$DW$193, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2349                      .dwattr $C$DW$193, DW_AT_decl_line(0x73)
    2350                      .dwattr $C$DW$193, DW_AT_decl_column(0x11)
    2351              $C$DW$194       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$3)
    2353                      .dwattr $C$DW$194, DW_AT_name("pvParameters")
    2354                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_pvParameters")
    2355                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2356                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2357                      .dwattr $C$DW$194, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2358                      .dwattr $C$DW$194, DW_AT_decl_line(0x74)
    2359                      .dwattr $C$DW$194, DW_AT_decl_column(0x08)
    2360              $C$DW$195       .dwtag  DW_TAG_member
    2361                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$11)
    2362                      .dwattr $C$DW$195, DW_AT_name("uxPriority")
    2363                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_uxPriority")
    2364                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2365                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2366                      .dwattr $C$DW$195, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2367                      .dwattr $C$DW$195, DW_AT_decl_line(0x75)
    2368                      .dwattr $C$DW$195, DW_AT_decl_column(0x19)
    2369              $C$DW$196       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$42)
    2371                      .dwattr $C$DW$196, DW_AT_name("puxStackBuffer")
    2372                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_puxStackBuffer")
    2373                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2374                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2375                      .dwattr $C$DW$196, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2376                      .dwattr $C$DW$196, DW_AT_decl_line(0x76)
    2377                      .dwattr $C$DW$196, DW_AT_decl_column(0x12)
    2378              $C$DW$197       .dwtag  DW_TAG_member
    2379                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$44)
    2380                      .dwattr $C$DW$197, DW_AT_name("xRegions")
    2381                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_xRegions")
    2382                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2383                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2384                      .dwattr $C$DW$197, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    2385                      .dwattr $C$DW$197, DW_AT_decl_line(0x77)
    2386                      .dwattr $C$DW$197, DW_AT_decl_column(0x10)
    2387                      .dwendtag $C$DW$T$45
    2388              
    2389                      .dwattr $C$DW$T$45, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2390                      .dwattr $C$DW$T$45, DW_AT_decl_line(0x6f)
    2391                      .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    2392              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    2393                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$45)
    2394                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2395                      .dwattr $C$DW$T$95, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    2396                      .dwattr $C$DW$T$95, DW_AT_decl_line(0x78)
    2397                      .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:33 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
QPeek.asm                                                            PAGE   50

    2398                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2399              
    2400              ;***************************************************************
    2401              ;* DWARF CIE ENTRIES                                           *
    2402              ;***************************************************************
    2403              
    2404              $C$DW$CIE       .dwcie 91
    2405                      .dwcfi  cfa_register, 36
    2406                      .dwcfi  cfa_offset, 0
    2407                      .dwcfi  undefined, 0
    2408                      .dwcfi  undefined, 1
    2409                      .dwcfi  undefined, 2
    2410                      .dwcfi  undefined, 3
    2411                      .dwcfi  undefined, 4
    2412                      .dwcfi  undefined, 5
    2413                      .dwcfi  undefined, 6
    2414                      .dwcfi  undefined, 7
    2415                      .dwcfi  undefined, 8
    2416                      .dwcfi  undefined, 9
    2417                      .dwcfi  undefined, 10
    2418                      .dwcfi  undefined, 11
    2419                      .dwcfi  undefined, 12
    2420                      .dwcfi  undefined, 13
    2421                      .dwcfi  same_value, 14
    2422                      .dwcfi  same_value, 15
    2423                      .dwcfi  undefined, 16
    2424                      .dwcfi  undefined, 17
    2425                      .dwcfi  undefined, 18
    2426                      .dwcfi  undefined, 19
    2427                      .dwcfi  undefined, 20
    2428                      .dwcfi  undefined, 21
    2429                      .dwcfi  undefined, 22
    2430                      .dwcfi  undefined, 23
    2431                      .dwcfi  undefined, 24
    2432                      .dwcfi  undefined, 25
    2433                      .dwcfi  same_value, 26
    2434                      .dwcfi  same_value, 27
    2435                      .dwcfi  same_value, 28
    2436                      .dwcfi  same_value, 29
    2437                      .dwcfi  same_value, 30
    2438                      .dwcfi  same_value, 31
    2439                      .dwcfi  undefined, 32
    2440                      .dwcfi  undefined, 33
    2441                      .dwcfi  undefined, 34
    2442                      .dwcfi  undefined, 35
    2443                      .dwcfi  undefined, 36
    2444                      .dwcfi  undefined, 37
