TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:25 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

    4028              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    4029                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$284)
    4030              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4031                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$11)
    4032                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    4033              $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    4034                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$11)
    4035                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    4036                      .dwattr $C$DW$T$117, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    4037                      .dwattr $C$DW$T$117, DW_AT_decl_line(0x27)
    4038                      .dwattr $C$DW$T$117, DW_AT_decl_column(0x1a)
    4039              $C$DW$T$12      .dwtag  DW_TAG_base_type
    4040                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4041                      .dwattr $C$DW$T$12, DW_AT_name("long")
    4042                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    4043              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    4044                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$12)
    4045                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    4046                      .dwattr $C$DW$T$118, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    4047                      .dwattr $C$DW$T$118, DW_AT_decl_line(0x11)
    4048                      .dwattr $C$DW$T$118, DW_AT_decl_column(0x1c)
    4049              $C$DW$T$13      .dwtag  DW_TAG_base_type
    4050                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   84

    4051                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4052                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    4053              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    4054                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$13)
    4055                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4056                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    4057                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x55)
    4058                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    4059              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
    4060                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$19)
    4061                      .dwattr $C$DW$T$95, DW_AT_address_class(0x17)
    4062              $C$DW$285       .dwtag  DW_TAG_TI_far_type
    4063                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$95)
    4064              $C$DW$T$96      .dwtag  DW_TAG_const_type
    4065                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$285)
    4066              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4067                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$13)
    4068                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    4069                      .dwattr $C$DW$T$56, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    4070                      .dwattr $C$DW$T$56, DW_AT_decl_line(0x21)
    4071                      .dwattr $C$DW$T$56, DW_AT_decl_column(0x19)
    4072              $C$DW$T$14      .dwtag  DW_TAG_base_type
    4073                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4074                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    4075                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    4076                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    4077                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    4078              $C$DW$T$15      .dwtag  DW_TAG_base_type
    4079                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4080                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4081                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    4082                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    4083                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    4084              $C$DW$T$16      .dwtag  DW_TAG_base_type
    4085                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4086                      .dwattr $C$DW$T$16, DW_AT_name("float")
    4087                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    4088              $C$DW$T$17      .dwtag  DW_TAG_base_type
    4089                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4090                      .dwattr $C$DW$T$17, DW_AT_name("double")
    4091                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    4092              $C$DW$T$18      .dwtag  DW_TAG_base_type
    4093                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4094                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    4095                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    4096              
    4097              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4098                      .dwattr $C$DW$T$22, DW_AT_name("xLIST_ITEM")
    4099                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0a)
    4100              $C$DW$286       .dwtag  DW_TAG_member
    4101                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    4102                      .dwattr $C$DW$286, DW_AT_name("xItemValue")
    4103                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_xItemValue")
    4104                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4105                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   85

    4106                      .dwattr $C$DW$286, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4107                      .dwattr $C$DW$286, DW_AT_decl_line(0x64)
    4108                      .dwattr $C$DW$286, DW_AT_decl_column(0x0f)
    4109              $C$DW$287       .dwtag  DW_TAG_member
    4110                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$21)
    4111                      .dwattr $C$DW$287, DW_AT_name("pxNext")
    4112                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_pxNext")
    4113                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4114                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4115                      .dwattr $C$DW$287, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4116                      .dwattr $C$DW$287, DW_AT_decl_line(0x65)
    4117                      .dwattr $C$DW$287, DW_AT_decl_column(0x1f)
    4118              $C$DW$288       .dwtag  DW_TAG_member
    4119                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$21)
    4120                      .dwattr $C$DW$288, DW_AT_name("pxPrevious")
    4121                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_pxPrevious")
    4122                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4123                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4124                      .dwattr $C$DW$288, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4125                      .dwattr $C$DW$288, DW_AT_decl_line(0x66)
    4126                      .dwattr $C$DW$288, DW_AT_decl_column(0x1f)
    4127              $C$DW$289       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$3)
    4129                      .dwattr $C$DW$289, DW_AT_name("pvOwner")
    4130                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_pvOwner")
    4131                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4132                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4133                      .dwattr $C$DW$289, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4134                      .dwattr $C$DW$289, DW_AT_decl_line(0x67)
    4135                      .dwattr $C$DW$289, DW_AT_decl_column(0x09)
    4136              $C$DW$290       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$3)
    4138                      .dwattr $C$DW$290, DW_AT_name("pvContainer")
    4139                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_pvContainer")
    4140                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4141                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4142                      .dwattr $C$DW$290, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4143                      .dwattr $C$DW$290, DW_AT_decl_line(0x68)
    4144                      .dwattr $C$DW$290, DW_AT_decl_column(0x09)
    4145                      .dwendtag $C$DW$T$22
    4146              
    4147                      .dwattr $C$DW$T$22, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    4148                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x62)
    4149                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x08)
    4150              $C$DW$291       .dwtag  DW_TAG_TI_far_type
    4151                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$22)
    4152              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    4153                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$291)
    4154              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    4155                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    4156                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
    4157              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    4158                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
    4159                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4160                      .dwattr $C$DW$T$25, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   86

    4161                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x6a)
    4162                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x1b)
    4163              $C$DW$292       .dwtag  DW_TAG_TI_far_type
    4164                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$25)
    4165              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    4166                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$292)
    4167              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    4168                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    4169                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
    4170              
    4171              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4172                      .dwattr $C$DW$T$23, DW_AT_name("xMINI_LIST_ITEM")
    4173                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    4174              $C$DW$293       .dwtag  DW_TAG_member
    4175                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    4176                      .dwattr $C$DW$293, DW_AT_name("xItemValue")
    4177                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_xItemValue")
    4178                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4179                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4180                      .dwattr $C$DW$293, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4181                      .dwattr $C$DW$293, DW_AT_decl_line(0x6e)
    4182                      .dwattr $C$DW$293, DW_AT_decl_column(0x0f)
    4183              $C$DW$294       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$21)
    4185                      .dwattr $C$DW$294, DW_AT_name("pxNext")
    4186                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_pxNext")
    4187                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4188                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4189                      .dwattr $C$DW$294, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4190                      .dwattr $C$DW$294, DW_AT_decl_line(0x6f)
    4191                      .dwattr $C$DW$294, DW_AT_decl_column(0x1e)
    4192              $C$DW$295       .dwtag  DW_TAG_member
    4193                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$21)
    4194                      .dwattr $C$DW$295, DW_AT_name("pxPrevious")
    4195                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_pxPrevious")
    4196                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4197                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4198                      .dwattr $C$DW$295, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4199                      .dwattr $C$DW$295, DW_AT_decl_line(0x70)
    4200                      .dwattr $C$DW$295, DW_AT_decl_column(0x1e)
    4201                      .dwendtag $C$DW$T$23
    4202              
    4203                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    4204                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x6c)
    4205                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x08)
    4206              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    4207                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
    4208                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4209                      .dwattr $C$DW$T$28, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    4210                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
    4211                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x20)
    4212              $C$DW$296       .dwtag  DW_TAG_TI_far_type
    4213                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$28)
    4214              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    4215                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$296)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   87

    4216              
    4217              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4218                      .dwattr $C$DW$T$30, DW_AT_name("xLIST")
    4219                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    4220              $C$DW$297       .dwtag  DW_TAG_member
    4221                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$24)
    4222                      .dwattr $C$DW$297, DW_AT_name("uxNumberOfItems")
    4223                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_uxNumberOfItems")
    4224                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4225                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4226                      .dwattr $C$DW$297, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4227                      .dwattr $C$DW$297, DW_AT_decl_line(0x79)
    4228                      .dwattr $C$DW$297, DW_AT_decl_column(0x22)
    4229              $C$DW$298       .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$27)
    4231                      .dwattr $C$DW$298, DW_AT_name("pxIndex")
    4232                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_pxIndex")
    4233                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4234                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4235                      .dwattr $C$DW$298, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4236                      .dwattr $C$DW$298, DW_AT_decl_line(0x7a)
    4237                      .dwattr $C$DW$298, DW_AT_decl_column(0x17)
    4238              $C$DW$299       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$29)
    4240                      .dwattr $C$DW$299, DW_AT_name("xListEnd")
    4241                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_xListEnd")
    4242                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4243                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4244                      .dwattr $C$DW$299, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    4245                      .dwattr $C$DW$299, DW_AT_decl_line(0x7b)
    4246                      .dwattr $C$DW$299, DW_AT_decl_column(0x19)
    4247                      .dwendtag $C$DW$T$30
    4248              
    4249                      .dwattr $C$DW$T$30, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    4250                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x77)
    4251                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    4252              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    4253                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
    4254                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4255                      .dwattr $C$DW$T$33, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    4256                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x7c)
    4257                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x03)
    4258              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    4259                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$33)
    4260                      .dwattr $C$DW$T$65, DW_AT_address_class(0x17)
    4261              $C$DW$300       .dwtag  DW_TAG_TI_far_type
    4262                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$33)
    4263              $C$DW$T$68      .dwtag  DW_TAG_const_type
    4264                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$300)
    4265              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    4266                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    4267                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
    4268              $C$DW$301       .dwtag  DW_TAG_TI_far_type
    4269                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$69)
    4270              $C$DW$T$70      .dwtag  DW_TAG_const_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   88

    4271                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$301)
    4272              
    4273              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4274                      .dwattr $C$DW$T$31, DW_AT_name("xTIME_OUT")
    4275                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    4276              $C$DW$302       .dwtag  DW_TAG_member
    4277                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$10)
    4278                      .dwattr $C$DW$302, DW_AT_name("xOverflowCount")
    4279                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_xOverflowCount")
    4280                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4281                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4282                      .dwattr $C$DW$302, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4283                      .dwattr $C$DW$302, DW_AT_decl_line(0x5e)
    4284                      .dwattr $C$DW$302, DW_AT_decl_column(0x10)
    4285              $C$DW$303       .dwtag  DW_TAG_member
    4286                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    4287                      .dwattr $C$DW$303, DW_AT_name("xTimeOnEntering")
    4288                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_xTimeOnEntering")
    4289                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4290                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4291                      .dwattr $C$DW$303, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4292                      .dwattr $C$DW$303, DW_AT_decl_line(0x5f)
    4293                      .dwattr $C$DW$303, DW_AT_decl_column(0x10)
    4294                      .dwendtag $C$DW$T$31
    4295              
    4296                      .dwattr $C$DW$T$31, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    4297                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x5c)
    4298                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4299              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    4300                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$31)
    4301                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4302                      .dwattr $C$DW$T$73, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    4303                      .dwattr $C$DW$T$73, DW_AT_decl_line(0x60)
    4304                      .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    4305              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    4306                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    4307                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    4308              $C$DW$304       .dwtag  DW_TAG_TI_far_type
    4309                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$74)
    4310              $C$DW$T$75      .dwtag  DW_TAG_const_type
    4311                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$304)
    4312              
    4313              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4314                      .dwattr $C$DW$T$34, DW_AT_name("QueueDefinition")
    4315                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x22)
    4316              $C$DW$305       .dwtag  DW_TAG_member
    4317                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$32)
    4318                      .dwattr $C$DW$305, DW_AT_name("pcHead")
    4319                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_pcHead")
    4320                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4321                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4322                      .dwattr $C$DW$305, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4323                      .dwattr $C$DW$305, DW_AT_decl_line(0x65)
    4324                      .dwattr $C$DW$305, DW_AT_decl_column(0x0f)
    4325              $C$DW$306       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   89

    4326                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$32)
    4327                      .dwattr $C$DW$306, DW_AT_name("pcTail")
    4328                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_pcTail")
    4329                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4330                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4331                      .dwattr $C$DW$306, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4332                      .dwattr $C$DW$306, DW_AT_decl_line(0x66)
    4333                      .dwattr $C$DW$306, DW_AT_decl_column(0x0f)
    4334              $C$DW$307       .dwtag  DW_TAG_member
    4335                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$32)
    4336                      .dwattr $C$DW$307, DW_AT_name("pcWriteTo")
    4337                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_pcWriteTo")
    4338                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4339                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4340                      .dwattr $C$DW$307, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4341                      .dwattr $C$DW$307, DW_AT_decl_line(0x68)
    4342                      .dwattr $C$DW$307, DW_AT_decl_column(0x0f)
    4343              $C$DW$308       .dwtag  DW_TAG_member
    4344                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$32)
    4345                      .dwattr $C$DW$308, DW_AT_name("pcReadFrom")
    4346                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_pcReadFrom")
    4347                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4348                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4349                      .dwattr $C$DW$308, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4350                      .dwattr $C$DW$308, DW_AT_decl_line(0x69)
    4351                      .dwattr $C$DW$308, DW_AT_decl_column(0x0f)
    4352              $C$DW$309       .dwtag  DW_TAG_member
    4353                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$33)
    4354                      .dwattr $C$DW$309, DW_AT_name("xTasksWaitingToSend")
    4355                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_xTasksWaitingToSend")
    4356                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4357                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4358                      .dwattr $C$DW$309, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4359                      .dwattr $C$DW$309, DW_AT_decl_line(0x6b)
    4360                      .dwattr $C$DW$309, DW_AT_decl_column(0x08)
    4361              $C$DW$310       .dwtag  DW_TAG_member
    4362                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$33)
    4363                      .dwattr $C$DW$310, DW_AT_name("xTasksWaitingToReceive")
    4364                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_xTasksWaitingToReceive")
    4365                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4366                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4367                      .dwattr $C$DW$310, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4368                      .dwattr $C$DW$310, DW_AT_decl_line(0x6c)
    4369                      .dwattr $C$DW$310, DW_AT_decl_column(0x08)
    4370              $C$DW$311       .dwtag  DW_TAG_member
    4371                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$24)
    4372                      .dwattr $C$DW$311, DW_AT_name("uxMessagesWaiting")
    4373                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_uxMessagesWaiting")
    4374                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4375                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4376                      .dwattr $C$DW$311, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4377                      .dwattr $C$DW$311, DW_AT_decl_line(0x6e)
    4378                      .dwattr $C$DW$311, DW_AT_decl_column(0x22)
    4379              $C$DW$312       .dwtag  DW_TAG_member
    4380                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$11)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   90

    4381                      .dwattr $C$DW$312, DW_AT_name("uxLength")
    4382                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_uxLength")
    4383                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4384                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4385                      .dwattr $C$DW$312, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4386                      .dwattr $C$DW$312, DW_AT_decl_line(0x6f)
    4387                      .dwattr $C$DW$312, DW_AT_decl_column(0x19)
    4388              $C$DW$313       .dwtag  DW_TAG_member
    4389                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$11)
    4390                      .dwattr $C$DW$313, DW_AT_name("uxItemSize")
    4391                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_uxItemSize")
    4392                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4393                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4394                      .dwattr $C$DW$313, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4395                      .dwattr $C$DW$313, DW_AT_decl_line(0x70)
    4396                      .dwattr $C$DW$313, DW_AT_decl_column(0x19)
    4397              $C$DW$314       .dwtag  DW_TAG_member
    4398                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$10)
    4399                      .dwattr $C$DW$314, DW_AT_name("xRxLock")
    4400                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_xRxLock")
    4401                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4402                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4403                      .dwattr $C$DW$314, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4404                      .dwattr $C$DW$314, DW_AT_decl_line(0x72)
    4405                      .dwattr $C$DW$314, DW_AT_decl_column(0x17)
    4406              $C$DW$315       .dwtag  DW_TAG_member
    4407                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$10)
    4408                      .dwattr $C$DW$315, DW_AT_name("xTxLock")
    4409                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_xTxLock")
    4410                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4411                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4412                      .dwattr $C$DW$315, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4413                      .dwattr $C$DW$315, DW_AT_decl_line(0x73)
    4414                      .dwattr $C$DW$315, DW_AT_decl_column(0x17)
    4415                      .dwendtag $C$DW$T$34
    4416              
    4417                      .dwattr $C$DW$T$34, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4418                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x63)
    4419                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    4420              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
    4421                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
    4422                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    4423                      .dwattr $C$DW$T$80, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4424                      .dwattr $C$DW$T$80, DW_AT_decl_line(0x75)
    4425                      .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    4426              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    4427                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    4428                      .dwattr $C$DW$T$81, DW_AT_address_class(0x17)
    4429              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueHandle")
    4430                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    4431                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    4432                      .dwattr $C$DW$T$82, DW_AT_decl_file("../FreeRTOS/Source/queue.c")
    4433                      .dwattr $C$DW$T$82, DW_AT_decl_line(0x7d)
    4434                      .dwattr $C$DW$T$82, DW_AT_decl_column(0x12)
    4435              $C$DW$316       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   91

    4436                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$82)
    4437              $C$DW$T$105     .dwtag  DW_TAG_const_type
    4438                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$316)
    4439              $C$DW$317       .dwtag  DW_TAG_TI_far_type
    4440                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$81)
    4441              $C$DW$T$87      .dwtag  DW_TAG_const_type
    4442                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$317)
    4443              
    4444              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4445                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    4446              $C$DW$318       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$10)
    4448                      .dwattr $C$DW$318, DW_AT_name("quot")
    4449                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_quot")
    4450                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4451                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4452                      .dwattr $C$DW$318, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    4453                      .dwattr $C$DW$318, DW_AT_decl_line(0x12)
    4454                      .dwattr $C$DW$318, DW_AT_decl_column(0x16)
    4455              $C$DW$319       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$10)
    4457                      .dwattr $C$DW$319, DW_AT_name("rem")
    4458                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_rem")
    4459                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4460                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4461                      .dwattr $C$DW$319, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    4462                      .dwattr $C$DW$319, DW_AT_decl_line(0x12)
    4463                      .dwattr $C$DW$319, DW_AT_decl_column(0x1c)
    4464                      .dwendtag $C$DW$T$35
    4465              
    4466                      .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    4467                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x12)
    4468                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    4469              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    4470                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$35)
    4471                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    4472                      .dwattr $C$DW$T$126, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    4473                      .dwattr $C$DW$T$126, DW_AT_decl_line(0x12)
    4474                      .dwattr $C$DW$T$126, DW_AT_decl_column(0x23)
    4475              
    4476              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4477                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    4478              $C$DW$320       .dwtag  DW_TAG_member
    4479                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$12)
    4480                      .dwattr $C$DW$320, DW_AT_name("quot")
    4481                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_quot")
    4482                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4483                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4484                      .dwattr $C$DW$320, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    4485                      .dwattr $C$DW$320, DW_AT_decl_line(0x14)
    4486                      .dwattr $C$DW$320, DW_AT_decl_column(0x17)
    4487              $C$DW$321       .dwtag  DW_TAG_member
    4488                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$12)
    4489                      .dwattr $C$DW$321, DW_AT_name("rem")
    4490                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_rem")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   92

    4491                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4492                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4493                      .dwattr $C$DW$321, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    4494                      .dwattr $C$DW$321, DW_AT_decl_line(0x14)
    4495                      .dwattr $C$DW$321, DW_AT_decl_column(0x1d)
    4496                      .dwendtag $C$DW$T$36
    4497              
    4498                      .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    4499                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x14)
    4500                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    4501              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    4502                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$36)
    4503                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    4504                      .dwattr $C$DW$T$127, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    4505                      .dwattr $C$DW$T$127, DW_AT_decl_line(0x14)
    4506                      .dwattr $C$DW$T$127, DW_AT_decl_column(0x24)
    4507              
    4508              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4509                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    4510              $C$DW$322       .dwtag  DW_TAG_member
    4511                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$14)
    4512                      .dwattr $C$DW$322, DW_AT_name("quot")
    4513                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_quot")
    4514                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4515                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4516                      .dwattr $C$DW$322, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    4517                      .dwattr $C$DW$322, DW_AT_decl_line(0x17)
    4518                      .dwattr $C$DW$322, DW_AT_decl_column(0x1c)
    4519              $C$DW$323       .dwtag  DW_TAG_member
    4520                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$14)
    4521                      .dwattr $C$DW$323, DW_AT_name("rem")
    4522                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_rem")
    4523                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4524                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4525                      .dwattr $C$DW$323, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    4526                      .dwattr $C$DW$323, DW_AT_decl_line(0x17)
    4527                      .dwattr $C$DW$323, DW_AT_decl_column(0x22)
    4528                      .dwendtag $C$DW$T$37
    4529              
    4530                      .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    4531                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x17)
    4532                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4533              $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    4534                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$37)
    4535                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    4536                      .dwattr $C$DW$T$128, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    4537                      .dwattr $C$DW$T$128, DW_AT_decl_line(0x17)
    4538                      .dwattr $C$DW$T$128, DW_AT_decl_column(0x29)
    4539              
    4540              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4541                      .dwattr $C$DW$T$38, DW_AT_name("xMEMORY_REGION")
    4542                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x06)
    4543              $C$DW$324       .dwtag  DW_TAG_member
    4544                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$3)
    4545                      .dwattr $C$DW$324, DW_AT_name("pvBaseAddress")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   93

    4546                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_pvBaseAddress")
    4547                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4548                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4549                      .dwattr $C$DW$324, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4550                      .dwattr $C$DW$324, DW_AT_decl_line(0x67)
    4551                      .dwattr $C$DW$324, DW_AT_decl_column(0x08)
    4552              $C$DW$325       .dwtag  DW_TAG_member
    4553                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$13)
    4554                      .dwattr $C$DW$325, DW_AT_name("ulLengthInBytes")
    4555                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_ulLengthInBytes")
    4556                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4557                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4558                      .dwattr $C$DW$325, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4559                      .dwattr $C$DW$325, DW_AT_decl_line(0x68)
    4560                      .dwattr $C$DW$325, DW_AT_decl_column(0x10)
    4561              $C$DW$326       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$13)
    4563                      .dwattr $C$DW$326, DW_AT_name("ulParameters")
    4564                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_ulParameters")
    4565                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4566                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4567                      .dwattr $C$DW$326, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4568                      .dwattr $C$DW$326, DW_AT_decl_line(0x69)
    4569                      .dwattr $C$DW$326, DW_AT_decl_column(0x10)
    4570                      .dwendtag $C$DW$T$38
    4571              
    4572                      .dwattr $C$DW$T$38, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    4573                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x65)
    4574                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4575              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    4576                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$38)
    4577                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4578                      .dwattr $C$DW$T$46, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    4579                      .dwattr $C$DW$T$46, DW_AT_decl_line(0x6a)
    4580                      .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    4581              
    4582              $C$DW$T$47      .dwtag  DW_TAG_array_type
    4583                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4584                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4585                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x06)
    4586              $C$DW$327       .dwtag  DW_TAG_subrange_type
    4587                      .dwattr $C$DW$327, DW_AT_upper_bound(0x00)
    4588                      .dwendtag $C$DW$T$47
    4589              
    4590              
    4591              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4592                      .dwattr $C$DW$T$48, DW_AT_name("xTASK_PARAMTERS")
    4593                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x12)
    4594              $C$DW$328       .dwtag  DW_TAG_member
    4595                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$41)
    4596                      .dwattr $C$DW$328, DW_AT_name("pvTaskCode")
    4597                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_pvTaskCode")
    4598                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4599                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4600                      .dwattr $C$DW$328, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   94

    4601                      .dwattr $C$DW$328, DW_AT_decl_line(0x71)
    4602                      .dwattr $C$DW$328, DW_AT_decl_column(0x0e)
    4603              $C$DW$329       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$44)
    4605                      .dwattr $C$DW$329, DW_AT_name("pcName")
    4606                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_pcName")
    4607                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4608                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4609                      .dwattr $C$DW$329, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4610                      .dwattr $C$DW$329, DW_AT_decl_line(0x72)
    4611                      .dwattr $C$DW$329, DW_AT_decl_column(0x1c)
    4612              $C$DW$330       .dwtag  DW_TAG_member
    4613                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$9)
    4614                      .dwattr $C$DW$330, DW_AT_name("usStackDepth")
    4615                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_usStackDepth")
    4616                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4617                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4618                      .dwattr $C$DW$330, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4619                      .dwattr $C$DW$330, DW_AT_decl_line(0x73)
    4620                      .dwattr $C$DW$330, DW_AT_decl_column(0x11)
    4621              $C$DW$331       .dwtag  DW_TAG_member
    4622                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$3)
    4623                      .dwattr $C$DW$331, DW_AT_name("pvParameters")
    4624                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_pvParameters")
    4625                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4626                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4627                      .dwattr $C$DW$331, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4628                      .dwattr $C$DW$331, DW_AT_decl_line(0x74)
    4629                      .dwattr $C$DW$331, DW_AT_decl_column(0x08)
    4630              $C$DW$332       .dwtag  DW_TAG_member
    4631                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$11)
    4632                      .dwattr $C$DW$332, DW_AT_name("uxPriority")
    4633                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_uxPriority")
    4634                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4635                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4636                      .dwattr $C$DW$332, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4637                      .dwattr $C$DW$332, DW_AT_decl_line(0x75)
    4638                      .dwattr $C$DW$332, DW_AT_decl_column(0x19)
    4639              $C$DW$333       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$45)
    4641                      .dwattr $C$DW$333, DW_AT_name("puxStackBuffer")
    4642                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_puxStackBuffer")
    4643                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4644                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4645                      .dwattr $C$DW$333, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4646                      .dwattr $C$DW$333, DW_AT_decl_line(0x76)
    4647                      .dwattr $C$DW$333, DW_AT_decl_column(0x12)
    4648              $C$DW$334       .dwtag  DW_TAG_member
    4649                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$47)
    4650                      .dwattr $C$DW$334, DW_AT_name("xRegions")
    4651                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_xRegions")
    4652                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4653                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4654                      .dwattr $C$DW$334, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4655                      .dwattr $C$DW$334, DW_AT_decl_line(0x77)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   95

    4656                      .dwattr $C$DW$334, DW_AT_decl_column(0x10)
    4657                      .dwendtag $C$DW$T$48
    4658              
    4659                      .dwattr $C$DW$T$48, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    4660                      .dwattr $C$DW$T$48, DW_AT_decl_line(0x6f)
    4661                      .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
    4662              $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    4663                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$48)
    4664                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    4665                      .dwattr $C$DW$T$129, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/
    4666                      .dwattr $C$DW$T$129, DW_AT_decl_line(0x78)
    4667                      .dwattr $C$DW$T$129, DW_AT_decl_column(0x03)
    4668              
    4669              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    4670                      .dwattr $C$DW$T$53, DW_AT_name("corCoRoutineControlBlock")
    4671                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x1a)
    4672              $C$DW$335       .dwtag  DW_TAG_member
    4673                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$52)
    4674                      .dwattr $C$DW$335, DW_AT_name("pxCoRoutineFunction")
    4675                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_pxCoRoutineFunction")
    4676                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4677                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4678                      .dwattr $C$DW$335, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4679                      .dwattr $C$DW$335, DW_AT_decl_line(0x50)
    4680                      .dwattr $C$DW$335, DW_AT_decl_column(0x15)
    4681              $C$DW$336       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$25)
    4683                      .dwattr $C$DW$336, DW_AT_name("xGenericListItem")
    4684                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_xGenericListItem")
    4685                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4686                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4687                      .dwattr $C$DW$336, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4688                      .dwattr $C$DW$336, DW_AT_decl_line(0x51)
    4689                      .dwattr $C$DW$336, DW_AT_decl_column(0x0f)
    4690              $C$DW$337       .dwtag  DW_TAG_member
    4691                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$25)
    4692                      .dwattr $C$DW$337, DW_AT_name("xEventListItem")
    4693                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_xEventListItem")
    4694                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4695                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4696                      .dwattr $C$DW$337, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4697                      .dwattr $C$DW$337, DW_AT_decl_line(0x52)
    4698                      .dwattr $C$DW$337, DW_AT_decl_column(0x0f)
    4699              $C$DW$338       .dwtag  DW_TAG_member
    4700                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$11)
    4701                      .dwattr $C$DW$338, DW_AT_name("uxPriority")
    4702                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_uxPriority")
    4703                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4704                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    4705                      .dwattr $C$DW$338, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4706                      .dwattr $C$DW$338, DW_AT_decl_line(0x53)
    4707                      .dwattr $C$DW$338, DW_AT_decl_column(0x1a)
    4708              $C$DW$339       .dwtag  DW_TAG_member
    4709                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$11)
    4710                      .dwattr $C$DW$339, DW_AT_name("uxIndex")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   96

    4711                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_uxIndex")
    4712                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4713                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    4714                      .dwattr $C$DW$339, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4715                      .dwattr $C$DW$339, DW_AT_decl_line(0x54)
    4716                      .dwattr $C$DW$339, DW_AT_decl_column(0x1a)
    4717              $C$DW$340       .dwtag  DW_TAG_member
    4718                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$9)
    4719                      .dwattr $C$DW$340, DW_AT_name("uxState")
    4720                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_uxState")
    4721                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4722                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    4723                      .dwattr $C$DW$340, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    4724                      .dwattr $C$DW$340, DW_AT_decl_line(0x55)
    4725                      .dwattr $C$DW$340, DW_AT_decl_column(0x13)
    4726                      .dwendtag $C$DW$T$53
    4727              
    4728                      .dwattr $C$DW$T$53, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    4729                      .dwattr $C$DW$T$53, DW_AT_decl_line(0x4e)
    4730                      .dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
    4731              $C$DW$T$130     .dwtag  DW_TAG_typedef, DW_AT_name("corCRCB")
    4732                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$53)
    4733                      .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    4734                      .dwattr $C$DW$T$130, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/
    4735                      .dwattr $C$DW$T$130, DW_AT_decl_line(0x56)
    4736                      .dwattr $C$DW$T$130, DW_AT_decl_column(0x03)
    4737                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4738              
    4739              ;***************************************************************
    4740              ;* DWARF CIE ENTRIES                                           *
    4741              ;***************************************************************
    4742              
    4743              $C$DW$CIE       .dwcie 91
    4744                      .dwcfi  cfa_register, 36
    4745                      .dwcfi  cfa_offset, 0
    4746                      .dwcfi  undefined, 0
    4747                      .dwcfi  undefined, 1
    4748                      .dwcfi  undefined, 2
    4749                      .dwcfi  undefined, 3
    4750                      .dwcfi  undefined, 4
    4751                      .dwcfi  undefined, 5
    4752                      .dwcfi  undefined, 6
    4753                      .dwcfi  undefined, 7
    4754                      .dwcfi  undefined, 8
    4755                      .dwcfi  undefined, 9
    4756                      .dwcfi  undefined, 10
    4757                      .dwcfi  undefined, 11
    4758                      .dwcfi  undefined, 12
    4759                      .dwcfi  undefined, 13
    4760                      .dwcfi  same_value, 14
    4761                      .dwcfi  same_value, 15
    4762                      .dwcfi  undefined, 16
    4763                      .dwcfi  undefined, 17
    4764                      .dwcfi  undefined, 18
    4765                      .dwcfi  undefined, 19
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:26 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
queue.asm                                                            PAGE   97

    4766                      .dwcfi  undefined, 20
    4767                      .dwcfi  undefined, 21
    4768                      .dwcfi  undefined, 22
    4769                      .dwcfi  undefined, 23
    4770                      .dwcfi  undefined, 24
    4771                      .dwcfi  undefined, 25
    4772                      .dwcfi  same_value, 26
    4773                      .dwcfi  same_value, 27
    4774                      .dwcfi  same_value, 28
    4775                      .dwcfi  same_value, 29
    4776                      .dwcfi  same_value, 30
    4777                      .dwcfi  same_value, 31
    4778                      .dwcfi  undefined, 32
    4779                      .dwcfi  undefined, 33
    4780                      .dwcfi  undefined, 34
    4781                      .dwcfi  undefined, 35
    4782                      .dwcfi  undefined, 36
    4783                      .dwcfi  undefined, 37
