TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE    1

       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:35 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .model call=c55_std
      13                      .model mem=huge
      14                      .noremark 5002  ; code respects overwrite rules
      15              ;*******************************************************************************
      16              ;* GLOBAL FILE PARAMETERS                                                      *
      17              ;*                                                                             *

    1248                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    1249              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1250                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$11)
    1251                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1252                      .dwattr $C$DW$T$93, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1253                      .dwattr $C$DW$T$93, DW_AT_decl_line(0x27)
    1254                      .dwattr $C$DW$T$93, DW_AT_decl_column(0x1a)
    1255              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1256                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1257                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1258                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1259              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    1260                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$12)
    1261                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    1262                      .dwattr $C$DW$T$94, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1263                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x11)
    1264                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x1c)
    1265              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1266                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1267                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1268                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1269              $C$DW$102       .dwtag  DW_TAG_TI_far_type
    1270                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$13)
    1271              $C$DW$T$22      .dwtag  DW_TAG_volatile_type
    1272                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$102)
    1273              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    1274                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1275                      .dwattr $C$DW$T$23, DW_AT_address_class(0x17)
    1276              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1277                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$13)
    1278                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1279                      .dwattr $C$DW$T$24, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1280                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x55)
    1281                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x1c)
    1282              $C$DW$103       .dwtag  DW_TAG_TI_far_type
    1283                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$24)
    1284              $C$DW$T$95      .dwtag  DW_TAG_const_type
    1285                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$103)
    1286              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1287                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$13)
    1288                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1289                      .dwattr $C$DW$T$52, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1290                      .dwattr $C$DW$T$52, DW_AT_decl_line(0x21)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE   28

    1291                      .dwattr $C$DW$T$52, DW_AT_decl_column(0x19)
    1292              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1293                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1294                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1295                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1296                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1297                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1298              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1299                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1300                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1301                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1302                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1303                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1304              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1305                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1306                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1307                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1308              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1309                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1310                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1311                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1312              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1313                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1314                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1315                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1316              
    1317              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1318                      .dwattr $C$DW$T$19, DW_AT_name("xMEMORY_REGION")
    1319                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x06)
    1320              $C$DW$104       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$3)
    1322                      .dwattr $C$DW$104, DW_AT_name("pvBaseAddress")
    1323                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_pvBaseAddress")
    1324                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1326                      .dwattr $C$DW$104, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1327                      .dwattr $C$DW$104, DW_AT_decl_line(0x67)
    1328                      .dwattr $C$DW$104, DW_AT_decl_column(0x08)
    1329              $C$DW$105       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$13)
    1331                      .dwattr $C$DW$105, DW_AT_name("ulLengthInBytes")
    1332                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ulLengthInBytes")
    1333                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1334                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1335                      .dwattr $C$DW$105, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1336                      .dwattr $C$DW$105, DW_AT_decl_line(0x68)
    1337                      .dwattr $C$DW$105, DW_AT_decl_column(0x10)
    1338              $C$DW$106       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$13)
    1340                      .dwattr $C$DW$106, DW_AT_name("ulParameters")
    1341                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ulParameters")
    1342                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1343                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1344                      .dwattr $C$DW$106, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1345                      .dwattr $C$DW$106, DW_AT_decl_line(0x69)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE   29

    1346                      .dwattr $C$DW$106, DW_AT_decl_column(0x10)
    1347                      .dwendtag $C$DW$T$19
    1348              
    1349                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1350                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x65)
    1351                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    1352              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1353                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    1354                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1355                      .dwattr $C$DW$T$48, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1356                      .dwattr $C$DW$T$48, DW_AT_decl_line(0x6a)
    1357                      .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    1358              
    1359              $C$DW$T$49      .dwtag  DW_TAG_array_type
    1360                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1361                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1362                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x06)
    1363              $C$DW$107       .dwtag  DW_TAG_subrange_type
    1364                      .dwattr $C$DW$107, DW_AT_upper_bound(0x00)
    1365                      .dwendtag $C$DW$T$49
    1366              
    1367              $C$DW$108       .dwtag  DW_TAG_TI_far_type
    1368                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$48)
    1369              $C$DW$T$73      .dwtag  DW_TAG_const_type
    1370                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$108)
    1371              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    1372                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1373                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    1374              $C$DW$109       .dwtag  DW_TAG_TI_far_type
    1375                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$74)
    1376              $C$DW$T$75      .dwtag  DW_TAG_const_type
    1377                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$109)
    1378              
    1379              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1380                      .dwattr $C$DW$T$25, DW_AT_name("SEMAPHORE_PARAMETERS")
    1381                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
    1382              $C$DW$110       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
    1384                      .dwattr $C$DW$110, DW_AT_name("xSemaphore")
    1385                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_xSemaphore")
    1386                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1388                      .dwattr $C$DW$110, DW_AT_decl_file("../FreeRTOS/Demo/Common/Minimal/semtest.c")
    1389                      .dwattr $C$DW$110, DW_AT_decl_line(0x68)
    1390                      .dwattr $C$DW$110, DW_AT_decl_column(0x13)
    1391              $C$DW$111       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$23)
    1393                      .dwattr $C$DW$111, DW_AT_name("pulSharedVariable")
    1394                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_pulSharedVariable")
    1395                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1396                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1397                      .dwattr $C$DW$111, DW_AT_decl_file("../FreeRTOS/Demo/Common/Minimal/semtest.c")
    1398                      .dwattr $C$DW$111, DW_AT_decl_line(0x69)
    1399                      .dwattr $C$DW$111, DW_AT_decl_column(0x1a)
    1400              $C$DW$112       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE   30

    1401                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$24)
    1402                      .dwattr $C$DW$112, DW_AT_name("xBlockTime")
    1403                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_xBlockTime")
    1404                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1405                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1406                      .dwattr $C$DW$112, DW_AT_decl_file("../FreeRTOS/Demo/Common/Minimal/semtest.c")
    1407                      .dwattr $C$DW$112, DW_AT_decl_line(0x6a)
    1408                      .dwattr $C$DW$112, DW_AT_decl_column(0x0f)
    1409                      .dwendtag $C$DW$T$25
    1410              
    1411                      .dwattr $C$DW$T$25, DW_AT_decl_file("../FreeRTOS/Demo/Common/Minimal/semtest.c")
    1412                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x66)
    1413                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1414              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("xSemaphoreParameters")
    1415                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$25)
    1416                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1417                      .dwattr $C$DW$T$99, DW_AT_decl_file("../FreeRTOS/Demo/Common/Minimal/semtest.c")
    1418                      .dwattr $C$DW$T$99, DW_AT_decl_line(0x6b)
    1419                      .dwattr $C$DW$T$99, DW_AT_decl_column(0x03)
    1420              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    1421                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    1422                      .dwattr $C$DW$T$100, DW_AT_address_class(0x17)
    1423              
    1424              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1425                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1426              $C$DW$113       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$10)
    1428                      .dwattr $C$DW$113, DW_AT_name("quot")
    1429                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_quot")
    1430                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1432                      .dwattr $C$DW$113, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1433                      .dwattr $C$DW$113, DW_AT_decl_line(0x12)
    1434                      .dwattr $C$DW$113, DW_AT_decl_column(0x16)
    1435              $C$DW$114       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$10)
    1437                      .dwattr $C$DW$114, DW_AT_name("rem")
    1438                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rem")
    1439                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1440                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1441                      .dwattr $C$DW$114, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1442                      .dwattr $C$DW$114, DW_AT_decl_line(0x12)
    1443                      .dwattr $C$DW$114, DW_AT_decl_column(0x1c)
    1444                      .dwendtag $C$DW$T$26
    1445              
    1446                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1447                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x12)
    1448                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    1449              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    1450                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$26)
    1451                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    1452                      .dwattr $C$DW$T$102, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    1453                      .dwattr $C$DW$T$102, DW_AT_decl_line(0x12)
    1454                      .dwattr $C$DW$T$102, DW_AT_decl_column(0x23)
    1455              
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE   31

    1456              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1457                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1458              $C$DW$115       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$12)
    1460                      .dwattr $C$DW$115, DW_AT_name("quot")
    1461                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_quot")
    1462                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1464                      .dwattr $C$DW$115, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1465                      .dwattr $C$DW$115, DW_AT_decl_line(0x14)
    1466                      .dwattr $C$DW$115, DW_AT_decl_column(0x17)
    1467              $C$DW$116       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$12)
    1469                      .dwattr $C$DW$116, DW_AT_name("rem")
    1470                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rem")
    1471                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1472                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1473                      .dwattr $C$DW$116, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1474                      .dwattr $C$DW$116, DW_AT_decl_line(0x14)
    1475                      .dwattr $C$DW$116, DW_AT_decl_column(0x1d)
    1476                      .dwendtag $C$DW$T$27
    1477              
    1478                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    1479                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x14)
    1480                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1481              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    1482                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$27)
    1483                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    1484                      .dwattr $C$DW$T$103, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    1485                      .dwattr $C$DW$T$103, DW_AT_decl_line(0x14)
    1486                      .dwattr $C$DW$T$103, DW_AT_decl_column(0x24)
    1487              
    1488              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1489                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    1490              $C$DW$117       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$14)
    1492                      .dwattr $C$DW$117, DW_AT_name("quot")
    1493                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_quot")
    1494                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1496                      .dwattr $C$DW$117, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1497                      .dwattr $C$DW$117, DW_AT_decl_line(0x17)
    1498                      .dwattr $C$DW$117, DW_AT_decl_column(0x1c)
    1499              $C$DW$118       .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$14)
    1501                      .dwattr $C$DW$118, DW_AT_name("rem")
    1502                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rem")
    1503                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1504                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1505                      .dwattr $C$DW$118, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    1506                      .dwattr $C$DW$118, DW_AT_decl_line(0x17)
    1507                      .dwattr $C$DW$118, DW_AT_decl_column(0x22)
    1508                      .dwendtag $C$DW$T$28
    1509              
    1510                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE   32

    1511                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x17)
    1512                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1513              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    1514                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$28)
    1515                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    1516                      .dwattr $C$DW$T$104, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    1517                      .dwattr $C$DW$T$104, DW_AT_decl_line(0x17)
    1518                      .dwattr $C$DW$T$104, DW_AT_decl_column(0x29)
    1519              
    1520              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1521                      .dwattr $C$DW$T$31, DW_AT_name("xLIST_ITEM")
    1522                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    1523              $C$DW$119       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$24)
    1525                      .dwattr $C$DW$119, DW_AT_name("xItemValue")
    1526                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_xItemValue")
    1527                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1528                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1529                      .dwattr $C$DW$119, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1530                      .dwattr $C$DW$119, DW_AT_decl_line(0x64)
    1531                      .dwattr $C$DW$119, DW_AT_decl_column(0x0f)
    1532              $C$DW$120       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$30)
    1534                      .dwattr $C$DW$120, DW_AT_name("pxNext")
    1535                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_pxNext")
    1536                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1537                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1538                      .dwattr $C$DW$120, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1539                      .dwattr $C$DW$120, DW_AT_decl_line(0x65)
    1540                      .dwattr $C$DW$120, DW_AT_decl_column(0x1f)
    1541              $C$DW$121       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$30)
    1543                      .dwattr $C$DW$121, DW_AT_name("pxPrevious")
    1544                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_pxPrevious")
    1545                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1546                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1547                      .dwattr $C$DW$121, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1548                      .dwattr $C$DW$121, DW_AT_decl_line(0x66)
    1549                      .dwattr $C$DW$121, DW_AT_decl_column(0x1f)
    1550              $C$DW$122       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$3)
    1552                      .dwattr $C$DW$122, DW_AT_name("pvOwner")
    1553                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_pvOwner")
    1554                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1555                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1556                      .dwattr $C$DW$122, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1557                      .dwattr $C$DW$122, DW_AT_decl_line(0x67)
    1558                      .dwattr $C$DW$122, DW_AT_decl_column(0x09)
    1559              $C$DW$123       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$3)
    1561                      .dwattr $C$DW$123, DW_AT_name("pvContainer")
    1562                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_pvContainer")
    1563                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1564                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1565                      .dwattr $C$DW$123, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE   33

    1566                      .dwattr $C$DW$123, DW_AT_decl_line(0x68)
    1567                      .dwattr $C$DW$123, DW_AT_decl_column(0x09)
    1568                      .dwendtag $C$DW$T$31
    1569              
    1570                      .dwattr $C$DW$T$31, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1571                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x62)
    1572                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x08)
    1573              $C$DW$124       .dwtag  DW_TAG_TI_far_type
    1574                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$31)
    1575              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    1576                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$124)
    1577              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    1578                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1579                      .dwattr $C$DW$T$30, DW_AT_address_class(0x17)
    1580              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1581                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    1582                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1583                      .dwattr $C$DW$T$34, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1584                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x6a)
    1585                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x1b)
    1586              $C$DW$125       .dwtag  DW_TAG_TI_far_type
    1587                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$34)
    1588              $C$DW$T$35      .dwtag  DW_TAG_volatile_type
    1589                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$125)
    1590              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1591                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1592                      .dwattr $C$DW$T$36, DW_AT_address_class(0x17)
    1593              
    1594              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1595                      .dwattr $C$DW$T$32, DW_AT_name("xMINI_LIST_ITEM")
    1596                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x06)
    1597              $C$DW$126       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$24)
    1599                      .dwattr $C$DW$126, DW_AT_name("xItemValue")
    1600                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_xItemValue")
    1601                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1603                      .dwattr $C$DW$126, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1604                      .dwattr $C$DW$126, DW_AT_decl_line(0x6e)
    1605                      .dwattr $C$DW$126, DW_AT_decl_column(0x0f)
    1606              $C$DW$127       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$30)
    1608                      .dwattr $C$DW$127, DW_AT_name("pxNext")
    1609                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_pxNext")
    1610                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1611                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1612                      .dwattr $C$DW$127, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1613                      .dwattr $C$DW$127, DW_AT_decl_line(0x6f)
    1614                      .dwattr $C$DW$127, DW_AT_decl_column(0x1e)
    1615              $C$DW$128       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$30)
    1617                      .dwattr $C$DW$128, DW_AT_name("pxPrevious")
    1618                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_pxPrevious")
    1619                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1620                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE   34

    1621                      .dwattr $C$DW$128, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1622                      .dwattr $C$DW$128, DW_AT_decl_line(0x70)
    1623                      .dwattr $C$DW$128, DW_AT_decl_column(0x1e)
    1624                      .dwendtag $C$DW$T$32
    1625              
    1626                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1627                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x6c)
    1628                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x08)
    1629              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1630                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$32)
    1631                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1632                      .dwattr $C$DW$T$37, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1633                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x72)
    1634                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x20)
    1635              $C$DW$129       .dwtag  DW_TAG_TI_far_type
    1636                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$37)
    1637              $C$DW$T$38      .dwtag  DW_TAG_volatile_type
    1638                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$129)
    1639              
    1640              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1641                      .dwattr $C$DW$T$39, DW_AT_name("xLIST")
    1642                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    1643              $C$DW$130       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$33)
    1645                      .dwattr $C$DW$130, DW_AT_name("uxNumberOfItems")
    1646                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1647                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1649                      .dwattr $C$DW$130, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1650                      .dwattr $C$DW$130, DW_AT_decl_line(0x79)
    1651                      .dwattr $C$DW$130, DW_AT_decl_column(0x22)
    1652              $C$DW$131       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$36)
    1654                      .dwattr $C$DW$131, DW_AT_name("pxIndex")
    1655                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_pxIndex")
    1656                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1657                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1658                      .dwattr $C$DW$131, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1659                      .dwattr $C$DW$131, DW_AT_decl_line(0x7a)
    1660                      .dwattr $C$DW$131, DW_AT_decl_column(0x17)
    1661              $C$DW$132       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$38)
    1663                      .dwattr $C$DW$132, DW_AT_name("xListEnd")
    1664                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_xListEnd")
    1665                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1666                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1667                      .dwattr $C$DW$132, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    1668                      .dwattr $C$DW$132, DW_AT_decl_line(0x7b)
    1669                      .dwattr $C$DW$132, DW_AT_decl_column(0x19)
    1670                      .dwendtag $C$DW$T$39
    1671              
    1672                      .dwattr $C$DW$T$39, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    1673                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x77)
    1674                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1675              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("xList")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE   35

    1676                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$39)
    1677                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    1678                      .dwattr $C$DW$T$105, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\
    1679                      .dwattr $C$DW$T$105, DW_AT_decl_line(0x7c)
    1680                      .dwattr $C$DW$T$105, DW_AT_decl_column(0x03)
    1681              
    1682              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1683                      .dwattr $C$DW$T$40, DW_AT_name("xTIME_OUT")
    1684                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1685              $C$DW$133       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$10)
    1687                      .dwattr $C$DW$133, DW_AT_name("xOverflowCount")
    1688                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_xOverflowCount")
    1689                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1691                      .dwattr $C$DW$133, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1692                      .dwattr $C$DW$133, DW_AT_decl_line(0x5e)
    1693                      .dwattr $C$DW$133, DW_AT_decl_column(0x10)
    1694              $C$DW$134       .dwtag  DW_TAG_member
    1695                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$24)
    1696                      .dwattr $C$DW$134, DW_AT_name("xTimeOnEntering")
    1697                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_xTimeOnEntering")
    1698                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1699                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1700                      .dwattr $C$DW$134, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1701                      .dwattr $C$DW$134, DW_AT_decl_line(0x5f)
    1702                      .dwattr $C$DW$134, DW_AT_decl_column(0x10)
    1703                      .dwendtag $C$DW$T$40
    1704              
    1705                      .dwattr $C$DW$T$40, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1706                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x5c)
    1707                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1708              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1709                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$40)
    1710                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    1711                      .dwattr $C$DW$T$106, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/
    1712                      .dwattr $C$DW$T$106, DW_AT_decl_line(0x60)
    1713                      .dwattr $C$DW$T$106, DW_AT_decl_column(0x03)
    1714              
    1715              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1716                      .dwattr $C$DW$T$50, DW_AT_name("xTASK_PARAMTERS")
    1717                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x12)
    1718              $C$DW$135       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$43)
    1720                      .dwattr $C$DW$135, DW_AT_name("pvTaskCode")
    1721                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_pvTaskCode")
    1722                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1724                      .dwattr $C$DW$135, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1725                      .dwattr $C$DW$135, DW_AT_decl_line(0x71)
    1726                      .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    1727              $C$DW$136       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$46)
    1729                      .dwattr $C$DW$136, DW_AT_name("pcName")
    1730                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_pcName")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE   36

    1731                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1732                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1733                      .dwattr $C$DW$136, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1734                      .dwattr $C$DW$136, DW_AT_decl_line(0x72)
    1735                      .dwattr $C$DW$136, DW_AT_decl_column(0x1c)
    1736              $C$DW$137       .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$9)
    1738                      .dwattr $C$DW$137, DW_AT_name("usStackDepth")
    1739                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_usStackDepth")
    1740                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1741                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1742                      .dwattr $C$DW$137, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1743                      .dwattr $C$DW$137, DW_AT_decl_line(0x73)
    1744                      .dwattr $C$DW$137, DW_AT_decl_column(0x11)
    1745              $C$DW$138       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$3)
    1747                      .dwattr $C$DW$138, DW_AT_name("pvParameters")
    1748                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_pvParameters")
    1749                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1750                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1751                      .dwattr $C$DW$138, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1752                      .dwattr $C$DW$138, DW_AT_decl_line(0x74)
    1753                      .dwattr $C$DW$138, DW_AT_decl_column(0x08)
    1754              $C$DW$139       .dwtag  DW_TAG_member
    1755                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    1756                      .dwattr $C$DW$139, DW_AT_name("uxPriority")
    1757                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_uxPriority")
    1758                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1759                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1760                      .dwattr $C$DW$139, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1761                      .dwattr $C$DW$139, DW_AT_decl_line(0x75)
    1762                      .dwattr $C$DW$139, DW_AT_decl_column(0x19)
    1763              $C$DW$140       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$47)
    1765                      .dwattr $C$DW$140, DW_AT_name("puxStackBuffer")
    1766                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_puxStackBuffer")
    1767                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1768                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1769                      .dwattr $C$DW$140, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1770                      .dwattr $C$DW$140, DW_AT_decl_line(0x76)
    1771                      .dwattr $C$DW$140, DW_AT_decl_column(0x12)
    1772              $C$DW$141       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$49)
    1774                      .dwattr $C$DW$141, DW_AT_name("xRegions")
    1775                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_xRegions")
    1776                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1777                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1778                      .dwattr $C$DW$141, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    1779                      .dwattr $C$DW$141, DW_AT_decl_line(0x77)
    1780                      .dwattr $C$DW$141, DW_AT_decl_column(0x10)
    1781                      .dwendtag $C$DW$T$50
    1782              
    1783                      .dwattr $C$DW$T$50, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    1784                      .dwattr $C$DW$T$50, DW_AT_decl_line(0x6f)
    1785                      .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:35 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
semtest.asm                                                          PAGE   37

    1786              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1787                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$50)
    1788                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    1789                      .dwattr $C$DW$T$107, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/
    1790                      .dwattr $C$DW$T$107, DW_AT_decl_line(0x78)
    1791                      .dwattr $C$DW$T$107, DW_AT_decl_column(0x03)
    1792                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1793              
    1794              ;***************************************************************
    1795              ;* DWARF CIE ENTRIES                                           *
    1796              ;***************************************************************
    1797              
    1798              $C$DW$CIE       .dwcie 91
    1799                      .dwcfi  cfa_register, 36
    1800                      .dwcfi  cfa_offset, 0
    1801                      .dwcfi  undefined, 0
    1802                      .dwcfi  undefined, 1
    1803                      .dwcfi  undefined, 2
    1804                      .dwcfi  undefined, 3
    1805                      .dwcfi  undefined, 4
    1806                      .dwcfi  undefined, 5
    1807                      .dwcfi  undefined, 6
    1808                      .dwcfi  undefined, 7
    1809                      .dwcfi  undefined, 8
    1810                      .dwcfi  undefined, 9
    1811                      .dwcfi  undefined, 10
    1812                      .dwcfi  undefined, 11
    1813                      .dwcfi  undefined, 12
    1814                      .dwcfi  undefined, 13
    1815                      .dwcfi  same_value, 14
    1816                      .dwcfi  same_value, 15
    1817                      .dwcfi  undefined, 16
    1818                      .dwcfi  undefined, 17
    1819                      .dwcfi  undefined, 18
    1820                      .dwcfi  undefined, 19
    1821                      .dwcfi  undefined, 20
    1822                      .dwcfi  undefined, 21
    1823                      .dwcfi  undefined, 22
    1824                      .dwcfi  undefined, 23
    1825                      .dwcfi  undefined, 24
    1826                      .dwcfi  undefined, 25
    1827                      .dwcfi  same_value, 26
    1828                      .dwcfi  same_value, 27
    1829                      .dwcfi  same_value, 28
    1830                      .dwcfi  same_value, 29
    1831                      .dwcfi  same_value, 30
    1832                      .dwcfi  same_value, 31
    1833                      .dwcfi  undefined, 32
    1834                      .dwcfi  undefined, 33
    1835                      .dwcfi  undefined, 34
    1836                      .dwcfi  undefined, 35
    1837                      .dwcfi  undefined, 36
    1838                      .dwcfi  undefined, 37
