TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE    1

    7137              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
       3              ;* Date/Time created: Fri Jan 21 01:13:26 2011                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=huge --silicon_core_3_3 --symde
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=huge
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    6118                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    6119                      .dwattr $C$DW$T$12, DW_AT_name("long")
    6120                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    6121              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    6122                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$12)
    6123                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    6124                      .dwattr $C$DW$T$126, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    6125                      .dwattr $C$DW$T$126, DW_AT_decl_line(0x27)
    6126                      .dwattr $C$DW$T$126, DW_AT_decl_column(0x0e)
    6127              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    6128                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$12)
    6129                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    6130                      .dwattr $C$DW$T$127, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    6131                      .dwattr $C$DW$T$127, DW_AT_decl_line(0x11)
    6132                      .dwattr $C$DW$T$127, DW_AT_decl_column(0x1c)
    6133              $C$DW$T$13      .dwtag  DW_TAG_base_type
    6134                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  132

    6135                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    6136                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    6137              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    6138                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$13)
    6139                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    6140                      .dwattr $C$DW$T$19, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    6141                      .dwattr $C$DW$T$19, DW_AT_decl_line(0x55)
    6142                      .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    6143              $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    6144                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$19)
    6145                      .dwattr $C$DW$T$72, DW_AT_address_class(0x17)
    6146              $C$DW$382       .dwtag  DW_TAG_TI_far_type
    6147                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$72)
    6148              $C$DW$T$73      .dwtag  DW_TAG_const_type
    6149                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$382)
    6150              $C$DW$383       .dwtag  DW_TAG_TI_far_type
    6151                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    6152              $C$DW$T$129     .dwtag  DW_TAG_volatile_type
    6153                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$383)
    6154              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    6155                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$13)
    6156                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    6157                      .dwattr $C$DW$T$51, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    6158                      .dwattr $C$DW$T$51, DW_AT_decl_line(0x19)
    6159                      .dwattr $C$DW$T$51, DW_AT_decl_column(0x19)
    6160              $C$DW$T$14      .dwtag  DW_TAG_base_type
    6161                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    6162                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    6163                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    6164                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    6165                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    6166              $C$DW$T$15      .dwtag  DW_TAG_base_type
    6167                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    6168                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    6169                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    6170                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    6171                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    6172              $C$DW$T$16      .dwtag  DW_TAG_base_type
    6173                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    6174                      .dwattr $C$DW$T$16, DW_AT_name("float")
    6175                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    6176              $C$DW$T$17      .dwtag  DW_TAG_base_type
    6177                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    6178                      .dwattr $C$DW$T$17, DW_AT_name("double")
    6179                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    6180              $C$DW$T$18      .dwtag  DW_TAG_base_type
    6181                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    6182                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    6183                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    6184              
    6185              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    6186                      .dwattr $C$DW$T$22, DW_AT_name("xLIST_ITEM")
    6187                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0a)
    6188              $C$DW$384       .dwtag  DW_TAG_member
    6189                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  133

    6190                      .dwattr $C$DW$384, DW_AT_name("xItemValue")
    6191                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_xItemValue")
    6192                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6193                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6194                      .dwattr $C$DW$384, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6195                      .dwattr $C$DW$384, DW_AT_decl_line(0x64)
    6196                      .dwattr $C$DW$384, DW_AT_decl_column(0x0f)
    6197              $C$DW$385       .dwtag  DW_TAG_member
    6198                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$21)
    6199                      .dwattr $C$DW$385, DW_AT_name("pxNext")
    6200                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_pxNext")
    6201                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6202                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6203                      .dwattr $C$DW$385, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6204                      .dwattr $C$DW$385, DW_AT_decl_line(0x65)
    6205                      .dwattr $C$DW$385, DW_AT_decl_column(0x1f)
    6206              $C$DW$386       .dwtag  DW_TAG_member
    6207                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$21)
    6208                      .dwattr $C$DW$386, DW_AT_name("pxPrevious")
    6209                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_pxPrevious")
    6210                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6211                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6212                      .dwattr $C$DW$386, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6213                      .dwattr $C$DW$386, DW_AT_decl_line(0x66)
    6214                      .dwattr $C$DW$386, DW_AT_decl_column(0x1f)
    6215              $C$DW$387       .dwtag  DW_TAG_member
    6216                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$3)
    6217                      .dwattr $C$DW$387, DW_AT_name("pvOwner")
    6218                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_pvOwner")
    6219                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6220                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6221                      .dwattr $C$DW$387, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6222                      .dwattr $C$DW$387, DW_AT_decl_line(0x67)
    6223                      .dwattr $C$DW$387, DW_AT_decl_column(0x09)
    6224              $C$DW$388       .dwtag  DW_TAG_member
    6225                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$3)
    6226                      .dwattr $C$DW$388, DW_AT_name("pvContainer")
    6227                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_pvContainer")
    6228                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6229                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6230                      .dwattr $C$DW$388, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6231                      .dwattr $C$DW$388, DW_AT_decl_line(0x68)
    6232                      .dwattr $C$DW$388, DW_AT_decl_column(0x09)
    6233                      .dwendtag $C$DW$T$22
    6234              
    6235                      .dwattr $C$DW$T$22, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    6236                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x62)
    6237                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x08)
    6238              $C$DW$389       .dwtag  DW_TAG_TI_far_type
    6239                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$22)
    6240              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    6241                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$389)
    6242              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    6243                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    6244                      .dwattr $C$DW$T$21, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  134

    6245              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    6246                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
    6247                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    6248                      .dwattr $C$DW$T$25, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    6249                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x6a)
    6250                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x1b)
    6251              $C$DW$390       .dwtag  DW_TAG_TI_far_type
    6252                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$25)
    6253              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    6254                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$390)
    6255              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    6256                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    6257                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
    6258              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    6259                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$25)
    6260                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
    6261              
    6262              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6263                      .dwattr $C$DW$T$23, DW_AT_name("xMINI_LIST_ITEM")
    6264                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    6265              $C$DW$391       .dwtag  DW_TAG_member
    6266                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
    6267                      .dwattr $C$DW$391, DW_AT_name("xItemValue")
    6268                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_xItemValue")
    6269                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6270                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    6271                      .dwattr $C$DW$391, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6272                      .dwattr $C$DW$391, DW_AT_decl_line(0x6e)
    6273                      .dwattr $C$DW$391, DW_AT_decl_column(0x0f)
    6274              $C$DW$392       .dwtag  DW_TAG_member
    6275                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$21)
    6276                      .dwattr $C$DW$392, DW_AT_name("pxNext")
    6277                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_pxNext")
    6278                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6279                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6280                      .dwattr $C$DW$392, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6281                      .dwattr $C$DW$392, DW_AT_decl_line(0x6f)
    6282                      .dwattr $C$DW$392, DW_AT_decl_column(0x1e)
    6283              $C$DW$393       .dwtag  DW_TAG_member
    6284                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$21)
    6285                      .dwattr $C$DW$393, DW_AT_name("pxPrevious")
    6286                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_pxPrevious")
    6287                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6288                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6289                      .dwattr $C$DW$393, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6290                      .dwattr $C$DW$393, DW_AT_decl_line(0x70)
    6291                      .dwattr $C$DW$393, DW_AT_decl_column(0x1e)
    6292                      .dwendtag $C$DW$T$23
    6293              
    6294                      .dwattr $C$DW$T$23, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    6295                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x6c)
    6296                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x08)
    6297              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    6298                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
    6299                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  135

    6300                      .dwattr $C$DW$T$28, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    6301                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x72)
    6302                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x20)
    6303              $C$DW$394       .dwtag  DW_TAG_TI_far_type
    6304                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$28)
    6305              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    6306                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$394)
    6307              
    6308              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6309                      .dwattr $C$DW$T$30, DW_AT_name("xLIST")
    6310                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    6311              $C$DW$395       .dwtag  DW_TAG_member
    6312                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$24)
    6313                      .dwattr $C$DW$395, DW_AT_name("uxNumberOfItems")
    6314                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_uxNumberOfItems")
    6315                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6316                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    6317                      .dwattr $C$DW$395, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6318                      .dwattr $C$DW$395, DW_AT_decl_line(0x79)
    6319                      .dwattr $C$DW$395, DW_AT_decl_column(0x22)
    6320              $C$DW$396       .dwtag  DW_TAG_member
    6321                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$27)
    6322                      .dwattr $C$DW$396, DW_AT_name("pxIndex")
    6323                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_pxIndex")
    6324                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6325                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6326                      .dwattr $C$DW$396, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6327                      .dwattr $C$DW$396, DW_AT_decl_line(0x7a)
    6328                      .dwattr $C$DW$396, DW_AT_decl_column(0x17)
    6329              $C$DW$397       .dwtag  DW_TAG_member
    6330                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$29)
    6331                      .dwattr $C$DW$397, DW_AT_name("xListEnd")
    6332                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_xListEnd")
    6333                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6334                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6335                      .dwattr $C$DW$397, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\in
    6336                      .dwattr $C$DW$397, DW_AT_decl_line(0x7b)
    6337                      .dwattr $C$DW$397, DW_AT_decl_column(0x19)
    6338                      .dwendtag $C$DW$T$30
    6339              
    6340                      .dwattr $C$DW$T$30, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    6341                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x77)
    6342                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    6343              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    6344                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$30)
    6345                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    6346                      .dwattr $C$DW$T$62, DW_AT_decl_file("E:\temp\c5515_eZdsp_FreeRTOS_Demo\EZDSP_Sample\FreeRTOS\Source\i
    6347                      .dwattr $C$DW$T$62, DW_AT_decl_line(0x7c)
    6348                      .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    6349              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    6350                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    6351                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
    6352              $C$DW$398       .dwtag  DW_TAG_TI_far_type
    6353                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$63)
    6354              $C$DW$T$143     .dwtag  DW_TAG_volatile_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  136

    6355                      .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$398)
    6356              $C$DW$399       .dwtag  DW_TAG_TI_far_type
    6357                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$63)
    6358              $C$DW$T$144     .dwtag  DW_TAG_const_type
    6359                      .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$399)
    6360              $C$DW$400       .dwtag  DW_TAG_TI_far_type
    6361                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$62)
    6362              $C$DW$T$77      .dwtag  DW_TAG_const_type
    6363                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$400)
    6364              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    6365                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    6366                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    6367              $C$DW$401       .dwtag  DW_TAG_TI_far_type
    6368                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$78)
    6369              $C$DW$T$79      .dwtag  DW_TAG_const_type
    6370                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$401)
    6371              
    6372              $C$DW$T$145     .dwtag  DW_TAG_array_type
    6373                      .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$62)
    6374                      .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    6375                      .dwattr $C$DW$T$145, DW_AT_byte_size(0x28)
    6376              $C$DW$402       .dwtag  DW_TAG_subrange_type
    6377                      .dwattr $C$DW$402, DW_AT_upper_bound(0x03)
    6378                      .dwendtag $C$DW$T$145
    6379              
    6380              $C$DW$403       .dwtag  DW_TAG_TI_far_type
    6381                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$62)
    6382              $C$DW$T$146     .dwtag  DW_TAG_volatile_type
    6383                      .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$403)
    6384              
    6385              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6386                      .dwattr $C$DW$T$31, DW_AT_name("xMEMORY_REGION")
    6387                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x06)
    6388              $C$DW$404       .dwtag  DW_TAG_member
    6389                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$3)
    6390                      .dwattr $C$DW$404, DW_AT_name("pvBaseAddress")
    6391                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_pvBaseAddress")
    6392                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6393                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    6394                      .dwattr $C$DW$404, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6395                      .dwattr $C$DW$404, DW_AT_decl_line(0x67)
    6396                      .dwattr $C$DW$404, DW_AT_decl_column(0x08)
    6397              $C$DW$405       .dwtag  DW_TAG_member
    6398                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$13)
    6399                      .dwattr $C$DW$405, DW_AT_name("ulLengthInBytes")
    6400                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_ulLengthInBytes")
    6401                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6402                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6403                      .dwattr $C$DW$405, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6404                      .dwattr $C$DW$405, DW_AT_decl_line(0x68)
    6405                      .dwattr $C$DW$405, DW_AT_decl_column(0x10)
    6406              $C$DW$406       .dwtag  DW_TAG_member
    6407                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$13)
    6408                      .dwattr $C$DW$406, DW_AT_name("ulParameters")
    6409                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_ulParameters")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  137

    6410                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6411                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    6412                      .dwattr $C$DW$406, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6413                      .dwattr $C$DW$406, DW_AT_decl_line(0x69)
    6414                      .dwattr $C$DW$406, DW_AT_decl_column(0x10)
    6415                      .dwendtag $C$DW$T$31
    6416              
    6417                      .dwattr $C$DW$T$31, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    6418                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x65)
    6419                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    6420              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    6421                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$31)
    6422                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    6423                      .dwattr $C$DW$T$48, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    6424                      .dwattr $C$DW$T$48, DW_AT_decl_line(0x6a)
    6425                      .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    6426              
    6427              $C$DW$T$49      .dwtag  DW_TAG_array_type
    6428                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    6429                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    6430                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x06)
    6431              $C$DW$407       .dwtag  DW_TAG_subrange_type
    6432                      .dwattr $C$DW$407, DW_AT_upper_bound(0x00)
    6433                      .dwendtag $C$DW$T$49
    6434              
    6435              $C$DW$408       .dwtag  DW_TAG_TI_far_type
    6436                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$48)
    6437              $C$DW$T$88      .dwtag  DW_TAG_const_type
    6438                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$408)
    6439              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    6440                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    6441                      .dwattr $C$DW$T$89, DW_AT_address_class(0x17)
    6442              $C$DW$409       .dwtag  DW_TAG_TI_far_type
    6443                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$89)
    6444              $C$DW$T$90      .dwtag  DW_TAG_const_type
    6445                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$409)
    6446              
    6447              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    6448                      .dwattr $C$DW$T$32, DW_AT_name("xTIME_OUT")
    6449                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    6450              $C$DW$410       .dwtag  DW_TAG_member
    6451                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$10)
    6452                      .dwattr $C$DW$410, DW_AT_name("xOverflowCount")
    6453                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_xOverflowCount")
    6454                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6455                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    6456                      .dwattr $C$DW$410, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6457                      .dwattr $C$DW$410, DW_AT_decl_line(0x5e)
    6458                      .dwattr $C$DW$410, DW_AT_decl_column(0x10)
    6459              $C$DW$411       .dwtag  DW_TAG_member
    6460                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    6461                      .dwattr $C$DW$411, DW_AT_name("xTimeOnEntering")
    6462                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_xTimeOnEntering")
    6463                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6464                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  138

    6465                      .dwattr $C$DW$411, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6466                      .dwattr $C$DW$411, DW_AT_decl_line(0x5f)
    6467                      .dwattr $C$DW$411, DW_AT_decl_column(0x10)
    6468                      .dwendtag $C$DW$T$32
    6469              
    6470                      .dwattr $C$DW$T$32, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    6471                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x5c)
    6472                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    6473              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    6474                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$32)
    6475                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    6476                      .dwattr $C$DW$T$81, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    6477                      .dwattr $C$DW$T$81, DW_AT_decl_line(0x60)
    6478                      .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    6479              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    6480                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    6481                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    6482              $C$DW$412       .dwtag  DW_TAG_TI_far_type
    6483                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$82)
    6484              $C$DW$T$83      .dwtag  DW_TAG_const_type
    6485                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$412)
    6486              
    6487              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6488                      .dwattr $C$DW$T$36, DW_AT_name("tskTaskControlBlock")
    6489                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x22)
    6490              $C$DW$413       .dwtag  DW_TAG_member
    6491                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$33)
    6492                      .dwattr $C$DW$413, DW_AT_name("pxTopOfStack")
    6493                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_pxTopOfStack")
    6494                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6495                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    6496                      .dwattr $C$DW$413, DW_AT_decl_file("../FreeRTOS/Source/tasks.c")
    6497                      .dwattr $C$DW$413, DW_AT_decl_line(0x51)
    6498                      .dwattr $C$DW$413, DW_AT_decl_column(0x1b)
    6499              $C$DW$414       .dwtag  DW_TAG_member
    6500                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$25)
    6501                      .dwattr $C$DW$414, DW_AT_name("xGenericListItem")
    6502                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_xGenericListItem")
    6503                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6504                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    6505                      .dwattr $C$DW$414, DW_AT_decl_file("../FreeRTOS/Source/tasks.c")
    6506                      .dwattr $C$DW$414, DW_AT_decl_line(0x57)
    6507                      .dwattr $C$DW$414, DW_AT_decl_column(0x0f)
    6508              $C$DW$415       .dwtag  DW_TAG_member
    6509                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$25)
    6510                      .dwattr $C$DW$415, DW_AT_name("xEventListItem")
    6511                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_xEventListItem")
    6512                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6513                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    6514                      .dwattr $C$DW$415, DW_AT_decl_file("../FreeRTOS/Source/tasks.c")
    6515                      .dwattr $C$DW$415, DW_AT_decl_line(0x58)
    6516                      .dwattr $C$DW$415, DW_AT_decl_column(0x0f)
    6517              $C$DW$416       .dwtag  DW_TAG_member
    6518                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$11)
    6519                      .dwattr $C$DW$416, DW_AT_name("uxPriority")
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  139

    6520                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_uxPriority")
    6521                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6522                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6523                      .dwattr $C$DW$416, DW_AT_decl_file("../FreeRTOS/Source/tasks.c")
    6524                      .dwattr $C$DW$416, DW_AT_decl_line(0x59)
    6525                      .dwattr $C$DW$416, DW_AT_decl_column(0x19)
    6526              $C$DW$417       .dwtag  DW_TAG_member
    6527                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$34)
    6528                      .dwattr $C$DW$417, DW_AT_name("pxStack")
    6529                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_pxStack")
    6530                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6531                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6532                      .dwattr $C$DW$417, DW_AT_decl_file("../FreeRTOS/Source/tasks.c")
    6533                      .dwattr $C$DW$417, DW_AT_decl_line(0x5a)
    6534                      .dwattr $C$DW$417, DW_AT_decl_column(0x14)
    6535              $C$DW$418       .dwtag  DW_TAG_member
    6536                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$35)
    6537                      .dwattr $C$DW$418, DW_AT_name("pcTaskName")
    6538                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_pcTaskName")
    6539                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6540                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6541                      .dwattr $C$DW$418, DW_AT_decl_file("../FreeRTOS/Source/tasks.c")
    6542                      .dwattr $C$DW$418, DW_AT_decl_line(0x5b)
    6543                      .dwattr $C$DW$418, DW_AT_decl_column(0x11)
    6544                      .dwendtag $C$DW$T$36
    6545              
    6546                      .dwattr $C$DW$T$36, DW_AT_decl_file("../FreeRTOS/Source/tasks.c")
    6547                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x4f)
    6548                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    6549              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    6550                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$36)
    6551                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    6552                      .dwattr $C$DW$T$86, DW_AT_decl_file("../FreeRTOS/Source/tasks.c")
    6553                      .dwattr $C$DW$T$86, DW_AT_decl_line(0x75)
    6554                      .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    6555              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    6556                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    6557                      .dwattr $C$DW$T$87, DW_AT_address_class(0x17)
    6558              $C$DW$419       .dwtag  DW_TAG_TI_far_type
    6559                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$87)
    6560              $C$DW$T$162     .dwtag  DW_TAG_volatile_type
    6561                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$419)
    6562              $C$DW$420       .dwtag  DW_TAG_TI_far_type
    6563                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$86)
    6564              $C$DW$T$163     .dwtag  DW_TAG_const_type
    6565                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$420)
    6566              $C$DW$T$164     .dwtag  DW_TAG_pointer_type
    6567                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$163)
    6568                      .dwattr $C$DW$T$164, DW_AT_address_class(0x17)
    6569              $C$DW$421       .dwtag  DW_TAG_TI_far_type
    6570                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$164)
    6571              $C$DW$T$165     .dwtag  DW_TAG_const_type
    6572                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$421)
    6573              $C$DW$422       .dwtag  DW_TAG_TI_far_type
    6574                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$86)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  140

    6575              $C$DW$T$166     .dwtag  DW_TAG_volatile_type
    6576                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$422)
    6577              $C$DW$T$167     .dwtag  DW_TAG_pointer_type
    6578                      .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$166)
    6579                      .dwattr $C$DW$T$167, DW_AT_address_class(0x17)
    6580              $C$DW$T$168     .dwtag  DW_TAG_pointer_type
    6581                      .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$36)
    6582                      .dwattr $C$DW$T$168, DW_AT_address_class(0x17)
    6583              
    6584              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6585                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    6586              $C$DW$423       .dwtag  DW_TAG_member
    6587                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$10)
    6588                      .dwattr $C$DW$423, DW_AT_name("fd")
    6589                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_fd")
    6590                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6591                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6592                      .dwattr $C$DW$423, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6593                      .dwattr $C$DW$423, DW_AT_decl_line(0x1d)
    6594                      .dwattr $C$DW$423, DW_AT_decl_column(0x0b)
    6595              $C$DW$424       .dwtag  DW_TAG_member
    6596                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$37)
    6597                      .dwattr $C$DW$424, DW_AT_name("buf")
    6598                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_buf")
    6599                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6600                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6601                      .dwattr $C$DW$424, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6602                      .dwattr $C$DW$424, DW_AT_decl_line(0x1e)
    6603                      .dwattr $C$DW$424, DW_AT_decl_column(0x16)
    6604              $C$DW$425       .dwtag  DW_TAG_member
    6605                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$37)
    6606                      .dwattr $C$DW$425, DW_AT_name("pos")
    6607                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_pos")
    6608                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6609                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6610                      .dwattr $C$DW$425, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6611                      .dwattr $C$DW$425, DW_AT_decl_line(0x1f)
    6612                      .dwattr $C$DW$425, DW_AT_decl_column(0x16)
    6613              $C$DW$426       .dwtag  DW_TAG_member
    6614                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$37)
    6615                      .dwattr $C$DW$426, DW_AT_name("bufend")
    6616                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_bufend")
    6617                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6618                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6619                      .dwattr $C$DW$426, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6620                      .dwattr $C$DW$426, DW_AT_decl_line(0x20)
    6621                      .dwattr $C$DW$426, DW_AT_decl_column(0x16)
    6622              $C$DW$427       .dwtag  DW_TAG_member
    6623                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$37)
    6624                      .dwattr $C$DW$427, DW_AT_name("buff_stop")
    6625                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_buff_stop")
    6626                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6627                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6628                      .dwattr $C$DW$427, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6629                      .dwattr $C$DW$427, DW_AT_decl_line(0x21)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  141

    6630                      .dwattr $C$DW$427, DW_AT_decl_column(0x16)
    6631              $C$DW$428       .dwtag  DW_TAG_member
    6632                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$11)
    6633                      .dwattr $C$DW$428, DW_AT_name("flags")
    6634                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_flags")
    6635                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6636                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6637                      .dwattr $C$DW$428, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6638                      .dwattr $C$DW$428, DW_AT_decl_line(0x22)
    6639                      .dwattr $C$DW$428, DW_AT_decl_column(0x16)
    6640                      .dwendtag $C$DW$T$38
    6641              
    6642                      .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    6643                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x1c)
    6644                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    6645              $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    6646                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$38)
    6647                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    6648                      .dwattr $C$DW$T$177, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    6649                      .dwattr $C$DW$T$177, DW_AT_decl_line(0x23)
    6650                      .dwattr $C$DW$T$177, DW_AT_decl_column(0x03)
    6651              
    6652              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6653                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    6654              $C$DW$429       .dwtag  DW_TAG_member
    6655                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$10)
    6656                      .dwattr $C$DW$429, DW_AT_name("quot")
    6657                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_quot")
    6658                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6659                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6660                      .dwattr $C$DW$429, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6661                      .dwattr $C$DW$429, DW_AT_decl_line(0x12)
    6662                      .dwattr $C$DW$429, DW_AT_decl_column(0x16)
    6663              $C$DW$430       .dwtag  DW_TAG_member
    6664                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$10)
    6665                      .dwattr $C$DW$430, DW_AT_name("rem")
    6666                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_rem")
    6667                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6668                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6669                      .dwattr $C$DW$430, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6670                      .dwattr $C$DW$430, DW_AT_decl_line(0x12)
    6671                      .dwattr $C$DW$430, DW_AT_decl_column(0x1c)
    6672                      .dwendtag $C$DW$T$39
    6673              
    6674                      .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    6675                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x12)
    6676                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    6677              $C$DW$T$178     .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    6678                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$39)
    6679                      .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    6680                      .dwattr $C$DW$T$178, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    6681                      .dwattr $C$DW$T$178, DW_AT_decl_line(0x12)
    6682                      .dwattr $C$DW$T$178, DW_AT_decl_column(0x23)
    6683              
    6684              $C$DW$T$40      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  142

    6685                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    6686              $C$DW$431       .dwtag  DW_TAG_member
    6687                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$12)
    6688                      .dwattr $C$DW$431, DW_AT_name("quot")
    6689                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_quot")
    6690                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6691                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6692                      .dwattr $C$DW$431, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6693                      .dwattr $C$DW$431, DW_AT_decl_line(0x14)
    6694                      .dwattr $C$DW$431, DW_AT_decl_column(0x17)
    6695              $C$DW$432       .dwtag  DW_TAG_member
    6696                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$12)
    6697                      .dwattr $C$DW$432, DW_AT_name("rem")
    6698                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_rem")
    6699                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6700                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6701                      .dwattr $C$DW$432, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6702                      .dwattr $C$DW$432, DW_AT_decl_line(0x14)
    6703                      .dwattr $C$DW$432, DW_AT_decl_column(0x1d)
    6704                      .dwendtag $C$DW$T$40
    6705              
    6706                      .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    6707                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x14)
    6708                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    6709              $C$DW$T$179     .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    6710                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$40)
    6711                      .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    6712                      .dwattr $C$DW$T$179, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    6713                      .dwattr $C$DW$T$179, DW_AT_decl_line(0x14)
    6714                      .dwattr $C$DW$T$179, DW_AT_decl_column(0x24)
    6715              
    6716              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6717                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    6718              $C$DW$433       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$14)
    6720                      .dwattr $C$DW$433, DW_AT_name("quot")
    6721                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_quot")
    6722                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6723                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6724                      .dwattr $C$DW$433, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6725                      .dwattr $C$DW$433, DW_AT_decl_line(0x17)
    6726                      .dwattr $C$DW$433, DW_AT_decl_column(0x1c)
    6727              $C$DW$434       .dwtag  DW_TAG_member
    6728                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$14)
    6729                      .dwattr $C$DW$434, DW_AT_name("rem")
    6730                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_rem")
    6731                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6732                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6733                      .dwattr $C$DW$434, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Genera
    6734                      .dwattr $C$DW$434, DW_AT_decl_line(0x17)
    6735                      .dwattr $C$DW$434, DW_AT_decl_column(0x22)
    6736                      .dwendtag $C$DW$T$41
    6737              
    6738                      .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gener
    6739                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  143

    6740                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    6741              $C$DW$T$180     .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    6742                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$41)
    6743                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    6744                      .dwattr $C$DW$T$180, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    6745                      .dwattr $C$DW$T$180, DW_AT_decl_line(0x17)
    6746                      .dwattr $C$DW$T$180, DW_AT_decl_column(0x29)
    6747              
    6748              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    6749                      .dwattr $C$DW$T$50, DW_AT_name("xTASK_PARAMTERS")
    6750                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x12)
    6751              $C$DW$435       .dwtag  DW_TAG_member
    6752                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$44)
    6753                      .dwattr $C$DW$435, DW_AT_name("pvTaskCode")
    6754                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_pvTaskCode")
    6755                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6756                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6757                      .dwattr $C$DW$435, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6758                      .dwattr $C$DW$435, DW_AT_decl_line(0x71)
    6759                      .dwattr $C$DW$435, DW_AT_decl_column(0x0e)
    6760              $C$DW$436       .dwtag  DW_TAG_member
    6761                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$47)
    6762                      .dwattr $C$DW$436, DW_AT_name("pcName")
    6763                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_pcName")
    6764                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6765                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6766                      .dwattr $C$DW$436, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6767                      .dwattr $C$DW$436, DW_AT_decl_line(0x72)
    6768                      .dwattr $C$DW$436, DW_AT_decl_column(0x1c)
    6769              $C$DW$437       .dwtag  DW_TAG_member
    6770                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$9)
    6771                      .dwattr $C$DW$437, DW_AT_name("usStackDepth")
    6772                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_usStackDepth")
    6773                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6774                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6775                      .dwattr $C$DW$437, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6776                      .dwattr $C$DW$437, DW_AT_decl_line(0x73)
    6777                      .dwattr $C$DW$437, DW_AT_decl_column(0x11)
    6778              $C$DW$438       .dwtag  DW_TAG_member
    6779                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$3)
    6780                      .dwattr $C$DW$438, DW_AT_name("pvParameters")
    6781                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_pvParameters")
    6782                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6783                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6784                      .dwattr $C$DW$438, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6785                      .dwattr $C$DW$438, DW_AT_decl_line(0x74)
    6786                      .dwattr $C$DW$438, DW_AT_decl_column(0x08)
    6787              $C$DW$439       .dwtag  DW_TAG_member
    6788                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$11)
    6789                      .dwattr $C$DW$439, DW_AT_name("uxPriority")
    6790                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_uxPriority")
    6791                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6792                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6793                      .dwattr $C$DW$439, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6794                      .dwattr $C$DW$439, DW_AT_decl_line(0x75)
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  144

    6795                      .dwattr $C$DW$439, DW_AT_decl_column(0x19)
    6796              $C$DW$440       .dwtag  DW_TAG_member
    6797                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$34)
    6798                      .dwattr $C$DW$440, DW_AT_name("puxStackBuffer")
    6799                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_puxStackBuffer")
    6800                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6801                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6802                      .dwattr $C$DW$440, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6803                      .dwattr $C$DW$440, DW_AT_decl_line(0x76)
    6804                      .dwattr $C$DW$440, DW_AT_decl_column(0x12)
    6805              $C$DW$441       .dwtag  DW_TAG_member
    6806                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$49)
    6807                      .dwattr $C$DW$441, DW_AT_name("xRegions")
    6808                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_xRegions")
    6809                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6810                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    6811                      .dwattr $C$DW$441, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/in
    6812                      .dwattr $C$DW$441, DW_AT_decl_line(0x77)
    6813                      .dwattr $C$DW$441, DW_AT_decl_column(0x10)
    6814                      .dwendtag $C$DW$T$50
    6815              
    6816                      .dwattr $C$DW$T$50, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/i
    6817                      .dwattr $C$DW$T$50, DW_AT_decl_line(0x6f)
    6818                      .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    6819              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    6820                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$50)
    6821                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    6822                      .dwattr $C$DW$T$181, DW_AT_decl_file("E:/temp/c5515_eZdsp_FreeRTOS_Demo/EZDSP_Sample/FreeRTOS/Source/
    6823                      .dwattr $C$DW$T$181, DW_AT_decl_line(0x78)
    6824                      .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    6825              $C$DW$T$182     .dwtag  DW_TAG_base_type
    6826                      .dwattr $C$DW$T$182, DW_AT_encoding(DW_ATE_signed_char)
    6827                      .dwattr $C$DW$T$182, DW_AT_name("signed char")
    6828                      .dwattr $C$DW$T$182, DW_AT_byte_size(0x01)
    6829              $C$DW$T$183     .dwtag  DW_TAG_pointer_type
    6830                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$182)
    6831                      .dwattr $C$DW$T$183, DW_AT_address_class(0x17)
    6832              $C$DW$T$187     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    6833                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$183)
    6834                      .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    6835                      .dwattr $C$DW$T$187, DW_AT_decl_file("C:/Texas Instruments Tools/ccsv4/tools/compiler/C5500 Code Gene
    6836                      .dwattr $C$DW$T$187, DW_AT_decl_line(0x0d)
    6837                      .dwattr $C$DW$T$187, DW_AT_decl_column(0x0f)
    6838              $C$DW$442       .dwtag  DW_TAG_TI_far_type
    6839                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$182)
    6840              $C$DW$T$184     .dwtag  DW_TAG_const_type
    6841                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$442)
    6842              $C$DW$T$185     .dwtag  DW_TAG_pointer_type
    6843                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    6844                      .dwattr $C$DW$T$185, DW_AT_address_class(0x17)
    6845                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    6846              
    6847              ;***************************************************************
    6848              ;* DWARF CIE ENTRIES                                           *
    6849              ;***************************************************************
TMS320C55x Assembler PC v4.3.8 Fri Jan 21 01:13:29 2011

Tools Copyright (c) 1996-2010 Texas Instruments Incorporated
tasks.asm                                                            PAGE  145

    6850              
    6851              $C$DW$CIE       .dwcie 91
    6852                      .dwcfi  cfa_register, 36
    6853                      .dwcfi  cfa_offset, 0
    6854                      .dwcfi  undefined, 0
    6855                      .dwcfi  undefined, 1
    6856                      .dwcfi  undefined, 2
    6857                      .dwcfi  undefined, 3
    6858                      .dwcfi  undefined, 4
    6859                      .dwcfi  undefined, 5
    6860                      .dwcfi  undefined, 6
    6861                      .dwcfi  undefined, 7
