TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE    1

    1917              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 23:28:17 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1368                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1369                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1370              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1371                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1372                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1373                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1374              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1375                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1376                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1377                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1378              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1379                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1380                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1381                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1382              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1383                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1384                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1385                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1386              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1387                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1388                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1389                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1390              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1391                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1392                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1393                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1394              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1395                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1396                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1397                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1398              $C$DW$120       .dwtag  DW_TAG_TI_far_type
    1399                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1400              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1401                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$120)
    1402              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1403                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$11)
    1404                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   32

    1405              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1406                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$11)
    1407                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1408              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1409                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1410                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1411                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1412              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1413                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1414                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1415                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1416              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1417                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1418                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1419                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1420                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1421                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1422              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1423                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1424                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1425                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1426                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1427                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1428              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1429                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1430                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1431                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1432              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1433                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1434                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1435                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1436              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1437                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1438                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1439                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1440              
    1441              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1442                      .dwattr $C$DW$T$24, DW_AT_name("corCoRoutineControlBlock")
    1443                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x1a)
    1444              $C$DW$121       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$22)
    1446                      .dwattr $C$DW$121, DW_AT_name("pxCoRoutineFunction")
    1447                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_pxCoRoutineFunction")
    1448                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1449                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1450              $C$DW$122       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$23)
    1452                      .dwattr $C$DW$122, DW_AT_name("xGenericListItem")
    1453                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_xGenericListItem")
    1454                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1455                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1456              $C$DW$123       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$23)
    1458                      .dwattr $C$DW$123, DW_AT_name("xEventListItem")
    1459                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_xEventListItem")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   33

    1460                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1461                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1462              $C$DW$124       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1464                      .dwattr $C$DW$124, DW_AT_name("uxPriority")
    1465                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_uxPriority")
    1466                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1467                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$125       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1470                      .dwattr $C$DW$125, DW_AT_name("uxIndex")
    1471                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_uxIndex")
    1472                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1473                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1474              $C$DW$126       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$9)
    1476                      .dwattr $C$DW$126, DW_AT_name("uxState")
    1477                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_uxState")
    1478                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1479                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1480                      .dwendtag $C$DW$T$24
    1481              
    1482              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("corCRCB")
    1483                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$24)
    1484                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1485              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    1486                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    1487                      .dwattr $C$DW$T$60, DW_AT_address_class(0x17)
    1488              
    1489              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1490                      .dwattr $C$DW$T$30, DW_AT_name("xLIST")
    1491                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    1492              $C$DW$127       .dwtag  DW_TAG_member
    1493                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$25)
    1494                      .dwattr $C$DW$127, DW_AT_name("uxNumberOfItems")
    1495                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1496                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1497                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1498              $C$DW$128       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$27)
    1500                      .dwattr $C$DW$128, DW_AT_name("pxIndex")
    1501                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_pxIndex")
    1502                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1503                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1504              $C$DW$129       .dwtag  DW_TAG_member
    1505                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$29)
    1506                      .dwattr $C$DW$129, DW_AT_name("xListEnd")
    1507                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_xListEnd")
    1508                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1509                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1510                      .dwendtag $C$DW$T$30
    1511              
    1512              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1513                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$30)
    1514                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   34

    1515              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    1516                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1517                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    1518              $C$DW$130       .dwtag  DW_TAG_TI_far_type
    1519                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$41)
    1520              $C$DW$T$61      .dwtag  DW_TAG_const_type
    1521                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$130)
    1522              
    1523              $C$DW$T$62      .dwtag  DW_TAG_array_type
    1524                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$40)
    1525                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1526                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x14)
    1527              $C$DW$131       .dwtag  DW_TAG_subrange_type
    1528                      .dwattr $C$DW$131, DW_AT_upper_bound(0x01)
    1529                      .dwendtag $C$DW$T$62
    1530              
    1531              $C$DW$132       .dwtag  DW_TAG_TI_far_type
    1532                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$40)
    1533              $C$DW$T$53      .dwtag  DW_TAG_const_type
    1534                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$132)
    1535              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    1536                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1537                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    1538              
    1539              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1540                      .dwattr $C$DW$T$34, DW_AT_name("xLIST_ITEM")
    1541                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    1542              $C$DW$133       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$31)
    1544                      .dwattr $C$DW$133, DW_AT_name("xItemValue")
    1545                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_xItemValue")
    1546                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1548              $C$DW$134       .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$33)
    1550                      .dwattr $C$DW$134, DW_AT_name("pxNext")
    1551                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_pxNext")
    1552                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1553                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1554              $C$DW$135       .dwtag  DW_TAG_member
    1555                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$33)
    1556                      .dwattr $C$DW$135, DW_AT_name("pxPrevious")
    1557                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_pxPrevious")
    1558                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1559                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1560              $C$DW$136       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$3)
    1562                      .dwattr $C$DW$136, DW_AT_name("pvOwner")
    1563                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_pvOwner")
    1564                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1565                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1566              $C$DW$137       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$3)
    1568                      .dwattr $C$DW$137, DW_AT_name("pvContainer")
    1569                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_pvContainer")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   35

    1570                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1571                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1572                      .dwendtag $C$DW$T$34
    1573              
    1574              $C$DW$138       .dwtag  DW_TAG_TI_far_type
    1575                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$34)
    1576              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    1577                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$138)
    1578              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1579                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1580                      .dwattr $C$DW$T$33, DW_AT_address_class(0x17)
    1581              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1582                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$34)
    1583                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1584              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1585                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$23)
    1586                      .dwattr $C$DW$T$44, DW_AT_address_class(0x17)
    1587              $C$DW$139       .dwtag  DW_TAG_TI_far_type
    1588                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$23)
    1589              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    1590                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$139)
    1591              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    1592                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1593                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
    1594              
    1595              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1596                      .dwattr $C$DW$T$35, DW_AT_name("xMINI_LIST_ITEM")
    1597                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    1598              $C$DW$140       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$31)
    1600                      .dwattr $C$DW$140, DW_AT_name("xItemValue")
    1601                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_xItemValue")
    1602                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$141       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$33)
    1606                      .dwattr $C$DW$141, DW_AT_name("pxNext")
    1607                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_pxNext")
    1608                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1609                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1610              $C$DW$142       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$33)
    1612                      .dwattr $C$DW$142, DW_AT_name("pxPrevious")
    1613                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_pxPrevious")
    1614                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1615                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1616                      .dwendtag $C$DW$T$35
    1617              
    1618              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1619                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$35)
    1620                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1621              $C$DW$143       .dwtag  DW_TAG_TI_far_type
    1622                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$28)
    1623              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    1624                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$143)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
croutine.asm                                                         PAGE   36

    1625                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1626              
    1627              ;***************************************************************
    1628              ;* DWARF CIE ENTRIES                                           *
    1629              ;***************************************************************
    1630              
    1631              $C$DW$CIE       .dwcie 91
    1632                      .dwcfi  cfa_register, 36
    1633                      .dwcfi  cfa_offset, 0
    1634                      .dwcfi  undefined, 0
    1635                      .dwcfi  undefined, 1
    1636                      .dwcfi  undefined, 2
    1637                      .dwcfi  undefined, 3
    1638                      .dwcfi  undefined, 4
    1639                      .dwcfi  undefined, 5
    1640                      .dwcfi  undefined, 6
    1641                      .dwcfi  undefined, 7
    1642                      .dwcfi  undefined, 8
    1643                      .dwcfi  undefined, 9
    1644                      .dwcfi  undefined, 10
    1645                      .dwcfi  undefined, 11
    1646                      .dwcfi  undefined, 12
    1647                      .dwcfi  undefined, 13
    1648                      .dwcfi  same_value, 14
    1649                      .dwcfi  same_value, 15
    1650                      .dwcfi  undefined, 16
    1651                      .dwcfi  undefined, 17
    1652                      .dwcfi  undefined, 18
    1653                      .dwcfi  undefined, 19
    1654                      .dwcfi  undefined, 20
    1655                      .dwcfi  undefined, 21
    1656                      .dwcfi  undefined, 22
    1657                      .dwcfi  undefined, 23
    1658                      .dwcfi  undefined, 24
    1659                      .dwcfi  undefined, 25
    1660                      .dwcfi  same_value, 26
    1661                      .dwcfi  same_value, 27
    1662                      .dwcfi  same_value, 28
    1663                      .dwcfi  same_value, 29
    1664                      .dwcfi  same_value, 30
    1665                      .dwcfi  same_value, 31
    1666                      .dwcfi  undefined, 32
    1667                      .dwcfi  undefined, 33
    1668                      .dwcfi  undefined, 34
    1669                      .dwcfi  undefined, 35
    1670                      .dwcfi  undefined, 36
    1671                      .dwcfi  undefined, 37
    1672                      .dwcfi  undefined, 38
    1673                      .dwcfi  undefined, 39
    1674                      .dwcfi  undefined, 40
    1675                      .dwcfi  undefined, 41
    1676                      .dwcfi  undefined, 42
    1677                      .dwcfi  undefined, 43
    1678                      .dwcfi  undefined, 44
    1679                      .dwcfi  undefined, 45
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:18 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
