TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE    1

    3985              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 23:28:19 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

         00099b BF   
    3278 00099c A961          MOV *AR3, AR1 ; |1399| 
    3279 00099e 0419          BCC $C$L78,AR1 != #0 ; |1399| 
         0009a0 1C   
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   72

    3280                                                      ; branchcc occurs ; |1399| 
    3281                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 1401,column 4,is_stmt
    3282 0009a1 ED00          MOV dbl(*SP(#0)), XAR3
         0009a3 BF   
    3283 0009a4 A96D          MOV *AR3(#8), AR1 ; |1401| 
         0009a6 0008 
    3284 0009a8 0409          BCC $C$L78,AR1 == #0 ; |1401| 
         0009aa 12   
    3285                                                      ; branchcc occurs ; |1401| 
    3286                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 1403,column 5,is_stmt
    3287 0009ab ED00          MOV dbl(*SP(#0)), XAR0
         0009ad 8F   
    3288 0009ae 1408          AADD #8, AR0 ; |1403| 
         0009b0 84   
    3289              $C$DW$284       .dwtag  DW_TAG_TI_branch
    3290                      .dwattr $C$DW$284, DW_AT_low_pc(0x00)
    3291                      .dwattr $C$DW$284, DW_AT_name("_xCoRoutineRemoveFromEventList")
    3292                      .dwattr $C$DW$284, DW_AT_TI_call
    3293 0009b1 6C00          CALL #_xCoRoutineRemoveFromEventList ; |1403| 
         0009b3 0000!
    3294                                                      ; call occurs [#_xCoRoutineRemoveFromEventList] ; |1403| 
    3295 0009b5 6304          BCC $C$L78,T0 == #0 ; |1403| 
    3296                                                      ; branchcc occurs ; |1403| 
    3297                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 1405,column 6,is_stmt
    3298 0009b7 ED08          MOV dbl(*SP(#4)), XAR3
         0009b9 BF   
    3299 0009ba E661          MOV #1, *AR3 ; |1405| 
         0009bc 01   
    3300 0009bd       $C$L78:    
    3301                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 1410,column 3,is_stmt
    3302 0009bd E60C          MOV #1, *SP(#6) ; |1410| 
         0009bf 01   
    3303                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 1411,column 2,is_stmt
    3304 0009c0 4A03          B $C$L80  ; |1411| 
    3305                                                      ; branch occurs ; |1411| 
    3306 0009c2       $C$L79:    
    3307                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 1414,column 3,is_stmt
    3308 0009c2 E60C          MOV #0, *SP(#6) ; |1414| 
         0009c4 00   
    3309 0009c5       $C$L80:    
    3310                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 1417,column 2,is_stmt
    3311 0009c5 A40C          MOV *SP(#6), T0 ; |1417| 
    3312                      .dwpsn  file "../FreeRTOS/Source/queue.c",line 1418,column 1,is_stmt
    3313 0009c7 4E07          AADD #7, SP
    3314                      .dwcfi  cfa_offset, 1
    3315              $C$DW$285       .dwtag  DW_TAG_TI_branch
    3316                      .dwattr $C$DW$285, DW_AT_low_pc(0x00)
    3317                      .dwattr $C$DW$285, DW_AT_TI_return
    3318 0009c9 4804          RET
    3319                                                      ; return occurs
    3320                      .dwattr $C$DW$275, DW_AT_TI_end_file("../FreeRTOS/Source/queue.c")
    3321                      .dwattr $C$DW$275, DW_AT_TI_end_line(0x58a)
    3322                      .dwattr $C$DW$275, DW_AT_TI_end_column(0x01)
    3323                      .dwendentry
    3324                      .dwendtag $C$DW$275
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   73

    3325              
    3326              ;******************************************************************************
    3327              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    3328              ;******************************************************************************
    3329                      .global _vPortYield
    3330                      .global _pvPortMalloc
    3331                      .global _vPortFree
    3332                      .global _vListInitialise
    3333                      .global _vTaskSuspendAll
    3334                      .global _xTaskResumeAll
    3335                      .global _vTaskPlaceOnEventList
    3336                      .global _xTaskRemoveFromEventList
    3337                      .global _vTaskSetTimeOutState
    3338                      .global _xTaskCheckForTimeOut
    3339                      .global _vTaskMissedYield
    3340                      .global _vCoRoutineAddToDelayedList
    3341                      .global _xCoRoutineRemoveFromEventList
    3342                      .global _usCriticalNesting
    3343                      .global _memcpy
    3344              
    3345              ;*******************************************************************************
    3346              ;* TYPE INFORMATION                                                            *
    3347              ;*******************************************************************************
    3348              
    3349              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3350                      .dwattr $C$DW$T$22, DW_AT_name("QueueDefinition")
    3351                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x22)
    3352              $C$DW$286       .dwtag  DW_TAG_member
    3353                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    3354                      .dwattr $C$DW$286, DW_AT_name("pcHead")
    3355                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_pcHead")
    3356                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3357                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3358              $C$DW$287       .dwtag  DW_TAG_member
    3359                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    3360                      .dwattr $C$DW$287, DW_AT_name("pcTail")
    3361                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_pcTail")
    3362                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3363                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3364              $C$DW$288       .dwtag  DW_TAG_member
    3365                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    3366                      .dwattr $C$DW$288, DW_AT_name("pcWriteTo")
    3367                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_pcWriteTo")
    3368                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3369                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3370              $C$DW$289       .dwtag  DW_TAG_member
    3371                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    3372                      .dwattr $C$DW$289, DW_AT_name("pcReadFrom")
    3373                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_pcReadFrom")
    3374                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3375                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3376              $C$DW$290       .dwtag  DW_TAG_member
    3377                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    3378                      .dwattr $C$DW$290, DW_AT_name("xTasksWaitingToSend")
    3379                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_xTasksWaitingToSend")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   74

    3380                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3381                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3382              $C$DW$291       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$20)
    3384                      .dwattr $C$DW$291, DW_AT_name("xTasksWaitingToReceive")
    3385                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_xTasksWaitingToReceive")
    3386                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3387                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3388              $C$DW$292       .dwtag  DW_TAG_member
    3389                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$21)
    3390                      .dwattr $C$DW$292, DW_AT_name("uxMessagesWaiting")
    3391                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_uxMessagesWaiting")
    3392                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3393                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3394              $C$DW$293       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$11)
    3396                      .dwattr $C$DW$293, DW_AT_name("uxLength")
    3397                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_uxLength")
    3398                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3399                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3400              $C$DW$294       .dwtag  DW_TAG_member
    3401                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$11)
    3402                      .dwattr $C$DW$294, DW_AT_name("uxItemSize")
    3403                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_uxItemSize")
    3404                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3405                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3406              $C$DW$295       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$10)
    3408                      .dwattr $C$DW$295, DW_AT_name("xRxLock")
    3409                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_xRxLock")
    3410                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3411                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$296       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$10)
    3414                      .dwattr $C$DW$296, DW_AT_name("xTxLock")
    3415                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_xTxLock")
    3416                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3417                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3418                      .dwendtag $C$DW$T$22
    3419              
    3420              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
    3421                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$22)
    3422                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3423              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    3424                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    3425                      .dwattr $C$DW$T$36, DW_AT_address_class(0x17)
    3426              $C$DW$297       .dwtag  DW_TAG_TI_far_type
    3427                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$36)
    3428              $C$DW$T$37      .dwtag  DW_TAG_const_type
    3429                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$297)
    3430              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueHandle")
    3431                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$36)
    3432                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3433              $C$DW$298       .dwtag  DW_TAG_TI_far_type
    3434                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$38)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   75

    3435              $C$DW$T$40      .dwtag  DW_TAG_const_type
    3436                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$298)
    3437              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3438                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    3439              $C$DW$299       .dwtag  DW_TAG_TI_far_type
    3440                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$3)
    3441              $C$DW$T$47      .dwtag  DW_TAG_const_type
    3442                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$299)
    3443              $C$DW$300       .dwtag  DW_TAG_TI_far_type
    3444              $C$DW$T$41      .dwtag  DW_TAG_const_type
    3445                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$300)
    3446              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    3447                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3448                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    3449              $C$DW$301       .dwtag  DW_TAG_TI_far_type
    3450                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$42)
    3451              $C$DW$T$48      .dwtag  DW_TAG_const_type
    3452                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$301)
    3453              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3454                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3455                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3456                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3457              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3458                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3459                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3460                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3461              $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    3462                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$5)
    3463                      .dwattr $C$DW$T$19, DW_AT_address_class(0x17)
    3464              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3465                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3466                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3467                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3468              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3469                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3470                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3471                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3472              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3473                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3474                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3475                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3476              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3477                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3478                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3479                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3480              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3481                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3482                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3483                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3484              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3485                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$10)
    3486                      .dwattr $C$DW$T$85, DW_AT_address_class(0x17)
    3487              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3488                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3489                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   76

    3490                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    3491              $C$DW$302       .dwtag  DW_TAG_TI_far_type
    3492                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$11)
    3493              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
    3494                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$302)
    3495              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    3496                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$11)
    3497                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3498              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    3499                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$29)
    3500                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    3501              $C$DW$303       .dwtag  DW_TAG_TI_far_type
    3502                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$78)
    3503              $C$DW$T$79      .dwtag  DW_TAG_const_type
    3504                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$303)
    3505              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3506                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$11)
    3507                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3508              $C$DW$T$12      .dwtag  DW_TAG_base_type
    3509                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3510                      .dwattr $C$DW$T$12, DW_AT_name("long")
    3511                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    3512              $C$DW$T$13      .dwtag  DW_TAG_base_type
    3513                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3514                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3515                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    3516              $C$DW$T$14      .dwtag  DW_TAG_base_type
    3517                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3518                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    3519                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    3520                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    3521                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    3522              $C$DW$T$15      .dwtag  DW_TAG_base_type
    3523                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3524                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3525                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    3526                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    3527                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    3528              $C$DW$T$16      .dwtag  DW_TAG_base_type
    3529                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3530                      .dwattr $C$DW$T$16, DW_AT_name("float")
    3531                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    3532              $C$DW$T$17      .dwtag  DW_TAG_base_type
    3533                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3534                      .dwattr $C$DW$T$17, DW_AT_name("double")
    3535                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    3536              $C$DW$T$18      .dwtag  DW_TAG_base_type
    3537                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3538                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    3539                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    3540              
    3541              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3542                      .dwattr $C$DW$T$28, DW_AT_name("xLIST")
    3543                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    3544              $C$DW$304       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   77

    3545                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$21)
    3546                      .dwattr $C$DW$304, DW_AT_name("uxNumberOfItems")
    3547                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_uxNumberOfItems")
    3548                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3549                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3550              $C$DW$305       .dwtag  DW_TAG_member
    3551                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$25)
    3552                      .dwattr $C$DW$305, DW_AT_name("pxIndex")
    3553                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_pxIndex")
    3554                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3555                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3556              $C$DW$306       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$27)
    3558                      .dwattr $C$DW$306, DW_AT_name("xListEnd")
    3559                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_xListEnd")
    3560                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3561                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3562                      .dwendtag $C$DW$T$28
    3563              
    3564              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    3565                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$28)
    3566                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3567              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    3568                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$20)
    3569                      .dwattr $C$DW$T$53, DW_AT_address_class(0x17)
    3570              $C$DW$307       .dwtag  DW_TAG_TI_far_type
    3571                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    3572              $C$DW$T$56      .dwtag  DW_TAG_const_type
    3573                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$307)
    3574              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    3575                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    3576                      .dwattr $C$DW$T$57, DW_AT_address_class(0x17)
    3577              $C$DW$308       .dwtag  DW_TAG_TI_far_type
    3578                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$57)
    3579              $C$DW$T$58      .dwtag  DW_TAG_const_type
    3580                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$308)
    3581              
    3582              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3583                      .dwattr $C$DW$T$32, DW_AT_name("xLIST_ITEM")
    3584                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    3585              $C$DW$309       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$29)
    3587                      .dwattr $C$DW$309, DW_AT_name("xItemValue")
    3588                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_xItemValue")
    3589                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3590                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3591              $C$DW$310       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$31)
    3593                      .dwattr $C$DW$310, DW_AT_name("pxNext")
    3594                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_pxNext")
    3595                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3596                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3597              $C$DW$311       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$31)
    3599                      .dwattr $C$DW$311, DW_AT_name("pxPrevious")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   78

    3600                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_pxPrevious")
    3601                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3602                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$312       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$3)
    3605                      .dwattr $C$DW$312, DW_AT_name("pvOwner")
    3606                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_pvOwner")
    3607                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3608                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3609              $C$DW$313       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$3)
    3611                      .dwattr $C$DW$313, DW_AT_name("pvContainer")
    3612                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_pvContainer")
    3613                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3614                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3615                      .dwendtag $C$DW$T$32
    3616              
    3617              $C$DW$314       .dwtag  DW_TAG_TI_far_type
    3618                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$32)
    3619              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    3620                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$314)
    3621              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    3622                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3623                      .dwattr $C$DW$T$31, DW_AT_address_class(0x17)
    3624              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    3625                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$32)
    3626                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3627              $C$DW$315       .dwtag  DW_TAG_TI_far_type
    3628                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$23)
    3629              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    3630                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$315)
    3631              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    3632                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    3633                      .dwattr $C$DW$T$25, DW_AT_address_class(0x17)
    3634              
    3635              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3636                      .dwattr $C$DW$T$33, DW_AT_name("xMINI_LIST_ITEM")
    3637                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    3638              $C$DW$316       .dwtag  DW_TAG_member
    3639                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$29)
    3640                      .dwattr $C$DW$316, DW_AT_name("xItemValue")
    3641                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_xItemValue")
    3642                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3643                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3644              $C$DW$317       .dwtag  DW_TAG_member
    3645                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$31)
    3646                      .dwattr $C$DW$317, DW_AT_name("pxNext")
    3647                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_pxNext")
    3648                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3649                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3650              $C$DW$318       .dwtag  DW_TAG_member
    3651                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$31)
    3652                      .dwattr $C$DW$318, DW_AT_name("pxPrevious")
    3653                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_pxPrevious")
    3654                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   79

    3655                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3656                      .dwendtag $C$DW$T$33
    3657              
    3658              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    3659                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$33)
    3660                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3661              $C$DW$319       .dwtag  DW_TAG_TI_far_type
    3662                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$26)
    3663              $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    3664                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$319)
    3665              
    3666              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3667                      .dwattr $C$DW$T$34, DW_AT_name("xTIME_OUT")
    3668                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    3669              $C$DW$320       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$10)
    3671                      .dwattr $C$DW$320, DW_AT_name("xOverflowCount")
    3672                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_xOverflowCount")
    3673                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3674                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3675              $C$DW$321       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$29)
    3677                      .dwattr $C$DW$321, DW_AT_name("xTimeOnEntering")
    3678                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_xTimeOnEntering")
    3679                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3680                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3681                      .dwendtag $C$DW$T$34
    3682              
    3683              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    3684                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$34)
    3685                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3686              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    3687                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    3688                      .dwattr $C$DW$T$62, DW_AT_address_class(0x17)
    3689              $C$DW$322       .dwtag  DW_TAG_TI_far_type
    3690                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$62)
    3691              $C$DW$T$63      .dwtag  DW_TAG_const_type
    3692                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$322)
    3693                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    3694              
    3695              ;***************************************************************
    3696              ;* DWARF CIE ENTRIES                                           *
    3697              ;***************************************************************
    3698              
    3699              $C$DW$CIE       .dwcie 91
    3700                      .dwcfi  cfa_register, 36
    3701                      .dwcfi  cfa_offset, 0
    3702                      .dwcfi  undefined, 0
    3703                      .dwcfi  undefined, 1
    3704                      .dwcfi  undefined, 2
    3705                      .dwcfi  undefined, 3
    3706                      .dwcfi  undefined, 4
    3707                      .dwcfi  undefined, 5
    3708                      .dwcfi  undefined, 6
    3709                      .dwcfi  undefined, 7
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:28:20 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
queue.asm                                                            PAGE   80

    3710                      .dwcfi  undefined, 8
    3711                      .dwcfi  undefined, 9
    3712                      .dwcfi  undefined, 10
    3713                      .dwcfi  undefined, 11
    3714                      .dwcfi  undefined, 12
    3715                      .dwcfi  undefined, 13
    3716                      .dwcfi  same_value, 14
    3717                      .dwcfi  same_value, 15
    3718                      .dwcfi  undefined, 16
    3719                      .dwcfi  undefined, 17
    3720                      .dwcfi  undefined, 18
    3721                      .dwcfi  undefined, 19
    3722                      .dwcfi  undefined, 20
    3723                      .dwcfi  undefined, 21
    3724                      .dwcfi  undefined, 22
    3725                      .dwcfi  undefined, 23
    3726                      .dwcfi  undefined, 24
    3727                      .dwcfi  undefined, 25
    3728                      .dwcfi  same_value, 26
    3729                      .dwcfi  same_value, 27
    3730                      .dwcfi  same_value, 28
    3731                      .dwcfi  same_value, 29
    3732                      .dwcfi  same_value, 30
    3733                      .dwcfi  same_value, 31
    3734                      .dwcfi  undefined, 32
    3735                      .dwcfi  undefined, 33
    3736                      .dwcfi  undefined, 34
    3737                      .dwcfi  undefined, 35
    3738                      .dwcfi  undefined, 36
    3739                      .dwcfi  undefined, 37
    3740                      .dwcfi  undefined, 38
    3741                      .dwcfi  undefined, 39
    3742                      .dwcfi  undefined, 40
    3743                      .dwcfi  undefined, 41
    3744                      .dwcfi  undefined, 42
    3745                      .dwcfi  undefined, 43
