TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE    1

    6019              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 07 02:27:25 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    5339              $C$DW$416       .dwtag  DW_TAG_TI_far_type
    5340                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$11)
    5341              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
    5342                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$416)
    5343              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    5344                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    5345                      .dwattr $C$DW$T$22, DW_AT_address_class(0x17)
    5346              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    5347                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$11)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  120

    5348                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    5349              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    5350                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$31)
    5351                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    5352              $C$DW$417       .dwtag  DW_TAG_TI_far_type
    5353                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$64)
    5354              $C$DW$T$65      .dwtag  DW_TAG_const_type
    5355                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$417)
    5356              $C$DW$418       .dwtag  DW_TAG_TI_far_type
    5357                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$31)
    5358              $C$DW$T$115     .dwtag  DW_TAG_volatile_type
    5359                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$418)
    5360              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    5361                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$11)
    5362                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    5363              $C$DW$T$12      .dwtag  DW_TAG_base_type
    5364                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    5365                      .dwattr $C$DW$T$12, DW_AT_name("long")
    5366                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    5367              $C$DW$T$13      .dwtag  DW_TAG_base_type
    5368                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    5369                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    5370                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    5371              $C$DW$T$14      .dwtag  DW_TAG_base_type
    5372                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    5373                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    5374                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    5375                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    5376                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    5377              $C$DW$T$15      .dwtag  DW_TAG_base_type
    5378                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    5379                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    5380                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    5381                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    5382                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    5383              $C$DW$T$16      .dwtag  DW_TAG_base_type
    5384                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    5385                      .dwattr $C$DW$T$16, DW_AT_name("float")
    5386                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    5387              $C$DW$T$17      .dwtag  DW_TAG_base_type
    5388                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    5389                      .dwattr $C$DW$T$17, DW_AT_name("double")
    5390                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    5391              $C$DW$T$18      .dwtag  DW_TAG_base_type
    5392                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    5393                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    5394                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    5395              $C$DW$T$116     .dwtag  DW_TAG_base_type
    5396                      .dwattr $C$DW$T$116, DW_AT_encoding(DW_ATE_signed_char)
    5397                      .dwattr $C$DW$T$116, DW_AT_name("signed char")
    5398                      .dwattr $C$DW$T$116, DW_AT_byte_size(0x01)
    5399              $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    5400                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
    5401                      .dwattr $C$DW$T$117, DW_AT_address_class(0x17)
    5402              $C$DW$419       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  121

    5403                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$116)
    5404              $C$DW$T$118     .dwtag  DW_TAG_const_type
    5405                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$419)
    5406              $C$DW$T$119     .dwtag  DW_TAG_pointer_type
    5407                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    5408                      .dwattr $C$DW$T$119, DW_AT_address_class(0x17)
    5409              
    5410              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    5411                      .dwattr $C$DW$T$20, DW_AT_name("tagSTACKSTRUCT")
    5412                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    5413              $C$DW$420       .dwtag  DW_TAG_member
    5414                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$19)
    5415                      .dwattr $C$DW$420, DW_AT_name("pxTopOfStack")
    5416                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_pxTopOfStack")
    5417                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5418                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5419              $C$DW$421       .dwtag  DW_TAG_member
    5420                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$19)
    5421                      .dwattr $C$DW$421, DW_AT_name("pxTopOfSysStack")
    5422                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    5423                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5424                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5425                      .dwendtag $C$DW$T$20
    5426              
    5427              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    5428                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$20)
    5429                      .dwattr $C$DW$T$122, DW_AT_address_class(0x17)
    5430              
    5431              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5432                      .dwattr $C$DW$T$25, DW_AT_name("tskTaskControlBlock")
    5433                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x26)
    5434              $C$DW$422       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$22)
    5436                      .dwattr $C$DW$422, DW_AT_name("pxTopOfStack")
    5437                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_pxTopOfStack")
    5438                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5439                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5440              $C$DW$423       .dwtag  DW_TAG_member
    5441                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$22)
    5442                      .dwattr $C$DW$423, DW_AT_name("pxTopOfSysStack")
    5443                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_pxTopOfSysStack")
    5444                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5445                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5446              $C$DW$424       .dwtag  DW_TAG_member
    5447                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$23)
    5448                      .dwattr $C$DW$424, DW_AT_name("xGenericListItem")
    5449                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_xGenericListItem")
    5450                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5451                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5452              $C$DW$425       .dwtag  DW_TAG_member
    5453                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$23)
    5454                      .dwattr $C$DW$425, DW_AT_name("xEventListItem")
    5455                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_xEventListItem")
    5456                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5457                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  122

    5458              $C$DW$426       .dwtag  DW_TAG_member
    5459                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$11)
    5460                      .dwattr $C$DW$426, DW_AT_name("uxPriority")
    5461                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_uxPriority")
    5462                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5463                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5464              $C$DW$427       .dwtag  DW_TAG_member
    5465                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
    5466                      .dwattr $C$DW$427, DW_AT_name("pxStack")
    5467                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_pxStack")
    5468                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5469                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5470              $C$DW$428       .dwtag  DW_TAG_member
    5471                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    5472                      .dwattr $C$DW$428, DW_AT_name("pxSysStack")
    5473                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_pxSysStack")
    5474                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5475                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5476              $C$DW$429       .dwtag  DW_TAG_member
    5477                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
    5478                      .dwattr $C$DW$429, DW_AT_name("pcTaskName")
    5479                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_pcTaskName")
    5480                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5481                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5482                      .dwendtag $C$DW$T$25
    5483              
    5484              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    5485                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$25)
    5486                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    5487              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    5488                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    5489                      .dwattr $C$DW$T$79, DW_AT_address_class(0x17)
    5490              $C$DW$430       .dwtag  DW_TAG_TI_far_type
    5491                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$79)
    5492              $C$DW$T$126     .dwtag  DW_TAG_volatile_type
    5493                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$430)
    5494              $C$DW$431       .dwtag  DW_TAG_TI_far_type
    5495                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$78)
    5496              $C$DW$T$127     .dwtag  DW_TAG_const_type
    5497                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$431)
    5498              $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    5499                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    5500                      .dwattr $C$DW$T$128, DW_AT_address_class(0x17)
    5501              $C$DW$432       .dwtag  DW_TAG_TI_far_type
    5502                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$128)
    5503              $C$DW$T$129     .dwtag  DW_TAG_const_type
    5504                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$432)
    5505              $C$DW$433       .dwtag  DW_TAG_TI_far_type
    5506                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$78)
    5507              $C$DW$T$130     .dwtag  DW_TAG_volatile_type
    5508                      .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$433)
    5509              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    5510                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$130)
    5511                      .dwattr $C$DW$T$131, DW_AT_address_class(0x17)
    5512              
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  123

    5513              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5514                      .dwattr $C$DW$T$30, DW_AT_name("xLIST")
    5515                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    5516              $C$DW$434       .dwtag  DW_TAG_member
    5517                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    5518                      .dwattr $C$DW$434, DW_AT_name("uxNumberOfItems")
    5519                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_uxNumberOfItems")
    5520                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5521                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5522              $C$DW$435       .dwtag  DW_TAG_member
    5523                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$27)
    5524                      .dwattr $C$DW$435, DW_AT_name("pxIndex")
    5525                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_pxIndex")
    5526                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5527                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5528              $C$DW$436       .dwtag  DW_TAG_member
    5529                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$29)
    5530                      .dwattr $C$DW$436, DW_AT_name("xListEnd")
    5531                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_xListEnd")
    5532                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5533                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5534                      .dwendtag $C$DW$T$30
    5535              
    5536              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    5537                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$30)
    5538                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    5539              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    5540                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    5541                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    5542              $C$DW$437       .dwtag  DW_TAG_TI_far_type
    5543                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$55)
    5544              $C$DW$T$132     .dwtag  DW_TAG_volatile_type
    5545                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$437)
    5546              $C$DW$438       .dwtag  DW_TAG_TI_far_type
    5547                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$55)
    5548              $C$DW$T$133     .dwtag  DW_TAG_const_type
    5549                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$438)
    5550              
    5551              $C$DW$T$134     .dwtag  DW_TAG_array_type
    5552                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$54)
    5553                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    5554                      .dwattr $C$DW$T$134, DW_AT_byte_size(0x28)
    5555              $C$DW$439       .dwtag  DW_TAG_subrange_type
    5556                      .dwattr $C$DW$439, DW_AT_upper_bound(0x03)
    5557                      .dwendtag $C$DW$T$134
    5558              
    5559              $C$DW$440       .dwtag  DW_TAG_TI_far_type
    5560                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$54)
    5561              $C$DW$T$69      .dwtag  DW_TAG_const_type
    5562                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$440)
    5563              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    5564                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    5565                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    5566              $C$DW$441       .dwtag  DW_TAG_TI_far_type
    5567                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$70)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  124

    5568              $C$DW$T$71      .dwtag  DW_TAG_const_type
    5569                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$441)
    5570              $C$DW$442       .dwtag  DW_TAG_TI_far_type
    5571                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$54)
    5572              $C$DW$T$135     .dwtag  DW_TAG_volatile_type
    5573                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$442)
    5574              
    5575              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5576                      .dwattr $C$DW$T$34, DW_AT_name("xLIST_ITEM")
    5577                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    5578              $C$DW$443       .dwtag  DW_TAG_member
    5579                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$31)
    5580                      .dwattr $C$DW$443, DW_AT_name("xItemValue")
    5581                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_xItemValue")
    5582                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5583                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5584              $C$DW$444       .dwtag  DW_TAG_member
    5585                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$33)
    5586                      .dwattr $C$DW$444, DW_AT_name("pxNext")
    5587                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_pxNext")
    5588                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5589                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5590              $C$DW$445       .dwtag  DW_TAG_member
    5591                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$33)
    5592                      .dwattr $C$DW$445, DW_AT_name("pxPrevious")
    5593                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_pxPrevious")
    5594                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5595                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5596              $C$DW$446       .dwtag  DW_TAG_member
    5597                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$3)
    5598                      .dwattr $C$DW$446, DW_AT_name("pvOwner")
    5599                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_pvOwner")
    5600                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5601                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5602              $C$DW$447       .dwtag  DW_TAG_member
    5603                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$3)
    5604                      .dwattr $C$DW$447, DW_AT_name("pvContainer")
    5605                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_pvContainer")
    5606                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5607                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5608                      .dwendtag $C$DW$T$34
    5609              
    5610              $C$DW$448       .dwtag  DW_TAG_TI_far_type
    5611                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$34)
    5612              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    5613                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$448)
    5614              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    5615                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    5616                      .dwattr $C$DW$T$33, DW_AT_address_class(0x17)
    5617              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    5618                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$34)
    5619                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    5620              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    5621                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    5622                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  125

    5623              $C$DW$449       .dwtag  DW_TAG_TI_far_type
    5624                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$23)
    5625              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    5626                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$449)
    5627              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    5628                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    5629                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
    5630              
    5631              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5632                      .dwattr $C$DW$T$35, DW_AT_name("xMEMORY_REGION")
    5633                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x06)
    5634              $C$DW$450       .dwtag  DW_TAG_member
    5635                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$3)
    5636                      .dwattr $C$DW$450, DW_AT_name("pvBaseAddress")
    5637                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_pvBaseAddress")
    5638                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5639                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    5640              $C$DW$451       .dwtag  DW_TAG_member
    5641                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$13)
    5642                      .dwattr $C$DW$451, DW_AT_name("ulLengthInBytes")
    5643                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_ulLengthInBytes")
    5644                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5645                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    5646              $C$DW$452       .dwtag  DW_TAG_member
    5647                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$13)
    5648                      .dwattr $C$DW$452, DW_AT_name("ulParameters")
    5649                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_ulParameters")
    5650                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5651                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    5652                      .dwendtag $C$DW$T$35
    5653              
    5654              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    5655                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$35)
    5656                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    5657              $C$DW$453       .dwtag  DW_TAG_TI_far_type
    5658                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$83)
    5659              $C$DW$T$84      .dwtag  DW_TAG_const_type
    5660                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$453)
    5661              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    5662                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    5663                      .dwattr $C$DW$T$85, DW_AT_address_class(0x17)
    5664              $C$DW$454       .dwtag  DW_TAG_TI_far_type
    5665                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$85)
    5666              $C$DW$T$86      .dwtag  DW_TAG_const_type
    5667                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$454)
    5668              
    5669              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    5670                      .dwattr $C$DW$T$36, DW_AT_name("xMINI_LIST_ITEM")
    5671                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    5672              $C$DW$455       .dwtag  DW_TAG_member
    5673                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$31)
    5674                      .dwattr $C$DW$455, DW_AT_name("xItemValue")
    5675                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_xItemValue")
    5676                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5677                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  126

    5678              $C$DW$456       .dwtag  DW_TAG_member
    5679                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$33)
    5680                      .dwattr $C$DW$456, DW_AT_name("pxNext")
    5681                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_pxNext")
    5682                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5683                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5684              $C$DW$457       .dwtag  DW_TAG_member
    5685                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$33)
    5686                      .dwattr $C$DW$457, DW_AT_name("pxPrevious")
    5687                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_pxPrevious")
    5688                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5689                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5690                      .dwendtag $C$DW$T$36
    5691              
    5692              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    5693                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$36)
    5694                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    5695              $C$DW$458       .dwtag  DW_TAG_TI_far_type
    5696                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$28)
    5697              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    5698                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$458)
    5699              
    5700              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5701                      .dwattr $C$DW$T$37, DW_AT_name("xTIME_OUT")
    5702                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    5703              $C$DW$459       .dwtag  DW_TAG_member
    5704                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$10)
    5705                      .dwattr $C$DW$459, DW_AT_name("xOverflowCount")
    5706                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_xOverflowCount")
    5707                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5708                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5709              $C$DW$460       .dwtag  DW_TAG_member
    5710                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$31)
    5711                      .dwattr $C$DW$460, DW_AT_name("xTimeOnEntering")
    5712                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_xTimeOnEntering")
    5713                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5714                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5715                      .dwendtag $C$DW$T$37
    5716              
    5717              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    5718                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$37)
    5719                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    5720              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    5721                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    5722                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    5723              $C$DW$461       .dwtag  DW_TAG_TI_far_type
    5724                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$74)
    5725              $C$DW$T$75      .dwtag  DW_TAG_const_type
    5726                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$461)
    5727                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    5728              
    5729              ;***************************************************************
    5730              ;* DWARF CIE ENTRIES                                           *
    5731              ;***************************************************************
    5732              
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:27 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
tasks.asm                                                            PAGE  127

    5733              $C$DW$CIE       .dwcie 91
    5734                      .dwcfi  cfa_register, 36
    5735                      .dwcfi  cfa_offset, 0
    5736                      .dwcfi  undefined, 0
    5737                      .dwcfi  undefined, 1
    5738                      .dwcfi  undefined, 2
    5739                      .dwcfi  undefined, 3
    5740                      .dwcfi  undefined, 4
    5741                      .dwcfi  undefined, 5
    5742                      .dwcfi  undefined, 6
    5743                      .dwcfi  undefined, 7
    5744                      .dwcfi  undefined, 8
    5745                      .dwcfi  undefined, 9
    5746                      .dwcfi  undefined, 10
    5747                      .dwcfi  undefined, 11
    5748                      .dwcfi  undefined, 12
    5749                      .dwcfi  undefined, 13
    5750                      .dwcfi  same_value, 14
    5751                      .dwcfi  same_value, 15
    5752                      .dwcfi  undefined, 16
    5753                      .dwcfi  undefined, 17
    5754                      .dwcfi  undefined, 18
    5755                      .dwcfi  undefined, 19
    5756                      .dwcfi  undefined, 20
    5757                      .dwcfi  undefined, 21
    5758                      .dwcfi  undefined, 22
    5759                      .dwcfi  undefined, 23
    5760                      .dwcfi  undefined, 24
    5761                      .dwcfi  undefined, 25
    5762                      .dwcfi  same_value, 26
    5763                      .dwcfi  same_value, 27
    5764                      .dwcfi  same_value, 28
    5765                      .dwcfi  same_value, 29
    5766                      .dwcfi  same_value, 30
    5767                      .dwcfi  same_value, 31
    5768                      .dwcfi  undefined, 32
    5769                      .dwcfi  undefined, 33
    5770                      .dwcfi  undefined, 34
    5771                      .dwcfi  undefined, 35
    5772                      .dwcfi  undefined, 36
    5773                      .dwcfi  undefined, 37
    5774                      .dwcfi  undefined, 38
    5775                      .dwcfi  undefined, 39
    5776                      .dwcfi  undefined, 40
    5777                      .dwcfi  undefined, 41
    5778                      .dwcfi  undefined, 42
    5779                      .dwcfi  undefined, 43
