TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE    1

    3569              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 16 02:56:33 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2240              $C$DW$108       .dwtag  DW_TAG_subprogram, DW_AT_name("I2C_getEventId")
    2241                      .dwattr $C$DW$108, DW_AT_low_pc(_I2C_getEventId)
    2242                      .dwattr $C$DW$108, DW_AT_high_pc(0x00)
    2243                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_I2C_getEventId")
    2244                      .dwattr $C$DW$108, DW_AT_external
    2245                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$68)
    2246                      .dwattr $C$DW$108, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_i2c.c")
    2247                      .dwattr $C$DW$108, DW_AT_TI_begin_line(0x41a)
    2248                      .dwattr $C$DW$108, DW_AT_TI_begin_column(0x07)
    2249                      .dwattr $C$DW$108, DW_AT_TI_max_frame_size(0x02)
    2250                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_i2c.c",line 1051,column 1,is_stmt,addr
    2251              
    2252                      .dwfde $C$DW$CIE, _I2C_getEventId
    2253              ;*******************************************************************************
    2254              ;* FUNCTION NAME: I2C_getEventId                                               *
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   56

    2255              ;*                                                                             *
    2256              ;*   Function Uses Regs : AC0,AC0,T0,AR1,AR3,XAR3,SP,M40,SATA,SATD,RDM,FRCT,   *
    2257              ;*                        SMUL                                                 *
    2258              ;*   Stack Frame        : Compact (No Frame Pointer, w/ debug)                 *
    2259              ;*   Total Frame Size   : 2 words                                              *
    2260              ;*                        (1 return address/alignment)                         *
    2261              ;*                        (1 local values)                                     *
    2262              ;*   Min System Stack   : 1 word                                               *
    2263              ;*******************************************************************************
    2264 000c30       _I2C_getEventId:
    2265                      .dwcfi  cfa_offset, 1
    2266                      .dwcfi  save_reg_to_mem, 91, -1
    2267 000c30 4EFF          AADD #-1, SP
    2268                      .dwcfi  cfa_offset, 2
    2269              $C$DW$109       .dwtag  DW_TAG_variable, DW_AT_name("eventId")
    2270                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_eventId")
    2271                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$68)
    2272                      .dwattr $C$DW$109, DW_AT_location[DW_OP_bregx 0x24 0]
    2273                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_i2c.c",line 1055,column 2,is_stmt
    2274 000c32 ED31          MOV dbl(*(#_i2cHandle)), XAR3
         000c34 BF00 
         000c36 0010-
    2275 000c38 7600          MOV #40, T0 ; |1055| 
         000c3a 2848 
    2276 000c3c AB61          MOV *AR3, AR3 ; |1055| 
    2277 000c3e A96B          MOV port(*AR3(T0)), AR1 ; |1055| 
         000c40 99   
    2278 000c41 1807          AND #0x0007, AR1, AC0 ; |1055| 
         000c43 09   
    2279 000c44 C000          MOV AC0, *SP(#0) ; |1055| 
    2280                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_i2c.c",line 1057,column 2,is_stmt
    2281 000c46 2204          MOV AC0, T0
    2282                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_i2c.c",line 1058,column 1,is_stmt
    2283 000c48 4E01          AADD #1, SP
    2284                      .dwcfi  cfa_offset, 1
    2285              $C$DW$110       .dwtag  DW_TAG_TI_branch
    2286                      .dwattr $C$DW$110, DW_AT_low_pc(0x00)
    2287                      .dwattr $C$DW$110, DW_AT_TI_return
    2288 000c4a 4804          RET
    2289                                                      ; return occurs
    2290                      .dwattr $C$DW$108, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_i2c.c")
    2291                      .dwattr $C$DW$108, DW_AT_TI_end_line(0x422)
    2292                      .dwattr $C$DW$108, DW_AT_TI_end_column(0x01)
    2293                      .dwendentry
    2294                      .dwendtag $C$DW$108
    2295              
    2296              ;******************************************************************************
    2297              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    2298              ;******************************************************************************
    2299                      .global __divul
    2300                      .global __remul
    2301                      .global __mpyli
    2302              
    2303              ;*******************************************************************************
    2304              ;* TYPE INFORMATION                                                            *
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   57

    2305              ;*******************************************************************************
    2306              
    2307              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2308                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x39)
    2309              $C$DW$111       .dwtag  DW_TAG_member
    2310                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    2311                      .dwattr $C$DW$111, DW_AT_name("ICOAR")
    2312                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ICOAR")
    2313                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2315              $C$DW$112       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    2317                      .dwattr $C$DW$112, DW_AT_name("RSVD0")
    2318                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_RSVD0")
    2319                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2320                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2321              $C$DW$113       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    2323                      .dwattr $C$DW$113, DW_AT_name("ICIMR")
    2324                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_ICIMR")
    2325                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2326                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2327              $C$DW$114       .dwtag  DW_TAG_member
    2328                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
    2329                      .dwattr $C$DW$114, DW_AT_name("RSVD1")
    2330                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_RSVD1")
    2331                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2332                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2333              $C$DW$115       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    2335                      .dwattr $C$DW$115, DW_AT_name("ICSTR")
    2336                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_ICSTR")
    2337                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2338                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2339              $C$DW$116       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
    2341                      .dwattr $C$DW$116, DW_AT_name("RSVD2")
    2342                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_RSVD2")
    2343                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2344                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2345              $C$DW$117       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    2347                      .dwattr $C$DW$117, DW_AT_name("ICCLKL")
    2348                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_ICCLKL")
    2349                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2350                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2351              $C$DW$118       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    2353                      .dwattr $C$DW$118, DW_AT_name("RSVD3")
    2354                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_RSVD3")
    2355                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2356                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2357              $C$DW$119       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    2359                      .dwattr $C$DW$119, DW_AT_name("ICCLKH")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   58

    2360                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_ICCLKH")
    2361                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2362                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2363              $C$DW$120       .dwtag  DW_TAG_member
    2364                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
    2365                      .dwattr $C$DW$120, DW_AT_name("RSVD4")
    2366                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_RSVD4")
    2367                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2368                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2369              $C$DW$121       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    2371                      .dwattr $C$DW$121, DW_AT_name("ICCNT")
    2372                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ICCNT")
    2373                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2374                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2375              $C$DW$122       .dwtag  DW_TAG_member
    2376                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    2377                      .dwattr $C$DW$122, DW_AT_name("RSVD5")
    2378                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_RSVD5")
    2379                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2380                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2381              $C$DW$123       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    2383                      .dwattr $C$DW$123, DW_AT_name("ICDRR")
    2384                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ICDRR")
    2385                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2386                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2387              $C$DW$124       .dwtag  DW_TAG_member
    2388                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    2389                      .dwattr $C$DW$124, DW_AT_name("RSVD6")
    2390                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_RSVD6")
    2391                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2392                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2393              $C$DW$125       .dwtag  DW_TAG_member
    2394                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    2395                      .dwattr $C$DW$125, DW_AT_name("ICSAR")
    2396                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_ICSAR")
    2397                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2398                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2399              $C$DW$126       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$21)
    2401                      .dwattr $C$DW$126, DW_AT_name("RSVD7")
    2402                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_RSVD7")
    2403                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2404                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2405              $C$DW$127       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    2407                      .dwattr $C$DW$127, DW_AT_name("ICDXR")
    2408                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ICDXR")
    2409                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2410                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2411              $C$DW$128       .dwtag  DW_TAG_member
    2412                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    2413                      .dwattr $C$DW$128, DW_AT_name("RSVD8")
    2414                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_RSVD8")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   59

    2415                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2416                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2417              $C$DW$129       .dwtag  DW_TAG_member
    2418                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    2419                      .dwattr $C$DW$129, DW_AT_name("ICMDR")
    2420                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ICMDR")
    2421                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2422                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2423              $C$DW$130       .dwtag  DW_TAG_member
    2424                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
    2425                      .dwattr $C$DW$130, DW_AT_name("RSVD9")
    2426                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_RSVD9")
    2427                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2428                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2429              $C$DW$131       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    2431                      .dwattr $C$DW$131, DW_AT_name("ICIVR")
    2432                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ICIVR")
    2433                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2434                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2435              $C$DW$132       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$21)
    2437                      .dwattr $C$DW$132, DW_AT_name("RSVD10")
    2438                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_RSVD10")
    2439                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2440                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2441              $C$DW$133       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    2443                      .dwattr $C$DW$133, DW_AT_name("ICEMDR")
    2444                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ICEMDR")
    2445                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2446                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2447              $C$DW$134       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
    2449                      .dwattr $C$DW$134, DW_AT_name("RSVD11")
    2450                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_RSVD11")
    2451                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2452                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2453              $C$DW$135       .dwtag  DW_TAG_member
    2454                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    2455                      .dwattr $C$DW$135, DW_AT_name("ICPSC")
    2456                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ICPSC")
    2457                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2458                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2459              $C$DW$136       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    2461                      .dwattr $C$DW$136, DW_AT_name("RSVD12")
    2462                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_RSVD12")
    2463                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2464                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2465              $C$DW$137       .dwtag  DW_TAG_member
    2466                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    2467                      .dwattr $C$DW$137, DW_AT_name("ICPID1")
    2468                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ICPID1")
    2469                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   60

    2470                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2471              $C$DW$138       .dwtag  DW_TAG_member
    2472                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    2473                      .dwattr $C$DW$138, DW_AT_name("RSVD13")
    2474                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_RSVD13")
    2475                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2476                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2477              $C$DW$139       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    2479                      .dwattr $C$DW$139, DW_AT_name("ICPID2")
    2480                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ICPID2")
    2481                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2482                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2483                      .dwendtag $C$DW$T$22
    2484              
    2485              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegs")
    2486                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$22)
    2487                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2488              $C$DW$140       .dwtag  DW_TAG_TI_far_type
    2489                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$32)
    2490              $C$DW$141       .dwtag  DW_TAG_TI_ioport_type
    2491                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$140)
    2492              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    2493                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$141)
    2494              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2495                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2496                      .dwattr $C$DW$T$34, DW_AT_address_class(0x10)
    2497              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegsOvly")
    2498                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2499                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2500              
    2501              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2502                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
    2503              $C$DW$142       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    2505                      .dwattr $C$DW$142, DW_AT_name("EBSR")
    2506                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_EBSR")
    2507                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2508                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2509              $C$DW$143       .dwtag  DW_TAG_member
    2510                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    2511                      .dwattr $C$DW$143, DW_AT_name("RSVD0")
    2512                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_RSVD0")
    2513                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2514                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2515              $C$DW$144       .dwtag  DW_TAG_member
    2516                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    2517                      .dwattr $C$DW$144, DW_AT_name("PCGCR1")
    2518                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PCGCR1")
    2519                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2520                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2521              $C$DW$145       .dwtag  DW_TAG_member
    2522                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    2523                      .dwattr $C$DW$145, DW_AT_name("PCGCR2")
    2524                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PCGCR2")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   61

    2525                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2526                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2527              $C$DW$146       .dwtag  DW_TAG_member
    2528                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    2529                      .dwattr $C$DW$146, DW_AT_name("PSRCR")
    2530                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PSRCR")
    2531                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2532                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2533              $C$DW$147       .dwtag  DW_TAG_member
    2534                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    2535                      .dwattr $C$DW$147, DW_AT_name("PRCR")
    2536                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PRCR")
    2537                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2538                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2539              $C$DW$148       .dwtag  DW_TAG_member
    2540                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$23)
    2541                      .dwattr $C$DW$148, DW_AT_name("RSVD1")
    2542                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_RSVD1")
    2543                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2544                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2545              $C$DW$149       .dwtag  DW_TAG_member
    2546                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    2547                      .dwattr $C$DW$149, DW_AT_name("TIAFR")
    2548                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_TIAFR")
    2549                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2550                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2551              $C$DW$150       .dwtag  DW_TAG_member
    2552                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    2553                      .dwattr $C$DW$150, DW_AT_name("RSVD2")
    2554                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_RSVD2")
    2555                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2556                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2557              $C$DW$151       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    2559                      .dwattr $C$DW$151, DW_AT_name("ODSCR")
    2560                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ODSCR")
    2561                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2562                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2563              $C$DW$152       .dwtag  DW_TAG_member
    2564                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    2565                      .dwattr $C$DW$152, DW_AT_name("PDINHIBR1")
    2566                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PDINHIBR1")
    2567                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2568                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2569              $C$DW$153       .dwtag  DW_TAG_member
    2570                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    2571                      .dwattr $C$DW$153, DW_AT_name("PDINHIBR2")
    2572                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PDINHIBR2")
    2573                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2574                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2575              $C$DW$154       .dwtag  DW_TAG_member
    2576                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    2577                      .dwattr $C$DW$154, DW_AT_name("PDINHIBR3")
    2578                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PDINHIBR3")
    2579                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   62

    2580                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2581              $C$DW$155       .dwtag  DW_TAG_member
    2582                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    2583                      .dwattr $C$DW$155, DW_AT_name("DMA0CESR1")
    2584                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DMA0CESR1")
    2585                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2586                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2587              $C$DW$156       .dwtag  DW_TAG_member
    2588                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    2589                      .dwattr $C$DW$156, DW_AT_name("DMA0CESR2")
    2590                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_DMA0CESR2")
    2591                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2592                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2593              $C$DW$157       .dwtag  DW_TAG_member
    2594                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    2595                      .dwattr $C$DW$157, DW_AT_name("DMA1CESR1")
    2596                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_DMA1CESR1")
    2597                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2598                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2599              $C$DW$158       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    2601                      .dwattr $C$DW$158, DW_AT_name("DMA1CESR2")
    2602                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_DMA1CESR2")
    2603                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2604                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2605              $C$DW$159       .dwtag  DW_TAG_member
    2606                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    2607                      .dwattr $C$DW$159, DW_AT_name("SDRAMCCR")
    2608                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_SDRAMCCR")
    2609                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2610                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2611              $C$DW$160       .dwtag  DW_TAG_member
    2612                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2613                      .dwattr $C$DW$160, DW_AT_name("CCR2")
    2614                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_CCR2")
    2615                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2616                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2617              $C$DW$161       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2619                      .dwattr $C$DW$161, DW_AT_name("CGCR1")
    2620                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_CGCR1")
    2621                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2622                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2623              $C$DW$162       .dwtag  DW_TAG_member
    2624                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2625                      .dwattr $C$DW$162, DW_AT_name("CGICR")
    2626                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_CGICR")
    2627                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2628                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2629              $C$DW$163       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2631                      .dwattr $C$DW$163, DW_AT_name("CGCR2")
    2632                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_CGCR2")
    2633                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2634                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   63

    2635              $C$DW$164       .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2637                      .dwattr $C$DW$164, DW_AT_name("CGOCR")
    2638                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_CGOCR")
    2639                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2640                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2641              $C$DW$165       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    2643                      .dwattr $C$DW$165, DW_AT_name("CCSSR")
    2644                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_CCSSR")
    2645                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2646                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2647              $C$DW$166       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2649                      .dwattr $C$DW$166, DW_AT_name("RSVD3")
    2650                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_RSVD3")
    2651                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2652                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2653              $C$DW$167       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2655                      .dwattr $C$DW$167, DW_AT_name("ECDR")
    2656                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_ECDR")
    2657                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2658                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2659              $C$DW$168       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    2661                      .dwattr $C$DW$168, DW_AT_name("RSVD4")
    2662                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD4")
    2663                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2664                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2665              $C$DW$169       .dwtag  DW_TAG_member
    2666                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    2667                      .dwattr $C$DW$169, DW_AT_name("RAMSLPMDCNTLR1")
    2668                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2669                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2670                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2671              $C$DW$170       .dwtag  DW_TAG_member
    2672                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    2673                      .dwattr $C$DW$170, DW_AT_name("RSVD5")
    2674                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_RSVD5")
    2675                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2676                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2677              $C$DW$171       .dwtag  DW_TAG_member
    2678                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    2679                      .dwattr $C$DW$171, DW_AT_name("RAMSLPMDCNTLR2")
    2680                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2681                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2682                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2683              $C$DW$172       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2685                      .dwattr $C$DW$172, DW_AT_name("RAMSLPMDCNTLR3")
    2686                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2687                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2688                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2689              $C$DW$173       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   64

    2690                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    2691                      .dwattr $C$DW$173, DW_AT_name("RAMSLPMDCNTLR4")
    2692                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2693                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2694                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2695              $C$DW$174       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    2697                      .dwattr $C$DW$174, DW_AT_name("RAMSLPMDCNTLR5")
    2698                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2699                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2700                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2701              $C$DW$175       .dwtag  DW_TAG_member
    2702                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$24)
    2703                      .dwattr $C$DW$175, DW_AT_name("RSVD6")
    2704                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD6")
    2705                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2706                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2707              $C$DW$176       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    2709                      .dwattr $C$DW$176, DW_AT_name("DMAIFR")
    2710                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_DMAIFR")
    2711                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2712                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2713              $C$DW$177       .dwtag  DW_TAG_member
    2714                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    2715                      .dwattr $C$DW$177, DW_AT_name("DMAIER")
    2716                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_DMAIER")
    2717                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2718                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2719              $C$DW$178       .dwtag  DW_TAG_member
    2720                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$20)
    2721                      .dwattr $C$DW$178, DW_AT_name("USBSCR")
    2722                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_USBSCR")
    2723                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2724                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2725              $C$DW$179       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    2727                      .dwattr $C$DW$179, DW_AT_name("ESCR")
    2728                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ESCR")
    2729                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2730                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2731              $C$DW$180       .dwtag  DW_TAG_member
    2732                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$24)
    2733                      .dwattr $C$DW$180, DW_AT_name("RSVD7")
    2734                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RSVD7")
    2735                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2736                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2737              $C$DW$181       .dwtag  DW_TAG_member
    2738                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    2739                      .dwattr $C$DW$181, DW_AT_name("DMA2CESR1")
    2740                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_DMA2CESR1")
    2741                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2742                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2743              $C$DW$182       .dwtag  DW_TAG_member
    2744                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   65

    2745                      .dwattr $C$DW$182, DW_AT_name("DMA2CESR2")
    2746                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DMA2CESR2")
    2747                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2748                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2749              $C$DW$183       .dwtag  DW_TAG_member
    2750                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    2751                      .dwattr $C$DW$183, DW_AT_name("DMA3CESR1")
    2752                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DMA3CESR1")
    2753                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2754                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2755              $C$DW$184       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$20)
    2757                      .dwattr $C$DW$184, DW_AT_name("DMA3CESR2")
    2758                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_DMA3CESR2")
    2759                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2760                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2761              $C$DW$185       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    2763                      .dwattr $C$DW$185, DW_AT_name("CLKSTOP")
    2764                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CLKSTOP")
    2765                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2766                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2767              $C$DW$186       .dwtag  DW_TAG_member
    2768                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$25)
    2769                      .dwattr $C$DW$186, DW_AT_name("RSVD8")
    2770                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_RSVD8")
    2771                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2772                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2773              $C$DW$187       .dwtag  DW_TAG_member
    2774                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    2775                      .dwattr $C$DW$187, DW_AT_name("DIEIDR0")
    2776                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_DIEIDR0")
    2777                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2778                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2779              $C$DW$188       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    2781                      .dwattr $C$DW$188, DW_AT_name("DIEIDR1")
    2782                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_DIEIDR1")
    2783                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2784                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2785              $C$DW$189       .dwtag  DW_TAG_member
    2786                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    2787                      .dwattr $C$DW$189, DW_AT_name("DIEIDR2")
    2788                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_DIEIDR2")
    2789                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2790                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2791              $C$DW$190       .dwtag  DW_TAG_member
    2792                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2793                      .dwattr $C$DW$190, DW_AT_name("DIEIDR3")
    2794                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DIEIDR3")
    2795                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2796                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2797              $C$DW$191       .dwtag  DW_TAG_member
    2798                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    2799                      .dwattr $C$DW$191, DW_AT_name("DIEIDR4")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   66

    2800                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DIEIDR4")
    2801                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2802                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2803              $C$DW$192       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    2805                      .dwattr $C$DW$192, DW_AT_name("DIEIDR5")
    2806                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_DIEIDR5")
    2807                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2808                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2809              $C$DW$193       .dwtag  DW_TAG_member
    2810                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$20)
    2811                      .dwattr $C$DW$193, DW_AT_name("DIEIDR6")
    2812                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_DIEIDR6")
    2813                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2814                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2815              $C$DW$194       .dwtag  DW_TAG_member
    2816                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$20)
    2817                      .dwattr $C$DW$194, DW_AT_name("DIEIDR7")
    2818                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_DIEIDR7")
    2819                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2820                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2821                      .dwendtag $C$DW$T$26
    2822              
    2823              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2824                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$26)
    2825                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2826              $C$DW$195       .dwtag  DW_TAG_TI_far_type
    2827                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$36)
    2828              $C$DW$196       .dwtag  DW_TAG_TI_ioport_type
    2829                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$195)
    2830              $C$DW$T$37      .dwtag  DW_TAG_volatile_type
    2831                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$196)
    2832              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    2833                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2834                      .dwattr $C$DW$T$38, DW_AT_address_class(0x10)
    2835              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2836                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2837                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2838              
    2839              $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
    2840                      .dwattr $C$DW$T$42, DW_AT_name("CSL_I2cAddrMode")
    2841                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2842              $C$DW$197       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_7BIT"), DW_AT_const_value(0x00)
    2843              $C$DW$198       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_ADDR_10BIT"), DW_AT_const_value(0x01)
    2844                      .dwendtag $C$DW$T$42
    2845              
    2846              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cAddrMode")
    2847                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2848                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2849              
    2850              $C$DW$T$44      .dwtag  DW_TAG_enumeration_type
    2851                      .dwattr $C$DW$T$44, DW_AT_name("CSL_I2cBitCount")
    2852                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2853              $C$DW$199       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_8BITS"), DW_AT_const_value(0x00)
    2854              $C$DW$200       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_RSVD"), DW_AT_const_value(0x01)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   67

    2855              $C$DW$201       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_2BITS"), DW_AT_const_value(0x02)
    2856              $C$DW$202       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_3BITS"), DW_AT_const_value(0x03)
    2857              $C$DW$203       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_4BITS"), DW_AT_const_value(0x04)
    2858              $C$DW$204       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_5BITS"), DW_AT_const_value(0x05)
    2859              $C$DW$205       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_6BITS"), DW_AT_const_value(0x06)
    2860              $C$DW$206       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_BC_7BITS"), DW_AT_const_value(0x07)
    2861                      .dwendtag $C$DW$T$44
    2862              
    2863              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cBitCount")
    2864                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2865                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2866              
    2867              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2868                      .dwattr $C$DW$T$27, DW_AT_name("CSL_I2cConfig")
    2869                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x09)
    2870              $C$DW$207       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2872                      .dwattr $C$DW$207, DW_AT_name("icoar")
    2873                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_icoar")
    2874                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2875                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2876              $C$DW$208       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2878                      .dwattr $C$DW$208, DW_AT_name("icimr")
    2879                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_icimr")
    2880                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2881                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2882              $C$DW$209       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2884                      .dwattr $C$DW$209, DW_AT_name("icclkl")
    2885                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_icclkl")
    2886                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2887                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2888              $C$DW$210       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2890                      .dwattr $C$DW$210, DW_AT_name("icclkh")
    2891                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_icclkh")
    2892                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2893                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2894              $C$DW$211       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2896                      .dwattr $C$DW$211, DW_AT_name("iccnt")
    2897                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_iccnt")
    2898                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2899                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2900              $C$DW$212       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2902                      .dwattr $C$DW$212, DW_AT_name("icsar")
    2903                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_icsar")
    2904                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2905                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2906              $C$DW$213       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2908                      .dwattr $C$DW$213, DW_AT_name("icmdr")
    2909                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_icmdr")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   68

    2910                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2911                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2912              $C$DW$214       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2914                      .dwattr $C$DW$214, DW_AT_name("icemdr")
    2915                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_icemdr")
    2916                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2917                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2918              $C$DW$215       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2920                      .dwattr $C$DW$215, DW_AT_name("icpsc")
    2921                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_icpsc")
    2922                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2923                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2924                      .dwendtag $C$DW$T$27
    2925              
    2926              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cConfig")
    2927                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$27)
    2928                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    2929              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    2930                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2931                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    2932              
    2933              $C$DW$T$56      .dwtag  DW_TAG_enumeration_type
    2934                      .dwattr $C$DW$T$56, DW_AT_name("CSL_I2cEvent")
    2935                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    2936              $C$DW$216       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_AL"), DW_AT_const_value(0x00)
    2937              $C$DW$217       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_NACK"), DW_AT_const_value(0x01)
    2938              $C$DW$218       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_ARDY"), DW_AT_const_value(0x02)
    2939              $C$DW$219       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_ICRRDY"), DW_AT_const_value(0x03)
    2940              $C$DW$220       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_ICXRDY"), DW_AT_const_value(0x04)
    2941              $C$DW$221       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_SCD"), DW_AT_const_value(0x05)
    2942              $C$DW$222       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_EVENT_AAS"), DW_AT_const_value(0x06)
    2943                      .dwendtag $C$DW$T$56
    2944              
    2945              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cEvent")
    2946                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2947                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2948              
    2949              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    2950                      .dwattr $C$DW$T$48, DW_AT_name("CSL_I2cFreeMode")
    2951                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2952              $C$DW$223       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_DISABLE"), DW_AT_const_value(0x00)
    2953              $C$DW$224       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_FREEMODE_ENABLE"), DW_AT_const_value(0x01)
    2954                      .dwendtag $C$DW$T$48
    2955              
    2956              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cFreeMode")
    2957                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2958                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2959              
    2960              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2961                      .dwattr $C$DW$T$31, DW_AT_name("CSL_I2cIsrAddr")
    2962                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0e)
    2963              $C$DW$225       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$30)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   69

    2965                      .dwattr $C$DW$225, DW_AT_name("alAddr")
    2966                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_alAddr")
    2967                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2968                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2969              $C$DW$226       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$30)
    2971                      .dwattr $C$DW$226, DW_AT_name("nackAddr")
    2972                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_nackAddr")
    2973                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2974                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2975              $C$DW$227       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$30)
    2977                      .dwattr $C$DW$227, DW_AT_name("ardyAddr")
    2978                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_ardyAddr")
    2979                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2980                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2981              $C$DW$228       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$30)
    2983                      .dwattr $C$DW$228, DW_AT_name("rrdyAddr")
    2984                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_rrdyAddr")
    2985                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2986                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2987              $C$DW$229       .dwtag  DW_TAG_member
    2988                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$30)
    2989                      .dwattr $C$DW$229, DW_AT_name("xrdyAddr")
    2990                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_xrdyAddr")
    2991                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2992                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2993              $C$DW$230       .dwtag  DW_TAG_member
    2994                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$30)
    2995                      .dwattr $C$DW$230, DW_AT_name("scdAddr")
    2996                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_scdAddr")
    2997                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2998                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2999              $C$DW$231       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$30)
    3001                      .dwattr $C$DW$231, DW_AT_name("aasAddr")
    3002                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_aasAddr")
    3003                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3004                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3005                      .dwendtag $C$DW$T$31
    3006              
    3007              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cIsrAddr")
    3008                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$31)
    3009                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3010              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    3011                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3012                      .dwattr $C$DW$T$59, DW_AT_address_class(0x17)
    3013              
    3014              $C$DW$T$46      .dwtag  DW_TAG_enumeration_type
    3015                      .dwattr $C$DW$T$46, DW_AT_name("CSL_I2cLoopback")
    3016                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    3017              $C$DW$232       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_DISABLE"), DW_AT_const_value(0x00)
    3018              $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_LOOPBACK_ENABLE"), DW_AT_const_value(0x01)
    3019                      .dwendtag $C$DW$T$46
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   70

    3020              
    3021              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cLoopback")
    3022                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3023                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3024              
    3025              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3026                      .dwattr $C$DW$T$41, DW_AT_name("CSL_I2cObj")
    3027                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x10)
    3028              $C$DW$234       .dwtag  DW_TAG_member
    3029                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$35)
    3030                      .dwattr $C$DW$234, DW_AT_name("i2cRegs")
    3031                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_i2cRegs")
    3032                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3033                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3034              $C$DW$235       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$39)
    3036                      .dwattr $C$DW$235, DW_AT_name("sysCtrlRegs")
    3037                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_sysCtrlRegs")
    3038                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3039                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$236       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$40)
    3042                      .dwattr $C$DW$236, DW_AT_name("I2C_isrDispatchTable")
    3043                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_I2C_isrDispatchTable")
    3044                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3045                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3046                      .dwendtag $C$DW$T$41
    3047              
    3048              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cObj")
    3049                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$41)
    3050                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3051              
    3052              $C$DW$T$61      .dwtag  DW_TAG_array_type
    3053                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    3054                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3055                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x10)
    3056              $C$DW$237       .dwtag  DW_TAG_subrange_type
    3057                      .dwattr $C$DW$237, DW_AT_upper_bound(0x00)
    3058                      .dwendtag $C$DW$T$61
    3059              
    3060              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    3061                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$60)
    3062                      .dwattr $C$DW$T$62, DW_AT_address_class(0x17)
    3063              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("pI2cHandle")
    3064                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    3065                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3066              
    3067              $C$DW$T$50      .dwtag  DW_TAG_enumeration_type
    3068                      .dwattr $C$DW$T$50, DW_AT_name("CSL_I2cRepeatMode")
    3069                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    3070              $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_DISABLE"), DW_AT_const_value(0x00)
    3071              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_I2C_REPEATMODE_ENABLE"), DW_AT_const_value(0x01)
    3072                      .dwendtag $C$DW$T$50
    3073              
    3074              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRepeatMode")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   71

    3075                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3076                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3077              
    3078              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3079                      .dwattr $C$DW$T$53, DW_AT_name("CSL_I2cSetup")
    3080                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x0a)
    3081              $C$DW$240       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$43)
    3083                      .dwattr $C$DW$240, DW_AT_name("addrMode")
    3084                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_addrMode")
    3085                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3086                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3087              $C$DW$241       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$45)
    3089                      .dwattr $C$DW$241, DW_AT_name("bitCount")
    3090                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_bitCount")
    3091                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3092                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3093              $C$DW$242       .dwtag  DW_TAG_member
    3094                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$47)
    3095                      .dwattr $C$DW$242, DW_AT_name("loopBack")
    3096                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_loopBack")
    3097                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3098                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3099              $C$DW$243       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$49)
    3101                      .dwattr $C$DW$243, DW_AT_name("freeMode")
    3102                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_freeMode")
    3103                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3104                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3105              $C$DW$244       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$51)
    3107                      .dwattr $C$DW$244, DW_AT_name("repeatMode")
    3108                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_repeatMode")
    3109                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3110                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3111              $C$DW$245       .dwtag  DW_TAG_member
    3112                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3113                      .dwattr $C$DW$245, DW_AT_name("ownAddr")
    3114                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_ownAddr")
    3115                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3116                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3117              $C$DW$246       .dwtag  DW_TAG_member
    3118                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$52)
    3119                      .dwattr $C$DW$246, DW_AT_name("sysInputClk")
    3120                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_sysInputClk")
    3121                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3122                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3123              $C$DW$247       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$52)
    3125                      .dwattr $C$DW$247, DW_AT_name("i2cBusFreq")
    3126                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_i2cBusFreq")
    3127                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3128                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3129                      .dwendtag $C$DW$T$53
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:35 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2c.asm                                                          PAGE   72

    3130              
    3131              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cSetup")
    3132                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$53)
    3133                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3134              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    3135                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    3136                      .dwattr $C$DW$T$65, DW_AT_address_class(0x17)
    3137              
    3138              $C$DW$T$28      .dwtag  DW_TAG_subroutine_type
    3139                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3140              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3141                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3142                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3143              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2C_EVENT_ISR")
    3144                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3145                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3146              
    3147              $C$DW$T$40      .dwtag  DW_TAG_array_type
    3148                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$30)
    3149                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3150                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0e)
    3151              $C$DW$248       .dwtag  DW_TAG_subrange_type
    3152                      .dwattr $C$DW$248, DW_AT_upper_bound(0x06)
    3153                      .dwendtag $C$DW$T$40
    3154              
    3155              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3156                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3157                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3158                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3159              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3160                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3161                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3162                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3163              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3164                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3165                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3166                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3167              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3168                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3169                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3170                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3171              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3172                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3173                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3174                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3175              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    3176                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$8)
    3177                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3178              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    3179                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    3180                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3181              $C$DW$T$9       .dwtag  DW_TAG_base_type
