TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE    1

    2462              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 15 12:23:03 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1787                      .dwattr $C$DW$105, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c")
    1788                      .dwattr $C$DW$105, DW_AT_TI_begin_line(0x3ea)
    1789                      .dwattr $C$DW$105, DW_AT_TI_begin_column(0x06)
    1790                      .dwattr $C$DW$105, DW_AT_TI_max_frame_size(0x02)
    1791                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1005,column 1,is_stmt,add
    1792              
    1793                      .dwfde $C$DW$CIE, _IRQ_globalRestore
    1794              $C$DW$106       .dwtag  DW_TAG_formal_parameter, DW_AT_name("value")
    1795                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_value")
    1796                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$41)
    1797                      .dwattr $C$DW$106, DW_AT_location[DW_OP_reg12]
    1798              ;*******************************************************************************
    1799              ;* FUNCTION NAME: IRQ_globalRestore                                            *
    1800              ;*                                                                             *
    1801              ;*   Function Uses Regs : T0,AR1,SP,M40,SATA,SATD,RDM,FRCT,SMUL                *
    1802              ;*   Stack Frame        : Compact (No Frame Pointer, w/ debug)                 *
    1803              ;*   Total Frame Size   : 2 words                                              *
    1804              ;*                        (1 return address/alignment)                         *
    1805              ;*                        (1 local values)                                     *
    1806              ;*   Min System Stack   : 1 word                                               *
    1807              ;*******************************************************************************
    1808 000524       _IRQ_globalRestore:
    1809                      .dwcfi  cfa_offset, 1
    1810                      .dwcfi  save_reg_to_mem, 91, -1
    1811 000524 4EFF          AADD #-1, SP
    1812                      .dwcfi  cfa_offset, 2
    1813              $C$DW$107       .dwtag  DW_TAG_variable, DW_AT_name("value")
    1814                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_value")
    1815                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$41)
    1816                      .dwattr $C$DW$107, DW_AT_location[DW_OP_bregx 0x24 0]
    1817 000526 C400          MOV T0, *SP(#0) ; |1005| 
    1818                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1006,column 5,is_stmt
    1819 000528 2249          MOV T0, AR1
    1820 00052a 6289          BCC $C$L41,AR1 == #0 ; |1006| 
    1821                                                      ; branchcc occurs ; |1006| 
    1822                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1008,column 9,is_stmt
    1823 00052c 20            NOP                      ;====> CODE AUTO-GENERATED by CSL
    1824                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1012,column 9,is_stmt
    1825 00052d 46B3          BSET INTM                ;====> CODE AUTO-GENERATED by CSL
    1826                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1014,column 5,is_stmt
    1827 00052f 4A03          B $C$L42  ; |1014| 
    1828                                                      ; branch occurs ; |1014| 
    1829 000531       $C$L41:    
    1830                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1018,column 9,is_stmt
    1831 000531 20            NOP                      ;====> CODE AUTO-GENERATED by CSL
    1832                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1022,column 9,is_stmt
    1833 000532 46B2          BCLR INTM                ;====> CODE AUTO-GENERATED by CSL
    1834                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c",line 1025,column 1,is_stmt
    1835 000534       $C$L42:    
    1836 000534 4E01          AADD #1, SP
    1837                      .dwcfi  cfa_offset, 1
    1838              $C$DW$108       .dwtag  DW_TAG_TI_branch
    1839                      .dwattr $C$DW$108, DW_AT_low_pc(0x00)
    1840                      .dwattr $C$DW$108, DW_AT_TI_return
    1841 000536 4804          RET
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   39

    1842                                                      ; return occurs
    1843                      .dwattr $C$DW$105, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_intc.c")
    1844                      .dwattr $C$DW$105, DW_AT_TI_end_line(0x401)
    1845                      .dwattr $C$DW$105, DW_AT_TI_end_column(0x01)
    1846                      .dwendentry
    1847                      .dwendtag $C$DW$105
    1848              
    1849              
    1850              ;*******************************************************************************
    1851              ;* TYPE INFORMATION                                                            *
    1852              ;*******************************************************************************
    1853              
    1854              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1855                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
    1856              $C$DW$109       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    1858                      .dwattr $C$DW$109, DW_AT_name("funcAddr")
    1859                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_funcAddr")
    1860                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1862              $C$DW$110       .dwtag  DW_TAG_member
    1863                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
    1864                      .dwattr $C$DW$110, DW_AT_name("funcArg")
    1865                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_funcArg")
    1866                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1867                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1868              $C$DW$111       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
    1870                      .dwattr $C$DW$111, DW_AT_name("ierMask")
    1871                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ierMask")
    1872                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1873                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1874              $C$DW$112       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$22)
    1876                      .dwattr $C$DW$112, DW_AT_name("cacheCtrl")
    1877                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_cacheCtrl")
    1878                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1879                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1880                      .dwendtag $C$DW$T$23
    1881              
    1882              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IRQ_Dispatch")
    1883                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$23)
    1884                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1885              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1886                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1887                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    1888              
    1889              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1890                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
    1891              $C$DW$113       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
    1893                      .dwattr $C$DW$113, DW_AT_name("funcAddr")
    1894                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_funcAddr")
    1895                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1896                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   40

    1897              $C$DW$114       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
    1899                      .dwattr $C$DW$114, DW_AT_name("funcArg")
    1900                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_funcArg")
    1901                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1902                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$115       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
    1905                      .dwattr $C$DW$115, DW_AT_name("ierMask")
    1906                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_ierMask")
    1907                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1908                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$116       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$22)
    1911                      .dwattr $C$DW$116, DW_AT_name("cacheCtrl")
    1912                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_cacheCtrl")
    1913                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1914                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1915                      .dwendtag $C$DW$T$24
    1916              
    1917              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IRQ_Config")
    1918                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$24)
    1919                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1920              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1921                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1922                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1923              
    1924              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1925                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x84)
    1926              $C$DW$117       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$26)
    1928                      .dwattr $C$DW$117, DW_AT_name("IrqDispatchTable")
    1929                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IrqDispatchTable")
    1930                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1931                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1932              $C$DW$118       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$27)
    1934                      .dwattr $C$DW$118, DW_AT_name("IrqIntTable")
    1935                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_IrqIntTable")
    1936                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1937                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1938              $C$DW$119       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$27)
    1940                      .dwattr $C$DW$119, DW_AT_name("IrqEventTable")
    1941                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_IrqEventTable")
    1942                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1943                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1944              $C$DW$120       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$28)
    1946                      .dwattr $C$DW$120, DW_AT_name("biosPresent")
    1947                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_biosPresent")
    1948                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    1949                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1950                      .dwendtag $C$DW$T$29
    1951              
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   41

    1952              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_IrqDataObj")
    1953                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$29)
    1954                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1955              
    1956              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1957                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x4c)
    1958              $C$DW$121       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$30)
    1960                      .dwattr $C$DW$121, DW_AT_name("IER0")
    1961                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_IER0")
    1962                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1964              $C$DW$122       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$30)
    1966                      .dwattr $C$DW$122, DW_AT_name("IFR0")
    1967                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_IFR0")
    1968                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1969                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1970              $C$DW$123       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$30)
    1972                      .dwattr $C$DW$123, DW_AT_name("ST0_55")
    1973                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ST0_55")
    1974                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1975                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1976              $C$DW$124       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$30)
    1978                      .dwattr $C$DW$124, DW_AT_name("ST1_55")
    1979                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ST1_55")
    1980                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1981                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1982              $C$DW$125       .dwtag  DW_TAG_member
    1983                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$30)
    1984                      .dwattr $C$DW$125, DW_AT_name("ST3_55")
    1985                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_ST3_55")
    1986                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1987                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1988              $C$DW$126       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$31)
    1990                      .dwattr $C$DW$126, DW_AT_name("RSVD0")
    1991                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_RSVD0")
    1992                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1993                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1994              $C$DW$127       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$30)
    1996                      .dwattr $C$DW$127, DW_AT_name("IER1")
    1997                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_IER1")
    1998                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1999                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2000              $C$DW$128       .dwtag  DW_TAG_member
    2001                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$30)
    2002                      .dwattr $C$DW$128, DW_AT_name("IFR1")
    2003                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_IFR1")
    2004                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2005                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2006              $C$DW$129       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   42

    2007                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
    2008                      .dwattr $C$DW$129, DW_AT_name("RSVD1")
    2009                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_RSVD1")
    2010                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2011                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2012              $C$DW$130       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$30)
    2014                      .dwattr $C$DW$130, DW_AT_name("IVPD")
    2015                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IVPD")
    2016                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    2017                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2018              $C$DW$131       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$30)
    2020                      .dwattr $C$DW$131, DW_AT_name("IVPH")
    2021                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_IVPH")
    2022                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2023                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2024              $C$DW$132       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$30)
    2026                      .dwattr $C$DW$132, DW_AT_name("ST2_55")
    2027                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ST2_55")
    2028                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4b]
    2029                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2030                      .dwendtag $C$DW$T$33
    2031              
    2032              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CpuRegs")
    2033                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$33)
    2034                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2035              $C$DW$133       .dwtag  DW_TAG_TI_far_type
    2036                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$37)
    2037              $C$DW$T$38      .dwtag  DW_TAG_volatile_type
    2038                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$133)
    2039              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    2040                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2041                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    2042              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CpuRegsOvly")
    2043                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    2044                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2045              
    2046              $C$DW$T$19      .dwtag  DW_TAG_subroutine_type
    2047                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2048              $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    2049                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    2050                      .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    2051              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("IRQ_IsrPtr")
    2052                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    2053                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    2054              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2055                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2056                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2057                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2058              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2059                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2060                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2061                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 15 12:23:03 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_intc.asm                                                         PAGE   43

    2062              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2063                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2064                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2065                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2066              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2067                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2068                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2069                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2070              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2071                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2072                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2073                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2074              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2075                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$8)
    2076                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2077              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2078                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2079                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2080              $C$DW$T$9       .dwtag  DW_TAG_base_type
