TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE    1

    2653              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Thu Sep 20 01:43:36 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1362                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1363                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1364              
    1365              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    1366                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1367              $C$DW$39        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU68"), DW_AT_const_value(0x00)
    1368              $C$DW$40        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU68"), DW_AT_const_value(0x01)
    1369              $C$DW$41        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_SYNC_MPU80"), DW_AT_const_value(0x02)
    1370              $C$DW$42        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_MPU80"), DW_AT_const_value(0x03)
    1371              $C$DW$43        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_ASYNC_HITACHI"), DW_AT_const_value(0x04)
    1372                      .dwendtag $C$DW$T$32
    1373              
    1374              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddMode")
    1375                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1376                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1377              
    1378              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    1379                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1380              $C$DW$44        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_NOT_USE_CS1"), DW_AT_const_value(0x00)
    1381              $C$DW$45        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_LIDD_USE_CS1"), DW_AT_const_value(0x01)
    1382                      .dwendtag $C$DW$T$38
    1383              
    1384              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcCs1Status")
    1385                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1386                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1387              
    1388              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    1389                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1390              $C$DW$46        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST1"), DW_AT_const_value(0x00)
    1391              $C$DW$47        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST2"), DW_AT_const_value(0x01)
    1392              $C$DW$48        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST4"), DW_AT_const_value(0x02)
    1393              $C$DW$49        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST8"), DW_AT_const_value(0x03)
    1394              $C$DW$50        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_DMA_BURST16"), DW_AT_const_value(0x04)
    1395                      .dwendtag $C$DW$T$41
    1396              
    1397              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcDmaBurst")
    1398                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1399                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1400              
    1401              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    1402                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1403              $C$DW$51        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_DISABLE"), DW_AT_const_value(0x00)
    1404              $C$DW$52        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_EOFINT_ENABLE"), DW_AT_const_value(0x01)
    1405                      .dwendtag $C$DW$T$43
    1406              
    1407              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEofIntCtl")
    1408                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1409                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1410              
    1411              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    1412                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1413              $C$DW$53        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_LITTLE"), DW_AT_const_value(0x00)
    1414              $C$DW$54        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_ENDIANESS_BIG"), DW_AT_const_value(0x01)
    1415                      .dwendtag $C$DW$T$45
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   36

    1416              
    1417              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcEndianess")
    1418                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1419                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1420              
    1421              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    1422                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1423              $C$DW$55        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_SINGLE"), DW_AT_const_value(0x00)
    1424              $C$DW$56        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_LCDC_FBMODE_DOUBLE"), DW_AT_const_value(0x01)
    1425                      .dwendtag $C$DW$T$47
    1426              
    1427              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcFrameMode")
    1428                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1429                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1430              
    1431              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1432                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x52)
    1433              $C$DW$57        .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
    1435                      .dwattr $C$DW$57, DW_AT_name("LCDREVMIN")
    1436                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_LCDREVMIN")
    1437                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1439              $C$DW$58        .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
    1441                      .dwattr $C$DW$58, DW_AT_name("LCDREVMAJ")
    1442                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_LCDREVMAJ")
    1443                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1444                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1445              $C$DW$59        .dwtag  DW_TAG_member
    1446                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
    1447                      .dwattr $C$DW$59, DW_AT_name("RSVD0")
    1448                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_RSVD0")
    1449                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1450                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1451              $C$DW$60        .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
    1453                      .dwattr $C$DW$60, DW_AT_name("LCDCR")
    1454                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_LCDCR")
    1455                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1456                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1457              $C$DW$61        .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$22)
    1459                      .dwattr $C$DW$61, DW_AT_name("RSVD1")
    1460                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_RSVD1")
    1461                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1462                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1463              $C$DW$62        .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
    1465                      .dwattr $C$DW$62, DW_AT_name("LCDSR")
    1466                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_LCDSR")
    1467                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1468                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1469              $C$DW$63        .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   37

    1471                      .dwattr $C$DW$63, DW_AT_name("RSVD2")
    1472                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_RSVD2")
    1473                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1474                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1475              $C$DW$64        .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
    1477                      .dwattr $C$DW$64, DW_AT_name("LCDLIDDCR")
    1478                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_LCDLIDDCR")
    1479                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1480                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1481              $C$DW$65        .dwtag  DW_TAG_member
    1482                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$22)
    1483                      .dwattr $C$DW$65, DW_AT_name("RSVD3")
    1484                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_RSVD3")
    1485                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1486                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1487              $C$DW$66        .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
    1489                      .dwattr $C$DW$66, DW_AT_name("LCDLIDDCS0CONFIG0")
    1490                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG0")
    1491                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1492                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1493              $C$DW$67        .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
    1495                      .dwattr $C$DW$67, DW_AT_name("LCDLIDDCS0CONFIG1")
    1496                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_LCDLIDDCS0CONFIG1")
    1497                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1498                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1499              $C$DW$68        .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
    1501                      .dwattr $C$DW$68, DW_AT_name("RSVD4")
    1502                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_RSVD4")
    1503                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1504                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1505              $C$DW$69        .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$20)
    1507                      .dwattr $C$DW$69, DW_AT_name("LCDLIDDCS0ADDR")
    1508                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_LCDLIDDCS0ADDR")
    1509                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1510                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1511              $C$DW$70        .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
    1513                      .dwattr $C$DW$70, DW_AT_name("RSVD5")
    1514                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_RSVD5")
    1515                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1516                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$71        .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1519                      .dwattr $C$DW$71, DW_AT_name("LCDLIDDCS0DATA")
    1520                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_LCDLIDDCS0DATA")
    1521                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1522                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1523              $C$DW$72        .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
    1525                      .dwattr $C$DW$72, DW_AT_name("RSVD6")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   38

    1526                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_RSVD6")
    1527                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1528                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1529              $C$DW$73        .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
    1531                      .dwattr $C$DW$73, DW_AT_name("LCDLIDDCS1CONFIG0")
    1532                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG0")
    1533                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1534                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1535              $C$DW$74        .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
    1537                      .dwattr $C$DW$74, DW_AT_name("LCDLIDDCS1CONFIG1")
    1538                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_LCDLIDDCS1CONFIG1")
    1539                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1540                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1541              $C$DW$75        .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
    1543                      .dwattr $C$DW$75, DW_AT_name("RSVD7")
    1544                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_RSVD7")
    1545                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1546                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1547              $C$DW$76        .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1549                      .dwattr $C$DW$76, DW_AT_name("LCDLIDDCS1ADDR")
    1550                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_LCDLIDDCS1ADDR")
    1551                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1552                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1553              $C$DW$77        .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
    1555                      .dwattr $C$DW$77, DW_AT_name("RSVD8")
    1556                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_RSVD8")
    1557                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1558                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$78        .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1561                      .dwattr $C$DW$78, DW_AT_name("LCDLIDDCS1DATA")
    1562                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_LCDLIDDCS1DATA")
    1563                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1564                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1565              $C$DW$79        .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$23)
    1567                      .dwattr $C$DW$79, DW_AT_name("RSVD9")
    1568                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_RSVD9")
    1569                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1570                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1571              $C$DW$80        .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    1573                      .dwattr $C$DW$80, DW_AT_name("LCDDMACR")
    1574                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_LCDDMACR")
    1575                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1576                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1577              $C$DW$81        .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
    1579                      .dwattr $C$DW$81, DW_AT_name("RSVD10")
    1580                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_RSVD10")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   39

    1581                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1582                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1583              $C$DW$82        .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    1585                      .dwattr $C$DW$82, DW_AT_name("LCDDMAFB0BAR0")
    1586                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_LCDDMAFB0BAR0")
    1587                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1588                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1589              $C$DW$83        .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1591                      .dwattr $C$DW$83, DW_AT_name("LCDDMAFB0BAR1")
    1592                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_LCDDMAFB0BAR1")
    1593                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1594                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1595              $C$DW$84        .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1597                      .dwattr $C$DW$84, DW_AT_name("RSVD11")
    1598                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_RSVD11")
    1599                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1600                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$85        .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1603                      .dwattr $C$DW$85, DW_AT_name("LCDDMAFB0CAR0")
    1604                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_LCDDMAFB0CAR0")
    1605                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1606                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1607              $C$DW$86        .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    1609                      .dwattr $C$DW$86, DW_AT_name("LCDDMAFB0CAR1")
    1610                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_LCDDMAFB0CAR1")
    1611                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    1612                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1613              $C$DW$87        .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
    1615                      .dwattr $C$DW$87, DW_AT_name("RSVD12")
    1616                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_RSVD12")
    1617                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1618                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1619              $C$DW$88        .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    1621                      .dwattr $C$DW$88, DW_AT_name("LCDDMAFB1BAR0")
    1622                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_LCDDMAFB1BAR0")
    1623                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1624                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1625              $C$DW$89        .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    1627                      .dwattr $C$DW$89, DW_AT_name("LCDDMAFB1BAR1")
    1628                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_LCDDMAFB1BAR1")
    1629                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    1630                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1631              $C$DW$90        .dwtag  DW_TAG_member
    1632                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1633                      .dwattr $C$DW$90, DW_AT_name("RSVD13")
    1634                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_RSVD13")
    1635                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   40

    1636                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1637              $C$DW$91        .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    1639                      .dwattr $C$DW$91, DW_AT_name("LCDDMAFB1CAR0")
    1640                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_LCDDMAFB1CAR0")
    1641                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1642                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1643              $C$DW$92        .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    1645                      .dwattr $C$DW$92, DW_AT_name("LCDDMAFB1CAR1")
    1646                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_LCDDMAFB1CAR1")
    1647                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    1648                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1649                      .dwendtag $C$DW$T$24
    1650              
    1651              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegs")
    1652                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$24)
    1653                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1654              $C$DW$93        .dwtag  DW_TAG_TI_far_type
    1655                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$54)
    1656              $C$DW$94        .dwtag  DW_TAG_TI_ioport_type
    1657                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$93)
    1658              $C$DW$T$55      .dwtag  DW_TAG_volatile_type
    1659                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$94)
    1660              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    1661                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    1662                      .dwattr $C$DW$T$56, DW_AT_address_class(0x10)
    1663              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcRegsOvly")
    1664                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1665                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1666              
    1667              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1668                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    1669              $C$DW$95        .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1671                      .dwattr $C$DW$95, DW_AT_name("clkDiv")
    1672                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_clkDiv")
    1673                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1674                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1675              $C$DW$96        .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$26)
    1677                      .dwattr $C$DW$96, DW_AT_name("fdoneIntEn")
    1678                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_fdoneIntEn")
    1679                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1680                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1681              $C$DW$97        .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$28)
    1683                      .dwattr $C$DW$97, DW_AT_name("dmaCs0Cs1")
    1684                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_dmaCs0Cs1")
    1685                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1686                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1687              $C$DW$98        .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$30)
    1689                      .dwattr $C$DW$98, DW_AT_name("dmaEnable")
    1690                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_dmaEnable")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   41

    1691                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1692                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$99        .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$31)
    1695                      .dwattr $C$DW$99, DW_AT_name("polControl")
    1696                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_polControl")
    1697                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1698                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1699              $C$DW$100       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$33)
    1701                      .dwattr $C$DW$100, DW_AT_name("modeSel")
    1702                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_modeSel")
    1703                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1704                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1705                      .dwendtag $C$DW$T$34
    1706              
    1707              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigLidd")
    1708                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$34)
    1709                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1710              
    1711              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1712                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x07)
    1713              $C$DW$101       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1715                      .dwattr $C$DW$101, DW_AT_name("wSu")
    1716                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_wSu")
    1717                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1718                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1719              $C$DW$102       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1721                      .dwattr $C$DW$102, DW_AT_name("wStrobe")
    1722                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_wStrobe")
    1723                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1724                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1725              $C$DW$103       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$103, DW_AT_name("wHold")
    1728                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_wHold")
    1729                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1730                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1731              $C$DW$104       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1733                      .dwattr $C$DW$104, DW_AT_name("rSu")
    1734                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rSu")
    1735                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1736                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$105       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1739                      .dwattr $C$DW$105, DW_AT_name("rStrobe")
    1740                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rStrobe")
    1741                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1742                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1743              $C$DW$106       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$106, DW_AT_name("rHold")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   42

    1746                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rHold")
    1747                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1748                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1749              $C$DW$107       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1751                      .dwattr $C$DW$107, DW_AT_name("ta")
    1752                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ta")
    1753                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1754                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1755                      .dwendtag $C$DW$T$35
    1756              
    1757              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcLiddTiming")
    1758                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$35)
    1759                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1760              
    1761              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1762                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
    1763              $C$DW$108       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$3)
    1765                      .dwattr $C$DW$108, DW_AT_name("extendSetup")
    1766                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_extendSetup")
    1767                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1769              $C$DW$109       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$36)
    1771                      .dwattr $C$DW$109, DW_AT_name("config")
    1772                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_config")
    1773                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1774                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1775              $C$DW$110       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$37)
    1777                      .dwattr $C$DW$110, DW_AT_name("timingCs0")
    1778                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_timingCs0")
    1779                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1780                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1781              $C$DW$111       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$39)
    1783                      .dwattr $C$DW$111, DW_AT_name("useCs1")
    1784                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_useCs1")
    1785                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1786                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1787              $C$DW$112       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$37)
    1789                      .dwattr $C$DW$112, DW_AT_name("timingCs1")
    1790                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_timingCs1")
    1791                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1792                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1793                      .dwendtag $C$DW$T$40
    1794              
    1795              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHwSetup")
    1796                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$40)
    1797                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1798              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    1799                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    1800                      .dwattr $C$DW$T$62, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   43

    1801              
    1802              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1803                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0c)
    1804              $C$DW$113       .dwtag  DW_TAG_member
    1805                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$42)
    1806                      .dwattr $C$DW$113, DW_AT_name("burstSize")
    1807                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_burstSize")
    1808                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1809                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1810              $C$DW$114       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$44)
    1812                      .dwattr $C$DW$114, DW_AT_name("eofIntEn")
    1813                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_eofIntEn")
    1814                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1815                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1816              $C$DW$115       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$46)
    1818                      .dwattr $C$DW$115, DW_AT_name("bigEndian")
    1819                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bigEndian")
    1820                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1821                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1822              $C$DW$116       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$48)
    1824                      .dwattr $C$DW$116, DW_AT_name("frameMode")
    1825                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_frameMode")
    1826                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1827                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$117       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$49)
    1830                      .dwattr $C$DW$117, DW_AT_name("fb0Base")
    1831                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_fb0Base")
    1832                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1833                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1834              $C$DW$118       .dwtag  DW_TAG_member
    1835                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$49)
    1836                      .dwattr $C$DW$118, DW_AT_name("fb0Ceil")
    1837                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_fb0Ceil")
    1838                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1839                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1840              $C$DW$119       .dwtag  DW_TAG_member
    1841                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$49)
    1842                      .dwattr $C$DW$119, DW_AT_name("fb1Base")
    1843                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_fb1Base")
    1844                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1845                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1846              $C$DW$120       .dwtag  DW_TAG_member
    1847                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$49)
    1848                      .dwattr $C$DW$120, DW_AT_name("fb1Ceil")
    1849                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_fb1Ceil")
    1850                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1851                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1852                      .dwendtag $C$DW$T$50
    1853              
    1854              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcConfigDma")
    1855                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$50)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   44

    1856                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1857              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
    1858                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1859                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
    1860              
    1861              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    1862                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x48)
    1863              $C$DW$121       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    1865                      .dwattr $C$DW$121, DW_AT_name("EBSR")
    1866                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_EBSR")
    1867                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1868                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1869              $C$DW$122       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    1871                      .dwattr $C$DW$122, DW_AT_name("RSVD0")
    1872                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_RSVD0")
    1873                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1874                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$123       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    1877                      .dwattr $C$DW$123, DW_AT_name("PCGCR1")
    1878                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PCGCR1")
    1879                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1880                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$124       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    1883                      .dwattr $C$DW$124, DW_AT_name("PCGCR2")
    1884                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_PCGCR2")
    1885                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1886                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1887              $C$DW$125       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1889                      .dwattr $C$DW$125, DW_AT_name("PSRCR")
    1890                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PSRCR")
    1891                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1892                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1893              $C$DW$126       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1895                      .dwattr $C$DW$126, DW_AT_name("PRCR")
    1896                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PRCR")
    1897                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1898                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1899              $C$DW$127       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$51)
    1901                      .dwattr $C$DW$127, DW_AT_name("RSVD1")
    1902                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_RSVD1")
    1903                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1904                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1905              $C$DW$128       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1907                      .dwattr $C$DW$128, DW_AT_name("TIAFR")
    1908                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_TIAFR")
    1909                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1910                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   45

    1911              $C$DW$129       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    1913                      .dwattr $C$DW$129, DW_AT_name("RSVD2")
    1914                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_RSVD2")
    1915                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1916                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$130       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1919                      .dwattr $C$DW$130, DW_AT_name("ODSCR")
    1920                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ODSCR")
    1921                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1922                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$131       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    1925                      .dwattr $C$DW$131, DW_AT_name("PDINHIBR1")
    1926                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PDINHIBR1")
    1927                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1928                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$132       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1931                      .dwattr $C$DW$132, DW_AT_name("PDINHIBR2")
    1932                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_PDINHIBR2")
    1933                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1934                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1935              $C$DW$133       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1937                      .dwattr $C$DW$133, DW_AT_name("PDINHIBR3")
    1938                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PDINHIBR3")
    1939                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1940                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1941              $C$DW$134       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1943                      .dwattr $C$DW$134, DW_AT_name("DMA0CESR1")
    1944                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_DMA0CESR1")
    1945                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1946                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1947              $C$DW$135       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1949                      .dwattr $C$DW$135, DW_AT_name("DMA0CESR2")
    1950                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_DMA0CESR2")
    1951                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1952                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$136       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    1955                      .dwattr $C$DW$136, DW_AT_name("DMA1CESR1")
    1956                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_DMA1CESR1")
    1957                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1958                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1959              $C$DW$137       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1961                      .dwattr $C$DW$137, DW_AT_name("DMA1CESR2")
    1962                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_DMA1CESR2")
    1963                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1964                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1965              $C$DW$138       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   46

    1966                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1967                      .dwattr $C$DW$138, DW_AT_name("SDRAMCCR")
    1968                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_SDRAMCCR")
    1969                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1970                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$139       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1973                      .dwattr $C$DW$139, DW_AT_name("CCR2")
    1974                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_CCR2")
    1975                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1976                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1977              $C$DW$140       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1979                      .dwattr $C$DW$140, DW_AT_name("CGCR1")
    1980                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_CGCR1")
    1981                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1982                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$141       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1985                      .dwattr $C$DW$141, DW_AT_name("CGICR")
    1986                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_CGICR")
    1987                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1988                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1989              $C$DW$142       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1991                      .dwattr $C$DW$142, DW_AT_name("CGCR2")
    1992                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CGCR2")
    1993                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1994                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1995              $C$DW$143       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1997                      .dwattr $C$DW$143, DW_AT_name("CGOCR")
    1998                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CGOCR")
    1999                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2000                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2001              $C$DW$144       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    2003                      .dwattr $C$DW$144, DW_AT_name("CCSSR")
    2004                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_CCSSR")
    2005                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2006                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2007              $C$DW$145       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    2009                      .dwattr $C$DW$145, DW_AT_name("RSVD3")
    2010                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_RSVD3")
    2011                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2012                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$146       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    2015                      .dwattr $C$DW$146, DW_AT_name("ECDR")
    2016                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ECDR")
    2017                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2018                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2019              $C$DW$147       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   47

    2021                      .dwattr $C$DW$147, DW_AT_name("RSVD4")
    2022                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_RSVD4")
    2023                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2024                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2025              $C$DW$148       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    2027                      .dwattr $C$DW$148, DW_AT_name("RAMSLPMDCNTLR1")
    2028                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2029                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2030                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2031              $C$DW$149       .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    2033                      .dwattr $C$DW$149, DW_AT_name("RSVD5")
    2034                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_RSVD5")
    2035                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2036                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2037              $C$DW$150       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    2039                      .dwattr $C$DW$150, DW_AT_name("RAMSLPMDCNTLR2")
    2040                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2041                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2042                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2043              $C$DW$151       .dwtag  DW_TAG_member
    2044                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    2045                      .dwattr $C$DW$151, DW_AT_name("RAMSLPMDCNTLR3")
    2046                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2047                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2048                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2049              $C$DW$152       .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    2051                      .dwattr $C$DW$152, DW_AT_name("RAMSLPMDCNTLR4")
    2052                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2053                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2054                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2055              $C$DW$153       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    2057                      .dwattr $C$DW$153, DW_AT_name("RAMSLPMDCNTLR5")
    2058                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2059                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2060                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2061              $C$DW$154       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$21)
    2063                      .dwattr $C$DW$154, DW_AT_name("RSVD6")
    2064                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_RSVD6")
    2065                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2066                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2067              $C$DW$155       .dwtag  DW_TAG_member
    2068                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    2069                      .dwattr $C$DW$155, DW_AT_name("DMAIFR")
    2070                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DMAIFR")
    2071                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2072                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2073              $C$DW$156       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    2075                      .dwattr $C$DW$156, DW_AT_name("DMAIER")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   48

    2076                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_DMAIER")
    2077                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2078                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2079              $C$DW$157       .dwtag  DW_TAG_member
    2080                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    2081                      .dwattr $C$DW$157, DW_AT_name("USBSCR")
    2082                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_USBSCR")
    2083                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2084                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2085              $C$DW$158       .dwtag  DW_TAG_member
    2086                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    2087                      .dwattr $C$DW$158, DW_AT_name("ESCR")
    2088                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ESCR")
    2089                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2090                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2091              $C$DW$159       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    2093                      .dwattr $C$DW$159, DW_AT_name("RSVD7")
    2094                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_RSVD7")
    2095                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2096                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2097              $C$DW$160       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2099                      .dwattr $C$DW$160, DW_AT_name("DMA2CESR1")
    2100                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_DMA2CESR1")
    2101                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2102                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2103              $C$DW$161       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2105                      .dwattr $C$DW$161, DW_AT_name("DMA2CESR2")
    2106                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_DMA2CESR2")
    2107                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2108                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2109              $C$DW$162       .dwtag  DW_TAG_member
    2110                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2111                      .dwattr $C$DW$162, DW_AT_name("DMA3CESR1")
    2112                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_DMA3CESR1")
    2113                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2114                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2115              $C$DW$163       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2117                      .dwattr $C$DW$163, DW_AT_name("DMA3CESR2")
    2118                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_DMA3CESR2")
    2119                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2120                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2121              $C$DW$164       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2123                      .dwattr $C$DW$164, DW_AT_name("CLKSTOP")
    2124                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_CLKSTOP")
    2125                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2126                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2127              $C$DW$165       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$52)
    2129                      .dwattr $C$DW$165, DW_AT_name("RSVD8")
    2130                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RSVD8")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   49

    2131                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2132                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2133              $C$DW$166       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2135                      .dwattr $C$DW$166, DW_AT_name("DIEIDR0")
    2136                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_DIEIDR0")
    2137                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2138                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2139              $C$DW$167       .dwtag  DW_TAG_member
    2140                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2141                      .dwattr $C$DW$167, DW_AT_name("DIEIDR1")
    2142                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_DIEIDR1")
    2143                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2144                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2145              $C$DW$168       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    2147                      .dwattr $C$DW$168, DW_AT_name("DIEIDR2")
    2148                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_DIEIDR2")
    2149                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2150                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2151              $C$DW$169       .dwtag  DW_TAG_member
    2152                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    2153                      .dwattr $C$DW$169, DW_AT_name("DIEIDR3")
    2154                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_DIEIDR3")
    2155                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2156                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2157              $C$DW$170       .dwtag  DW_TAG_member
    2158                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    2159                      .dwattr $C$DW$170, DW_AT_name("DIEIDR4")
    2160                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_DIEIDR4")
    2161                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2162                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2163              $C$DW$171       .dwtag  DW_TAG_member
    2164                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    2165                      .dwattr $C$DW$171, DW_AT_name("DIEIDR5")
    2166                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_DIEIDR5")
    2167                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2168                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2169              $C$DW$172       .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2171                      .dwattr $C$DW$172, DW_AT_name("DIEIDR6")
    2172                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_DIEIDR6")
    2173                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2174                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2175              $C$DW$173       .dwtag  DW_TAG_member
    2176                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    2177                      .dwattr $C$DW$173, DW_AT_name("DIEIDR7")
    2178                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_DIEIDR7")
    2179                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2180                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2181                      .dwendtag $C$DW$T$53
    2182              
    2183              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2184                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$53)
    2185                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   50

    2186              $C$DW$174       .dwtag  DW_TAG_TI_far_type
    2187                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$65)
    2188              $C$DW$175       .dwtag  DW_TAG_TI_ioport_type
    2189                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$174)
    2190              $C$DW$T$66      .dwtag  DW_TAG_volatile_type
    2191                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$175)
    2192              $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    2193                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2194                      .dwattr $C$DW$T$67, DW_AT_address_class(0x10)
    2195              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2196                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2197                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2198              
    2199              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    2200                      .dwattr $C$DW$T$60, DW_AT_name("CSL_LcdcObj")
    2201                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
    2202              $C$DW$176       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$57)
    2204                      .dwattr $C$DW$176, DW_AT_name("regs")
    2205                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_regs")
    2206                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2208              $C$DW$177       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$59)
    2210                      .dwattr $C$DW$177, DW_AT_name("perNum")
    2211                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_perNum")
    2212                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2213                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2214                      .dwendtag $C$DW$T$60
    2215              
    2216              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcObj")
    2217                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$60)
    2218                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2219              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    2220                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2221                      .dwattr $C$DW$T$70, DW_AT_address_class(0x17)
    2222              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_LcdcHandle")
    2223                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2224                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2225              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2226                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    2227              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2228                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2229                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2230                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2231              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2232                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2233                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2234                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2235              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2236                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2237                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2238                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2239              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2240                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:37 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_lcdc.asm                                                         PAGE   51

    2241                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2242                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2243              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2244                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2245                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2246                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2247              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2248                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$8)
    2249                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2250              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_InstNum")
    2251                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2252                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2253              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2254                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$58)
    2255                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2256              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    2257                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2258                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    2259              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2260                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2261                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2262                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2263              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
