TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE    1

   10731              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 22 03:36:56 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    7500                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$92)
    7501                      .dwattr $C$DW$T$129, DW_AT_address_class(0x17)
    7502              
    7503              $C$DW$T$93      .dwtag  DW_TAG_enumeration_type
    7504                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x01)
    7505              $C$DW$405       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_IDLE"), DW_AT_const_value(0x00)
    7506              $C$DW$406       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_STATUS_IN"), DW_AT_const_value(0x01)
    7507              $C$DW$407       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_TX"), DW_AT_const_value(0x02)
    7508              $C$DW$408       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_RX"), DW_AT_const_value(0x03)
    7509                      .dwendtag $C$DW$T$93
    7510              
    7511              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEp0State")
    7512                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    7513                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    7514              
    7515              $C$DW$T$95      .dwtag  DW_TAG_enumeration_type
    7516                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
    7517              $C$DW$409       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
    7518              $C$DW$410       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
    7519                      .dwendtag $C$DW$T$95
    7520              
    7521              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
    7522                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    7523                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    7524              
    7525              $C$DW$T$107     .dwtag  DW_TAG_enumeration_type
    7526                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  180

    7527              $C$DW$411       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
    7528              $C$DW$412       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    7529              $C$DW$413       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    7530              $C$DW$414       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    7531              $C$DW$415       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    7532              $C$DW$416       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    7533              $C$DW$417       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    7534              $C$DW$418       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    7535              $C$DW$419       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    7536              $C$DW$420       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    7537              $C$DW$421       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    7538              $C$DW$422       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    7539              $C$DW$423       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    7540              $C$DW$424       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    7541              $C$DW$425       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    7542              $C$DW$426       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    7543                      .dwendtag $C$DW$T$107
    7544              
    7545              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    7546                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    7547                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    7548              
    7549              $C$DW$T$109     .dwtag  DW_TAG_enumeration_type
    7550                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    7551              $C$DW$427       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    7552              $C$DW$428       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    7553              $C$DW$429       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    7554              $C$DW$430       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    7555              $C$DW$431       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    7556                      .dwendtag $C$DW$T$109
    7557              
    7558              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    7559                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    7560                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    7561              
    7562              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7563                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    7564              $C$DW$432       .dwtag  DW_TAG_member
    7565                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    7566                      .dwattr $C$DW$432, DW_AT_name("TXFUNCADDR")
    7567                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_TXFUNCADDR")
    7568                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7569                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    7570              $C$DW$433       .dwtag  DW_TAG_member
    7571                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    7572                      .dwattr $C$DW$433, DW_AT_name("TXHUBADDR_TXHUBPORT")
    7573                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_TXHUBADDR_TXHUBPORT")
    7574                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7575                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    7576              $C$DW$434       .dwtag  DW_TAG_member
    7577                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    7578                      .dwattr $C$DW$434, DW_AT_name("RSVD0")
    7579                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_RSVD0")
    7580                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7581                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  181

    7582              $C$DW$435       .dwtag  DW_TAG_member
    7583                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    7584                      .dwattr $C$DW$435, DW_AT_name("RXFUNCADDR")
    7585                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_RXFUNCADDR")
    7586                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7587                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    7588              $C$DW$436       .dwtag  DW_TAG_member
    7589                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    7590                      .dwattr $C$DW$436, DW_AT_name("RXHUBADDR_RXHUBPORT")
    7591                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_RXHUBADDR_RXHUBPORT")
    7592                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7593                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    7594              $C$DW$437       .dwtag  DW_TAG_member
    7595                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    7596                      .dwattr $C$DW$437, DW_AT_name("RSVD36")
    7597                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_RSVD36")
    7598                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7599                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    7600                      .dwendtag $C$DW$T$22
    7601              
    7602              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEptrgRegs")
    7603                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$22)
    7604                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    7605              
    7606              $C$DW$T$40      .dwtag  DW_TAG_array_type
    7607                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    7608                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    7609                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x28)
    7610              $C$DW$438       .dwtag  DW_TAG_subrange_type
    7611                      .dwattr $C$DW$438, DW_AT_upper_bound(0x04)
    7612                      .dwendtag $C$DW$T$40
    7613              
    7614              
    7615              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    7616                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    7617              $C$DW$439       .dwtag  DW_TAG_member
    7618                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    7619                      .dwattr $C$DW$439, DW_AT_name("TXMAXP")
    7620                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_TXMAXP")
    7621                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7622                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    7623              $C$DW$440       .dwtag  DW_TAG_member
    7624                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    7625                      .dwattr $C$DW$440, DW_AT_name("PERI_TXCSR")
    7626                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_PERI_TXCSR")
    7627                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7628                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    7629              $C$DW$441       .dwtag  DW_TAG_member
    7630                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$21)
    7631                      .dwattr $C$DW$441, DW_AT_name("RSVD0")
    7632                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_RSVD0")
    7633                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7634                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    7635              $C$DW$442       .dwtag  DW_TAG_member
    7636                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  182

    7637                      .dwattr $C$DW$442, DW_AT_name("RXMAXP")
    7638                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_RXMAXP")
    7639                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7640                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    7641              $C$DW$443       .dwtag  DW_TAG_member
    7642                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
    7643                      .dwattr $C$DW$443, DW_AT_name("PERI_RXCSR")
    7644                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_PERI_RXCSR")
    7645                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7646                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    7647              $C$DW$444       .dwtag  DW_TAG_member
    7648                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$21)
    7649                      .dwattr $C$DW$444, DW_AT_name("RSVD1")
    7650                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD1")
    7651                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7652                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    7653              $C$DW$445       .dwtag  DW_TAG_member
    7654                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
    7655                      .dwattr $C$DW$445, DW_AT_name("RXCOUNT")
    7656                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_RXCOUNT")
    7657                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7658                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    7659              $C$DW$446       .dwtag  DW_TAG_member
    7660                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$23)
    7661                      .dwattr $C$DW$446, DW_AT_name("RSVD41")
    7662                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_RSVD41")
    7663                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7664                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    7665                      .dwendtag $C$DW$T$24
    7666              
    7667              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpcsrRegs")
    7668                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$24)
    7669                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    7670              
    7671              $C$DW$T$43      .dwtag  DW_TAG_array_type
    7672                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    7673                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    7674                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x40)
    7675              $C$DW$447       .dwtag  DW_TAG_subrange_type
    7676                      .dwattr $C$DW$447, DW_AT_upper_bound(0x03)
    7677                      .dwendtag $C$DW$T$43
    7678              
    7679              
    7680              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7681                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
    7682              $C$DW$448       .dwtag  DW_TAG_member
    7683                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    7684                      .dwattr $C$DW$448, DW_AT_name("TXGCR1")
    7685                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_TXGCR1")
    7686                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7687                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    7688              $C$DW$449       .dwtag  DW_TAG_member
    7689                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    7690                      .dwattr $C$DW$449, DW_AT_name("TXGCR2")
    7691                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_TXGCR2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  183

    7692                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7693                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    7694              $C$DW$450       .dwtag  DW_TAG_member
    7695                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$25)
    7696                      .dwattr $C$DW$450, DW_AT_name("RSVD0")
    7697                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_RSVD0")
    7698                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7699                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    7700              $C$DW$451       .dwtag  DW_TAG_member
    7701                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    7702                      .dwattr $C$DW$451, DW_AT_name("RXGCR1")
    7703                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_RXGCR1")
    7704                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7705                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    7706              $C$DW$452       .dwtag  DW_TAG_member
    7707                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    7708                      .dwattr $C$DW$452, DW_AT_name("RXGCR2")
    7709                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_RXGCR2")
    7710                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7711                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    7712              $C$DW$453       .dwtag  DW_TAG_member
    7713                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$21)
    7714                      .dwattr $C$DW$453, DW_AT_name("RSVD1")
    7715                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD1")
    7716                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7717                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    7718              $C$DW$454       .dwtag  DW_TAG_member
    7719                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    7720                      .dwattr $C$DW$454, DW_AT_name("RXHPCR1A")
    7721                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_RXHPCR1A")
    7722                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7723                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    7724              $C$DW$455       .dwtag  DW_TAG_member
    7725                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    7726                      .dwattr $C$DW$455, DW_AT_name("RXHPCR2A")
    7727                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_RXHPCR2A")
    7728                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7729                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    7730              $C$DW$456       .dwtag  DW_TAG_member
    7731                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$21)
    7732                      .dwattr $C$DW$456, DW_AT_name("RSVD2")
    7733                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_RSVD2")
    7734                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7735                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    7736              $C$DW$457       .dwtag  DW_TAG_member
    7737                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    7738                      .dwattr $C$DW$457, DW_AT_name("RXHPCR1B")
    7739                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_RXHPCR1B")
    7740                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7741                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    7742              $C$DW$458       .dwtag  DW_TAG_member
    7743                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    7744                      .dwattr $C$DW$458, DW_AT_name("RXHPCR2B")
    7745                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_RXHPCR2B")
    7746                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  184

    7747                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    7748              $C$DW$459       .dwtag  DW_TAG_member
    7749                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$26)
    7750                      .dwattr $C$DW$459, DW_AT_name("RSVD46")
    7751                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_RSVD46")
    7752                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7753                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    7754                      .dwendtag $C$DW$T$27
    7755              
    7756              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbChannelRegs")
    7757                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$27)
    7758                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    7759              
    7760              $C$DW$T$47      .dwtag  DW_TAG_array_type
    7761                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    7762                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7763                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x80)
    7764              $C$DW$460       .dwtag  DW_TAG_subrange_type
    7765                      .dwattr $C$DW$460, DW_AT_upper_bound(0x03)
    7766                      .dwendtag $C$DW$T$47
    7767              
    7768              
    7769              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7770                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    7771              $C$DW$461       .dwtag  DW_TAG_member
    7772                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    7773                      .dwattr $C$DW$461, DW_AT_name("ENTRYLSW")
    7774                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_ENTRYLSW")
    7775                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7776                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    7777              $C$DW$462       .dwtag  DW_TAG_member
    7778                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    7779                      .dwattr $C$DW$462, DW_AT_name("ENTRYMSW")
    7780                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_ENTRYMSW")
    7781                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7782                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7783              $C$DW$463       .dwtag  DW_TAG_member
    7784                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$21)
    7785                      .dwattr $C$DW$463, DW_AT_name("RSVD49")
    7786                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_RSVD49")
    7787                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7788                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7789                      .dwendtag $C$DW$T$28
    7790              
    7791              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbCdmaschetblwordRegs")
    7792                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$28)
    7793                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    7794              
    7795              $C$DW$T$51      .dwtag  DW_TAG_array_type
    7796                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    7797                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    7798                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
    7799              $C$DW$464       .dwtag  DW_TAG_subrange_type
    7800                      .dwattr $C$DW$464, DW_AT_upper_bound(0x3f)
    7801                      .dwendtag $C$DW$T$51
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  185

    7802              
    7803              
    7804              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7805                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    7806              $C$DW$465       .dwtag  DW_TAG_member
    7807                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    7808                      .dwattr $C$DW$465, DW_AT_name("QMEMRBASE1")
    7809                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_QMEMRBASE1")
    7810                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7811                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7812              $C$DW$466       .dwtag  DW_TAG_member
    7813                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$20)
    7814                      .dwattr $C$DW$466, DW_AT_name("QMEMRBASE2")
    7815                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_QMEMRBASE2")
    7816                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7817                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    7818              $C$DW$467       .dwtag  DW_TAG_member
    7819                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$21)
    7820                      .dwattr $C$DW$467, DW_AT_name("RSVD0")
    7821                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_RSVD0")
    7822                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7823                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7824              $C$DW$468       .dwtag  DW_TAG_member
    7825                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    7826                      .dwattr $C$DW$468, DW_AT_name("QMEMRCTRL1")
    7827                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_QMEMRCTRL1")
    7828                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7829                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    7830              $C$DW$469       .dwtag  DW_TAG_member
    7831                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$20)
    7832                      .dwattr $C$DW$469, DW_AT_name("QMEMRCTRL2")
    7833                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_QMEMRCTRL2")
    7834                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7835                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7836              $C$DW$470       .dwtag  DW_TAG_member
    7837                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$29)
    7838                      .dwattr $C$DW$470, DW_AT_name("RSVD63")
    7839                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_RSVD63")
    7840                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7841                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7842                      .dwendtag $C$DW$T$30
    7843              
    7844              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmmemregrRegs")
    7845                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$30)
    7846                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    7847              
    7848              $C$DW$T$57      .dwtag  DW_TAG_array_type
    7849                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    7850                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    7851                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x100)
    7852              $C$DW$471       .dwtag  DW_TAG_subrange_type
    7853                      .dwattr $C$DW$471, DW_AT_upper_bound(0x0f)
    7854                      .dwendtag $C$DW$T$57
    7855              
    7856              
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  186

    7857              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    7858                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    7859              $C$DW$472       .dwtag  DW_TAG_member
    7860                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$31)
    7861                      .dwattr $C$DW$472, DW_AT_name("RSVD0")
    7862                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_RSVD0")
    7863                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7864                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7865              $C$DW$473       .dwtag  DW_TAG_member
    7866                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    7867                      .dwattr $C$DW$473, DW_AT_name("CTRL1D")
    7868                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_CTRL1D")
    7869                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7870                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7871              $C$DW$474       .dwtag  DW_TAG_member
    7872                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    7873                      .dwattr $C$DW$474, DW_AT_name("CTRL2D")
    7874                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_CTRL2D")
    7875                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7876                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7877              $C$DW$475       .dwtag  DW_TAG_member
    7878                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$21)
    7879                      .dwattr $C$DW$475, DW_AT_name("RSVD65")
    7880                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_RSVD65")
    7881                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7882                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7883                      .dwendtag $C$DW$T$32
    7884              
    7885              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnRegs")
    7886                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
    7887                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    7888              
    7889              $C$DW$T$60      .dwtag  DW_TAG_array_type
    7890                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    7891                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    7892                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x400)
    7893              $C$DW$476       .dwtag  DW_TAG_subrange_type
    7894                      .dwattr $C$DW$476, DW_AT_upper_bound(0x3f)
    7895                      .dwendtag $C$DW$T$60
    7896              
    7897              
    7898              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7899                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    7900              $C$DW$477       .dwtag  DW_TAG_member
    7901                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    7902                      .dwattr $C$DW$477, DW_AT_name("QSTATA")
    7903                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_QSTATA")
    7904                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7905                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7906              $C$DW$478       .dwtag  DW_TAG_member
    7907                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$33)
    7908                      .dwattr $C$DW$478, DW_AT_name("RSVD0")
    7909                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_RSVD0")
    7910                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7911                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  187

    7912              $C$DW$479       .dwtag  DW_TAG_member
    7913                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    7914                      .dwattr $C$DW$479, DW_AT_name("QSTAT1B")
    7915                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_QSTAT1B")
    7916                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7917                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7918              $C$DW$480       .dwtag  DW_TAG_member
    7919                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    7920                      .dwattr $C$DW$480, DW_AT_name("QSTAT2B")
    7921                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_QSTAT2B")
    7922                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7923                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7924              $C$DW$481       .dwtag  DW_TAG_member
    7925                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$21)
    7926                      .dwattr $C$DW$481, DW_AT_name("RSVD1")
    7927                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_RSVD1")
    7928                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7929                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7930              $C$DW$482       .dwtag  DW_TAG_member
    7931                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    7932                      .dwattr $C$DW$482, DW_AT_name("QSTAT1C")
    7933                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_QSTAT1C")
    7934                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7935                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7936              $C$DW$483       .dwtag  DW_TAG_member
    7937                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$23)
    7938                      .dwattr $C$DW$483, DW_AT_name("RSVD67")
    7939                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_RSVD67")
    7940                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7941                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7942                      .dwendtag $C$DW$T$34
    7943              
    7944              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnsRegs")
    7945                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$34)
    7946                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    7947              
    7948              $C$DW$T$63      .dwtag  DW_TAG_array_type
    7949                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    7950                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    7951                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x400)
    7952              $C$DW$484       .dwtag  DW_TAG_subrange_type
    7953                      .dwattr $C$DW$484, DW_AT_upper_bound(0x3f)
    7954                      .dwendtag $C$DW$T$63
    7955              
    7956              
    7957              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7958                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x6c00)
    7959              $C$DW$485       .dwtag  DW_TAG_member
    7960                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    7961                      .dwattr $C$DW$485, DW_AT_name("REVID1")
    7962                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_REVID1")
    7963                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7964                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7965              $C$DW$486       .dwtag  DW_TAG_member
    7966                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  188

    7967                      .dwattr $C$DW$486, DW_AT_name("REVID2")
    7968                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_REVID2")
    7969                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7970                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7971              $C$DW$487       .dwtag  DW_TAG_member
    7972                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$21)
    7973                      .dwattr $C$DW$487, DW_AT_name("RSVD0")
    7974                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_RSVD0")
    7975                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7976                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7977              $C$DW$488       .dwtag  DW_TAG_member
    7978                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$20)
    7979                      .dwattr $C$DW$488, DW_AT_name("CTRLR")
    7980                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_CTRLR")
    7981                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7982                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7983              $C$DW$489       .dwtag  DW_TAG_member
    7984                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$33)
    7985                      .dwattr $C$DW$489, DW_AT_name("RSVD1")
    7986                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_RSVD1")
    7987                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7988                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7989              $C$DW$490       .dwtag  DW_TAG_member
    7990                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
    7991                      .dwattr $C$DW$490, DW_AT_name("STATR")
    7992                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_STATR")
    7993                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7994                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7995              $C$DW$491       .dwtag  DW_TAG_member
    7996                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$33)
    7997                      .dwattr $C$DW$491, DW_AT_name("RSVD2")
    7998                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_RSVD2")
    7999                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8000                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    8001              $C$DW$492       .dwtag  DW_TAG_member
    8002                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$20)
    8003                      .dwattr $C$DW$492, DW_AT_name("EMUR")
    8004                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_EMUR")
    8005                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8006                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    8007              $C$DW$493       .dwtag  DW_TAG_member
    8008                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$33)
    8009                      .dwattr $C$DW$493, DW_AT_name("RSVD3")
    8010                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_RSVD3")
    8011                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8012                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    8013              $C$DW$494       .dwtag  DW_TAG_member
    8014                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$20)
    8015                      .dwattr $C$DW$494, DW_AT_name("MODE1")
    8016                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_MODE1")
    8017                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8018                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    8019              $C$DW$495       .dwtag  DW_TAG_member
    8020                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
    8021                      .dwattr $C$DW$495, DW_AT_name("MODE2")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  189

    8022                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_MODE2")
    8023                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8024                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    8025              $C$DW$496       .dwtag  DW_TAG_member
    8026                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$21)
    8027                      .dwattr $C$DW$496, DW_AT_name("RSVD4")
    8028                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_RSVD4")
    8029                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8030                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    8031              $C$DW$497       .dwtag  DW_TAG_member
    8032                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$20)
    8033                      .dwattr $C$DW$497, DW_AT_name("AUTOREQ")
    8034                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_AUTOREQ")
    8035                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8036                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    8037              $C$DW$498       .dwtag  DW_TAG_member
    8038                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$33)
    8039                      .dwattr $C$DW$498, DW_AT_name("RSVD5")
    8040                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_RSVD5")
    8041                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8042                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    8043              $C$DW$499       .dwtag  DW_TAG_member
    8044                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$20)
    8045                      .dwattr $C$DW$499, DW_AT_name("SPRFIXTIME1")
    8046                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_SPRFIXTIME1")
    8047                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8048                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    8049              $C$DW$500       .dwtag  DW_TAG_member
    8050                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$20)
    8051                      .dwattr $C$DW$500, DW_AT_name("SPRFIXTIME2")
    8052                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_SPRFIXTIME2")
    8053                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    8054                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    8055              $C$DW$501       .dwtag  DW_TAG_member
    8056                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$21)
    8057                      .dwattr $C$DW$501, DW_AT_name("RSVD6")
    8058                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_RSVD6")
    8059                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8060                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    8061              $C$DW$502       .dwtag  DW_TAG_member
    8062                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$20)
    8063                      .dwattr $C$DW$502, DW_AT_name("TEARDOWN1")
    8064                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_TEARDOWN1")
    8065                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8066                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    8067              $C$DW$503       .dwtag  DW_TAG_member
    8068                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$20)
    8069                      .dwattr $C$DW$503, DW_AT_name("TEARDOWN2")
    8070                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_TEARDOWN2")
    8071                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8072                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    8073              $C$DW$504       .dwtag  DW_TAG_member
    8074                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$21)
    8075                      .dwattr $C$DW$504, DW_AT_name("RSVD7")
    8076                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_RSVD7")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  190

    8077                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8078                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    8079              $C$DW$505       .dwtag  DW_TAG_member
    8080                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$20)
    8081                      .dwattr $C$DW$505, DW_AT_name("INTSRCR1")
    8082                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_INTSRCR1")
    8083                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8084                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    8085              $C$DW$506       .dwtag  DW_TAG_member
    8086                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$20)
    8087                      .dwattr $C$DW$506, DW_AT_name("INTSRCR2")
    8088                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_INTSRCR2")
    8089                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    8090                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    8091              $C$DW$507       .dwtag  DW_TAG_member
    8092                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$21)
    8093                      .dwattr $C$DW$507, DW_AT_name("RSVD8")
    8094                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_RSVD8")
    8095                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8096                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    8097              $C$DW$508       .dwtag  DW_TAG_member
    8098                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$20)
    8099                      .dwattr $C$DW$508, DW_AT_name("INTSETR1")
    8100                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_INTSETR1")
    8101                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8102                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    8103              $C$DW$509       .dwtag  DW_TAG_member
    8104                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$20)
    8105                      .dwattr $C$DW$509, DW_AT_name("INTSETR2")
    8106                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_INTSETR2")
    8107                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    8108                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    8109              $C$DW$510       .dwtag  DW_TAG_member
    8110                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$21)
    8111                      .dwattr $C$DW$510, DW_AT_name("RSVD9")
    8112                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_RSVD9")
    8113                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    8114                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    8115              $C$DW$511       .dwtag  DW_TAG_member
    8116                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$20)
    8117                      .dwattr $C$DW$511, DW_AT_name("INTCLRR1")
    8118                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_INTCLRR1")
    8119                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8120                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    8121              $C$DW$512       .dwtag  DW_TAG_member
    8122                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$20)
    8123                      .dwattr $C$DW$512, DW_AT_name("INTCLRR2")
    8124                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_INTCLRR2")
    8125                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    8126                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    8127              $C$DW$513       .dwtag  DW_TAG_member
    8128                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$21)
    8129                      .dwattr $C$DW$513, DW_AT_name("RSVD10")
    8130                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_RSVD10")
    8131                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  191

    8132                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    8133              $C$DW$514       .dwtag  DW_TAG_member
    8134                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$20)
    8135                      .dwattr $C$DW$514, DW_AT_name("INTMSKR1")
    8136                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_INTMSKR1")
    8137                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8138                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    8139              $C$DW$515       .dwtag  DW_TAG_member
    8140                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$20)
    8141                      .dwattr $C$DW$515, DW_AT_name("INTMSKR2")
    8142                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_INTMSKR2")
    8143                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    8144                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    8145              $C$DW$516       .dwtag  DW_TAG_member
    8146                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$21)
    8147                      .dwattr $C$DW$516, DW_AT_name("RSVD11")
    8148                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_RSVD11")
    8149                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    8150                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    8151              $C$DW$517       .dwtag  DW_TAG_member
    8152                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$20)
    8153                      .dwattr $C$DW$517, DW_AT_name("INTMSKSETR1")
    8154                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_INTMSKSETR1")
    8155                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    8156                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    8157              $C$DW$518       .dwtag  DW_TAG_member
    8158                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$20)
    8159                      .dwattr $C$DW$518, DW_AT_name("INTMSKSETR2")
    8160                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_INTMSKSETR2")
    8161                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    8162                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    8163              $C$DW$519       .dwtag  DW_TAG_member
    8164                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$21)
    8165                      .dwattr $C$DW$519, DW_AT_name("RSVD12")
    8166                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_RSVD12")
    8167                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8168                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    8169              $C$DW$520       .dwtag  DW_TAG_member
    8170                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$20)
    8171                      .dwattr $C$DW$520, DW_AT_name("INTMSKCLRR1")
    8172                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_INTMSKCLRR1")
    8173                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8174                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    8175              $C$DW$521       .dwtag  DW_TAG_member
    8176                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$20)
    8177                      .dwattr $C$DW$521, DW_AT_name("INTMSKCLRR2")
    8178                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_INTMSKCLRR2")
    8179                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    8180                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    8181              $C$DW$522       .dwtag  DW_TAG_member
    8182                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$21)
    8183                      .dwattr $C$DW$522, DW_AT_name("RSVD13")
    8184                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_RSVD13")
    8185                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    8186                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  192

    8187              $C$DW$523       .dwtag  DW_TAG_member
    8188                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$20)
    8189                      .dwattr $C$DW$523, DW_AT_name("INTMASKEDR1")
    8190                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_INTMASKEDR1")
    8191                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8192                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    8193              $C$DW$524       .dwtag  DW_TAG_member
    8194                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$20)
    8195                      .dwattr $C$DW$524, DW_AT_name("INTMASKEDR2")
    8196                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_INTMASKEDR2")
    8197                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    8198                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    8199              $C$DW$525       .dwtag  DW_TAG_member
    8200                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$21)
    8201                      .dwattr $C$DW$525, DW_AT_name("RSVD14")
    8202                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_RSVD14")
    8203                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    8204                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    8205              $C$DW$526       .dwtag  DW_TAG_member
    8206                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$20)
    8207                      .dwattr $C$DW$526, DW_AT_name("EOIR")
    8208                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_EOIR")
    8209                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    8210                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    8211              $C$DW$527       .dwtag  DW_TAG_member
    8212                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$33)
    8213                      .dwattr $C$DW$527, DW_AT_name("RSVD15")
    8214                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_RSVD15")
    8215                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    8216                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    8217              $C$DW$528       .dwtag  DW_TAG_member
    8218                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$20)
    8219                      .dwattr $C$DW$528, DW_AT_name("INTVECTR1")
    8220                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_INTVECTR1")
    8221                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8222                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    8223              $C$DW$529       .dwtag  DW_TAG_member
    8224                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$20)
    8225                      .dwattr $C$DW$529, DW_AT_name("INTVECTR2")
    8226                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_INTVECTR2")
    8227                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    8228                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    8229              $C$DW$530       .dwtag  DW_TAG_member
    8230                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$26)
    8231                      .dwattr $C$DW$530, DW_AT_name("RSVD16")
    8232                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_RSVD16")
    8233                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    8234                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    8235              $C$DW$531       .dwtag  DW_TAG_member
    8236                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$20)
    8237                      .dwattr $C$DW$531, DW_AT_name("GREP1SZR1")
    8238                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_GREP1SZR1")
    8239                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    8240                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    8241              $C$DW$532       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  193

    8242                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$20)
    8243                      .dwattr $C$DW$532, DW_AT_name("GREP1SZR2")
    8244                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_GREP1SZR2")
    8245                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    8246                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    8247              $C$DW$533       .dwtag  DW_TAG_member
    8248                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$21)
    8249                      .dwattr $C$DW$533, DW_AT_name("RSVD17")
    8250                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_RSVD17")
    8251                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    8252                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    8253              $C$DW$534       .dwtag  DW_TAG_member
    8254                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$20)
    8255                      .dwattr $C$DW$534, DW_AT_name("GREP2SZR1")
    8256                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_GREP2SZR1")
    8257                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    8258                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    8259              $C$DW$535       .dwtag  DW_TAG_member
    8260                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$20)
    8261                      .dwattr $C$DW$535, DW_AT_name("GREP2SZR2")
    8262                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_GREP2SZR2")
    8263                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
    8264                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    8265              $C$DW$536       .dwtag  DW_TAG_member
    8266                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$21)
    8267                      .dwattr $C$DW$536, DW_AT_name("RSVD18")
    8268                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_RSVD18")
    8269                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    8270                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    8271              $C$DW$537       .dwtag  DW_TAG_member
    8272                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$20)
    8273                      .dwattr $C$DW$537, DW_AT_name("GREP3SZR1")
    8274                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_GREP3SZR1")
    8275                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8276                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    8277              $C$DW$538       .dwtag  DW_TAG_member
    8278                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$20)
    8279                      .dwattr $C$DW$538, DW_AT_name("GREP3SZR2")
    8280                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_GREP3SZR2")
    8281                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    8282                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    8283              $C$DW$539       .dwtag  DW_TAG_member
    8284                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$21)
    8285                      .dwattr $C$DW$539, DW_AT_name("RSVD19")
    8286                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_RSVD19")
    8287                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    8288                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    8289              $C$DW$540       .dwtag  DW_TAG_member
    8290                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$20)
    8291                      .dwattr $C$DW$540, DW_AT_name("GREP4SZR1")
    8292                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_GREP4SZR1")
    8293                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8294                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    8295              $C$DW$541       .dwtag  DW_TAG_member
    8296                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  194

    8297                      .dwattr $C$DW$541, DW_AT_name("GREP4SZR2")
    8298                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_GREP4SZR2")
    8299                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    8300                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    8301              $C$DW$542       .dwtag  DW_TAG_member
    8302                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$35)
    8303                      .dwattr $C$DW$542, DW_AT_name("RSVD20")
    8304                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_RSVD20")
    8305                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    8306                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    8307              $C$DW$543       .dwtag  DW_TAG_member
    8308                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$20)
    8309                      .dwattr $C$DW$543, DW_AT_name("FADDR_POWER")
    8310                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_FADDR_POWER")
    8311                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x401]
    8312                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    8313              $C$DW$544       .dwtag  DW_TAG_member
    8314                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$20)
    8315                      .dwattr $C$DW$544, DW_AT_name("INTRTX")
    8316                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_INTRTX")
    8317                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x402]
    8318                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    8319              $C$DW$545       .dwtag  DW_TAG_member
    8320                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$21)
    8321                      .dwattr $C$DW$545, DW_AT_name("RSVD21")
    8322                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_RSVD21")
    8323                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x403]
    8324                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    8325              $C$DW$546       .dwtag  DW_TAG_member
    8326                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$20)
    8327                      .dwattr $C$DW$546, DW_AT_name("INTRRX")
    8328                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_INTRRX")
    8329                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    8330                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    8331              $C$DW$547       .dwtag  DW_TAG_member
    8332                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$20)
    8333                      .dwattr $C$DW$547, DW_AT_name("INTRTXE")
    8334                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_INTRTXE")
    8335                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    8336                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    8337              $C$DW$548       .dwtag  DW_TAG_member
    8338                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$21)
    8339                      .dwattr $C$DW$548, DW_AT_name("RSVD22")
    8340                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_RSVD22")
    8341                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
    8342                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    8343              $C$DW$549       .dwtag  DW_TAG_member
    8344                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$20)
    8345                      .dwattr $C$DW$549, DW_AT_name("INTRRXE")
    8346                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_INTRRXE")
    8347                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x409]
    8348                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    8349              $C$DW$550       .dwtag  DW_TAG_member
    8350                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$20)
    8351                      .dwattr $C$DW$550, DW_AT_name("INTRUSB_INTRUSBE")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  195

    8352                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_INTRUSB_INTRUSBE")
    8353                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x40a]
    8354                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    8355              $C$DW$551       .dwtag  DW_TAG_member
    8356                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$21)
    8357                      .dwattr $C$DW$551, DW_AT_name("RSVD23")
    8358                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_RSVD23")
    8359                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x40b]
    8360                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    8361              $C$DW$552       .dwtag  DW_TAG_member
    8362                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$20)
    8363                      .dwattr $C$DW$552, DW_AT_name("FRAME")
    8364                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_FRAME")
    8365                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x40d]
    8366                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    8367              $C$DW$553       .dwtag  DW_TAG_member
    8368                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$20)
    8369                      .dwattr $C$DW$553, DW_AT_name("INDEX_TESTMODE")
    8370                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_INDEX_TESTMODE")
    8371                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x40e]
    8372                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    8373              $C$DW$554       .dwtag  DW_TAG_member
    8374                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$21)
    8375                      .dwattr $C$DW$554, DW_AT_name("RSVD24")
    8376                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_RSVD24")
    8377                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x40f]
    8378                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    8379              $C$DW$555       .dwtag  DW_TAG_member
    8380                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$20)
    8381                      .dwattr $C$DW$555, DW_AT_name("TXMAXP_INDX")
    8382                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_TXMAXP_INDX")
    8383                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x411]
    8384                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    8385              $C$DW$556       .dwtag  DW_TAG_member
    8386                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$20)
    8387                      .dwattr $C$DW$556, DW_AT_name("PERI_CSR0_INDX")
    8388                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_PERI_CSR0_INDX")
    8389                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x412]
    8390                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    8391              $C$DW$557       .dwtag  DW_TAG_member
    8392                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$21)
    8393                      .dwattr $C$DW$557, DW_AT_name("RSVD25")
    8394                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_RSVD25")
    8395                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x413]
    8396                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    8397              $C$DW$558       .dwtag  DW_TAG_member
    8398                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$20)
    8399                      .dwattr $C$DW$558, DW_AT_name("RXMAXP_INDX")
    8400                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_RXMAXP_INDX")
    8401                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x415]
    8402                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    8403              $C$DW$559       .dwtag  DW_TAG_member
    8404                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$20)
    8405                      .dwattr $C$DW$559, DW_AT_name("PERI_RXCSR_INDX")
    8406                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_PERI_RXCSR_INDX")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  196

    8407                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x416]
    8408                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    8409              $C$DW$560       .dwtag  DW_TAG_member
    8410                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$21)
    8411                      .dwattr $C$DW$560, DW_AT_name("RSVD26")
    8412                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_RSVD26")
    8413                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x417]
    8414                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    8415              $C$DW$561       .dwtag  DW_TAG_member
    8416                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$20)
    8417                      .dwattr $C$DW$561, DW_AT_name("COUNT0_INDX")
    8418                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_COUNT0_INDX")
    8419                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x419]
    8420                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    8421              $C$DW$562       .dwtag  DW_TAG_member
    8422                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$36)
    8423                      .dwattr $C$DW$562, DW_AT_name("RSVD27")
    8424                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_RSVD27")
    8425                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x41a]
    8426                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    8427              $C$DW$563       .dwtag  DW_TAG_member
    8428                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$20)
    8429                      .dwattr $C$DW$563, DW_AT_name("CONFIGDATA_INDX")
    8430                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_CONFIGDATA_INDX")
    8431                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x41e]
    8432                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    8433              $C$DW$564       .dwtag  DW_TAG_member
    8434                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$21)
    8435                      .dwattr $C$DW$564, DW_AT_name("RSVD28")
    8436                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_RSVD28")
    8437                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x41f]
    8438                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    8439              $C$DW$565       .dwtag  DW_TAG_member
    8440                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$20)
    8441                      .dwattr $C$DW$565, DW_AT_name("FIFO0R1")
    8442                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_FIFO0R1")
    8443                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x421]
    8444                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    8445              $C$DW$566       .dwtag  DW_TAG_member
    8446                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$20)
    8447                      .dwattr $C$DW$566, DW_AT_name("FIFO0R2")
    8448                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_FIFO0R2")
    8449                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x422]
    8450                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    8451              $C$DW$567       .dwtag  DW_TAG_member
    8452                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$21)
    8453                      .dwattr $C$DW$567, DW_AT_name("RSVD29")
    8454                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_RSVD29")
    8455                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x423]
    8456                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    8457              $C$DW$568       .dwtag  DW_TAG_member
    8458                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$20)
    8459                      .dwattr $C$DW$568, DW_AT_name("FIFO1R1")
    8460                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_FIFO1R1")
    8461                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x425]
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  197

    8462                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    8463              $C$DW$569       .dwtag  DW_TAG_member
    8464                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$20)
    8465                      .dwattr $C$DW$569, DW_AT_name("FIFO1R2")
    8466                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_FIFO1R2")
    8467                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x426]
    8468                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    8469              $C$DW$570       .dwtag  DW_TAG_member
    8470                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$21)
    8471                      .dwattr $C$DW$570, DW_AT_name("RSVD30")
    8472                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_RSVD30")
    8473                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x427]
    8474                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    8475              $C$DW$571       .dwtag  DW_TAG_member
    8476                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$20)
    8477                      .dwattr $C$DW$571, DW_AT_name("FIFO2R1")
    8478                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_FIFO2R1")
    8479                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x429]
    8480                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    8481              $C$DW$572       .dwtag  DW_TAG_member
    8482                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$20)
    8483                      .dwattr $C$DW$572, DW_AT_name("FIFO2R2")
    8484                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_FIFO2R2")
    8485                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x42a]
    8486                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    8487              $C$DW$573       .dwtag  DW_TAG_member
    8488                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$21)
    8489                      .dwattr $C$DW$573, DW_AT_name("RSVD31")
    8490                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_RSVD31")
    8491                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x42b]
    8492                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    8493              $C$DW$574       .dwtag  DW_TAG_member
    8494                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$20)
    8495                      .dwattr $C$DW$574, DW_AT_name("FIFO3R1")
    8496                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_FIFO3R1")
    8497                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x42d]
    8498                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    8499              $C$DW$575       .dwtag  DW_TAG_member
    8500                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$20)
    8501                      .dwattr $C$DW$575, DW_AT_name("FIFO3R2")
    8502                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_FIFO3R2")
    8503                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x42e]
    8504                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    8505              $C$DW$576       .dwtag  DW_TAG_member
    8506                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$21)
    8507                      .dwattr $C$DW$576, DW_AT_name("RSVD32")
    8508                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_RSVD32")
    8509                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x42f]
    8510                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    8511              $C$DW$577       .dwtag  DW_TAG_member
    8512                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$20)
    8513                      .dwattr $C$DW$577, DW_AT_name("FIFO4R1")
    8514                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_FIFO4R1")
    8515                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x431]
    8516                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  198

    8517              $C$DW$578       .dwtag  DW_TAG_member
    8518                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$20)
    8519                      .dwattr $C$DW$578, DW_AT_name("FIFO4R2")
    8520                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_FIFO4R2")
    8521                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x432]
    8522                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    8523              $C$DW$579       .dwtag  DW_TAG_member
    8524                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$37)
    8525                      .dwattr $C$DW$579, DW_AT_name("RSVD33")
    8526                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_RSVD33")
    8527                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x433]
    8528                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    8529              $C$DW$580       .dwtag  DW_TAG_member
    8530                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$20)
    8531                      .dwattr $C$DW$580, DW_AT_name("DEVCTL")
    8532                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_DEVCTL")
    8533                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x461]
    8534                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    8535              $C$DW$581       .dwtag  DW_TAG_member
    8536                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$20)
    8537                      .dwattr $C$DW$581, DW_AT_name("TXFIFOSZ_RXFIFOSZ")
    8538                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_TXFIFOSZ_RXFIFOSZ")
    8539                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x462]
    8540                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    8541              $C$DW$582       .dwtag  DW_TAG_member
    8542                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$21)
    8543                      .dwattr $C$DW$582, DW_AT_name("RSVD34")
    8544                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_RSVD34")
    8545                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x463]
    8546                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    8547              $C$DW$583       .dwtag  DW_TAG_member
    8548                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$20)
    8549                      .dwattr $C$DW$583, DW_AT_name("TXFIFOADDR")
    8550                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_TXFIFOADDR")
    8551                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x465]
    8552                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    8553              $C$DW$584       .dwtag  DW_TAG_member
    8554                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$20)
    8555                      .dwattr $C$DW$584, DW_AT_name("RXFIFOADDR")
    8556                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_RXFIFOADDR")
    8557                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x466]
    8558                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    8559              $C$DW$585       .dwtag  DW_TAG_member
    8560                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$25)
    8561                      .dwattr $C$DW$585, DW_AT_name("RSVD35")
    8562                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_RSVD35")
    8563                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x467]
    8564                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    8565              $C$DW$586       .dwtag  DW_TAG_member
    8566                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$20)
    8567                      .dwattr $C$DW$586, DW_AT_name("HWVERS")
    8568                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_HWVERS")
    8569                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x46d]
    8570                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    8571              $C$DW$587       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  199

    8572                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$38)
    8573                      .dwattr $C$DW$587, DW_AT_name("RSVD37")
    8574                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_RSVD37")
    8575                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
    8576                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    8577              $C$DW$588       .dwtag  DW_TAG_member
    8578                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$40)
    8579                      .dwattr $C$DW$588, DW_AT_name("EPTRG")
    8580                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_EPTRG")
    8581                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x481]
    8582                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    8583              $C$DW$589       .dwtag  DW_TAG_member
    8584                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$41)
    8585                      .dwattr $C$DW$589, DW_AT_name("RSVD38")
    8586                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_RSVD38")
    8587                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a9]
    8588                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    8589              $C$DW$590       .dwtag  DW_TAG_member
    8590                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$20)
    8591                      .dwattr $C$DW$590, DW_AT_name("PERI_CSR0")
    8592                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_PERI_CSR0")
    8593                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x502]
    8594                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    8595              $C$DW$591       .dwtag  DW_TAG_member
    8596                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$25)
    8597                      .dwattr $C$DW$591, DW_AT_name("RSVD39")
    8598                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_RSVD39")
    8599                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x503]
    8600                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    8601              $C$DW$592       .dwtag  DW_TAG_member
    8602                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$20)
    8603                      .dwattr $C$DW$592, DW_AT_name("COUNT0")
    8604                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_COUNT0")
    8605                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x509]
    8606                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    8607              $C$DW$593       .dwtag  DW_TAG_member
    8608                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$36)
    8609                      .dwattr $C$DW$593, DW_AT_name("RSVD40")
    8610                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_RSVD40")
    8611                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x50a]
    8612                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    8613              $C$DW$594       .dwtag  DW_TAG_member
    8614                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$20)
    8615                      .dwattr $C$DW$594, DW_AT_name("CONFIGDATA")
    8616                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_CONFIGDATA")
    8617                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x50e]
    8618                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    8619              $C$DW$595       .dwtag  DW_TAG_member
    8620                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$21)
    8621                      .dwattr $C$DW$595, DW_AT_name("RSVD42")
    8622                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_RSVD42")
    8623                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x50f]
    8624                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    8625              $C$DW$596       .dwtag  DW_TAG_member
    8626                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$43)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  200

    8627                      .dwattr $C$DW$596, DW_AT_name("EPCSR")
    8628                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_EPCSR")
    8629                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x511]
    8630                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    8631              $C$DW$597       .dwtag  DW_TAG_member
    8632                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$44)
    8633                      .dwattr $C$DW$597, DW_AT_name("RSVD43")
    8634                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_RSVD43")
    8635                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x551]
    8636                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    8637              $C$DW$598       .dwtag  DW_TAG_member
    8638                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$20)
    8639                      .dwattr $C$DW$598, DW_AT_name("DMAREVID1")
    8640                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_DMAREVID1")
    8641                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x1000]
    8642                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    8643              $C$DW$599       .dwtag  DW_TAG_member
    8644                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$20)
    8645                      .dwattr $C$DW$599, DW_AT_name("DMAREVID2")
    8646                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_DMAREVID2")
    8647                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x1001]
    8648                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    8649              $C$DW$600       .dwtag  DW_TAG_member
    8650                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$21)
    8651                      .dwattr $C$DW$600, DW_AT_name("RSVD44")
    8652                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_RSVD44")
    8653                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x1002]
    8654                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    8655              $C$DW$601       .dwtag  DW_TAG_member
    8656                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$20)
    8657                      .dwattr $C$DW$601, DW_AT_name("TDFDQ")
    8658                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_TDFDQ")
    8659                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x1004]
    8660                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    8661              $C$DW$602       .dwtag  DW_TAG_member
    8662                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$33)
    8663                      .dwattr $C$DW$602, DW_AT_name("RSVD45")
    8664                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_RSVD45")
    8665                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x1005]
    8666                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    8667              $C$DW$603       .dwtag  DW_TAG_member
    8668                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$20)
    8669                      .dwattr $C$DW$603, DW_AT_name("DMAEMU")
    8670                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_DMAEMU")
    8671                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x1008]
    8672                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    8673              $C$DW$604       .dwtag  DW_TAG_member
    8674                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$45)
    8675                      .dwattr $C$DW$604, DW_AT_name("RSVD47")
    8676                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_RSVD47")
    8677                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x1009]
    8678                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    8679              $C$DW$605       .dwtag  DW_TAG_member
    8680                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$47)
    8681                      .dwattr $C$DW$605, DW_AT_name("CHANNEL")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:37:01 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_usb.asm                                                          PAGE  201

    8682                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_CHANNEL")
    8683                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x1800]
    8684                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    8685              $C$DW$606       .dwtag  DW_TAG_member
    8686                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$48)
    8687                      .dwattr $C$DW$606, DW_AT_name("RSVD48")
    8688                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_RSVD48")
    8689                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x1880]
    8690                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    8691              $C$DW$607       .dwtag  DW_TAG_member
    8692                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$20)
    8693                      .dwattr $C$DW$607, DW_AT_name("DMA_SCHED_CTRL1")
    8694                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL1")
    8695                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x2000]
    8696                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    8697              $C$DW$608       .dwtag  DW_TAG_member
    8698                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$20)
    8699                      .dwattr $C$DW$608, DW_AT_name("DMA_SCHED_CTRL2")
    8700                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL2")
    8701                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x2001]
    8702                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    8703              $C$DW$609       .dwtag  DW_TAG_member
    8704                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$49)
    8705                      .dwattr $C$DW$609, DW_AT_name("RSVD50")
    8706                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_RSVD50")
    8707                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x2002]
    8708                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    8709              $C$DW$610       .dwtag  DW_TAG_member
    8710                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$51)
    8711                      .dwattr $C$DW$610, DW_AT_name("CDMASCHETBLWORD")
    8712                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_CDMASCHETBLWORD")
    8713                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x2800]
    8714                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
