TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mem.asm                                                          PAGE    1

    1853              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 16 02:56:40 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1037                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_mem.c",line 704,column 1,is_stmt,addre
    1038              
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mem.asm                                                          PAGE   23

    1039                      .dwfde $C$DW$CIE, _MEM_getmSDRAMClock
    1040              ;*******************************************************************************
    1041              ;* FUNCTION NAME: MEM_getmSDRAMClock                                           *
    1042              ;*                                                                             *
    1043              ;*   Function Uses Regs : AC0,AC0,T0,AR1,SP,M40,SATA,SATD,RDM,FRCT,SMUL        *
    1044              ;*   Stack Frame        : Compact (No Frame Pointer, w/ debug)                 *
    1045              ;*   Total Frame Size   : 2 words                                              *
    1046              ;*                        (1 return address/alignment)                         *
    1047              ;*                        (1 local values)                                     *
    1048              ;*   Min System Stack   : 1 word                                               *
    1049              ;*******************************************************************************
    1050 000334       _MEM_getmSDRAMClock:
    1051                      .dwcfi  cfa_offset, 1
    1052                      .dwcfi  save_reg_to_mem, 91, -1
    1053 000334 4EFF          AADD #-1, SP
    1054                      .dwcfi  cfa_offset, 2
    1055              $C$DW$57        .dwtag  DW_TAG_variable, DW_AT_name("bitValue")
    1056                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bitValue")
    1057                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$42)
    1058                      .dwattr $C$DW$57, DW_AT_location[DW_OP_bregx 0x24 0]
    1059                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_mem.c",line 707,column 2,is_stmt
    1060 000336 A951          MOV *port(#7198), AR1 ; |707| 
         000338 1C1E 
    1061 00033a 1801          AND #0x0001, AR1, AC0 ; |707| 
         00033c 09   
    1062 00033d C000          MOV AC0, *SP(#0) ; |707| 
    1063                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_mem.c",line 709,column 2,is_stmt
    1064 00033f 2204          MOV AC0, T0
    1065                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_mem.c",line 710,column 1,is_stmt
    1066 000341 4E01          AADD #1, SP
    1067                      .dwcfi  cfa_offset, 1
    1068              $C$DW$58        .dwtag  DW_TAG_TI_branch
    1069                      .dwattr $C$DW$58, DW_AT_low_pc(0x00)
    1070                      .dwattr $C$DW$58, DW_AT_TI_return
    1071 000343 4804          RET
    1072                                                      ; return occurs
    1073                      .dwattr $C$DW$56, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_mem.c")
    1074                      .dwattr $C$DW$56, DW_AT_TI_end_line(0x2c6)
    1075                      .dwattr $C$DW$56, DW_AT_TI_end_column(0x01)
    1076                      .dwendentry
    1077                      .dwendtag $C$DW$56
    1078              
    1079              
    1080              ;*******************************************************************************
    1081              ;* TYPE INFORMATION                                                            *
    1082              ;*******************************************************************************
    1083              
    1084              $C$DW$T$25      .dwtag  DW_TAG_enumeration_type
    1085                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1086              $C$DW$59        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MEM_DARAM"), DW_AT_const_value(0x00)
    1087              $C$DW$60        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MEM_SARAM"), DW_AT_const_value(0x01)
    1088              $C$DW$61        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MEM_INVALID"), DW_AT_const_value(0x02)
    1089                      .dwendtag $C$DW$T$25
    1090              
    1091              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MemType")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mem.asm                                                          PAGE   24

    1092                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1093                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1094              
    1095              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
    1096                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1097              $C$DW$62        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MEM_MSDARAM_CLOCK_ON"), DW_AT_const_value(0x00)
    1098              $C$DW$63        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MEM_MSDARAM_CLOCK_OFF"), DW_AT_const_value(0x01)
    1099                      .dwendtag $C$DW$T$27
    1100              
    1101              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MEMmSDRAMClock")
    1102                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1103                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1104              
    1105              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1106                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x48)
    1107              $C$DW$64        .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
    1109                      .dwattr $C$DW$64, DW_AT_name("EBSR")
    1110                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_EBSR")
    1111                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1113              $C$DW$65        .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$20)
    1115                      .dwattr $C$DW$65, DW_AT_name("RSVD0")
    1116                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_RSVD0")
    1117                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1118                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1119              $C$DW$66        .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
    1121                      .dwattr $C$DW$66, DW_AT_name("PCGCR1")
    1122                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PCGCR1")
    1123                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1124                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1125              $C$DW$67        .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
    1127                      .dwattr $C$DW$67, DW_AT_name("PCGCR2")
    1128                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_PCGCR2")
    1129                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1130                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1131              $C$DW$68        .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
    1133                      .dwattr $C$DW$68, DW_AT_name("PSRCR")
    1134                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_PSRCR")
    1135                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1136                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$69        .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$20)
    1139                      .dwattr $C$DW$69, DW_AT_name("PRCR")
    1140                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PRCR")
    1141                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1142                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1143              $C$DW$70        .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1145                      .dwattr $C$DW$70, DW_AT_name("RSVD1")
    1146                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_RSVD1")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mem.asm                                                          PAGE   25

    1147                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1148                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$71        .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1151                      .dwattr $C$DW$71, DW_AT_name("TIAFR")
    1152                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_TIAFR")
    1153                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1154                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1155              $C$DW$72        .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
    1157                      .dwattr $C$DW$72, DW_AT_name("RSVD2")
    1158                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_RSVD2")
    1159                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1160                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1161              $C$DW$73        .dwtag  DW_TAG_member
    1162                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
    1163                      .dwattr $C$DW$73, DW_AT_name("ODSCR")
    1164                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ODSCR")
    1165                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1166                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1167              $C$DW$74        .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
    1169                      .dwattr $C$DW$74, DW_AT_name("PDINHIBR1")
    1170                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PDINHIBR1")
    1171                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1172                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1173              $C$DW$75        .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
    1175                      .dwattr $C$DW$75, DW_AT_name("PDINHIBR2")
    1176                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_PDINHIBR2")
    1177                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1178                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1179              $C$DW$76        .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1181                      .dwattr $C$DW$76, DW_AT_name("PDINHIBR3")
    1182                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PDINHIBR3")
    1183                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1184                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1185              $C$DW$77        .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
    1187                      .dwattr $C$DW$77, DW_AT_name("DMA0CESR1")
    1188                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_DMA0CESR1")
    1189                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1190                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1191              $C$DW$78        .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1193                      .dwattr $C$DW$78, DW_AT_name("DMA0CESR2")
    1194                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_DMA0CESR2")
    1195                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1196                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1197              $C$DW$79        .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    1199                      .dwattr $C$DW$79, DW_AT_name("DMA1CESR1")
    1200                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_DMA1CESR1")
    1201                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mem.asm                                                          PAGE   26

    1202                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1203              $C$DW$80        .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    1205                      .dwattr $C$DW$80, DW_AT_name("DMA1CESR2")
    1206                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_DMA1CESR2")
    1207                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1208                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1209              $C$DW$81        .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
    1211                      .dwattr $C$DW$81, DW_AT_name("SDRAMCCR")
    1212                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_SDRAMCCR")
    1213                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1214                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1215              $C$DW$82        .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    1217                      .dwattr $C$DW$82, DW_AT_name("CCR2")
    1218                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_CCR2")
    1219                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1220                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1221              $C$DW$83        .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1223                      .dwattr $C$DW$83, DW_AT_name("CGCR1")
    1224                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_CGCR1")
    1225                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1226                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1227              $C$DW$84        .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    1229                      .dwattr $C$DW$84, DW_AT_name("CGICR")
    1230                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_CGICR")
    1231                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1232                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1233              $C$DW$85        .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1235                      .dwattr $C$DW$85, DW_AT_name("CGCR2")
    1236                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_CGCR2")
    1237                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1238                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1239              $C$DW$86        .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    1241                      .dwattr $C$DW$86, DW_AT_name("CGOCR")
    1242                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_CGOCR")
    1243                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1244                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1245              $C$DW$87        .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    1247                      .dwattr $C$DW$87, DW_AT_name("CCSSR")
    1248                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_CCSSR")
    1249                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1250                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1251              $C$DW$88        .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    1253                      .dwattr $C$DW$88, DW_AT_name("RSVD3")
    1254                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_RSVD3")
    1255                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1256                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mem.asm                                                          PAGE   27

    1257              $C$DW$89        .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    1259                      .dwattr $C$DW$89, DW_AT_name("ECDR")
    1260                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ECDR")
    1261                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1262                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1263              $C$DW$90        .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
    1265                      .dwattr $C$DW$90, DW_AT_name("RSVD4")
    1266                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_RSVD4")
    1267                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1268                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1269              $C$DW$91        .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    1271                      .dwattr $C$DW$91, DW_AT_name("RAMSLPMDCNTLR1")
    1272                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1273                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1274                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1275              $C$DW$92        .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    1277                      .dwattr $C$DW$92, DW_AT_name("RSVD5")
    1278                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_RSVD5")
    1279                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1280                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1281              $C$DW$93        .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
    1283                      .dwattr $C$DW$93, DW_AT_name("RAMSLPMDCNTLR2")
    1284                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1285                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1286                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1287              $C$DW$94        .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
    1289                      .dwattr $C$DW$94, DW_AT_name("RAMSLPMDCNTLR3")
    1290                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1291                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1292                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1293              $C$DW$95        .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    1295                      .dwattr $C$DW$95, DW_AT_name("RAMSLPMDCNTLR4")
    1296                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1297                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1298                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1299              $C$DW$96        .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    1301                      .dwattr $C$DW$96, DW_AT_name("RAMSLPMDCNTLR5")
    1302                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1303                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1304                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1305              $C$DW$97        .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$22)
    1307                      .dwattr $C$DW$97, DW_AT_name("RSVD6")
    1308                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_RSVD6")
    1309                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1310                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1311              $C$DW$98        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mem.asm                                                          PAGE   28

    1312                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    1313                      .dwattr $C$DW$98, DW_AT_name("DMAIFR")
    1314                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_DMAIFR")
    1315                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1316                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1317              $C$DW$99        .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    1319                      .dwattr $C$DW$99, DW_AT_name("DMAIER")
    1320                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_DMAIER")
    1321                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1322                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1323              $C$DW$100       .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    1325                      .dwattr $C$DW$100, DW_AT_name("USBSCR")
    1326                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_USBSCR")
    1327                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1328                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1329              $C$DW$101       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    1331                      .dwattr $C$DW$101, DW_AT_name("ESCR")
    1332                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_ESCR")
    1333                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1334                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1335              $C$DW$102       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$22)
    1337                      .dwattr $C$DW$102, DW_AT_name("RSVD7")
    1338                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_RSVD7")
    1339                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1340                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1341              $C$DW$103       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1343                      .dwattr $C$DW$103, DW_AT_name("DMA2CESR1")
    1344                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_DMA2CESR1")
    1345                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1346                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1347              $C$DW$104       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    1349                      .dwattr $C$DW$104, DW_AT_name("DMA2CESR2")
    1350                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_DMA2CESR2")
    1351                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1352                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1353              $C$DW$105       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    1355                      .dwattr $C$DW$105, DW_AT_name("DMA3CESR1")
    1356                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_DMA3CESR1")
    1357                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1358                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1359              $C$DW$106       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    1361                      .dwattr $C$DW$106, DW_AT_name("DMA3CESR2")
    1362                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_DMA3CESR2")
    1363                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1364                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1365              $C$DW$107       .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mem.asm                                                          PAGE   29

    1367                      .dwattr $C$DW$107, DW_AT_name("CLKSTOP")
    1368                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CLKSTOP")
    1369                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1370                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1371              $C$DW$108       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$23)
    1373                      .dwattr $C$DW$108, DW_AT_name("RSVD8")
    1374                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_RSVD8")
    1375                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1376                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1377              $C$DW$109       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    1379                      .dwattr $C$DW$109, DW_AT_name("DIEIDR0")
    1380                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_DIEIDR0")
    1381                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1382                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1383              $C$DW$110       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    1385                      .dwattr $C$DW$110, DW_AT_name("DIEIDR1")
    1386                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_DIEIDR1")
    1387                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1388                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1389              $C$DW$111       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    1391                      .dwattr $C$DW$111, DW_AT_name("DIEIDR2")
    1392                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_DIEIDR2")
    1393                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1394                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1395              $C$DW$112       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    1397                      .dwattr $C$DW$112, DW_AT_name("DIEIDR3")
    1398                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_DIEIDR3")
    1399                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1400                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1401              $C$DW$113       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    1403                      .dwattr $C$DW$113, DW_AT_name("DIEIDR4")
    1404                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_DIEIDR4")
    1405                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1406                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1407              $C$DW$114       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1409                      .dwattr $C$DW$114, DW_AT_name("DIEIDR5")
    1410                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_DIEIDR5")
    1411                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1412                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1413              $C$DW$115       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    1415                      .dwattr $C$DW$115, DW_AT_name("DIEIDR6")
    1416                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_DIEIDR6")
    1417                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1418                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1419              $C$DW$116       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1421                      .dwattr $C$DW$116, DW_AT_name("DIEIDR7")
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:40 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mem.asm                                                          PAGE   30

    1422                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_DIEIDR7")
    1423                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1424                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1425                      .dwendtag $C$DW$T$24
    1426              
    1427              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1428                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$24)
    1429                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1430              $C$DW$117       .dwtag  DW_TAG_TI_far_type
    1431                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$29)
    1432              $C$DW$118       .dwtag  DW_TAG_TI_ioport_type
    1433                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$117)
    1434              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    1435                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$118)
    1436              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1437                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1438                      .dwattr $C$DW$T$31, DW_AT_address_class(0x10)
    1439              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1440                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1441                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1442              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1443                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1444                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1445                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1446              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1447                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1448                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1449                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1450              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1451                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1452                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1453                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1454              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1455                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1456                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1457                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1458              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1459                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1460                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1461                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1462              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1463                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$8)
    1464                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1465              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1466                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1467                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1468              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1469                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1470                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1471                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1472              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1473                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1474                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1475              $C$DW$119       .dwtag  DW_TAG_TI_far_type
    1476                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Sun Sep 16 02:56:40 2018

