TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE    1

    3406              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 14 03:54:52 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2381                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2382              
    2383              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    2384                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2385              $C$DW$93        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_0"), DW_AT_const_value(0x00)
    2386              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_1"), DW_AT_const_value(0x01)
    2387              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_2"), DW_AT_const_value(0x02)
    2388              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_3"), DW_AT_const_value(0x03)
    2389              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_4"), DW_AT_const_value(0x04)
    2390              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CHAN_5"), DW_AT_const_value(0x05)
    2391              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_NO_CHAN"), DW_AT_const_value(0x06)
    2392                      .dwendtag $C$DW$T$41
    2393              
    2394              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanSel")
    2395                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2396                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2397              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    2398                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2399                      .dwattr $C$DW$T$43, DW_AT_address_class(0x17)
    2400              
    2401              $C$DW$T$44      .dwtag  DW_TAG_enumeration_type
    2402                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2403              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_CONTINUOUS_CONVERSION"), DW_AT_const_value(0x0
    2404              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_SINGLE_CONVERSION"), DW_AT_const_value(0x01)
    2405                      .dwendtag $C$DW$T$44
    2406              
    2407              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChanCyc")
    2408                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2409                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   57

    2410              
    2411              $C$DW$T$46      .dwtag  DW_TAG_enumeration_type
    2412                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2413              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_KEYPAD_MEAS"), DW_AT_const_value(0x00)
    2414              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_BATTRY_MEAS"), DW_AT_const_value(0x01)
    2415              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_INT_VOLT_MEAS"), DW_AT_const_value(0x02)
    2416              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_VOLUME_CTRL"), DW_AT_const_value(0x03)
    2417              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_XAXIS"), DW_AT_const_value(0x04)
    2418              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_TOUCH_SCREEN_YAXIS"), DW_AT_const_value(0x05)
    2419              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_PEN_PRESS_DOWN"), DW_AT_const_value(0x06)
    2420                      .dwendtag $C$DW$T$46
    2421              
    2422              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SARMeasParam")
    2423                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    2424                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2425              
    2426              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    2427                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2428              $C$DW$109       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_0"), DW_AT_const_value(0x00)
    2429              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_1"), DW_AT_const_value(0x01)
    2430              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_2"), DW_AT_const_value(0x02)
    2431              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_3"), DW_AT_const_value(0x03)
    2432                      .dwendtag $C$DW$T$48
    2433              
    2434              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarGPOPinSel")
    2435                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2436                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2437              
    2438              $C$DW$T$50      .dwtag  DW_TAG_enumeration_type
    2439                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2440              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_IN"), DW_AT_const_value(0x00)
    2441              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SAR_GPO_OUT"), DW_AT_const_value(0x01)
    2442                      .dwendtag $C$DW$T$50
    2443              
    2444              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarGPODir")
    2445                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2446                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2447              
    2448              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2449                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1b)
    2450              $C$DW$115       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    2452                      .dwattr $C$DW$115, DW_AT_name("RSVD0")
    2453                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_RSVD0")
    2454                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2455                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2456              $C$DW$116       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    2458                      .dwattr $C$DW$116, DW_AT_name("USBLDOCNTL")
    2459                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_USBLDOCNTL")
    2460                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2461                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2462              $C$DW$117       .dwtag  DW_TAG_member
    2463                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$22)
    2464                      .dwattr $C$DW$117, DW_AT_name("RSVD1")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   58

    2465                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_RSVD1")
    2466                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2467                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2468              $C$DW$118       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    2470                      .dwattr $C$DW$118, DW_AT_name("SARCTRL")
    2471                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_SARCTRL")
    2472                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2473                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2474              $C$DW$119       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    2476                      .dwattr $C$DW$119, DW_AT_name("RSVD2")
    2477                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_RSVD2")
    2478                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2479                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2480              $C$DW$120       .dwtag  DW_TAG_member
    2481                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    2482                      .dwattr $C$DW$120, DW_AT_name("SARDATA")
    2483                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_SARDATA")
    2484                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2485                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2486              $C$DW$121       .dwtag  DW_TAG_member
    2487                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    2488                      .dwattr $C$DW$121, DW_AT_name("RSVD3")
    2489                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_RSVD3")
    2490                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2491                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2492              $C$DW$122       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    2494                      .dwattr $C$DW$122, DW_AT_name("SARCLKCTRL")
    2495                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_SARCLKCTRL")
    2496                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2497                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2498              $C$DW$123       .dwtag  DW_TAG_member
    2499                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    2500                      .dwattr $C$DW$123, DW_AT_name("RSVD4")
    2501                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_RSVD4")
    2502                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2503                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2504              $C$DW$124       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    2506                      .dwattr $C$DW$124, DW_AT_name("SARPINCTRL")
    2507                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_SARPINCTRL")
    2508                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2509                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2510              $C$DW$125       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    2512                      .dwattr $C$DW$125, DW_AT_name("RSVD5")
    2513                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_RSVD5")
    2514                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2515                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2516              $C$DW$126       .dwtag  DW_TAG_member
    2517                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    2518                      .dwattr $C$DW$126, DW_AT_name("SARGPOCTRL")
    2519                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_SARGPOCTRL")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   59

    2520                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2521                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2522                      .dwendtag $C$DW$T$23
    2523              
    2524              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AnactrlRegs")
    2525                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2526                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2527              $C$DW$127       .dwtag  DW_TAG_TI_far_type
    2528                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$24)
    2529              $C$DW$128       .dwtag  DW_TAG_TI_ioport_type
    2530                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$127)
    2531              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    2532                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$128)
    2533              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2534                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2535                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    2536              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarRegsOvly")
    2537                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2538                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2539              
    2540              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2541                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x03)
    2542              $C$DW$129       .dwtag  DW_TAG_member
    2543                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$27)
    2544                      .dwattr $C$DW$129, DW_AT_name("baseAddr")
    2545                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_baseAddr")
    2546                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2547                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2548              $C$DW$130       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2550                      .dwattr $C$DW$130, DW_AT_name("chanNo")
    2551                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_chanNo")
    2552                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2553                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2554              $C$DW$131       .dwtag  DW_TAG_member
    2555                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2556                      .dwattr $C$DW$131, DW_AT_name("status")
    2557                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_status")
    2558                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2559                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2560                      .dwendtag $C$DW$T$28
    2561              
    2562              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarHandleObj")
    2563                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$28)
    2564                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2565              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    2566                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2567                      .dwattr $C$DW$T$53, DW_AT_address_class(0x17)
    2568              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("SAR_Handle")
    2569                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    2570                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    2571              
    2572              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2573                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    2574              $C$DW$132       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   60

    2575                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    2576                      .dwattr $C$DW$132, DW_AT_name("SARCTRL")
    2577                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_SARCTRL")
    2578                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2579                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2580              $C$DW$133       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    2582                      .dwattr $C$DW$133, DW_AT_name("SARCLKCTRL")
    2583                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_SARCLKCTRL")
    2584                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2585                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2586              $C$DW$134       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    2588                      .dwattr $C$DW$134, DW_AT_name("SARPINCTRL")
    2589                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_SARPINCTRL")
    2590                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2591                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2592              $C$DW$135       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    2594                      .dwattr $C$DW$135, DW_AT_name("SARGPOCTRL")
    2595                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_SARGPOCTRL")
    2596                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2597                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2598                      .dwendtag $C$DW$T$29
    2599              
    2600              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChConfig")
    2601                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$29)
    2602                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2603              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    2604                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2605                      .dwattr $C$DW$T$56, DW_AT_address_class(0x17)
    2606              
    2607              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2608                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2609              $C$DW$136       .dwtag  DW_TAG_member
    2610                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2611                      .dwattr $C$DW$136, DW_AT_name("SysClkDiv")
    2612                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_SysClkDiv")
    2613                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2614                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2615              $C$DW$137       .dwtag  DW_TAG_member
    2616                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$31)
    2617                      .dwattr $C$DW$137, DW_AT_name("OpMode")
    2618                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_OpMode")
    2619                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2620                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2621              $C$DW$138       .dwtag  DW_TAG_member
    2622                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$33)
    2623                      .dwattr $C$DW$138, DW_AT_name("MultiCh")
    2624                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_MultiCh")
    2625                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2626                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2627              $C$DW$139       .dwtag  DW_TAG_member
    2628                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$35)
    2629                      .dwattr $C$DW$139, DW_AT_name("RefVoltage")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   61

    2630                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_RefVoltage")
    2631                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2632                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2633                      .dwendtag $C$DW$T$36
    2634              
    2635              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SarChSetup")
    2636                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$36)
    2637                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2638              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2639                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2640                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
    2641              
    2642              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2643                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x48)
    2644              $C$DW$140       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    2646                      .dwattr $C$DW$140, DW_AT_name("EBSR")
    2647                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_EBSR")
    2648                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2649                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2650              $C$DW$141       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    2652                      .dwattr $C$DW$141, DW_AT_name("RSVD0")
    2653                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_RSVD0")
    2654                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2655                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2656              $C$DW$142       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    2658                      .dwattr $C$DW$142, DW_AT_name("PCGCR1")
    2659                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PCGCR1")
    2660                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2661                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2662              $C$DW$143       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    2664                      .dwattr $C$DW$143, DW_AT_name("PCGCR2")
    2665                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PCGCR2")
    2666                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2667                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2668              $C$DW$144       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    2670                      .dwattr $C$DW$144, DW_AT_name("PSRCR")
    2671                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PSRCR")
    2672                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2673                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2674              $C$DW$145       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    2676                      .dwattr $C$DW$145, DW_AT_name("PRCR")
    2677                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PRCR")
    2678                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2679                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2680              $C$DW$146       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$37)
    2682                      .dwattr $C$DW$146, DW_AT_name("RSVD1")
    2683                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_RSVD1")
    2684                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   62

    2685                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2686              $C$DW$147       .dwtag  DW_TAG_member
    2687                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    2688                      .dwattr $C$DW$147, DW_AT_name("TIAFR")
    2689                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_TIAFR")
    2690                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2691                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2692              $C$DW$148       .dwtag  DW_TAG_member
    2693                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    2694                      .dwattr $C$DW$148, DW_AT_name("RSVD2")
    2695                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_RSVD2")
    2696                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2697                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2698              $C$DW$149       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    2700                      .dwattr $C$DW$149, DW_AT_name("ODSCR")
    2701                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ODSCR")
    2702                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2703                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2704              $C$DW$150       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    2706                      .dwattr $C$DW$150, DW_AT_name("PDINHIBR1")
    2707                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PDINHIBR1")
    2708                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2709                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2710              $C$DW$151       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    2712                      .dwattr $C$DW$151, DW_AT_name("PDINHIBR2")
    2713                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PDINHIBR2")
    2714                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2715                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2716              $C$DW$152       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    2718                      .dwattr $C$DW$152, DW_AT_name("PDINHIBR3")
    2719                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PDINHIBR3")
    2720                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2721                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2722              $C$DW$153       .dwtag  DW_TAG_member
    2723                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    2724                      .dwattr $C$DW$153, DW_AT_name("DMA0CESR1")
    2725                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_DMA0CESR1")
    2726                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2727                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2728              $C$DW$154       .dwtag  DW_TAG_member
    2729                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    2730                      .dwattr $C$DW$154, DW_AT_name("DMA0CESR2")
    2731                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_DMA0CESR2")
    2732                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2733                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2734              $C$DW$155       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    2736                      .dwattr $C$DW$155, DW_AT_name("DMA1CESR1")
    2737                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DMA1CESR1")
    2738                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2739                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   63

    2740              $C$DW$156       .dwtag  DW_TAG_member
    2741                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    2742                      .dwattr $C$DW$156, DW_AT_name("DMA1CESR2")
    2743                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_DMA1CESR2")
    2744                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2745                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2746              $C$DW$157       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    2748                      .dwattr $C$DW$157, DW_AT_name("SDRAMCCR")
    2749                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SDRAMCCR")
    2750                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2751                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2752              $C$DW$158       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    2754                      .dwattr $C$DW$158, DW_AT_name("CCR2")
    2755                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_CCR2")
    2756                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2757                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2758              $C$DW$159       .dwtag  DW_TAG_member
    2759                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    2760                      .dwattr $C$DW$159, DW_AT_name("CGCR1")
    2761                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_CGCR1")
    2762                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2763                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2764              $C$DW$160       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2766                      .dwattr $C$DW$160, DW_AT_name("CGICR")
    2767                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_CGICR")
    2768                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2769                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2770              $C$DW$161       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    2772                      .dwattr $C$DW$161, DW_AT_name("CGCR2")
    2773                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_CGCR2")
    2774                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2775                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2776              $C$DW$162       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2778                      .dwattr $C$DW$162, DW_AT_name("CGOCR")
    2779                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_CGOCR")
    2780                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2781                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2782              $C$DW$163       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2784                      .dwattr $C$DW$163, DW_AT_name("CCSSR")
    2785                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_CCSSR")
    2786                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2787                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2788              $C$DW$164       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2790                      .dwattr $C$DW$164, DW_AT_name("RSVD3")
    2791                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_RSVD3")
    2792                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2793                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2794              $C$DW$165       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   64

    2795                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    2796                      .dwattr $C$DW$165, DW_AT_name("ECDR")
    2797                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_ECDR")
    2798                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2799                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2800              $C$DW$166       .dwtag  DW_TAG_member
    2801                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2802                      .dwattr $C$DW$166, DW_AT_name("RSVD4")
    2803                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_RSVD4")
    2804                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2805                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2806              $C$DW$167       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2808                      .dwattr $C$DW$167, DW_AT_name("RAMSLPMDCNTLR1")
    2809                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2810                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2811                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2812              $C$DW$168       .dwtag  DW_TAG_member
    2813                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    2814                      .dwattr $C$DW$168, DW_AT_name("RSVD5")
    2815                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD5")
    2816                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2817                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2818              $C$DW$169       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    2820                      .dwattr $C$DW$169, DW_AT_name("RAMSLPMDCNTLR2")
    2821                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2822                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2823                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2824              $C$DW$170       .dwtag  DW_TAG_member
    2825                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    2826                      .dwattr $C$DW$170, DW_AT_name("RAMSLPMDCNTLR3")
    2827                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2828                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2829                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2830              $C$DW$171       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$20)
    2832                      .dwattr $C$DW$171, DW_AT_name("RAMSLPMDCNTLR4")
    2833                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2834                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2835                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2836              $C$DW$172       .dwtag  DW_TAG_member
    2837                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2838                      .dwattr $C$DW$172, DW_AT_name("RAMSLPMDCNTLR5")
    2839                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2840                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2841                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2842              $C$DW$173       .dwtag  DW_TAG_member
    2843                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$38)
    2844                      .dwattr $C$DW$173, DW_AT_name("RSVD6")
    2845                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD6")
    2846                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2847                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2848              $C$DW$174       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   65

    2850                      .dwattr $C$DW$174, DW_AT_name("DMAIFR")
    2851                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_DMAIFR")
    2852                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2853                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2854              $C$DW$175       .dwtag  DW_TAG_member
    2855                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    2856                      .dwattr $C$DW$175, DW_AT_name("DMAIER")
    2857                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_DMAIER")
    2858                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2859                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2860              $C$DW$176       .dwtag  DW_TAG_member
    2861                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    2862                      .dwattr $C$DW$176, DW_AT_name("USBSCR")
    2863                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_USBSCR")
    2864                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2865                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2866              $C$DW$177       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    2868                      .dwattr $C$DW$177, DW_AT_name("ESCR")
    2869                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_ESCR")
    2870                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2871                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2872              $C$DW$178       .dwtag  DW_TAG_member
    2873                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$38)
    2874                      .dwattr $C$DW$178, DW_AT_name("RSVD7")
    2875                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RSVD7")
    2876                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2877                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2878              $C$DW$179       .dwtag  DW_TAG_member
    2879                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    2880                      .dwattr $C$DW$179, DW_AT_name("DMA2CESR1")
    2881                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_DMA2CESR1")
    2882                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2883                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2884              $C$DW$180       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    2886                      .dwattr $C$DW$180, DW_AT_name("DMA2CESR2")
    2887                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_DMA2CESR2")
    2888                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2889                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2890              $C$DW$181       .dwtag  DW_TAG_member
    2891                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$20)
    2892                      .dwattr $C$DW$181, DW_AT_name("DMA3CESR1")
    2893                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_DMA3CESR1")
    2894                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2895                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2896              $C$DW$182       .dwtag  DW_TAG_member
    2897                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    2898                      .dwattr $C$DW$182, DW_AT_name("DMA3CESR2")
    2899                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DMA3CESR2")
    2900                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2901                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2902              $C$DW$183       .dwtag  DW_TAG_member
    2903                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    2904                      .dwattr $C$DW$183, DW_AT_name("CLKSTOP")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   66

    2905                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_CLKSTOP")
    2906                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2907                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2908              $C$DW$184       .dwtag  DW_TAG_member
    2909                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$39)
    2910                      .dwattr $C$DW$184, DW_AT_name("RSVD8")
    2911                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_RSVD8")
    2912                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2913                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2914              $C$DW$185       .dwtag  DW_TAG_member
    2915                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    2916                      .dwattr $C$DW$185, DW_AT_name("DIEIDR0")
    2917                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_DIEIDR0")
    2918                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2919                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2920              $C$DW$186       .dwtag  DW_TAG_member
    2921                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    2922                      .dwattr $C$DW$186, DW_AT_name("DIEIDR1")
    2923                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_DIEIDR1")
    2924                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2925                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2926              $C$DW$187       .dwtag  DW_TAG_member
    2927                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    2928                      .dwattr $C$DW$187, DW_AT_name("DIEIDR2")
    2929                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_DIEIDR2")
    2930                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2931                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2932              $C$DW$188       .dwtag  DW_TAG_member
    2933                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    2934                      .dwattr $C$DW$188, DW_AT_name("DIEIDR3")
    2935                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_DIEIDR3")
    2936                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2937                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2938              $C$DW$189       .dwtag  DW_TAG_member
    2939                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    2940                      .dwattr $C$DW$189, DW_AT_name("DIEIDR4")
    2941                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_DIEIDR4")
    2942                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2943                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2944              $C$DW$190       .dwtag  DW_TAG_member
    2945                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2946                      .dwattr $C$DW$190, DW_AT_name("DIEIDR5")
    2947                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DIEIDR5")
    2948                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2949                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2950              $C$DW$191       .dwtag  DW_TAG_member
    2951                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    2952                      .dwattr $C$DW$191, DW_AT_name("DIEIDR6")
    2953                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DIEIDR6")
    2954                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2955                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2956              $C$DW$192       .dwtag  DW_TAG_member
    2957                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    2958                      .dwattr $C$DW$192, DW_AT_name("DIEIDR7")
    2959                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_DIEIDR7")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:53 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sar.asm                                                          PAGE   67

    2960                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2961                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2962                      .dwendtag $C$DW$T$40
    2963              
    2964              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2965                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$40)
    2966                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2967              $C$DW$193       .dwtag  DW_TAG_TI_far_type
    2968                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$59)
    2969              $C$DW$194       .dwtag  DW_TAG_TI_ioport_type
    2970                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$193)
    2971              $C$DW$T$60      .dwtag  DW_TAG_volatile_type
    2972                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$194)
    2973              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    2974                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    2975                      .dwattr $C$DW$T$61, DW_AT_address_class(0x10)
    2976              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2977                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2978                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2979              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2980                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2981                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2982                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2983              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2984                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2985                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2986                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2987              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2988                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2989                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2990                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2991              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2992                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2993                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2994                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2995              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2996                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2997                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2998                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2999              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    3000                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$8)
    3001                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    3002              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    3003                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    3004                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3005              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    3006                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$64)
    3007                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    3008              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3009                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3010                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3011                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3012              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    3013                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    3014                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
