TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE    1

    5965              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 14 23:31:57 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    3594              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_16WORD"), DW_AT_const_value(0x04)
    3595                      .dwendtag $C$DW$T$70
    3596              
    3597              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMATxBurstLen")
    3598                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    3599                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3600              
    3601              $C$DW$T$72      .dwtag  DW_TAG_enumeration_type
    3602                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x01)
    3603              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_NONE"), DW_AT_const_value(0x00)
    3604              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_TX"), DW_AT_const_value(0x01)
    3605              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
    3606              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
    3607              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
    3608              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
    3609              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
    3610              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
    3611              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
    3612              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
    3613              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    3614              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
    3615              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
    3616              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    3617              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
    3618              $C$DW$294       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    3619              $C$DW$295       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   80

    3620              $C$DW$296       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    3621              $C$DW$297       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    3622              $C$DW$298       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    3623              $C$DW$299       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    3624              $C$DW$300       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    3625                      .dwendtag $C$DW$T$72
    3626              
    3627              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    3628                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    3629                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3630              
    3631              $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
    3632                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
    3633              $C$DW$301       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_POLLED"), DW_AT_const_value(0x00)
    3634              $C$DW$302       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_INTERRUPT"), DW_AT_const_value(0x01)
    3635              $C$DW$303       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_DMA"), DW_AT_const_value(0x02)
    3636              $C$DW$304       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_NONE"), DW_AT_const_value(0x03)
    3637                      .dwendtag $C$DW$T$85
    3638              
    3639              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDOpMode")
    3640                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3641                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3642              
    3643              $C$DW$T$96      .dwtag  DW_TAG_enumeration_type
    3644                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
    3645              $C$DW$305       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
    3646              $C$DW$306       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_BIG"), DW_AT_const_value(0x01)
    3647                      .dwendtag $C$DW$T$96
    3648              
    3649              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdEndianMode")
    3650                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    3651                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    3652              
    3653              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3654                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x75)
    3655              $C$DW$307       .dwtag  DW_TAG_member
    3656                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    3657                      .dwattr $C$DW$307, DW_AT_name("MMCCTL")
    3658                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_MMCCTL")
    3659                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3660                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3661              $C$DW$308       .dwtag  DW_TAG_member
    3662                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    3663                      .dwattr $C$DW$308, DW_AT_name("RSVD0")
    3664                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_RSVD0")
    3665                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3666                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3667              $C$DW$309       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
    3669                      .dwattr $C$DW$309, DW_AT_name("MMCCLK")
    3670                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_MMCCLK")
    3671                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3672                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3673              $C$DW$310       .dwtag  DW_TAG_member
    3674                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   81

    3675                      .dwattr $C$DW$310, DW_AT_name("RSVD1")
    3676                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_RSVD1")
    3677                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3678                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3679              $C$DW$311       .dwtag  DW_TAG_member
    3680                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
    3681                      .dwattr $C$DW$311, DW_AT_name("MMCST0")
    3682                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_MMCST0")
    3683                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3684                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3685              $C$DW$312       .dwtag  DW_TAG_member
    3686                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
    3687                      .dwattr $C$DW$312, DW_AT_name("RSVD2")
    3688                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_RSVD2")
    3689                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3690                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3691              $C$DW$313       .dwtag  DW_TAG_member
    3692                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    3693                      .dwattr $C$DW$313, DW_AT_name("MMCST1")
    3694                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_MMCST1")
    3695                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3696                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3697              $C$DW$314       .dwtag  DW_TAG_member
    3698                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    3699                      .dwattr $C$DW$314, DW_AT_name("RSVD3")
    3700                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_RSVD3")
    3701                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3702                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3703              $C$DW$315       .dwtag  DW_TAG_member
    3704                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
    3705                      .dwattr $C$DW$315, DW_AT_name("MMCIM")
    3706                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_MMCIM")
    3707                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3708                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3709              $C$DW$316       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
    3711                      .dwattr $C$DW$316, DW_AT_name("RSVD4")
    3712                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_RSVD4")
    3713                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3714                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3715              $C$DW$317       .dwtag  DW_TAG_member
    3716                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$20)
    3717                      .dwattr $C$DW$317, DW_AT_name("MMCTOR")
    3718                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_MMCTOR")
    3719                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3720                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3721              $C$DW$318       .dwtag  DW_TAG_member
    3722                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$21)
    3723                      .dwattr $C$DW$318, DW_AT_name("RSVD5")
    3724                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_RSVD5")
    3725                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3726                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3727              $C$DW$319       .dwtag  DW_TAG_member
    3728                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
    3729                      .dwattr $C$DW$319, DW_AT_name("MMCTOD")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   82

    3730                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_MMCTOD")
    3731                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3732                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3733              $C$DW$320       .dwtag  DW_TAG_member
    3734                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
    3735                      .dwattr $C$DW$320, DW_AT_name("RSVD6")
    3736                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_RSVD6")
    3737                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3738                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3739              $C$DW$321       .dwtag  DW_TAG_member
    3740                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
    3741                      .dwattr $C$DW$321, DW_AT_name("MMCBLEN")
    3742                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_MMCBLEN")
    3743                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3744                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3745              $C$DW$322       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    3747                      .dwattr $C$DW$322, DW_AT_name("RSVD7")
    3748                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_RSVD7")
    3749                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3750                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3751              $C$DW$323       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
    3753                      .dwattr $C$DW$323, DW_AT_name("MMCNBLK")
    3754                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_MMCNBLK")
    3755                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3756                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3757              $C$DW$324       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
    3759                      .dwattr $C$DW$324, DW_AT_name("RSVD8")
    3760                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_RSVD8")
    3761                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3762                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3763              $C$DW$325       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$20)
    3765                      .dwattr $C$DW$325, DW_AT_name("MMCNBLC")
    3766                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_MMCNBLC")
    3767                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3768                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3769              $C$DW$326       .dwtag  DW_TAG_member
    3770                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
    3771                      .dwattr $C$DW$326, DW_AT_name("RSVD9")
    3772                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_RSVD9")
    3773                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3774                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3775              $C$DW$327       .dwtag  DW_TAG_member
    3776                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    3777                      .dwattr $C$DW$327, DW_AT_name("MMCDRR1")
    3778                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_MMCDRR1")
    3779                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3780                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3781              $C$DW$328       .dwtag  DW_TAG_member
    3782                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
    3783                      .dwattr $C$DW$328, DW_AT_name("MMCDRR2")
    3784                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_MMCDRR2")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   83

    3785                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3786                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3787              $C$DW$329       .dwtag  DW_TAG_member
    3788                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$22)
    3789                      .dwattr $C$DW$329, DW_AT_name("RSVD10")
    3790                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_RSVD10")
    3791                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3792                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3793              $C$DW$330       .dwtag  DW_TAG_member
    3794                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    3795                      .dwattr $C$DW$330, DW_AT_name("MMCDXR1")
    3796                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_MMCDXR1")
    3797                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3798                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3799              $C$DW$331       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$20)
    3801                      .dwattr $C$DW$331, DW_AT_name("MMCDXR2")
    3802                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_MMCDXR2")
    3803                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    3804                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3805              $C$DW$332       .dwtag  DW_TAG_member
    3806                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$22)
    3807                      .dwattr $C$DW$332, DW_AT_name("RSVD11")
    3808                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_RSVD11")
    3809                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3810                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3811              $C$DW$333       .dwtag  DW_TAG_member
    3812                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
    3813                      .dwattr $C$DW$333, DW_AT_name("MMCCMD1")
    3814                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_MMCCMD1")
    3815                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3816                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3817              $C$DW$334       .dwtag  DW_TAG_member
    3818                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$20)
    3819                      .dwattr $C$DW$334, DW_AT_name("MMCCMD2")
    3820                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_MMCCMD2")
    3821                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3822                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3823              $C$DW$335       .dwtag  DW_TAG_member
    3824                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$22)
    3825                      .dwattr $C$DW$335, DW_AT_name("RSVD12")
    3826                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_RSVD12")
    3827                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3828                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3829              $C$DW$336       .dwtag  DW_TAG_member
    3830                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$20)
    3831                      .dwattr $C$DW$336, DW_AT_name("MMCARG1")
    3832                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_MMCARG1")
    3833                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3834                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3835              $C$DW$337       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$20)
    3837                      .dwattr $C$DW$337, DW_AT_name("MMCARG2")
    3838                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_MMCARG2")
    3839                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   84

    3840                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3841              $C$DW$338       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$22)
    3843                      .dwattr $C$DW$338, DW_AT_name("RSVD13")
    3844                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_RSVD13")
    3845                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3846                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3847              $C$DW$339       .dwtag  DW_TAG_member
    3848                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
    3849                      .dwattr $C$DW$339, DW_AT_name("MMCRSP0")
    3850                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_MMCRSP0")
    3851                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3852                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3853              $C$DW$340       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$20)
    3855                      .dwattr $C$DW$340, DW_AT_name("MMCRSP1")
    3856                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_MMCRSP1")
    3857                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    3858                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3859              $C$DW$341       .dwtag  DW_TAG_member
    3860                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$22)
    3861                      .dwattr $C$DW$341, DW_AT_name("RSVD14")
    3862                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_RSVD14")
    3863                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3864                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3865              $C$DW$342       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
    3867                      .dwattr $C$DW$342, DW_AT_name("MMCRSP2")
    3868                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_MMCRSP2")
    3869                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3870                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3871              $C$DW$343       .dwtag  DW_TAG_member
    3872                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$20)
    3873                      .dwattr $C$DW$343, DW_AT_name("MMCRSP3")
    3874                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_MMCRSP3")
    3875                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    3876                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3877              $C$DW$344       .dwtag  DW_TAG_member
    3878                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
    3879                      .dwattr $C$DW$344, DW_AT_name("RSVD15")
    3880                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_RSVD15")
    3881                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3882                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3883              $C$DW$345       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    3885                      .dwattr $C$DW$345, DW_AT_name("MMCRSP4")
    3886                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_MMCRSP4")
    3887                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3888                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3889              $C$DW$346       .dwtag  DW_TAG_member
    3890                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    3891                      .dwattr $C$DW$346, DW_AT_name("MMCRSP5")
    3892                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_MMCRSP5")
    3893                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    3894                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   85

    3895              $C$DW$347       .dwtag  DW_TAG_member
    3896                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$22)
    3897                      .dwattr $C$DW$347, DW_AT_name("RSVD16")
    3898                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_RSVD16")
    3899                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3900                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3901              $C$DW$348       .dwtag  DW_TAG_member
    3902                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    3903                      .dwattr $C$DW$348, DW_AT_name("MMCRSP6")
    3904                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_MMCRSP6")
    3905                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3906                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3907              $C$DW$349       .dwtag  DW_TAG_member
    3908                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    3909                      .dwattr $C$DW$349, DW_AT_name("MMCRSP7")
    3910                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_MMCRSP7")
    3911                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    3912                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3913              $C$DW$350       .dwtag  DW_TAG_member
    3914                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
    3915                      .dwattr $C$DW$350, DW_AT_name("RSVD17")
    3916                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_RSVD17")
    3917                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3918                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3919              $C$DW$351       .dwtag  DW_TAG_member
    3920                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    3921                      .dwattr $C$DW$351, DW_AT_name("MMCDRSP")
    3922                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_MMCDRSP")
    3923                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3924                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3925              $C$DW$352       .dwtag  DW_TAG_member
    3926                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
    3927                      .dwattr $C$DW$352, DW_AT_name("RSVD18")
    3928                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_RSVD18")
    3929                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    3930                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3931              $C$DW$353       .dwtag  DW_TAG_member
    3932                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    3933                      .dwattr $C$DW$353, DW_AT_name("MMCCIDX")
    3934                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_MMCCIDX")
    3935                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3936                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3937              $C$DW$354       .dwtag  DW_TAG_member
    3938                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$24)
    3939                      .dwattr $C$DW$354, DW_AT_name("RSVD19")
    3940                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_RSVD19")
    3941                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    3942                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3943              $C$DW$355       .dwtag  DW_TAG_member
    3944                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    3945                      .dwattr $C$DW$355, DW_AT_name("SDIOCTL")
    3946                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_SDIOCTL")
    3947                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3948                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3949              $C$DW$356       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   86

    3950                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$21)
    3951                      .dwattr $C$DW$356, DW_AT_name("RSVD20")
    3952                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_RSVD20")
    3953                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    3954                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3955              $C$DW$357       .dwtag  DW_TAG_member
    3956                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    3957                      .dwattr $C$DW$357, DW_AT_name("SDIOST0")
    3958                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_SDIOST0")
    3959                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3960                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3961              $C$DW$358       .dwtag  DW_TAG_member
    3962                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$21)
    3963                      .dwattr $C$DW$358, DW_AT_name("RSVD21")
    3964                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_RSVD21")
    3965                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    3966                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3967              $C$DW$359       .dwtag  DW_TAG_member
    3968                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    3969                      .dwattr $C$DW$359, DW_AT_name("SDIOIEN")
    3970                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_SDIOIEN")
    3971                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3972                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3973              $C$DW$360       .dwtag  DW_TAG_member
    3974                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$21)
    3975                      .dwattr $C$DW$360, DW_AT_name("RSVD22")
    3976                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_RSVD22")
    3977                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
    3978                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3979              $C$DW$361       .dwtag  DW_TAG_member
    3980                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    3981                      .dwattr $C$DW$361, DW_AT_name("SDIOIST")
    3982                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_SDIOIST")
    3983                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    3984                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3985              $C$DW$362       .dwtag  DW_TAG_member
    3986                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$21)
    3987                      .dwattr $C$DW$362, DW_AT_name("RSVD23")
    3988                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_RSVD23")
    3989                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    3990                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3991              $C$DW$363       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    3993                      .dwattr $C$DW$363, DW_AT_name("MMCFIFOCTL")
    3994                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_MMCFIFOCTL")
    3995                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3996                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3997                      .dwendtag $C$DW$T$25
    3998              
    3999              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
    4000                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$25)
    4001                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    4002              $C$DW$364       .dwtag  DW_TAG_TI_far_type
    4003                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$77)
    4004              $C$DW$365       .dwtag  DW_TAG_TI_ioport_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   87

    4005                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$364)
    4006              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
    4007                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$365)
    4008              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    4009                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    4010                      .dwattr $C$DW$T$79, DW_AT_address_class(0x10)
    4011              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
    4012                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    4013                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    4014              
    4015              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4016                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    4017              $C$DW$366       .dwtag  DW_TAG_member
    4018                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
    4019                      .dwattr $C$DW$366, DW_AT_name("mfgId")
    4020                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_mfgId")
    4021                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4022                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4023              $C$DW$367       .dwtag  DW_TAG_member
    4024                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    4025                      .dwattr $C$DW$367, DW_AT_name("oemAppId")
    4026                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_oemAppId")
    4027                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4028                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4029              $C$DW$368       .dwtag  DW_TAG_member
    4030                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$27)
    4031                      .dwattr $C$DW$368, DW_AT_name("productName")
    4032                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_productName")
    4033                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4034                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4035              $C$DW$369       .dwtag  DW_TAG_member
    4036                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    4037                      .dwattr $C$DW$369, DW_AT_name("productRev")
    4038                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_productRev")
    4039                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4040                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4041              $C$DW$370       .dwtag  DW_TAG_member
    4042                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$28)
    4043                      .dwattr $C$DW$370, DW_AT_name("serialNumber")
    4044                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_serialNumber")
    4045                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4046                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4047              $C$DW$371       .dwtag  DW_TAG_member
    4048                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
    4049                      .dwattr $C$DW$371, DW_AT_name("month")
    4050                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_month")
    4051                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4052                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4053              $C$DW$372       .dwtag  DW_TAG_member
    4054                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    4055                      .dwattr $C$DW$372, DW_AT_name("year")
    4056                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_year")
    4057                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4058                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4059              $C$DW$373       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   88

    4060                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$19)
    4061                      .dwattr $C$DW$373, DW_AT_name("checksum")
    4062                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_checksum")
    4063                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4064                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4065                      .dwendtag $C$DW$T$29
    4066              
    4067              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardIdObj")
    4068                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$29)
    4069                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4070              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    4071                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4072                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    4073              
    4074              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4075                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x22)
    4076              $C$DW$374       .dwtag  DW_TAG_member
    4077                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    4078                      .dwattr $C$DW$374, DW_AT_name("csdStruct")
    4079                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_csdStruct")
    4080                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4081                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4082              $C$DW$375       .dwtag  DW_TAG_member
    4083                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    4084                      .dwattr $C$DW$375, DW_AT_name("mmcProt")
    4085                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_mmcProt")
    4086                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4087                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4088              $C$DW$376       .dwtag  DW_TAG_member
    4089                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    4090                      .dwattr $C$DW$376, DW_AT_name("taac")
    4091                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_taac")
    4092                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4093                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4094              $C$DW$377       .dwtag  DW_TAG_member
    4095                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    4096                      .dwattr $C$DW$377, DW_AT_name("nsac")
    4097                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_nsac")
    4098                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4099                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4100              $C$DW$378       .dwtag  DW_TAG_member
    4101                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    4102                      .dwattr $C$DW$378, DW_AT_name("tranSpeed")
    4103                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_tranSpeed")
    4104                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4105                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4106              $C$DW$379       .dwtag  DW_TAG_member
    4107                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
    4108                      .dwattr $C$DW$379, DW_AT_name("ccc")
    4109                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ccc")
    4110                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4111                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4112              $C$DW$380       .dwtag  DW_TAG_member
    4113                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    4114                      .dwattr $C$DW$380, DW_AT_name("readBlLen")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   89

    4115                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_readBlLen")
    4116                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4117                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4118              $C$DW$381       .dwtag  DW_TAG_member
    4119                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    4120                      .dwattr $C$DW$381, DW_AT_name("readBlPartial")
    4121                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_readBlPartial")
    4122                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4123                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4124              $C$DW$382       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    4126                      .dwattr $C$DW$382, DW_AT_name("writeBlkMisalign")
    4127                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_writeBlkMisalign")
    4128                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4129                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4130              $C$DW$383       .dwtag  DW_TAG_member
    4131                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    4132                      .dwattr $C$DW$383, DW_AT_name("readBlkMisalign")
    4133                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_readBlkMisalign")
    4134                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4135                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4136              $C$DW$384       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
    4138                      .dwattr $C$DW$384, DW_AT_name("dsrImp")
    4139                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_dsrImp")
    4140                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4141                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4142              $C$DW$385       .dwtag  DW_TAG_member
    4143                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
    4144                      .dwattr $C$DW$385, DW_AT_name("cSize")
    4145                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_cSize")
    4146                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4147                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4148              $C$DW$386       .dwtag  DW_TAG_member
    4149                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    4150                      .dwattr $C$DW$386, DW_AT_name("vddRCurrMin")
    4151                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_vddRCurrMin")
    4152                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4153                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4154              $C$DW$387       .dwtag  DW_TAG_member
    4155                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
    4156                      .dwattr $C$DW$387, DW_AT_name("vddRCurrMax")
    4157                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_vddRCurrMax")
    4158                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4159                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4160              $C$DW$388       .dwtag  DW_TAG_member
    4161                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    4162                      .dwattr $C$DW$388, DW_AT_name("vddWCurrMin")
    4163                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_vddWCurrMin")
    4164                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4165                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4166              $C$DW$389       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    4168                      .dwattr $C$DW$389, DW_AT_name("vddWCurrMax")
    4169                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_vddWCurrMax")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   90

    4170                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4171                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4172              $C$DW$390       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
    4174                      .dwattr $C$DW$390, DW_AT_name("cSizeMult")
    4175                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_cSizeMult")
    4176                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4177                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4178              $C$DW$391       .dwtag  DW_TAG_member
    4179                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
    4180                      .dwattr $C$DW$391, DW_AT_name("eraseBlkEnable")
    4181                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_eraseBlkEnable")
    4182                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4183                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4184              $C$DW$392       .dwtag  DW_TAG_member
    4185                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
    4186                      .dwattr $C$DW$392, DW_AT_name("eraseGrpSize")
    4187                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_eraseGrpSize")
    4188                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4189                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4190              $C$DW$393       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
    4192                      .dwattr $C$DW$393, DW_AT_name("eraseGrpMult")
    4193                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_eraseGrpMult")
    4194                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    4195                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4196              $C$DW$394       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
    4198                      .dwattr $C$DW$394, DW_AT_name("wpGrpSize")
    4199                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_wpGrpSize")
    4200                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4201                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4202              $C$DW$395       .dwtag  DW_TAG_member
    4203                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    4204                      .dwattr $C$DW$395, DW_AT_name("wpGrpEnable")
    4205                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_wpGrpEnable")
    4206                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4207                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4208              $C$DW$396       .dwtag  DW_TAG_member
    4209                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    4210                      .dwattr $C$DW$396, DW_AT_name("defaultEcc")
    4211                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_defaultEcc")
    4212                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4213                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4214              $C$DW$397       .dwtag  DW_TAG_member
    4215                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    4216                      .dwattr $C$DW$397, DW_AT_name("r2wFactor")
    4217                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_r2wFactor")
    4218                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4219                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4220              $C$DW$398       .dwtag  DW_TAG_member
    4221                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    4222                      .dwattr $C$DW$398, DW_AT_name("writeBlLen")
    4223                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_writeBlLen")
    4224                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   91

    4225                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4226              $C$DW$399       .dwtag  DW_TAG_member
    4227                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$19)
    4228                      .dwattr $C$DW$399, DW_AT_name("writeBlPartial")
    4229                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_writeBlPartial")
    4230                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4231                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4232              $C$DW$400       .dwtag  DW_TAG_member
    4233                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    4234                      .dwattr $C$DW$400, DW_AT_name("contProtApp")
    4235                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_contProtApp")
    4236                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4237                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4238              $C$DW$401       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
    4240                      .dwattr $C$DW$401, DW_AT_name("fileFmtGrp")
    4241                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_fileFmtGrp")
    4242                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4243                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4244              $C$DW$402       .dwtag  DW_TAG_member
    4245                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    4246                      .dwattr $C$DW$402, DW_AT_name("copyFlag")
    4247                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_copyFlag")
    4248                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4249                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4250              $C$DW$403       .dwtag  DW_TAG_member
    4251                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    4252                      .dwattr $C$DW$403, DW_AT_name("permWriteProtect")
    4253                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_permWriteProtect")
    4254                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4255                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4256              $C$DW$404       .dwtag  DW_TAG_member
    4257                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    4258                      .dwattr $C$DW$404, DW_AT_name("tmpWriteProtect")
    4259                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_tmpWriteProtect")
    4260                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4261                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4262              $C$DW$405       .dwtag  DW_TAG_member
    4263                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    4264                      .dwattr $C$DW$405, DW_AT_name("fileFmt")
    4265                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_fileFmt")
    4266                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4267                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4268              $C$DW$406       .dwtag  DW_TAG_member
    4269                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    4270                      .dwattr $C$DW$406, DW_AT_name("ecc")
    4271                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_ecc")
    4272                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4273                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4274              $C$DW$407       .dwtag  DW_TAG_member
    4275                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    4276                      .dwattr $C$DW$407, DW_AT_name("crc")
    4277                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_crc")
    4278                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4279                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   92

    4280                      .dwendtag $C$DW$T$30
    4281              
    4282              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardCsdObj")
    4283                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$30)
    4284                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4285              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4286                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4287                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    4288              
    4289              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4290                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x06)
    4291              $C$DW$408       .dwtag  DW_TAG_member
    4292                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    4293                      .dwattr $C$DW$408, DW_AT_name("securitySysId")
    4294                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_securitySysId")
    4295                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4296                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4297              $C$DW$409       .dwtag  DW_TAG_member
    4298                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    4299                      .dwattr $C$DW$409, DW_AT_name("securitySysVers")
    4300                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_securitySysVers")
    4301                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4302                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4303              $C$DW$410       .dwtag  DW_TAG_member
    4304                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    4305                      .dwattr $C$DW$410, DW_AT_name("maxLicenses")
    4306                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_maxLicenses")
    4307                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4308                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4309              $C$DW$411       .dwtag  DW_TAG_member
    4310                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$28)
    4311                      .dwattr $C$DW$411, DW_AT_name("xStatus")
    4312                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_xStatus")
    4313                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4314                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4315                      .dwendtag $C$DW$T$31
    4316              
    4317              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardXCsdObj")
    4318                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
    4319                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4320              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4321                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    4322                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    4323              
    4324              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4325                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x1e)
    4326              $C$DW$412       .dwtag  DW_TAG_member
    4327                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    4328                      .dwattr $C$DW$412, DW_AT_name("rca")
    4329                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_rca")
    4330                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4331                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4332              $C$DW$413       .dwtag  DW_TAG_member
    4333                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    4334                      .dwattr $C$DW$413, DW_AT_name("ST0")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   93

    4335                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_ST0")
    4336                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4337                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4338              $C$DW$414       .dwtag  DW_TAG_member
    4339                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    4340                      .dwattr $C$DW$414, DW_AT_name("ST1")
    4341                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_ST1")
    4342                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4343                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4344              $C$DW$415       .dwtag  DW_TAG_member
    4345                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    4346                      .dwattr $C$DW$415, DW_AT_name("cardIndex")
    4347                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_cardIndex")
    4348                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4349                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4350              $C$DW$416       .dwtag  DW_TAG_member
    4351                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$28)
    4352                      .dwattr $C$DW$416, DW_AT_name("maxXfrRate")
    4353                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_maxXfrRate")
    4354                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4355                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4356              $C$DW$417       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$28)
    4358                      .dwattr $C$DW$417, DW_AT_name("readAccessTime")
    4359                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_readAccessTime")
    4360                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4361                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4362              $C$DW$418       .dwtag  DW_TAG_member
    4363                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$28)
    4364                      .dwattr $C$DW$418, DW_AT_name("cardCapacity")
    4365                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_cardCapacity")
    4366                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4367                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4368              $C$DW$419       .dwtag  DW_TAG_member
    4369                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$28)
    4370                      .dwattr $C$DW$419, DW_AT_name("blockLength")
    4371                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_blockLength")
    4372                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4373                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4374              $C$DW$420       .dwtag  DW_TAG_member
    4375                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$28)
    4376                      .dwattr $C$DW$420, DW_AT_name("totalSectors")
    4377                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_totalSectors")
    4378                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4379                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4380              $C$DW$421       .dwtag  DW_TAG_member
    4381                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$28)
    4382                      .dwattr $C$DW$421, DW_AT_name("lastAddrRead")
    4383                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_lastAddrRead")
    4384                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4385                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$422       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$28)
    4388                      .dwattr $C$DW$422, DW_AT_name("lastAddrWritten")
    4389                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_lastAddrWritten")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   94

    4390                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4391                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4392              $C$DW$423       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$33)
    4394                      .dwattr $C$DW$423, DW_AT_name("cardType")
    4395                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_cardType")
    4396                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4397                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4398              $C$DW$424       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$35)
    4400                      .dwattr $C$DW$424, DW_AT_name("cid")
    4401                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_cid")
    4402                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4403                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4404              $C$DW$425       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$37)
    4406                      .dwattr $C$DW$425, DW_AT_name("csd")
    4407                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_csd")
    4408                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4409                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$426       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$39)
    4412                      .dwattr $C$DW$426, DW_AT_name("xcsd")
    4413                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_xcsd")
    4414                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4415                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4416              $C$DW$427       .dwtag  DW_TAG_member
    4417                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$40)
    4418                      .dwattr $C$DW$427, DW_AT_name("sdHcDetected")
    4419                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_sdHcDetected")
    4420                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4421                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4422              $C$DW$428       .dwtag  DW_TAG_member
    4423                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$40)
    4424                      .dwattr $C$DW$428, DW_AT_name("cardAtaFsOpen")
    4425                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_cardAtaFsOpen")
    4426                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4427                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4428              $C$DW$429       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$19)
    4430                      .dwattr $C$DW$429, DW_AT_name("cardMscStatus")
    4431                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_cardMscStatus")
    4432                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4433                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4434                      .dwendtag $C$DW$T$41
    4435              
    4436              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardObj")
    4437                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$41)
    4438                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    4439              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    4440                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    4441                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
    4442              
    4443              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4444                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   95

    4445              $C$DW$430       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$45)
    4447                      .dwattr $C$DW$430, DW_AT_name("isr")
    4448                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_isr")
    4449                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4450                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4451                      .dwendtag $C$DW$T$46
    4452              
    4453              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackObj")
    4454                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$46)
    4455                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    4456              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    4457                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    4458                      .dwattr $C$DW$T$84, DW_AT_address_class(0x17)
    4459              
    4460              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4461                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x66)
    4462              $C$DW$431       .dwtag  DW_TAG_member
    4463                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    4464                      .dwattr $C$DW$431, DW_AT_name("DMACH0SSAL")
    4465                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_DMACH0SSAL")
    4466                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4467                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4468              $C$DW$432       .dwtag  DW_TAG_member
    4469                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    4470                      .dwattr $C$DW$432, DW_AT_name("DMACH0SSAU")
    4471                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_DMACH0SSAU")
    4472                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4473                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4474              $C$DW$433       .dwtag  DW_TAG_member
    4475                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    4476                      .dwattr $C$DW$433, DW_AT_name("DMACH0DSAL")
    4477                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_DMACH0DSAL")
    4478                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4479                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4480              $C$DW$434       .dwtag  DW_TAG_member
    4481                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    4482                      .dwattr $C$DW$434, DW_AT_name("DMACH0DSAU")
    4483                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_DMACH0DSAU")
    4484                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4485                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4486              $C$DW$435       .dwtag  DW_TAG_member
    4487                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    4488                      .dwattr $C$DW$435, DW_AT_name("DMACH0TCR1")
    4489                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_DMACH0TCR1")
    4490                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4491                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4492              $C$DW$436       .dwtag  DW_TAG_member
    4493                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    4494                      .dwattr $C$DW$436, DW_AT_name("DMACH0TCR2")
    4495                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_DMACH0TCR2")
    4496                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4497                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4498              $C$DW$437       .dwtag  DW_TAG_member
    4499                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$47)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   96

    4500                      .dwattr $C$DW$437, DW_AT_name("RSVD0")
    4501                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_RSVD0")
    4502                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4503                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4504              $C$DW$438       .dwtag  DW_TAG_member
    4505                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    4506                      .dwattr $C$DW$438, DW_AT_name("DMACH1SSAL")
    4507                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_DMACH1SSAL")
    4508                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4509                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4510              $C$DW$439       .dwtag  DW_TAG_member
    4511                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
    4512                      .dwattr $C$DW$439, DW_AT_name("DMACH1SSAU")
    4513                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_DMACH1SSAU")
    4514                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4515                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4516              $C$DW$440       .dwtag  DW_TAG_member
    4517                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    4518                      .dwattr $C$DW$440, DW_AT_name("DMACH1DSAL")
    4519                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_DMACH1DSAL")
    4520                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4521                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4522              $C$DW$441       .dwtag  DW_TAG_member
    4523                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$20)
    4524                      .dwattr $C$DW$441, DW_AT_name("DMACH1DSAU")
    4525                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_DMACH1DSAU")
    4526                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4527                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4528              $C$DW$442       .dwtag  DW_TAG_member
    4529                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
    4530                      .dwattr $C$DW$442, DW_AT_name("DMACH1TCR1")
    4531                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_DMACH1TCR1")
    4532                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4533                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4534              $C$DW$443       .dwtag  DW_TAG_member
    4535                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
    4536                      .dwattr $C$DW$443, DW_AT_name("DMACH1TCR2")
    4537                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_DMACH1TCR2")
    4538                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4539                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4540              $C$DW$444       .dwtag  DW_TAG_member
    4541                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$47)
    4542                      .dwattr $C$DW$444, DW_AT_name("RSVD1")
    4543                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD1")
    4544                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4545                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4546              $C$DW$445       .dwtag  DW_TAG_member
    4547                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
    4548                      .dwattr $C$DW$445, DW_AT_name("DMACH2SSAL")
    4549                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_DMACH2SSAL")
    4550                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4551                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4552              $C$DW$446       .dwtag  DW_TAG_member
    4553                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    4554                      .dwattr $C$DW$446, DW_AT_name("DMACH2SSAU")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   97

    4555                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_DMACH2SSAU")
    4556                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4557                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4558              $C$DW$447       .dwtag  DW_TAG_member
    4559                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    4560                      .dwattr $C$DW$447, DW_AT_name("DMACH2DSAL")
    4561                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_DMACH2DSAL")
    4562                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4563                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4564              $C$DW$448       .dwtag  DW_TAG_member
    4565                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
    4566                      .dwattr $C$DW$448, DW_AT_name("DMACH2DSAU")
    4567                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_DMACH2DSAU")
    4568                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4569                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4570              $C$DW$449       .dwtag  DW_TAG_member
    4571                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    4572                      .dwattr $C$DW$449, DW_AT_name("DMACH2TCR1")
    4573                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_DMACH2TCR1")
    4574                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4575                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4576              $C$DW$450       .dwtag  DW_TAG_member
    4577                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    4578                      .dwattr $C$DW$450, DW_AT_name("DMACH2TCR2")
    4579                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_DMACH2TCR2")
    4580                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4581                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4582              $C$DW$451       .dwtag  DW_TAG_member
    4583                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$47)
    4584                      .dwattr $C$DW$451, DW_AT_name("RSVD2")
    4585                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_RSVD2")
    4586                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4587                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4588              $C$DW$452       .dwtag  DW_TAG_member
    4589                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    4590                      .dwattr $C$DW$452, DW_AT_name("DMACH3SSAL")
    4591                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_DMACH3SSAL")
    4592                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4593                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4594              $C$DW$453       .dwtag  DW_TAG_member
    4595                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    4596                      .dwattr $C$DW$453, DW_AT_name("DMACH3SSAU")
    4597                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_DMACH3SSAU")
    4598                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    4599                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4600              $C$DW$454       .dwtag  DW_TAG_member
    4601                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    4602                      .dwattr $C$DW$454, DW_AT_name("DMACH3DSAL")
    4603                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_DMACH3DSAL")
    4604                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4605                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4606              $C$DW$455       .dwtag  DW_TAG_member
    4607                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    4608                      .dwattr $C$DW$455, DW_AT_name("DMACH3DSAU")
    4609                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_DMACH3DSAU")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   98

    4610                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4611                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4612              $C$DW$456       .dwtag  DW_TAG_member
    4613                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    4614                      .dwattr $C$DW$456, DW_AT_name("DMACH3TCR1")
    4615                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_DMACH3TCR1")
    4616                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4617                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4618              $C$DW$457       .dwtag  DW_TAG_member
    4619                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
    4620                      .dwattr $C$DW$457, DW_AT_name("DMACH3TCR2")
    4621                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_DMACH3TCR2")
    4622                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    4623                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4624                      .dwendtag $C$DW$T$48
    4625              
    4626              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    4627                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4628                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4629              $C$DW$458       .dwtag  DW_TAG_TI_far_type
    4630                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$49)
    4631              $C$DW$459       .dwtag  DW_TAG_TI_ioport_type
    4632                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$458)
    4633              $C$DW$T$50      .dwtag  DW_TAG_volatile_type
    4634                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$459)
    4635              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    4636                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    4637                      .dwattr $C$DW$T$51, DW_AT_address_class(0x10)
    4638              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    4639                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    4640                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4641              
    4642              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    4643                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x09)
    4644              $C$DW$460       .dwtag  DW_TAG_member
    4645                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$52)
    4646                      .dwattr $C$DW$460, DW_AT_name("dmaRegs")
    4647                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_dmaRegs")
    4648                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4649                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4650              $C$DW$461       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$54)
    4652                      .dwattr $C$DW$461, DW_AT_name("chanNum")
    4653                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_chanNum")
    4654                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4655                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4656              $C$DW$462       .dwtag  DW_TAG_member
    4657                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$56)
    4658                      .dwattr $C$DW$462, DW_AT_name("dmaInstNum")
    4659                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_dmaInstNum")
    4660                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4661                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4662              $C$DW$463       .dwtag  DW_TAG_member
    4663                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$40)
    4664                      .dwattr $C$DW$463, DW_AT_name("isChanFree")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE   99

    4665                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_isChanFree")
    4666                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4667                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4668              $C$DW$464       .dwtag  DW_TAG_member
    4669                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$58)
    4670                      .dwattr $C$DW$464, DW_AT_name("chanDir")
    4671                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_chanDir")
    4672                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4673                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4674              $C$DW$465       .dwtag  DW_TAG_member
    4675                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$60)
    4676                      .dwattr $C$DW$465, DW_AT_name("trigger")
    4677                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_trigger")
    4678                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4679                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4680              $C$DW$466       .dwtag  DW_TAG_member
    4681                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$62)
    4682                      .dwattr $C$DW$466, DW_AT_name("trfType")
    4683                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_trfType")
    4684                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4685                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4686              $C$DW$467       .dwtag  DW_TAG_member
    4687                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$64)
    4688                      .dwattr $C$DW$467, DW_AT_name("dmaInt")
    4689                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_dmaInt")
    4690                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4691                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4692              $C$DW$468       .dwtag  DW_TAG_member
    4693                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$40)
    4694                      .dwattr $C$DW$468, DW_AT_name("pingPongEnabled")
    4695                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_pingPongEnabled")
    4696                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4697                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4698                      .dwendtag $C$DW$T$65
    4699              
    4700              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    4701                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$65)
    4702                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4703              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    4704                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    4705                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
    4706              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    4707                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    4708                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    4709              
    4710              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    4711                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0e)
    4712              $C$DW$469       .dwtag  DW_TAG_member
    4713                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$67)
    4714                      .dwattr $C$DW$469, DW_AT_name("pingPongMode")
    4715                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_pingPongMode")
    4716                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4717                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4718              $C$DW$470       .dwtag  DW_TAG_member
    4719                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$69)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE  100

    4720                      .dwattr $C$DW$470, DW_AT_name("autoMode")
    4721                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_autoMode")
    4722                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4723                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4724              $C$DW$471       .dwtag  DW_TAG_member
    4725                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$71)
    4726                      .dwattr $C$DW$471, DW_AT_name("burstLen")
    4727                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_burstLen")
    4728                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4729                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4730              $C$DW$472       .dwtag  DW_TAG_member
    4731                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$60)
    4732                      .dwattr $C$DW$472, DW_AT_name("trigger")
    4733                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_trigger")
    4734                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4735                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4736              $C$DW$473       .dwtag  DW_TAG_member
    4737                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$73)
    4738                      .dwattr $C$DW$473, DW_AT_name("dmaEvt")
    4739                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_dmaEvt")
    4740                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4741                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4742              $C$DW$474       .dwtag  DW_TAG_member
    4743                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$64)
    4744                      .dwattr $C$DW$474, DW_AT_name("dmaInt")
    4745                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_dmaInt")
    4746                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4747                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4748              $C$DW$475       .dwtag  DW_TAG_member
    4749                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$58)
    4750                      .dwattr $C$DW$475, DW_AT_name("chanDir")
    4751                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_chanDir")
    4752                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4753                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4754              $C$DW$476       .dwtag  DW_TAG_member
    4755                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$62)
    4756                      .dwattr $C$DW$476, DW_AT_name("trfType")
    4757                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_trfType")
    4758                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4759                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4760              $C$DW$477       .dwtag  DW_TAG_member
    4761                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$19)
    4762                      .dwattr $C$DW$477, DW_AT_name("dataLen")
    4763                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_dataLen")
    4764                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4765                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4766              $C$DW$478       .dwtag  DW_TAG_member
    4767                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$28)
    4768                      .dwattr $C$DW$478, DW_AT_name("srcAddr")
    4769                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_srcAddr")
    4770                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4771                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4772              $C$DW$479       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$28)
    4774                      .dwattr $C$DW$479, DW_AT_name("destAddr")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 23:31:58 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd_ataIf.asm                                                  PAGE  101

    4775                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_destAddr")
    4776                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4777                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4778                      .dwendtag $C$DW$T$74
    4779              
    4780              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    4781                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$74)
    4782                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4783              
    4784              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4785                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    4786              $C$DW$480       .dwtag  DW_TAG_member
    4787                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    4788                      .dwattr $C$DW$480, DW_AT_name("slice127_112")
    4789                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_slice127_112")
    4790                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4791                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4792              $C$DW$481       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$19)
    4794                      .dwattr $C$DW$481, DW_AT_name("slice111_96")
