TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:36:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpio.asm                                                         PAGE    1

    2457              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 22 03:36:10 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1815              $C$DW$87        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN3"), DW_AT_const_value(0x03)
    1816              $C$DW$88        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN4"), DW_AT_const_value(0x04)
    1817              $C$DW$89        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN5"), DW_AT_const_value(0x05)
    1818              $C$DW$90        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN6"), DW_AT_const_value(0x06)
    1819              $C$DW$91        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN7"), DW_AT_const_value(0x07)
    1820              $C$DW$92        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN8"), DW_AT_const_value(0x08)
    1821              $C$DW$93        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN9"), DW_AT_const_value(0x09)
    1822              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN10"), DW_AT_const_value(0x0a)
    1823              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN11"), DW_AT_const_value(0x0b)
    1824              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN12"), DW_AT_const_value(0x0c)
    1825              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN13"), DW_AT_const_value(0x0d)
    1826              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN14"), DW_AT_const_value(0x0e)
    1827              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN15"), DW_AT_const_value(0x0f)
    1828              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN16"), DW_AT_const_value(0x10)
    1829              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN17"), DW_AT_const_value(0x11)
    1830              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN18"), DW_AT_const_value(0x12)
    1831              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN19"), DW_AT_const_value(0x13)
    1832              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN20"), DW_AT_const_value(0x14)
    1833              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN21"), DW_AT_const_value(0x15)
    1834              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN22"), DW_AT_const_value(0x16)
    1835              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN23"), DW_AT_const_value(0x17)
    1836              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN24"), DW_AT_const_value(0x18)
    1837              $C$DW$109       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN25"), DW_AT_const_value(0x19)
    1838              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN26"), DW_AT_const_value(0x1a)
    1839              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN27"), DW_AT_const_value(0x1b)
    1840              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN28"), DW_AT_const_value(0x1c)
    1841              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN29"), DW_AT_const_value(0x1d)
    1842              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN30"), DW_AT_const_value(0x1e)
    1843              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_PIN31"), DW_AT_const_value(0x1f)
    1844                      .dwendtag $C$DW$T$30
    1845              
    1846              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioPinNum")
    1847                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1848                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1849              
    1850              $C$DW$T$32      .dwtag  DW_TAG_enumeration_type
    1851                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1852              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_DIR_INPUT"), DW_AT_const_value(0x00)
    1853              $C$DW$117       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_DIR_OUTPUT"), DW_AT_const_value(0x01)
    1854                      .dwendtag $C$DW$T$32
    1855              
    1856              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioDirection")
    1857                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1858                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1859              
    1860              $C$DW$T$34      .dwtag  DW_TAG_enumeration_type
    1861                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1862              $C$DW$118       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_RISING_EDGE"), DW_AT_const_value(0x00)
    1863              $C$DW$119       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_FALLING_EDGE"), DW_AT_const_value(0x01)
    1864              $C$DW$120       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_GPIO_TRIG_CLEAR_EDGE"), DW_AT_const_value(0x02)
    1865                      .dwendtag $C$DW$T$34
    1866              
    1867              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioTriggerType")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:36:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpio.asm                                                         PAGE   41

    1868                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1869                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1870              
    1871              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1872                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x12)
    1873              $C$DW$121       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1875                      .dwattr $C$DW$121, DW_AT_name("RSVD0")
    1876                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_RSVD0")
    1877                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1878                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1879              $C$DW$122       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    1881                      .dwattr $C$DW$122, DW_AT_name("IODIR1")
    1882                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_IODIR1")
    1883                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1884                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1885              $C$DW$123       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    1887                      .dwattr $C$DW$123, DW_AT_name("IODIR2")
    1888                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_IODIR2")
    1889                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1890                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$124       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    1893                      .dwattr $C$DW$124, DW_AT_name("IOINDATA1")
    1894                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_IOINDATA1")
    1895                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1896                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1897              $C$DW$125       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1899                      .dwattr $C$DW$125, DW_AT_name("IOINDATA2")
    1900                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_IOINDATA2")
    1901                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1902                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$126       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1905                      .dwattr $C$DW$126, DW_AT_name("IOOUTDATA1")
    1906                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_IOOUTDATA1")
    1907                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1908                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$127       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    1911                      .dwattr $C$DW$127, DW_AT_name("IOOUTDATA2")
    1912                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_IOOUTDATA2")
    1913                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1914                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$128       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1917                      .dwattr $C$DW$128, DW_AT_name("IOINTEDG1")
    1918                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_IOINTEDG1")
    1919                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1920                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1921              $C$DW$129       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:36:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpio.asm                                                         PAGE   42

    1923                      .dwattr $C$DW$129, DW_AT_name("IOINTEDG2")
    1924                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_IOINTEDG2")
    1925                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1926                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$130       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1929                      .dwattr $C$DW$130, DW_AT_name("IOINTEN1")
    1930                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IOINTEN1")
    1931                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1932                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1933              $C$DW$131       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    1935                      .dwattr $C$DW$131, DW_AT_name("IOINTEN2")
    1936                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_IOINTEN2")
    1937                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1938                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$132       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1941                      .dwattr $C$DW$132, DW_AT_name("IOINTFLG1")
    1942                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_IOINTFLG1")
    1943                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1944                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$133       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1947                      .dwattr $C$DW$133, DW_AT_name("IOINTFLG2")
    1948                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_IOINTFLG2")
    1949                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1950                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1951                      .dwendtag $C$DW$T$22
    1952              
    1953              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegs")
    1954                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1955                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1956              $C$DW$134       .dwtag  DW_TAG_TI_far_type
    1957                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$23)
    1958              $C$DW$135       .dwtag  DW_TAG_TI_ioport_type
    1959                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$134)
    1960              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    1961                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$135)
    1962              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    1963                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1964                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    1965              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioRegsOvly")
    1966                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1967                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1968              
    1969              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1970                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1971              $C$DW$136       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$26)
    1973                      .dwattr $C$DW$136, DW_AT_name("baseAddr")
    1974                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_baseAddr")
    1975                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1976                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1977              $C$DW$137       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:36:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpio.asm                                                         PAGE   43

    1978                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    1979                      .dwattr $C$DW$137, DW_AT_name("numPins")
    1980                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_numPins")
    1981                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1982                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1983                      .dwendtag $C$DW$T$28
    1984              
    1985              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioObj")
    1986                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$28)
    1987                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1988              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    1989                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1990                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    1991              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1992                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1993                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1994              
    1995              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1996                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x06)
    1997              $C$DW$138       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1999                      .dwattr $C$DW$138, DW_AT_name("GPIODIRL")
    2000                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIODIRL")
    2001                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2003              $C$DW$139       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    2005                      .dwattr $C$DW$139, DW_AT_name("GPIODIRH")
    2006                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIODIRH")
    2007                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2008                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2009              $C$DW$140       .dwtag  DW_TAG_member
    2010                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    2011                      .dwattr $C$DW$140, DW_AT_name("GPIOINTTRIGL")
    2012                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIOINTTRIGL")
    2013                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2014                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2015              $C$DW$141       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    2017                      .dwattr $C$DW$141, DW_AT_name("GPIOINTTRIGH")
    2018                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIOINTTRIGH")
    2019                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2020                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2021              $C$DW$142       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    2023                      .dwattr $C$DW$142, DW_AT_name("GPIOINTENAL")
    2024                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIOINTENAL")
    2025                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2026                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2027              $C$DW$143       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    2029                      .dwattr $C$DW$143, DW_AT_name("GPIOINTENAH")
    2030                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIOINTENAH")
    2031                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2032                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:36:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpio.asm                                                         PAGE   44

    2033                      .dwendtag $C$DW$T$29
    2034              
    2035              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioConfig")
    2036                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$29)
    2037                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2038              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    2039                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2040                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    2041              
    2042              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2043                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x03)
    2044              $C$DW$144       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
    2046                      .dwattr $C$DW$144, DW_AT_name("pinNum")
    2047                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_pinNum")
    2048                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2049                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2050              $C$DW$145       .dwtag  DW_TAG_member
    2051                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$33)
    2052                      .dwattr $C$DW$145, DW_AT_name("direction")
    2053                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_direction")
    2054                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2055                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2056              $C$DW$146       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$35)
    2058                      .dwattr $C$DW$146, DW_AT_name("trigger")
    2059                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_trigger")
    2060                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2061                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2062                      .dwendtag $C$DW$T$36
    2063              
    2064              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GpioPinConfig")
    2065                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$36)
    2066                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2067              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    2068                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    2069                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    2070              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2071                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2072                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2073                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2074              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2075                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2076                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2077                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2078              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2079                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2080                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2081                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2082              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    2083                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    2084                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2085              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2086                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2087                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
TMS320C55x Assembler PC v4.4.1 Sat Sep 22 03:36:11 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpio.asm                                                         PAGE   45

    2088                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2089              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2090                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2091                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2092                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2093              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2094                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$8)
    2095                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2096              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2097                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2098                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2099              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2100                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2101                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    2102              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2103                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2104                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2105                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2106              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    2107                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2108                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2109              $C$DW$147       .dwtag  DW_TAG_TI_far_type
    2110                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2111              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
