TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE    1

    2647              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Thu Sep 20 01:44:11 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    1642              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_LENGTH_31"), DW_AT_const_value(0x1e)
    1643              $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_LENGTH_32"), DW_AT_const_value(0x1f)
    1644              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_MAX_WORD_LEN"), DW_AT_const_value(0x20)
    1645                      .dwendtag $C$DW$T$25
    1646              
    1647              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_WordLen")
    1648                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1649                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1650              
    1651              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
    1652                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1653              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_IRQ_DISABLE"), DW_AT_const_value(0x00)
    1654              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WORD_IRQ_ENABLE"), DW_AT_const_value(0x01)
    1655                      .dwendtag $C$DW$T$27
    1656              
    1657              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_WordCntEnb")
    1658                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1659                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1660              
    1661              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
    1662                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1663              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FRAME_IRQ_DISABLE"), DW_AT_const_value(0x00)
    1664              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_FRAME_IRQ_ENABLE"), DW_AT_const_value(0x01)
    1665                      .dwendtag $C$DW$T$29
    1666              
    1667              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_FrameCntEnb")
    1668                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1669                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1670              
    1671              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
    1672                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1673              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_0"), DW_AT_const_value(0x00)
    1674              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_1"), DW_AT_const_value(0x01)
    1675              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_2"), DW_AT_const_value(0x02)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   37

    1676              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_3"), DW_AT_const_value(0x03)
    1677              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_DATA_DLY_UNKNOWN"), DW_AT_const_value(0x04)
    1678                      .dwendtag $C$DW$T$31
    1679              
    1680              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_DataDly")
    1681                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1682                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1683              
    1684              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
    1685                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1686              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLKP_LOW_AT_IDLE"), DW_AT_const_value(0x00)
    1687              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLKP_HIGH_AT_IDLE"), DW_AT_const_value(0x01)
    1688                      .dwendtag $C$DW$T$33
    1689              
    1690              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity")
    1691                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1692                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1693              
    1694              $C$DW$T$35      .dwtag  DW_TAG_enumeration_type
    1695                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1696              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CSP_ACTIVE_LOW"), DW_AT_const_value(0x00)
    1697              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CSP_ACTIVE_HIGH"), DW_AT_const_value(0x01)
    1698                      .dwendtag $C$DW$T$35
    1699              
    1700              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ChipSelPol")
    1701                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1702                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1703              
    1704              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    1705                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1706              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLK_PH_FALL_EDGE"), DW_AT_const_value(0x00)
    1707              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_CLK_PH_RISE_EDGE"), DW_AT_const_value(0x01)
    1708                      .dwendtag $C$DW$T$37
    1709              
    1710              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPh")
    1711                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1712                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1713              
    1714              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1715                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x03)
    1716              $C$DW$154       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$154, DW_AT_name("configured")
    1719                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_configured")
    1720                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1721                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1722              $C$DW$155       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    1724                      .dwattr $C$DW$155, DW_AT_name("mode")
    1725                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_mode")
    1726                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1727                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1728              $C$DW$156       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
    1730                      .dwattr $C$DW$156, DW_AT_name("opMode")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   38

    1731                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_opMode")
    1732                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1733                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1734                      .dwendtag $C$DW$T$24
    1735              
    1736              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiObj")
    1737                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$24)
    1738                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1739              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1740                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    1741                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    1742              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiHandle")
    1743                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1744                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1745              
    1746              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1747                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    1748              $C$DW$157       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$157, DW_AT_name("spiClkDiv")
    1751                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_spiClkDiv")
    1752                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1753                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1754              $C$DW$158       .dwtag  DW_TAG_member
    1755                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$26)
    1756                      .dwattr $C$DW$158, DW_AT_name("wLen")
    1757                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_wLen")
    1758                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1759                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1760              $C$DW$159       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1762                      .dwattr $C$DW$159, DW_AT_name("frLen")
    1763                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_frLen")
    1764                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1765                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1766              $C$DW$160       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$28)
    1768                      .dwattr $C$DW$160, DW_AT_name("wcEnable")
    1769                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_wcEnable")
    1770                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1771                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1772              $C$DW$161       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$30)
    1774                      .dwattr $C$DW$161, DW_AT_name("fcEnable")
    1775                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_fcEnable")
    1776                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1777                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1778              $C$DW$162       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    1780                      .dwattr $C$DW$162, DW_AT_name("csNum")
    1781                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_csNum")
    1782                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1783                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1784              $C$DW$163       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$32)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   39

    1786                      .dwattr $C$DW$163, DW_AT_name("dataDelay")
    1787                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_dataDelay")
    1788                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1789                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1790              $C$DW$164       .dwtag  DW_TAG_member
    1791                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$34)
    1792                      .dwattr $C$DW$164, DW_AT_name("clkPol")
    1793                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_clkPol")
    1794                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1795                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1796              $C$DW$165       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$36)
    1798                      .dwattr $C$DW$165, DW_AT_name("csPol")
    1799                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_csPol")
    1800                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1801                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1802              $C$DW$166       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$38)
    1804                      .dwattr $C$DW$166, DW_AT_name("clkPh")
    1805                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_clkPh")
    1806                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1807                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1808                      .dwendtag $C$DW$T$39
    1809              
    1810              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Config")
    1811                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
    1812                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1813              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    1814                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    1815                      .dwattr $C$DW$T$51, DW_AT_address_class(0x17)
    1816              
    1817              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1818                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x48)
    1819              $C$DW$167       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$40)
    1821                      .dwattr $C$DW$167, DW_AT_name("EBSR")
    1822                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_EBSR")
    1823                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1824                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$168       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$40)
    1827                      .dwattr $C$DW$168, DW_AT_name("RSVD0")
    1828                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD0")
    1829                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1830                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$169       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$40)
    1833                      .dwattr $C$DW$169, DW_AT_name("PCGCR1")
    1834                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PCGCR1")
    1835                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1836                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$170       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$40)
    1839                      .dwattr $C$DW$170, DW_AT_name("PCGCR2")
    1840                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PCGCR2")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   40

    1841                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1842                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$171       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$40)
    1845                      .dwattr $C$DW$171, DW_AT_name("PSRCR")
    1846                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PSRCR")
    1847                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1848                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$172       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$40)
    1851                      .dwattr $C$DW$172, DW_AT_name("PRCR")
    1852                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PRCR")
    1853                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1854                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$173       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$41)
    1857                      .dwattr $C$DW$173, DW_AT_name("RSVD1")
    1858                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD1")
    1859                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1860                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$174       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$40)
    1863                      .dwattr $C$DW$174, DW_AT_name("TIAFR")
    1864                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_TIAFR")
    1865                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1866                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1867              $C$DW$175       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$40)
    1869                      .dwattr $C$DW$175, DW_AT_name("RSVD2")
    1870                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD2")
    1871                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1872                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1873              $C$DW$176       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$40)
    1875                      .dwattr $C$DW$176, DW_AT_name("ODSCR")
    1876                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ODSCR")
    1877                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1878                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1879              $C$DW$177       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$40)
    1881                      .dwattr $C$DW$177, DW_AT_name("PDINHIBR1")
    1882                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PDINHIBR1")
    1883                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1884                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1885              $C$DW$178       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$40)
    1887                      .dwattr $C$DW$178, DW_AT_name("PDINHIBR2")
    1888                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PDINHIBR2")
    1889                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1890                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$179       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$40)
    1893                      .dwattr $C$DW$179, DW_AT_name("PDINHIBR3")
    1894                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PDINHIBR3")
    1895                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   41

    1896                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1897              $C$DW$180       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$40)
    1899                      .dwattr $C$DW$180, DW_AT_name("DMA0CESR1")
    1900                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_DMA0CESR1")
    1901                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1902                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$181       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$40)
    1905                      .dwattr $C$DW$181, DW_AT_name("DMA0CESR2")
    1906                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_DMA0CESR2")
    1907                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1908                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$182       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    1911                      .dwattr $C$DW$182, DW_AT_name("DMA1CESR1")
    1912                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DMA1CESR1")
    1913                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1914                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$183       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$40)
    1917                      .dwattr $C$DW$183, DW_AT_name("DMA1CESR2")
    1918                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DMA1CESR2")
    1919                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1920                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1921              $C$DW$184       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    1923                      .dwattr $C$DW$184, DW_AT_name("SDRAMCCR")
    1924                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SDRAMCCR")
    1925                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1926                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$185       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$40)
    1929                      .dwattr $C$DW$185, DW_AT_name("CCR2")
    1930                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CCR2")
    1931                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1932                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1933              $C$DW$186       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$40)
    1935                      .dwattr $C$DW$186, DW_AT_name("CGCR1")
    1936                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_CGCR1")
    1937                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1938                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$187       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$40)
    1941                      .dwattr $C$DW$187, DW_AT_name("CGICR")
    1942                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_CGICR")
    1943                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1944                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$188       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$40)
    1947                      .dwattr $C$DW$188, DW_AT_name("CGCR2")
    1948                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CGCR2")
    1949                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1950                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   42

    1951              $C$DW$189       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$40)
    1953                      .dwattr $C$DW$189, DW_AT_name("CGOCR")
    1954                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CGOCR")
    1955                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1956                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$190       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$40)
    1959                      .dwattr $C$DW$190, DW_AT_name("CCSSR")
    1960                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CCSSR")
    1961                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1962                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$191       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$40)
    1965                      .dwattr $C$DW$191, DW_AT_name("RSVD3")
    1966                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_RSVD3")
    1967                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1968                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$192       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$40)
    1971                      .dwattr $C$DW$192, DW_AT_name("ECDR")
    1972                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_ECDR")
    1973                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1974                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1975              $C$DW$193       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$40)
    1977                      .dwattr $C$DW$193, DW_AT_name("RSVD4")
    1978                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_RSVD4")
    1979                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1980                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$194       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$40)
    1983                      .dwattr $C$DW$194, DW_AT_name("RAMSLPMDCNTLR1")
    1984                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1985                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1986                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1987              $C$DW$195       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$40)
    1989                      .dwattr $C$DW$195, DW_AT_name("RSVD5")
    1990                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_RSVD5")
    1991                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1992                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1993              $C$DW$196       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$40)
    1995                      .dwattr $C$DW$196, DW_AT_name("RAMSLPMDCNTLR2")
    1996                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1997                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1998                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$197       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$40)
    2001                      .dwattr $C$DW$197, DW_AT_name("RAMSLPMDCNTLR3")
    2002                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2003                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2004                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2005              $C$DW$198       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   43

    2006                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$40)
    2007                      .dwattr $C$DW$198, DW_AT_name("RAMSLPMDCNTLR4")
    2008                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2009                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2010                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$199       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$40)
    2013                      .dwattr $C$DW$199, DW_AT_name("RAMSLPMDCNTLR5")
    2014                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2015                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2016                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2017              $C$DW$200       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$42)
    2019                      .dwattr $C$DW$200, DW_AT_name("RSVD6")
    2020                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_RSVD6")
    2021                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2022                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2023              $C$DW$201       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$40)
    2025                      .dwattr $C$DW$201, DW_AT_name("DMAIFR")
    2026                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_DMAIFR")
    2027                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2028                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2029              $C$DW$202       .dwtag  DW_TAG_member
    2030                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$40)
    2031                      .dwattr $C$DW$202, DW_AT_name("DMAIER")
    2032                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_DMAIER")
    2033                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2034                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2035              $C$DW$203       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$40)
    2037                      .dwattr $C$DW$203, DW_AT_name("USBSCR")
    2038                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_USBSCR")
    2039                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2040                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2041              $C$DW$204       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$40)
    2043                      .dwattr $C$DW$204, DW_AT_name("ESCR")
    2044                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ESCR")
    2045                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2046                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2047              $C$DW$205       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$42)
    2049                      .dwattr $C$DW$205, DW_AT_name("RSVD7")
    2050                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_RSVD7")
    2051                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2052                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2053              $C$DW$206       .dwtag  DW_TAG_member
    2054                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$40)
    2055                      .dwattr $C$DW$206, DW_AT_name("DMA2CESR1")
    2056                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_DMA2CESR1")
    2057                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2058                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2059              $C$DW$207       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$40)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   44

    2061                      .dwattr $C$DW$207, DW_AT_name("DMA2CESR2")
    2062                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_DMA2CESR2")
    2063                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2064                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2065              $C$DW$208       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$40)
    2067                      .dwattr $C$DW$208, DW_AT_name("DMA3CESR1")
    2068                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_DMA3CESR1")
    2069                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2070                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2071              $C$DW$209       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$40)
    2073                      .dwattr $C$DW$209, DW_AT_name("DMA3CESR2")
    2074                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_DMA3CESR2")
    2075                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2076                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2077              $C$DW$210       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$40)
    2079                      .dwattr $C$DW$210, DW_AT_name("CLKSTOP")
    2080                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_CLKSTOP")
    2081                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2082                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2083              $C$DW$211       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$43)
    2085                      .dwattr $C$DW$211, DW_AT_name("RSVD8")
    2086                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RSVD8")
    2087                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2088                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2089              $C$DW$212       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$40)
    2091                      .dwattr $C$DW$212, DW_AT_name("DIEIDR0")
    2092                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_DIEIDR0")
    2093                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2094                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2095              $C$DW$213       .dwtag  DW_TAG_member
    2096                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$40)
    2097                      .dwattr $C$DW$213, DW_AT_name("DIEIDR1")
    2098                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_DIEIDR1")
    2099                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2100                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2101              $C$DW$214       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$40)
    2103                      .dwattr $C$DW$214, DW_AT_name("DIEIDR2")
    2104                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DIEIDR2")
    2105                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2106                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2107              $C$DW$215       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$40)
    2109                      .dwattr $C$DW$215, DW_AT_name("DIEIDR3")
    2110                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DIEIDR3")
    2111                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2112                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2113              $C$DW$216       .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$40)
    2115                      .dwattr $C$DW$216, DW_AT_name("DIEIDR4")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   45

    2116                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DIEIDR4")
    2117                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2118                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2119              $C$DW$217       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$40)
    2121                      .dwattr $C$DW$217, DW_AT_name("DIEIDR5")
    2122                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_DIEIDR5")
    2123                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2124                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2125              $C$DW$218       .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$40)
    2127                      .dwattr $C$DW$218, DW_AT_name("DIEIDR6")
    2128                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_DIEIDR6")
    2129                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2130                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2131              $C$DW$219       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$40)
    2133                      .dwattr $C$DW$219, DW_AT_name("DIEIDR7")
    2134                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_DIEIDR7")
    2135                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2136                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2137                      .dwendtag $C$DW$T$44
    2138              
    2139              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2140                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$44)
    2141                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2142              $C$DW$220       .dwtag  DW_TAG_TI_far_type
    2143                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$52)
    2144              $C$DW$221       .dwtag  DW_TAG_TI_ioport_type
    2145                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$220)
    2146              $C$DW$T$53      .dwtag  DW_TAG_volatile_type
    2147                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$221)
    2148              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    2149                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    2150                      .dwattr $C$DW$T$54, DW_AT_address_class(0x10)
    2151              
    2152              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2153                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x0a)
    2154              $C$DW$222       .dwtag  DW_TAG_member
    2155                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$40)
    2156                      .dwattr $C$DW$222, DW_AT_name("SPICDR")
    2157                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_SPICDR")
    2158                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2159                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2160              $C$DW$223       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$40)
    2162                      .dwattr $C$DW$223, DW_AT_name("SPICCR")
    2163                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_SPICCR")
    2164                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2165                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$224       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$40)
    2168                      .dwattr $C$DW$224, DW_AT_name("SPIDCR1")
    2169                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_SPIDCR1")
    2170                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   46

    2171                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2172              $C$DW$225       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$40)
    2174                      .dwattr $C$DW$225, DW_AT_name("SPIDCR2")
    2175                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_SPIDCR2")
    2176                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2177                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2178              $C$DW$226       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$40)
    2180                      .dwattr $C$DW$226, DW_AT_name("SPICMD1")
    2181                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_SPICMD1")
    2182                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2183                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2184              $C$DW$227       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$40)
    2186                      .dwattr $C$DW$227, DW_AT_name("SPICMD2")
    2187                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_SPICMD2")
    2188                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2189                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2190              $C$DW$228       .dwtag  DW_TAG_member
    2191                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$40)
    2192                      .dwattr $C$DW$228, DW_AT_name("SPISTAT1")
    2193                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_SPISTAT1")
    2194                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2195                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2196              $C$DW$229       .dwtag  DW_TAG_member
    2197                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$40)
    2198                      .dwattr $C$DW$229, DW_AT_name("SPISTAT2")
    2199                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_SPISTAT2")
    2200                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2201                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2202              $C$DW$230       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$40)
    2204                      .dwattr $C$DW$230, DW_AT_name("SPIDR1")
    2205                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_SPIDR1")
    2206                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2207                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2208              $C$DW$231       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$40)
    2210                      .dwattr $C$DW$231, DW_AT_name("SPIDR2")
    2211                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_SPIDR2")
    2212                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2213                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2214                      .dwendtag $C$DW$T$45
    2215              
    2216              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiRegs")
    2217                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$45)
    2218                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2219              $C$DW$232       .dwtag  DW_TAG_TI_far_type
    2220                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$55)
    2221              $C$DW$233       .dwtag  DW_TAG_TI_ioport_type
    2222                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$232)
    2223              $C$DW$T$56      .dwtag  DW_TAG_volatile_type
    2224                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$233)
    2225              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:44:12 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_spi.asm                                                          PAGE   47

    2226                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2227                      .dwattr $C$DW$T$57, DW_AT_address_class(0x10)
    2228              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SpiRegsOvly")
    2229                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2230                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2231              
    2232              $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
    2233                      .dwattr $C$DW$T$59, DW_AT_name("SPI_Command")
    2234                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x01)
    2235              $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_RSVD_CMD"), DW_AT_const_value(0x00)
    2236              $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_READ"), DW_AT_const_value(0x01)
    2237              $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_WRITE"), DW_AT_const_value(0x02)
    2238              $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_RSVD1_CMD"), DW_AT_const_value(0x03)
    2239                      .dwendtag $C$DW$T$59
    2240              
    2241              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Command")
    2242                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2243                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2244              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2245                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2246                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2247                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2248              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2249                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2250                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2251                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2252              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2253                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2254                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2255                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2256              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2257                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2258                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2259                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2260              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2261                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2262                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2263                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
