TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE    1

    3788              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 14 03:54:50 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2761                                                      ; branch occurs ; |1229| 
    2762 0008ab       $C$L89:    
    2763                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_rtc.c",line 1232,column 3,is_stmt
    2764 0008ab E604          MOV #-6, *SP(#2) ; |1232| 
         0008ad FA   
    2765 0008ae       $C$L90:    
    2766                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_rtc.c",line 1235,column 2,is_stmt
    2767 0008ae A404          MOV *SP(#2), T0 ; |1235| 
    2768                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_rtc.c",line 1236,column 1,is_stmt
    2769 0008b0 4E05          AADD #5, SP
    2770                      .dwcfi  cfa_offset, 1
    2771              $C$DW$165       .dwtag  DW_TAG_TI_branch
    2772                      .dwattr $C$DW$165, DW_AT_low_pc(0x00)
    2773                      .dwattr $C$DW$165, DW_AT_TI_return
    2774 0008b2 4804          RET
    2775                                                      ; return occurs
    2776                      .dwattr $C$DW$157, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_rtc.c")
    2777                      .dwattr $C$DW$157, DW_AT_TI_end_line(0x4d4)
    2778                      .dwattr $C$DW$157, DW_AT_TI_end_column(0x01)
    2779                      .dwendentry
    2780                      .dwendtag $C$DW$157
    2781              
    2782              
    2783              ;*******************************************************************************
    2784              ;* TYPE INFORMATION                                                            *
    2785              ;*******************************************************************************
    2786              
    2787              $C$DW$T$35      .dwtag  DW_TAG_enumeration_type
    2788                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2789              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_DAY_PERIODIC_INTERRUPT"), DW_AT_const_value(0x
    2790              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_HR_PERIODIC_INTERRUPT"), DW_AT_const_value(0x0
    2791              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_MINS_PERIODIC_INTERRUPT"), DW_AT_const_value(0
    2792              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_SEC_PERIODIC_INTERRUPT"), DW_AT_const_value(0x
    2793              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_MS_PERIODIC_INTERRUPT"), DW_AT_const_value(0x0
    2794                      .dwendtag $C$DW$T$35
    2795              
    2796              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RTCPeriodicInterruptType")
    2797                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    2798                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2799              
    2800              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    2801                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2802              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_MSEVENT_INTERRUPT"), DW_AT_const_value(0x00)
    2803              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_SECEVENT_INTERRUPT"), DW_AT_const_value(0x01)
    2804              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_MINSEVENT_INTERRUPT"), DW_AT_const_value(0x02)
    2805              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_HREVENT_INTERRUPT"), DW_AT_const_value(0x03)
    2806              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_DAYEVENT_INTERRUPT"), DW_AT_const_value(0x04)
    2807              $C$DW$176       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_EXTEVENT_INTERRUPT"), DW_AT_const_value(0x05)
    2808              $C$DW$177       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_ALARM_INTERRUPT"), DW_AT_const_value(0x06)
    2809              $C$DW$178       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_INTERRUPT_NONE"), DW_AT_const_value(0x07)
    2810                      .dwendtag $C$DW$T$37
    2811              
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   61

    2812              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RTCEventType")
    2813                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2814                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2815              
    2816              $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
    2817                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2818              $C$DW$179       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_COMPENSATION_NEGATIVE"), DW_AT_const_value(0x0
    2819              $C$DW$180       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_COMPENSATION_POSITIVE"), DW_AT_const_value(0x0
    2820              $C$DW$181       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_RTC_COMPENSATION_INVALID"), DW_AT_const_value(0x02
    2821                      .dwendtag $C$DW$T$40
    2822              
    2823              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RTCCompType")
    2824                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2825                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2826              
    2827              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2828                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0f)
    2829              $C$DW$182       .dwtag  DW_TAG_member
    2830                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2831                      .dwattr $C$DW$182, DW_AT_name("rtcmSec")
    2832                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rtcmSec")
    2833                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2834                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2835              $C$DW$183       .dwtag  DW_TAG_member
    2836                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2837                      .dwattr $C$DW$183, DW_AT_name("rtcsec")
    2838                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rtcsec")
    2839                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2840                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2841              $C$DW$184       .dwtag  DW_TAG_member
    2842                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2843                      .dwattr $C$DW$184, DW_AT_name("rtcmin")
    2844                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rtcmin")
    2845                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2846                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2847              $C$DW$185       .dwtag  DW_TAG_member
    2848                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2849                      .dwattr $C$DW$185, DW_AT_name("rtchour")
    2850                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rtchour")
    2851                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2852                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2853              $C$DW$186       .dwtag  DW_TAG_member
    2854                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2855                      .dwattr $C$DW$186, DW_AT_name("rtcday")
    2856                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rtcday")
    2857                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2858                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2859              $C$DW$187       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2861                      .dwattr $C$DW$187, DW_AT_name("rtcmonth")
    2862                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rtcmonth")
    2863                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2864                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2865              $C$DW$188       .dwtag  DW_TAG_member
    2866                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   62

    2867                      .dwattr $C$DW$188, DW_AT_name("rtcyear")
    2868                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rtcyear")
    2869                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2870                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2871              $C$DW$189       .dwtag  DW_TAG_member
    2872                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2873                      .dwattr $C$DW$189, DW_AT_name("rtcmSeca")
    2874                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rtcmSeca")
    2875                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2876                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2877              $C$DW$190       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2879                      .dwattr $C$DW$190, DW_AT_name("rtcseca")
    2880                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rtcseca")
    2881                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2882                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2883              $C$DW$191       .dwtag  DW_TAG_member
    2884                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2885                      .dwattr $C$DW$191, DW_AT_name("rtcmina")
    2886                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rtcmina")
    2887                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2888                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2889              $C$DW$192       .dwtag  DW_TAG_member
    2890                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2891                      .dwattr $C$DW$192, DW_AT_name("rtchoura")
    2892                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rtchoura")
    2893                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2894                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2895              $C$DW$193       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2897                      .dwattr $C$DW$193, DW_AT_name("rtcdaya")
    2898                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rtcdaya")
    2899                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2900                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2901              $C$DW$194       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2903                      .dwattr $C$DW$194, DW_AT_name("rtcmontha")
    2904                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rtcmontha")
    2905                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2906                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2907              $C$DW$195       .dwtag  DW_TAG_member
    2908                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2909                      .dwattr $C$DW$195, DW_AT_name("rtcyeara")
    2910                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rtcyeara")
    2911                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2912                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2913              $C$DW$196       .dwtag  DW_TAG_member
    2914                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2915                      .dwattr $C$DW$196, DW_AT_name("rtcintcr")
    2916                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rtcintcr")
    2917                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2918                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2919                      .dwendtag $C$DW$T$20
    2920              
    2921              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcConfig")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   63

    2922                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$20)
    2923                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2924              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    2925                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2926                      .dwattr $C$DW$T$43, DW_AT_address_class(0x17)
    2927              
    2928              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2929                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    2930              $C$DW$197       .dwtag  DW_TAG_member
    2931                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2932                      .dwattr $C$DW$197, DW_AT_name("hours")
    2933                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_hours")
    2934                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2935                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2936              $C$DW$198       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2938                      .dwattr $C$DW$198, DW_AT_name("mins")
    2939                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_mins")
    2940                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2941                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2942              $C$DW$199       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2944                      .dwattr $C$DW$199, DW_AT_name("secs")
    2945                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_secs")
    2946                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2947                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2948              $C$DW$200       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2950                      .dwattr $C$DW$200, DW_AT_name("mSecs")
    2951                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_mSecs")
    2952                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2953                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2954                      .dwendtag $C$DW$T$21
    2955              
    2956              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcTime")
    2957                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$21)
    2958                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2959              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    2960                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2961                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    2962              
    2963              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2964                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x03)
    2965              $C$DW$201       .dwtag  DW_TAG_member
    2966                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2967                      .dwattr $C$DW$201, DW_AT_name("year")
    2968                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_year")
    2969                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2970                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2971              $C$DW$202       .dwtag  DW_TAG_member
    2972                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2973                      .dwattr $C$DW$202, DW_AT_name("month")
    2974                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_month")
    2975                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2976                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   64

    2977              $C$DW$203       .dwtag  DW_TAG_member
    2978                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2979                      .dwattr $C$DW$203, DW_AT_name("day")
    2980                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_day")
    2981                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2982                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2983                      .dwendtag $C$DW$T$22
    2984              
    2985              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcDate")
    2986                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$22)
    2987                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2988              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    2989                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    2990                      .dwattr $C$DW$T$47, DW_AT_address_class(0x17)
    2991              
    2992              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2993                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x07)
    2994              $C$DW$204       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2996                      .dwattr $C$DW$204, DW_AT_name("year")
    2997                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_year")
    2998                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2999                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3000              $C$DW$205       .dwtag  DW_TAG_member
    3001                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3002                      .dwattr $C$DW$205, DW_AT_name("month")
    3003                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_month")
    3004                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3005                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3006              $C$DW$206       .dwtag  DW_TAG_member
    3007                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3008                      .dwattr $C$DW$206, DW_AT_name("day")
    3009                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_day")
    3010                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3011                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3012              $C$DW$207       .dwtag  DW_TAG_member
    3013                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3014                      .dwattr $C$DW$207, DW_AT_name("hours")
    3015                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_hours")
    3016                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3017                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3018              $C$DW$208       .dwtag  DW_TAG_member
    3019                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3020                      .dwattr $C$DW$208, DW_AT_name("mins")
    3021                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_mins")
    3022                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3023                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3024              $C$DW$209       .dwtag  DW_TAG_member
    3025                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3026                      .dwattr $C$DW$209, DW_AT_name("secs")
    3027                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_secs")
    3028                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3029                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3030              $C$DW$210       .dwtag  DW_TAG_member
    3031                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   65

    3032                      .dwattr $C$DW$210, DW_AT_name("mSecs")
    3033                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_mSecs")
    3034                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3035                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3036                      .dwendtag $C$DW$T$23
    3037              
    3038              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcAlarm")
    3039                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$23)
    3040                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3041              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    3042                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3043                      .dwattr $C$DW$T$49, DW_AT_address_class(0x17)
    3044              
    3045              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3046                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    3047              $C$DW$211       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$27)
    3049                      .dwattr $C$DW$211, DW_AT_name("isr")
    3050                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_isr")
    3051                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3052                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3053                      .dwendtag $C$DW$T$28
    3054              
    3055              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcIsrDispatchTable")
    3056                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$28)
    3057                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3058              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3059                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3060                      .dwattr $C$DW$T$51, DW_AT_address_class(0x17)
    3061              
    3062              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3063                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0e)
    3064              $C$DW$212       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$25)
    3066                      .dwattr $C$DW$212, DW_AT_name("MilEvtAddr")
    3067                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_MilEvtAddr")
    3068                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3069                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3070              $C$DW$213       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$25)
    3072                      .dwattr $C$DW$213, DW_AT_name("SecEvtAddr")
    3073                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_SecEvtAddr")
    3074                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3075                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3076              $C$DW$214       .dwtag  DW_TAG_member
    3077                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$25)
    3078                      .dwattr $C$DW$214, DW_AT_name("MinEvtAddr")
    3079                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_MinEvtAddr")
    3080                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3081                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3082              $C$DW$215       .dwtag  DW_TAG_member
    3083                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$25)
    3084                      .dwattr $C$DW$215, DW_AT_name("HourEvtAddr")
    3085                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_HourEvtAddr")
    3086                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   66

    3087                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3088              $C$DW$216       .dwtag  DW_TAG_member
    3089                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$25)
    3090                      .dwattr $C$DW$216, DW_AT_name("DayEvtAddr")
    3091                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DayEvtAddr")
    3092                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3093                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3094              $C$DW$217       .dwtag  DW_TAG_member
    3095                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$25)
    3096                      .dwattr $C$DW$217, DW_AT_name("ExtEvtAddr")
    3097                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_ExtEvtAddr")
    3098                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3099                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3100              $C$DW$218       .dwtag  DW_TAG_member
    3101                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$25)
    3102                      .dwattr $C$DW$218, DW_AT_name("AlarmEvtAddr")
    3103                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_AlarmEvtAddr")
    3104                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3105                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3106                      .dwendtag $C$DW$T$29
    3107              
    3108              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcIsrAddr")
    3109                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    3110                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    3111              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    3112                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    3113                      .dwattr $C$DW$T$53, DW_AT_address_class(0x17)
    3114              
    3115              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3116                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x66)
    3117              $C$DW$219       .dwtag  DW_TAG_member
    3118                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$30)
    3119                      .dwattr $C$DW$219, DW_AT_name("RTCINTEN")
    3120                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_RTCINTEN")
    3121                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3122                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3123              $C$DW$220       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$30)
    3125                      .dwattr $C$DW$220, DW_AT_name("RTCUPDATE")
    3126                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_RTCUPDATE")
    3127                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3128                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3129              $C$DW$221       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$31)
    3131                      .dwattr $C$DW$221, DW_AT_name("RSVD0")
    3132                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_RSVD0")
    3133                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3134                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3135              $C$DW$222       .dwtag  DW_TAG_member
    3136                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$30)
    3137                      .dwattr $C$DW$222, DW_AT_name("RTCMIL")
    3138                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_RTCMIL")
    3139                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3140                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3141              $C$DW$223       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   67

    3142                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$30)
    3143                      .dwattr $C$DW$223, DW_AT_name("RTCMILA")
    3144                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_RTCMILA")
    3145                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3146                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3147              $C$DW$224       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$31)
    3149                      .dwattr $C$DW$224, DW_AT_name("RSVD1")
    3150                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_RSVD1")
    3151                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3152                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3153              $C$DW$225       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$30)
    3155                      .dwattr $C$DW$225, DW_AT_name("RTCSEC")
    3156                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_RTCSEC")
    3157                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3158                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3159              $C$DW$226       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$30)
    3161                      .dwattr $C$DW$226, DW_AT_name("RTCSECA")
    3162                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_RTCSECA")
    3163                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3164                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3165              $C$DW$227       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$31)
    3167                      .dwattr $C$DW$227, DW_AT_name("RSVD2")
    3168                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_RSVD2")
    3169                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3170                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3171              $C$DW$228       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$30)
    3173                      .dwattr $C$DW$228, DW_AT_name("RTCMIN")
    3174                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_RTCMIN")
    3175                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3176                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3177              $C$DW$229       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$30)
    3179                      .dwattr $C$DW$229, DW_AT_name("RTCMINA")
    3180                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_RTCMINA")
    3181                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3182                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3183              $C$DW$230       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$31)
    3185                      .dwattr $C$DW$230, DW_AT_name("RSVD3")
    3186                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_RSVD3")
    3187                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3188                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3189              $C$DW$231       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$30)
    3191                      .dwattr $C$DW$231, DW_AT_name("RTCHOUR")
    3192                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_RTCHOUR")
    3193                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3194                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3195              $C$DW$232       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$30)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   68

    3197                      .dwattr $C$DW$232, DW_AT_name("RTCHOURA")
    3198                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RTCHOURA")
    3199                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3200                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3201              $C$DW$233       .dwtag  DW_TAG_member
    3202                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$31)
    3203                      .dwattr $C$DW$233, DW_AT_name("RSVD4")
    3204                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_RSVD4")
    3205                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3206                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3207              $C$DW$234       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$30)
    3209                      .dwattr $C$DW$234, DW_AT_name("RTCDAY")
    3210                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_RTCDAY")
    3211                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3212                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3213              $C$DW$235       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$30)
    3215                      .dwattr $C$DW$235, DW_AT_name("RTCDAYA")
    3216                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_RTCDAYA")
    3217                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3218                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3219              $C$DW$236       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$31)
    3221                      .dwattr $C$DW$236, DW_AT_name("RSVD5")
    3222                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_RSVD5")
    3223                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3224                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3225              $C$DW$237       .dwtag  DW_TAG_member
    3226                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$30)
    3227                      .dwattr $C$DW$237, DW_AT_name("RTCMONTH")
    3228                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_RTCMONTH")
    3229                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3230                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3231              $C$DW$238       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$30)
    3233                      .dwattr $C$DW$238, DW_AT_name("RTCMONTHA")
    3234                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_RTCMONTHA")
    3235                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3236                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3237              $C$DW$239       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$31)
    3239                      .dwattr $C$DW$239, DW_AT_name("RSVD6")
    3240                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_RSVD6")
    3241                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3242                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3243              $C$DW$240       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$30)
    3245                      .dwattr $C$DW$240, DW_AT_name("RTCYEAR")
    3246                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_RTCYEAR")
    3247                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3248                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3249              $C$DW$241       .dwtag  DW_TAG_member
    3250                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$30)
    3251                      .dwattr $C$DW$241, DW_AT_name("RTCYEARA")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   69

    3252                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_RTCYEARA")
    3253                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3254                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3255              $C$DW$242       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$31)
    3257                      .dwattr $C$DW$242, DW_AT_name("RSVD7")
    3258                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_RSVD7")
    3259                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3260                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3261              $C$DW$243       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$30)
    3263                      .dwattr $C$DW$243, DW_AT_name("RTCINTFL")
    3264                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_RTCINTFL")
    3265                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3266                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3267              $C$DW$244       .dwtag  DW_TAG_member
    3268                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$30)
    3269                      .dwattr $C$DW$244, DW_AT_name("RTCNOPWR")
    3270                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_RTCNOPWR")
    3271                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3272                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3273              $C$DW$245       .dwtag  DW_TAG_member
    3274                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$31)
    3275                      .dwattr $C$DW$245, DW_AT_name("RSVD8")
    3276                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_RSVD8")
    3277                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3278                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3279              $C$DW$246       .dwtag  DW_TAG_member
    3280                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$30)
    3281                      .dwattr $C$DW$246, DW_AT_name("RTCINTREG")
    3282                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_RTCINTREG")
    3283                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3284                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3285              $C$DW$247       .dwtag  DW_TAG_member
    3286                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$32)
    3287                      .dwattr $C$DW$247, DW_AT_name("RSVD9")
    3288                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_RSVD9")
    3289                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3290                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3291              $C$DW$248       .dwtag  DW_TAG_member
    3292                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$30)
    3293                      .dwattr $C$DW$248, DW_AT_name("RTCDRIFT")
    3294                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_RTCDRIFT")
    3295                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3296                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3297              $C$DW$249       .dwtag  DW_TAG_member
    3298                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$32)
    3299                      .dwattr $C$DW$249, DW_AT_name("RSVD10")
    3300                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_RSVD10")
    3301                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3302                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3303              $C$DW$250       .dwtag  DW_TAG_member
    3304                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$30)
    3305                      .dwattr $C$DW$250, DW_AT_name("RTCOSC")
    3306                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_RTCOSC")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   70

    3307                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3308                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3309              $C$DW$251       .dwtag  DW_TAG_member
    3310                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$32)
    3311                      .dwattr $C$DW$251, DW_AT_name("RSVD11")
    3312                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_RSVD11")
    3313                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    3314                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3315              $C$DW$252       .dwtag  DW_TAG_member
    3316                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$30)
    3317                      .dwattr $C$DW$252, DW_AT_name("RTCPMGT")
    3318                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_RTCPMGT")
    3319                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3320                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3321              $C$DW$253       .dwtag  DW_TAG_member
    3322                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$33)
    3323                      .dwattr $C$DW$253, DW_AT_name("RSVD12")
    3324                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_RSVD12")
    3325                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3326                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3327              $C$DW$254       .dwtag  DW_TAG_member
    3328                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$30)
    3329                      .dwattr $C$DW$254, DW_AT_name("RTCSCR1")
    3330                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_RTCSCR1")
    3331                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3332                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3333              $C$DW$255       .dwtag  DW_TAG_member
    3334                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$30)
    3335                      .dwattr $C$DW$255, DW_AT_name("RTCSCR2")
    3336                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_RTCSCR2")
    3337                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    3338                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3339              $C$DW$256       .dwtag  DW_TAG_member
    3340                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$31)
    3341                      .dwattr $C$DW$256, DW_AT_name("RSVD13")
    3342                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_RSVD13")
    3343                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3344                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3345              $C$DW$257       .dwtag  DW_TAG_member
    3346                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$30)
    3347                      .dwattr $C$DW$257, DW_AT_name("RTCSCR3")
    3348                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_RTCSCR3")
    3349                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3350                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3351              $C$DW$258       .dwtag  DW_TAG_member
    3352                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$30)
    3353                      .dwattr $C$DW$258, DW_AT_name("RTCSCR4")
    3354                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_RTCSCR4")
    3355                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    3356                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3357                      .dwendtag $C$DW$T$34
    3358              
    3359              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcRegs")
    3360                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$34)
    3361                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:51 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_rtc.asm                                                          PAGE   71

    3362              $C$DW$259       .dwtag  DW_TAG_TI_far_type
    3363                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$54)
    3364              $C$DW$260       .dwtag  DW_TAG_TI_ioport_type
    3365                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$259)
    3366              $C$DW$T$55      .dwtag  DW_TAG_volatile_type
    3367                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$260)
    3368              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    3369                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3370                      .dwattr $C$DW$T$56, DW_AT_address_class(0x10)
    3371              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RtcRegsOvly")
    3372                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    3373                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3374              
    3375              $C$DW$T$24      .dwtag  DW_TAG_subroutine_type
    3376                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3377              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    3378                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    3379                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    3380              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_RTCCallBackPtr")
    3381                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3382                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3383              
    3384              $C$DW$T$27      .dwtag  DW_TAG_array_type
    3385                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    3386                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3387                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
    3388              $C$DW$261       .dwtag  DW_TAG_subrange_type
    3389                      .dwattr $C$DW$261, DW_AT_upper_bound(0x06)
    3390                      .dwendtag $C$DW$T$27
    3391              
    3392              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3393                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3394                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3395                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3396              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3397                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3398                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3399                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3400              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3401                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3402                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3403                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3404              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3405                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3406                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3407                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3408              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3409                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
