TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE    1

   17007              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 14 03:54:28 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

   14510              $C$DW$842       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMC_CARD"), DW_AT_const_value(0x02)
   14511                      .dwendtag $C$DW$T$61
   14512              
   14513              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CardType")
   14514                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
   14515                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
   14516              
   14517              $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
   14518                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
   14519              $C$DW$843       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_POLLED"), DW_AT_const_value(0x00)
   14520              $C$DW$844       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_INTERRUPT"), DW_AT_const_value(0x01)
   14521              $C$DW$845       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_DMA"), DW_AT_const_value(0x02)
   14522              $C$DW$846       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_NONE"), DW_AT_const_value(0x03)
   14523                      .dwendtag $C$DW$T$85
   14524              
   14525              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDOpMode")
   14526                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
   14527                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
   14528              
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  341

   14529              $C$DW$T$96      .dwtag  DW_TAG_enumeration_type
   14530                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
   14531              $C$DW$847       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
   14532              $C$DW$848       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_BIG"), DW_AT_const_value(0x01)
   14533                      .dwendtag $C$DW$T$96
   14534              
   14535              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdEndianMode")
   14536                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   14537                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   14538              
   14539              $C$DW$T$107     .dwtag  DW_TAG_enumeration_type
   14540                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x01)
   14541              $C$DW$849       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD0_INST"), DW_AT_const_value(0x00)
   14542              $C$DW$850       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD1_INST"), DW_AT_const_value(0x01)
   14543              $C$DW$851       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INST_INV"), DW_AT_const_value(0x02)
   14544                      .dwendtag $C$DW$T$107
   14545              
   14546              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdInstId")
   14547                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
   14548                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
   14549              
   14550              $C$DW$T$109     .dwtag  DW_TAG_enumeration_type
   14551                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
   14552              $C$DW$852       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDATDNE_INTERRUPT"), DW_AT_const_value(0x01)
   14553              $C$DW$853       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EBSYDNE_INTERRUPT"), DW_AT_const_value(0x02)
   14554              $C$DW$854       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ERSPDNE_INTERRUPT"), DW_AT_const_value(0x04)
   14555              $C$DW$855       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ETOUTRD_INTERRUPT"), DW_AT_const_value(0x08)
   14556              $C$DW$856       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ETOUTRS_INTERRUPT"), DW_AT_const_value(0x10)
   14557              $C$DW$857       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ECRCWR_INTERRUPT"), DW_AT_const_value(0x20)
   14558              $C$DW$858       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ECRCRD_INTERRUPT"), DW_AT_const_value(0x40)
   14559              $C$DW$859       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ECRCRS_INTERRUPT"), DW_AT_const_value(0x80)
   14560              $C$DW$860       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_RSV_BIT"), DW_AT_const_value(0x100)
   14561              $C$DW$861       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDXRDY_INTERRUPT"), DW_AT_const_value(0x200)
   14562              $C$DW$862       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDRRDY_INTERRUPT"), DW_AT_const_value(0x400)
   14563              $C$DW$863       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_EDATED_INTERRUPT"), DW_AT_const_value(0x800)
   14564              $C$DW$864       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ETRNDNE_INTERRUPT"), DW_AT_const_value(0x100
   14565              $C$DW$865       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_INTERRUPT_NONE"), DW_AT_const_value(0x2000)
   14566                      .dwendtag $C$DW$T$109
   14567              
   14568              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDEventType")
   14569                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
   14570                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
   14571              
   14572              $C$DW$T$22      .dwtag  DW_TAG_structure_type
   14573                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x66)
   14574              $C$DW$866       .dwtag  DW_TAG_member
   14575                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$20)
   14576                      .dwattr $C$DW$866, DW_AT_name("DMACH0SSAL")
   14577                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_DMACH0SSAL")
   14578                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14579                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
   14580              $C$DW$867       .dwtag  DW_TAG_member
   14581                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$20)
   14582                      .dwattr $C$DW$867, DW_AT_name("DMACH0SSAU")
   14583                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_DMACH0SSAU")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  342

   14584                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14585                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
   14586              $C$DW$868       .dwtag  DW_TAG_member
   14587                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$20)
   14588                      .dwattr $C$DW$868, DW_AT_name("DMACH0DSAL")
   14589                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_DMACH0DSAL")
   14590                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14591                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
   14592              $C$DW$869       .dwtag  DW_TAG_member
   14593                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$20)
   14594                      .dwattr $C$DW$869, DW_AT_name("DMACH0DSAU")
   14595                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_DMACH0DSAU")
   14596                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14597                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
   14598              $C$DW$870       .dwtag  DW_TAG_member
   14599                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$20)
   14600                      .dwattr $C$DW$870, DW_AT_name("DMACH0TCR1")
   14601                      .dwattr $C$DW$870, DW_AT_TI_symbol_name("_DMACH0TCR1")
   14602                      .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14603                      .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
   14604              $C$DW$871       .dwtag  DW_TAG_member
   14605                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$20)
   14606                      .dwattr $C$DW$871, DW_AT_name("DMACH0TCR2")
   14607                      .dwattr $C$DW$871, DW_AT_TI_symbol_name("_DMACH0TCR2")
   14608                      .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14609                      .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
   14610              $C$DW$872       .dwtag  DW_TAG_member
   14611                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$21)
   14612                      .dwattr $C$DW$872, DW_AT_name("RSVD0")
   14613                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_RSVD0")
   14614                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14615                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
   14616              $C$DW$873       .dwtag  DW_TAG_member
   14617                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$20)
   14618                      .dwattr $C$DW$873, DW_AT_name("DMACH1SSAL")
   14619                      .dwattr $C$DW$873, DW_AT_TI_symbol_name("_DMACH1SSAL")
   14620                      .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   14621                      .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
   14622              $C$DW$874       .dwtag  DW_TAG_member
   14623                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$20)
   14624                      .dwattr $C$DW$874, DW_AT_name("DMACH1SSAU")
   14625                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_DMACH1SSAU")
   14626                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   14627                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
   14628              $C$DW$875       .dwtag  DW_TAG_member
   14629                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$20)
   14630                      .dwattr $C$DW$875, DW_AT_name("DMACH1DSAL")
   14631                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_DMACH1DSAL")
   14632                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   14633                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
   14634              $C$DW$876       .dwtag  DW_TAG_member
   14635                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$20)
   14636                      .dwattr $C$DW$876, DW_AT_name("DMACH1DSAU")
   14637                      .dwattr $C$DW$876, DW_AT_TI_symbol_name("_DMACH1DSAU")
   14638                      .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  343

   14639                      .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
   14640              $C$DW$877       .dwtag  DW_TAG_member
   14641                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$20)
   14642                      .dwattr $C$DW$877, DW_AT_name("DMACH1TCR1")
   14643                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_DMACH1TCR1")
   14644                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   14645                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
   14646              $C$DW$878       .dwtag  DW_TAG_member
   14647                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$20)
   14648                      .dwattr $C$DW$878, DW_AT_name("DMACH1TCR2")
   14649                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_DMACH1TCR2")
   14650                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
   14651                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
   14652              $C$DW$879       .dwtag  DW_TAG_member
   14653                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$21)
   14654                      .dwattr $C$DW$879, DW_AT_name("RSVD1")
   14655                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_RSVD1")
   14656                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   14657                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
   14658              $C$DW$880       .dwtag  DW_TAG_member
   14659                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$20)
   14660                      .dwattr $C$DW$880, DW_AT_name("DMACH2SSAL")
   14661                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_DMACH2SSAL")
   14662                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   14663                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
   14664              $C$DW$881       .dwtag  DW_TAG_member
   14665                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$20)
   14666                      .dwattr $C$DW$881, DW_AT_name("DMACH2SSAU")
   14667                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_DMACH2SSAU")
   14668                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
   14669                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
   14670              $C$DW$882       .dwtag  DW_TAG_member
   14671                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$20)
   14672                      .dwattr $C$DW$882, DW_AT_name("DMACH2DSAL")
   14673                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_DMACH2DSAL")
   14674                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   14675                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
   14676              $C$DW$883       .dwtag  DW_TAG_member
   14677                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$20)
   14678                      .dwattr $C$DW$883, DW_AT_name("DMACH2DSAU")
   14679                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_DMACH2DSAU")
   14680                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
   14681                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
   14682              $C$DW$884       .dwtag  DW_TAG_member
   14683                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$20)
   14684                      .dwattr $C$DW$884, DW_AT_name("DMACH2TCR1")
   14685                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_DMACH2TCR1")
   14686                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   14687                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
   14688              $C$DW$885       .dwtag  DW_TAG_member
   14689                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$20)
   14690                      .dwattr $C$DW$885, DW_AT_name("DMACH2TCR2")
   14691                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_DMACH2TCR2")
   14692                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   14693                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  344

   14694              $C$DW$886       .dwtag  DW_TAG_member
   14695                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$21)
   14696                      .dwattr $C$DW$886, DW_AT_name("RSVD2")
   14697                      .dwattr $C$DW$886, DW_AT_TI_symbol_name("_RSVD2")
   14698                      .dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   14699                      .dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
   14700              $C$DW$887       .dwtag  DW_TAG_member
   14701                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$20)
   14702                      .dwattr $C$DW$887, DW_AT_name("DMACH3SSAL")
   14703                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_DMACH3SSAL")
   14704                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   14705                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
   14706              $C$DW$888       .dwtag  DW_TAG_member
   14707                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$20)
   14708                      .dwattr $C$DW$888, DW_AT_name("DMACH3SSAU")
   14709                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_DMACH3SSAU")
   14710                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
   14711                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
   14712              $C$DW$889       .dwtag  DW_TAG_member
   14713                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$20)
   14714                      .dwattr $C$DW$889, DW_AT_name("DMACH3DSAL")
   14715                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_DMACH3DSAL")
   14716                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
   14717                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
   14718              $C$DW$890       .dwtag  DW_TAG_member
   14719                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$20)
   14720                      .dwattr $C$DW$890, DW_AT_name("DMACH3DSAU")
   14721                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_DMACH3DSAU")
   14722                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   14723                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
   14724              $C$DW$891       .dwtag  DW_TAG_member
   14725                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$20)
   14726                      .dwattr $C$DW$891, DW_AT_name("DMACH3TCR1")
   14727                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_DMACH3TCR1")
   14728                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
   14729                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
   14730              $C$DW$892       .dwtag  DW_TAG_member
   14731                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$20)
   14732                      .dwattr $C$DW$892, DW_AT_name("DMACH3TCR2")
   14733                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_DMACH3TCR2")
   14734                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
   14735                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
   14736                      .dwendtag $C$DW$T$22
   14737              
   14738              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
   14739                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
   14740                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
   14741              $C$DW$893       .dwtag  DW_TAG_TI_far_type
   14742                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$23)
   14743              $C$DW$894       .dwtag  DW_TAG_TI_ioport_type
   14744                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$893)
   14745              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
   14746                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$894)
   14747              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
   14748                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  345

   14749                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
   14750              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
   14751                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
   14752                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
   14753              
   14754              $C$DW$T$40      .dwtag  DW_TAG_structure_type
   14755                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x09)
   14756              $C$DW$895       .dwtag  DW_TAG_member
   14757                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$26)
   14758                      .dwattr $C$DW$895, DW_AT_name("dmaRegs")
   14759                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_dmaRegs")
   14760                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14761                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
   14762              $C$DW$896       .dwtag  DW_TAG_member
   14763                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$28)
   14764                      .dwattr $C$DW$896, DW_AT_name("chanNum")
   14765                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_chanNum")
   14766                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14767                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
   14768              $C$DW$897       .dwtag  DW_TAG_member
   14769                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$30)
   14770                      .dwattr $C$DW$897, DW_AT_name("dmaInstNum")
   14771                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_dmaInstNum")
   14772                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14773                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
   14774              $C$DW$898       .dwtag  DW_TAG_member
   14775                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$31)
   14776                      .dwattr $C$DW$898, DW_AT_name("isChanFree")
   14777                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_isChanFree")
   14778                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14779                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
   14780              $C$DW$899       .dwtag  DW_TAG_member
   14781                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$33)
   14782                      .dwattr $C$DW$899, DW_AT_name("chanDir")
   14783                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_chanDir")
   14784                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14785                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
   14786              $C$DW$900       .dwtag  DW_TAG_member
   14787                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$35)
   14788                      .dwattr $C$DW$900, DW_AT_name("trigger")
   14789                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_trigger")
   14790                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14791                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
   14792              $C$DW$901       .dwtag  DW_TAG_member
   14793                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$37)
   14794                      .dwattr $C$DW$901, DW_AT_name("trfType")
   14795                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_trfType")
   14796                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14797                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
   14798              $C$DW$902       .dwtag  DW_TAG_member
   14799                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$39)
   14800                      .dwattr $C$DW$902, DW_AT_name("dmaInt")
   14801                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_dmaInt")
   14802                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14803                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  346

   14804              $C$DW$903       .dwtag  DW_TAG_member
   14805                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$31)
   14806                      .dwattr $C$DW$903, DW_AT_name("pingPongEnabled")
   14807                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_pingPongEnabled")
   14808                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14809                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
   14810                      .dwendtag $C$DW$T$40
   14811              
   14812              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
   14813                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$40)
   14814                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
   14815              $C$DW$T$88      .dwtag  DW_TAG_pointer_type
   14816                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
   14817                      .dwattr $C$DW$T$88, DW_AT_address_class(0x17)
   14818              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
   14819                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   14820                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   14821              
   14822              $C$DW$T$50      .dwtag  DW_TAG_structure_type
   14823                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0e)
   14824              $C$DW$904       .dwtag  DW_TAG_member
   14825                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$42)
   14826                      .dwattr $C$DW$904, DW_AT_name("pingPongMode")
   14827                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_pingPongMode")
   14828                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14829                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
   14830              $C$DW$905       .dwtag  DW_TAG_member
   14831                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$44)
   14832                      .dwattr $C$DW$905, DW_AT_name("autoMode")
   14833                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_autoMode")
   14834                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14835                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
   14836              $C$DW$906       .dwtag  DW_TAG_member
   14837                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$46)
   14838                      .dwattr $C$DW$906, DW_AT_name("burstLen")
   14839                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_burstLen")
   14840                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14841                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
   14842              $C$DW$907       .dwtag  DW_TAG_member
   14843                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$35)
   14844                      .dwattr $C$DW$907, DW_AT_name("trigger")
   14845                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_trigger")
   14846                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14847                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
   14848              $C$DW$908       .dwtag  DW_TAG_member
   14849                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$48)
   14850                      .dwattr $C$DW$908, DW_AT_name("dmaEvt")
   14851                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_dmaEvt")
   14852                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14853                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
   14854              $C$DW$909       .dwtag  DW_TAG_member
   14855                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$39)
   14856                      .dwattr $C$DW$909, DW_AT_name("dmaInt")
   14857                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_dmaInt")
   14858                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  347

   14859                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
   14860              $C$DW$910       .dwtag  DW_TAG_member
   14861                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$33)
   14862                      .dwattr $C$DW$910, DW_AT_name("chanDir")
   14863                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_chanDir")
   14864                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14865                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
   14866              $C$DW$911       .dwtag  DW_TAG_member
   14867                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$37)
   14868                      .dwattr $C$DW$911, DW_AT_name("trfType")
   14869                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_trfType")
   14870                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   14871                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
   14872              $C$DW$912       .dwtag  DW_TAG_member
   14873                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$19)
   14874                      .dwattr $C$DW$912, DW_AT_name("dataLen")
   14875                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_dataLen")
   14876                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14877                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
   14878              $C$DW$913       .dwtag  DW_TAG_member
   14879                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$49)
   14880                      .dwattr $C$DW$913, DW_AT_name("srcAddr")
   14881                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_srcAddr")
   14882                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14883                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
   14884              $C$DW$914       .dwtag  DW_TAG_member
   14885                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$49)
   14886                      .dwattr $C$DW$914, DW_AT_name("destAddr")
   14887                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_destAddr")
   14888                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14889                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
   14890                      .dwendtag $C$DW$T$50
   14891              
   14892              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
   14893                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$50)
   14894                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
   14895              $C$DW$T$111     .dwtag  DW_TAG_pointer_type
   14896                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$90)
   14897                      .dwattr $C$DW$T$111, DW_AT_address_class(0x17)
   14898              
   14899              $C$DW$T$55      .dwtag  DW_TAG_structure_type
   14900                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x75)
   14901              $C$DW$915       .dwtag  DW_TAG_member
   14902                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$20)
   14903                      .dwattr $C$DW$915, DW_AT_name("MMCCTL")
   14904                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_MMCCTL")
   14905                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14906                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
   14907              $C$DW$916       .dwtag  DW_TAG_member
   14908                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$51)
   14909                      .dwattr $C$DW$916, DW_AT_name("RSVD0")
   14910                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_RSVD0")
   14911                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   14912                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
   14913              $C$DW$917       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  348

   14914                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$20)
   14915                      .dwattr $C$DW$917, DW_AT_name("MMCCLK")
   14916                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_MMCCLK")
   14917                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14918                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
   14919              $C$DW$918       .dwtag  DW_TAG_member
   14920                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$51)
   14921                      .dwattr $C$DW$918, DW_AT_name("RSVD1")
   14922                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_RSVD1")
   14923                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14924                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
   14925              $C$DW$919       .dwtag  DW_TAG_member
   14926                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$20)
   14927                      .dwattr $C$DW$919, DW_AT_name("MMCST0")
   14928                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_MMCST0")
   14929                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14930                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
   14931              $C$DW$920       .dwtag  DW_TAG_member
   14932                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$51)
   14933                      .dwattr $C$DW$920, DW_AT_name("RSVD2")
   14934                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_RSVD2")
   14935                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   14936                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
   14937              $C$DW$921       .dwtag  DW_TAG_member
   14938                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$20)
   14939                      .dwattr $C$DW$921, DW_AT_name("MMCST1")
   14940                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_MMCST1")
   14941                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14942                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
   14943              $C$DW$922       .dwtag  DW_TAG_member
   14944                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$51)
   14945                      .dwattr $C$DW$922, DW_AT_name("RSVD3")
   14946                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_RSVD3")
   14947                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   14948                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
   14949              $C$DW$923       .dwtag  DW_TAG_member
   14950                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$20)
   14951                      .dwattr $C$DW$923, DW_AT_name("MMCIM")
   14952                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_MMCIM")
   14953                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14954                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
   14955              $C$DW$924       .dwtag  DW_TAG_member
   14956                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$51)
   14957                      .dwattr $C$DW$924, DW_AT_name("RSVD4")
   14958                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_RSVD4")
   14959                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   14960                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
   14961              $C$DW$925       .dwtag  DW_TAG_member
   14962                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$20)
   14963                      .dwattr $C$DW$925, DW_AT_name("MMCTOR")
   14964                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_MMCTOR")
   14965                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14966                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
   14967              $C$DW$926       .dwtag  DW_TAG_member
   14968                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$51)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  349

   14969                      .dwattr $C$DW$926, DW_AT_name("RSVD5")
   14970                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_RSVD5")
   14971                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   14972                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
   14973              $C$DW$927       .dwtag  DW_TAG_member
   14974                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$20)
   14975                      .dwattr $C$DW$927, DW_AT_name("MMCTOD")
   14976                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_MMCTOD")
   14977                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   14978                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
   14979              $C$DW$928       .dwtag  DW_TAG_member
   14980                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$51)
   14981                      .dwattr $C$DW$928, DW_AT_name("RSVD6")
   14982                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_RSVD6")
   14983                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   14984                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
   14985              $C$DW$929       .dwtag  DW_TAG_member
   14986                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$20)
   14987                      .dwattr $C$DW$929, DW_AT_name("MMCBLEN")
   14988                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_MMCBLEN")
   14989                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   14990                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
   14991              $C$DW$930       .dwtag  DW_TAG_member
   14992                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$51)
   14993                      .dwattr $C$DW$930, DW_AT_name("RSVD7")
   14994                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_RSVD7")
   14995                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   14996                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
   14997              $C$DW$931       .dwtag  DW_TAG_member
   14998                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$20)
   14999                      .dwattr $C$DW$931, DW_AT_name("MMCNBLK")
   15000                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_MMCNBLK")
   15001                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   15002                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
   15003              $C$DW$932       .dwtag  DW_TAG_member
   15004                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$51)
   15005                      .dwattr $C$DW$932, DW_AT_name("RSVD8")
   15006                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_RSVD8")
   15007                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   15008                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
   15009              $C$DW$933       .dwtag  DW_TAG_member
   15010                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$20)
   15011                      .dwattr $C$DW$933, DW_AT_name("MMCNBLC")
   15012                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_MMCNBLC")
   15013                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   15014                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
   15015              $C$DW$934       .dwtag  DW_TAG_member
   15016                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$51)
   15017                      .dwattr $C$DW$934, DW_AT_name("RSVD9")
   15018                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_RSVD9")
   15019                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
   15020                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
   15021              $C$DW$935       .dwtag  DW_TAG_member
   15022                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$20)
   15023                      .dwattr $C$DW$935, DW_AT_name("MMCDRR1")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  350

   15024                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_MMCDRR1")
   15025                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   15026                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
   15027              $C$DW$936       .dwtag  DW_TAG_member
   15028                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$20)
   15029                      .dwattr $C$DW$936, DW_AT_name("MMCDRR2")
   15030                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_MMCDRR2")
   15031                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
   15032                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
   15033              $C$DW$937       .dwtag  DW_TAG_member
   15034                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$52)
   15035                      .dwattr $C$DW$937, DW_AT_name("RSVD10")
   15036                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_RSVD10")
   15037                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   15038                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
   15039              $C$DW$938       .dwtag  DW_TAG_member
   15040                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$20)
   15041                      .dwattr $C$DW$938, DW_AT_name("MMCDXR1")
   15042                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_MMCDXR1")
   15043                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   15044                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
   15045              $C$DW$939       .dwtag  DW_TAG_member
   15046                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$20)
   15047                      .dwattr $C$DW$939, DW_AT_name("MMCDXR2")
   15048                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_MMCDXR2")
   15049                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
   15050                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
   15051              $C$DW$940       .dwtag  DW_TAG_member
   15052                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$52)
   15053                      .dwattr $C$DW$940, DW_AT_name("RSVD11")
   15054                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_RSVD11")
   15055                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   15056                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
   15057              $C$DW$941       .dwtag  DW_TAG_member
   15058                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$20)
   15059                      .dwattr $C$DW$941, DW_AT_name("MMCCMD1")
   15060                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_MMCCMD1")
   15061                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   15062                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
   15063              $C$DW$942       .dwtag  DW_TAG_member
   15064                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$20)
   15065                      .dwattr $C$DW$942, DW_AT_name("MMCCMD2")
   15066                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_MMCCMD2")
   15067                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
   15068                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
   15069              $C$DW$943       .dwtag  DW_TAG_member
   15070                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$52)
   15071                      .dwattr $C$DW$943, DW_AT_name("RSVD12")
   15072                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_RSVD12")
   15073                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
   15074                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
   15075              $C$DW$944       .dwtag  DW_TAG_member
   15076                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$20)
   15077                      .dwattr $C$DW$944, DW_AT_name("MMCARG1")
   15078                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_MMCARG1")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  351

   15079                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   15080                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
   15081              $C$DW$945       .dwtag  DW_TAG_member
   15082                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$20)
   15083                      .dwattr $C$DW$945, DW_AT_name("MMCARG2")
   15084                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_MMCARG2")
   15085                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
   15086                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
   15087              $C$DW$946       .dwtag  DW_TAG_member
   15088                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$52)
   15089                      .dwattr $C$DW$946, DW_AT_name("RSVD13")
   15090                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_RSVD13")
   15091                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   15092                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
   15093              $C$DW$947       .dwtag  DW_TAG_member
   15094                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$20)
   15095                      .dwattr $C$DW$947, DW_AT_name("MMCRSP0")
   15096                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_MMCRSP0")
   15097                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   15098                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
   15099              $C$DW$948       .dwtag  DW_TAG_member
   15100                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$20)
   15101                      .dwattr $C$DW$948, DW_AT_name("MMCRSP1")
   15102                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_MMCRSP1")
   15103                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
   15104                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
   15105              $C$DW$949       .dwtag  DW_TAG_member
   15106                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$52)
   15107                      .dwattr $C$DW$949, DW_AT_name("RSVD14")
   15108                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_RSVD14")
   15109                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   15110                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
   15111              $C$DW$950       .dwtag  DW_TAG_member
   15112                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$20)
   15113                      .dwattr $C$DW$950, DW_AT_name("MMCRSP2")
   15114                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_MMCRSP2")
   15115                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   15116                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
   15117              $C$DW$951       .dwtag  DW_TAG_member
   15118                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$20)
   15119                      .dwattr $C$DW$951, DW_AT_name("MMCRSP3")
   15120                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_MMCRSP3")
   15121                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
   15122                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
   15123              $C$DW$952       .dwtag  DW_TAG_member
   15124                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$52)
   15125                      .dwattr $C$DW$952, DW_AT_name("RSVD15")
   15126                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_RSVD15")
   15127                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
   15128                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
   15129              $C$DW$953       .dwtag  DW_TAG_member
   15130                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$20)
   15131                      .dwattr $C$DW$953, DW_AT_name("MMCRSP4")
   15132                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_MMCRSP4")
   15133                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  352

   15134                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
   15135              $C$DW$954       .dwtag  DW_TAG_member
   15136                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$20)
   15137                      .dwattr $C$DW$954, DW_AT_name("MMCRSP5")
   15138                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_MMCRSP5")
   15139                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
   15140                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
   15141              $C$DW$955       .dwtag  DW_TAG_member
   15142                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$52)
   15143                      .dwattr $C$DW$955, DW_AT_name("RSVD16")
   15144                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_RSVD16")
   15145                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   15146                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
   15147              $C$DW$956       .dwtag  DW_TAG_member
   15148                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$20)
   15149                      .dwattr $C$DW$956, DW_AT_name("MMCRSP6")
   15150                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_MMCRSP6")
   15151                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   15152                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
   15153              $C$DW$957       .dwtag  DW_TAG_member
   15154                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$20)
   15155                      .dwattr $C$DW$957, DW_AT_name("MMCRSP7")
   15156                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_MMCRSP7")
   15157                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   15158                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
   15159              $C$DW$958       .dwtag  DW_TAG_member
   15160                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$52)
   15161                      .dwattr $C$DW$958, DW_AT_name("RSVD17")
   15162                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_RSVD17")
   15163                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   15164                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
   15165              $C$DW$959       .dwtag  DW_TAG_member
   15166                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$20)
   15167                      .dwattr $C$DW$959, DW_AT_name("MMCDRSP")
   15168                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_MMCDRSP")
   15169                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   15170                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
   15171              $C$DW$960       .dwtag  DW_TAG_member
   15172                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$53)
   15173                      .dwattr $C$DW$960, DW_AT_name("RSVD18")
   15174                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_RSVD18")
   15175                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
   15176                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
   15177              $C$DW$961       .dwtag  DW_TAG_member
   15178                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$20)
   15179                      .dwattr $C$DW$961, DW_AT_name("MMCCIDX")
   15180                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_MMCCIDX")
   15181                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   15182                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
   15183              $C$DW$962       .dwtag  DW_TAG_member
   15184                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$54)
   15185                      .dwattr $C$DW$962, DW_AT_name("RSVD19")
   15186                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_RSVD19")
   15187                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
   15188                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  353

   15189              $C$DW$963       .dwtag  DW_TAG_member
   15190                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$20)
   15191                      .dwattr $C$DW$963, DW_AT_name("SDIOCTL")
   15192                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_SDIOCTL")
   15193                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
   15194                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
   15195              $C$DW$964       .dwtag  DW_TAG_member
   15196                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$51)
   15197                      .dwattr $C$DW$964, DW_AT_name("RSVD20")
   15198                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_RSVD20")
   15199                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
   15200                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
   15201              $C$DW$965       .dwtag  DW_TAG_member
   15202                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$20)
   15203                      .dwattr $C$DW$965, DW_AT_name("SDIOST0")
   15204                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_SDIOST0")
   15205                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   15206                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
   15207              $C$DW$966       .dwtag  DW_TAG_member
   15208                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$51)
   15209                      .dwattr $C$DW$966, DW_AT_name("RSVD21")
   15210                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_RSVD21")
   15211                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
   15212                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
   15213              $C$DW$967       .dwtag  DW_TAG_member
   15214                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$20)
   15215                      .dwattr $C$DW$967, DW_AT_name("SDIOIEN")
   15216                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_SDIOIEN")
   15217                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   15218                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
   15219              $C$DW$968       .dwtag  DW_TAG_member
   15220                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$51)
   15221                      .dwattr $C$DW$968, DW_AT_name("RSVD22")
   15222                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_RSVD22")
   15223                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
   15224                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
   15225              $C$DW$969       .dwtag  DW_TAG_member
   15226                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$20)
   15227                      .dwattr $C$DW$969, DW_AT_name("SDIOIST")
   15228                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_SDIOIST")
   15229                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   15230                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
   15231              $C$DW$970       .dwtag  DW_TAG_member
   15232                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$51)
   15233                      .dwattr $C$DW$970, DW_AT_name("RSVD23")
   15234                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_RSVD23")
   15235                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
   15236                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
   15237              $C$DW$971       .dwtag  DW_TAG_member
   15238                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$20)
   15239                      .dwattr $C$DW$971, DW_AT_name("MMCFIFOCTL")
   15240                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_MMCFIFOCTL")
   15241                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
   15242                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
   15243                      .dwendtag $C$DW$T$55
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  354

   15244              
   15245              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
   15246                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$55)
   15247                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
   15248              $C$DW$972       .dwtag  DW_TAG_TI_far_type
   15249                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$77)
   15250              $C$DW$973       .dwtag  DW_TAG_TI_ioport_type
   15251                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$972)
   15252              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
   15253                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$973)
   15254              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   15255                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
   15256                      .dwattr $C$DW$T$79, DW_AT_address_class(0x10)
   15257              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
   15258                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   15259                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   15260              
   15261              $C$DW$T$58      .dwtag  DW_TAG_structure_type
   15262                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
   15263              $C$DW$974       .dwtag  DW_TAG_member
   15264                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$19)
   15265                      .dwattr $C$DW$974, DW_AT_name("mfgId")
   15266                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_mfgId")
   15267                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15268                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
   15269              $C$DW$975       .dwtag  DW_TAG_member
   15270                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$19)
   15271                      .dwattr $C$DW$975, DW_AT_name("oemAppId")
   15272                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_oemAppId")
   15273                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15274                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
   15275              $C$DW$976       .dwtag  DW_TAG_member
   15276                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$57)
   15277                      .dwattr $C$DW$976, DW_AT_name("productName")
   15278                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_productName")
   15279                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15280                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
   15281              $C$DW$977       .dwtag  DW_TAG_member
   15282                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$19)
   15283                      .dwattr $C$DW$977, DW_AT_name("productRev")
   15284                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_productRev")
   15285                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15286                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
   15287              $C$DW$978       .dwtag  DW_TAG_member
   15288                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$49)
   15289                      .dwattr $C$DW$978, DW_AT_name("serialNumber")
   15290                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_serialNumber")
   15291                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15292                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
   15293              $C$DW$979       .dwtag  DW_TAG_member
   15294                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$19)
   15295                      .dwattr $C$DW$979, DW_AT_name("month")
   15296                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_month")
   15297                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15298                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  355

   15299              $C$DW$980       .dwtag  DW_TAG_member
   15300                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$19)
   15301                      .dwattr $C$DW$980, DW_AT_name("year")
   15302                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_year")
   15303                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15304                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
   15305              $C$DW$981       .dwtag  DW_TAG_member
   15306                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$19)
   15307                      .dwattr $C$DW$981, DW_AT_name("checksum")
   15308                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_checksum")
   15309                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15310                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
   15311                      .dwendtag $C$DW$T$58
   15312              
   15313              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardIdObj")
   15314                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$58)
   15315                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
   15316              $C$DW$T$64      .dwtag  DW_TAG_pointer_type
   15317                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
   15318                      .dwattr $C$DW$T$64, DW_AT_address_class(0x17)
   15319              
   15320              $C$DW$T$59      .dwtag  DW_TAG_structure_type
   15321                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x22)
   15322              $C$DW$982       .dwtag  DW_TAG_member
   15323                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$19)
   15324                      .dwattr $C$DW$982, DW_AT_name("csdStruct")
   15325                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_csdStruct")
   15326                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15327                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
   15328              $C$DW$983       .dwtag  DW_TAG_member
   15329                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$19)
   15330                      .dwattr $C$DW$983, DW_AT_name("mmcProt")
   15331                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_mmcProt")
   15332                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15333                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
   15334              $C$DW$984       .dwtag  DW_TAG_member
   15335                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$19)
   15336                      .dwattr $C$DW$984, DW_AT_name("taac")
   15337                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_taac")
   15338                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15339                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
   15340              $C$DW$985       .dwtag  DW_TAG_member
   15341                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$19)
   15342                      .dwattr $C$DW$985, DW_AT_name("nsac")
   15343                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_nsac")
   15344                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15345                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
   15346              $C$DW$986       .dwtag  DW_TAG_member
   15347                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$19)
   15348                      .dwattr $C$DW$986, DW_AT_name("tranSpeed")
   15349                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_tranSpeed")
   15350                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15351                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
   15352              $C$DW$987       .dwtag  DW_TAG_member
   15353                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  356

   15354                      .dwattr $C$DW$987, DW_AT_name("ccc")
   15355                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_ccc")
   15356                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15357                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
   15358              $C$DW$988       .dwtag  DW_TAG_member
   15359                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$19)
   15360                      .dwattr $C$DW$988, DW_AT_name("readBlLen")
   15361                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_readBlLen")
   15362                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15363                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
   15364              $C$DW$989       .dwtag  DW_TAG_member
   15365                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$19)
   15366                      .dwattr $C$DW$989, DW_AT_name("readBlPartial")
   15367                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_readBlPartial")
   15368                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15369                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
   15370              $C$DW$990       .dwtag  DW_TAG_member
   15371                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$19)
   15372                      .dwattr $C$DW$990, DW_AT_name("writeBlkMisalign")
   15373                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_writeBlkMisalign")
   15374                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15375                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
   15376              $C$DW$991       .dwtag  DW_TAG_member
   15377                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$19)
   15378                      .dwattr $C$DW$991, DW_AT_name("readBlkMisalign")
   15379                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_readBlkMisalign")
   15380                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   15381                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
   15382              $C$DW$992       .dwtag  DW_TAG_member
   15383                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$19)
   15384                      .dwattr $C$DW$992, DW_AT_name("dsrImp")
   15385                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_dsrImp")
   15386                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15387                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
   15388              $C$DW$993       .dwtag  DW_TAG_member
   15389                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$19)
   15390                      .dwattr $C$DW$993, DW_AT_name("cSize")
   15391                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_cSize")
   15392                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   15393                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
   15394              $C$DW$994       .dwtag  DW_TAG_member
   15395                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$19)
   15396                      .dwattr $C$DW$994, DW_AT_name("vddRCurrMin")
   15397                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_vddRCurrMin")
   15398                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15399                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
   15400              $C$DW$995       .dwtag  DW_TAG_member
   15401                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$19)
   15402                      .dwattr $C$DW$995, DW_AT_name("vddRCurrMax")
   15403                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_vddRCurrMax")
   15404                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15405                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
   15406              $C$DW$996       .dwtag  DW_TAG_member
   15407                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$19)
   15408                      .dwattr $C$DW$996, DW_AT_name("vddWCurrMin")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  357

   15409                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_vddWCurrMin")
   15410                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15411                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
   15412              $C$DW$997       .dwtag  DW_TAG_member
   15413                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$19)
   15414                      .dwattr $C$DW$997, DW_AT_name("vddWCurrMax")
   15415                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_vddWCurrMax")
   15416                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   15417                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
   15418              $C$DW$998       .dwtag  DW_TAG_member
   15419                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$19)
   15420                      .dwattr $C$DW$998, DW_AT_name("cSizeMult")
   15421                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_cSizeMult")
   15422                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15423                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
   15424              $C$DW$999       .dwtag  DW_TAG_member
   15425                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$19)
   15426                      .dwattr $C$DW$999, DW_AT_name("eraseBlkEnable")
   15427                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_eraseBlkEnable")
   15428                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   15429                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
   15430              $C$DW$1000      .dwtag  DW_TAG_member
   15431                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$19)
   15432                      .dwattr $C$DW$1000, DW_AT_name("eraseGrpSize")
   15433                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_eraseGrpSize")
   15434                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15435                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
   15436              $C$DW$1001      .dwtag  DW_TAG_member
   15437                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$19)
   15438                      .dwattr $C$DW$1001, DW_AT_name("eraseGrpMult")
   15439                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_eraseGrpMult")
   15440                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   15441                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
   15442              $C$DW$1002      .dwtag  DW_TAG_member
   15443                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$19)
   15444                      .dwattr $C$DW$1002, DW_AT_name("wpGrpSize")
   15445                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_wpGrpSize")
   15446                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   15447                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
   15448              $C$DW$1003      .dwtag  DW_TAG_member
   15449                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$19)
   15450                      .dwattr $C$DW$1003, DW_AT_name("wpGrpEnable")
   15451                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_wpGrpEnable")
   15452                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   15453                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
   15454              $C$DW$1004      .dwtag  DW_TAG_member
   15455                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$19)
   15456                      .dwattr $C$DW$1004, DW_AT_name("defaultEcc")
   15457                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_defaultEcc")
   15458                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15459                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
   15460              $C$DW$1005      .dwtag  DW_TAG_member
   15461                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$19)
   15462                      .dwattr $C$DW$1005, DW_AT_name("r2wFactor")
   15463                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_r2wFactor")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  358

   15464                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   15465                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
   15466              $C$DW$1006      .dwtag  DW_TAG_member
   15467                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$19)
   15468                      .dwattr $C$DW$1006, DW_AT_name("writeBlLen")
   15469                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_writeBlLen")
   15470                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   15471                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
   15472              $C$DW$1007      .dwtag  DW_TAG_member
   15473                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$19)
   15474                      .dwattr $C$DW$1007, DW_AT_name("writeBlPartial")
   15475                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_writeBlPartial")
   15476                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   15477                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
   15478              $C$DW$1008      .dwtag  DW_TAG_member
   15479                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$19)
   15480                      .dwattr $C$DW$1008, DW_AT_name("contProtApp")
   15481                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_contProtApp")
   15482                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   15483                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
   15484              $C$DW$1009      .dwtag  DW_TAG_member
   15485                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$19)
   15486                      .dwattr $C$DW$1009, DW_AT_name("fileFmtGrp")
   15487                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_fileFmtGrp")
   15488                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
   15489                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
   15490              $C$DW$1010      .dwtag  DW_TAG_member
   15491                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$19)
   15492                      .dwattr $C$DW$1010, DW_AT_name("copyFlag")
   15493                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_copyFlag")
   15494                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   15495                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
   15496              $C$DW$1011      .dwtag  DW_TAG_member
   15497                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$19)
   15498                      .dwattr $C$DW$1011, DW_AT_name("permWriteProtect")
   15499                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_permWriteProtect")
   15500                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   15501                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
   15502              $C$DW$1012      .dwtag  DW_TAG_member
   15503                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$19)
   15504                      .dwattr $C$DW$1012, DW_AT_name("tmpWriteProtect")
   15505                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_tmpWriteProtect")
   15506                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   15507                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
   15508              $C$DW$1013      .dwtag  DW_TAG_member
   15509                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$19)
   15510                      .dwattr $C$DW$1013, DW_AT_name("fileFmt")
   15511                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_fileFmt")
   15512                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
   15513                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
   15514              $C$DW$1014      .dwtag  DW_TAG_member
   15515                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$19)
   15516                      .dwattr $C$DW$1014, DW_AT_name("ecc")
   15517                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_ecc")
   15518                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  359

   15519                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
   15520              $C$DW$1015      .dwtag  DW_TAG_member
   15521                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$19)
   15522                      .dwattr $C$DW$1015, DW_AT_name("crc")
   15523                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_crc")
   15524                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   15525                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
   15526                      .dwendtag $C$DW$T$59
   15527              
   15528              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardCsdObj")
   15529                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$59)
   15530                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   15531              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
   15532                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
   15533                      .dwattr $C$DW$T$66, DW_AT_address_class(0x17)
   15534              
   15535              $C$DW$T$60      .dwtag  DW_TAG_structure_type
   15536                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x06)
   15537              $C$DW$1016      .dwtag  DW_TAG_member
   15538                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$19)
   15539                      .dwattr $C$DW$1016, DW_AT_name("securitySysId")
   15540                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_securitySysId")
   15541                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15542                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
   15543              $C$DW$1017      .dwtag  DW_TAG_member
   15544                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$19)
   15545                      .dwattr $C$DW$1017, DW_AT_name("securitySysVers")
   15546                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_securitySysVers")
   15547                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15548                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
   15549              $C$DW$1018      .dwtag  DW_TAG_member
   15550                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$19)
   15551                      .dwattr $C$DW$1018, DW_AT_name("maxLicenses")
   15552                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_maxLicenses")
   15553                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15554                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
   15555              $C$DW$1019      .dwtag  DW_TAG_member
   15556                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$49)
   15557                      .dwattr $C$DW$1019, DW_AT_name("xStatus")
   15558                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_xStatus")
   15559                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15560                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
   15561                      .dwendtag $C$DW$T$60
   15562              
   15563              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardXCsdObj")
   15564                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$60)
   15565                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   15566              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
   15567                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
   15568                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
   15569              
   15570              $C$DW$T$69      .dwtag  DW_TAG_structure_type
   15571                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x1e)
   15572              $C$DW$1020      .dwtag  DW_TAG_member
   15573                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$19)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  360

   15574                      .dwattr $C$DW$1020, DW_AT_name("rca")
   15575                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_rca")
   15576                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15577                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
   15578              $C$DW$1021      .dwtag  DW_TAG_member
   15579                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$19)
   15580                      .dwattr $C$DW$1021, DW_AT_name("ST0")
   15581                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_ST0")
   15582                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15583                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
   15584              $C$DW$1022      .dwtag  DW_TAG_member
   15585                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$19)
   15586                      .dwattr $C$DW$1022, DW_AT_name("ST1")
   15587                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_ST1")
   15588                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15589                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
   15590              $C$DW$1023      .dwtag  DW_TAG_member
   15591                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$19)
   15592                      .dwattr $C$DW$1023, DW_AT_name("cardIndex")
   15593                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_cardIndex")
   15594                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15595                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
   15596              $C$DW$1024      .dwtag  DW_TAG_member
   15597                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$49)
   15598                      .dwattr $C$DW$1024, DW_AT_name("maxXfrRate")
   15599                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_maxXfrRate")
   15600                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15601                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
   15602              $C$DW$1025      .dwtag  DW_TAG_member
   15603                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$49)
   15604                      .dwattr $C$DW$1025, DW_AT_name("readAccessTime")
   15605                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_readAccessTime")
   15606                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15607                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
   15608              $C$DW$1026      .dwtag  DW_TAG_member
   15609                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$49)
   15610                      .dwattr $C$DW$1026, DW_AT_name("cardCapacity")
   15611                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_cardCapacity")
   15612                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15613                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
   15614              $C$DW$1027      .dwtag  DW_TAG_member
   15615                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$49)
   15616                      .dwattr $C$DW$1027, DW_AT_name("blockLength")
   15617                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_blockLength")
   15618                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15619                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
   15620              $C$DW$1028      .dwtag  DW_TAG_member
   15621                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$49)
   15622                      .dwattr $C$DW$1028, DW_AT_name("totalSectors")
   15623                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_totalSectors")
   15624                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15625                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
   15626              $C$DW$1029      .dwtag  DW_TAG_member
   15627                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$49)
   15628                      .dwattr $C$DW$1029, DW_AT_name("lastAddrRead")
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  361

   15629                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_lastAddrRead")
   15630                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   15631                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
   15632              $C$DW$1030      .dwtag  DW_TAG_member
   15633                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$49)
   15634                      .dwattr $C$DW$1030, DW_AT_name("lastAddrWritten")
   15635                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_lastAddrWritten")
   15636                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15637                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
   15638              $C$DW$1031      .dwtag  DW_TAG_member
   15639                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$62)
   15640                      .dwattr $C$DW$1031, DW_AT_name("cardType")
   15641                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_cardType")
   15642                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   15643                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
   15644              $C$DW$1032      .dwtag  DW_TAG_member
   15645                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$64)
   15646                      .dwattr $C$DW$1032, DW_AT_name("cid")
   15647                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_cid")
   15648                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   15649                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
   15650              $C$DW$1033      .dwtag  DW_TAG_member
   15651                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$66)
   15652                      .dwattr $C$DW$1033, DW_AT_name("csd")
   15653                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_csd")
   15654                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   15655                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
   15656              $C$DW$1034      .dwtag  DW_TAG_member
   15657                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$68)
   15658                      .dwattr $C$DW$1034, DW_AT_name("xcsd")
   15659                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_xcsd")
   15660                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   15661                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
   15662              $C$DW$1035      .dwtag  DW_TAG_member
   15663                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$31)
   15664                      .dwattr $C$DW$1035, DW_AT_name("sdHcDetected")
   15665                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_sdHcDetected")
   15666                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   15667                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
   15668              $C$DW$1036      .dwtag  DW_TAG_member
   15669                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$31)
   15670                      .dwattr $C$DW$1036, DW_AT_name("cardAtaFsOpen")
   15671                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_cardAtaFsOpen")
   15672                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
   15673                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
   15674              $C$DW$1037      .dwtag  DW_TAG_member
   15675                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$19)
   15676                      .dwattr $C$DW$1037, DW_AT_name("cardMscStatus")
   15677                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_cardMscStatus")
   15678                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   15679                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
   15680                      .dwendtag $C$DW$T$69
   15681              
   15682              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardObj")
   15683                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$69)
TMS320C55x Assembler PC v4.4.1 Fri Sep 14 03:54:38 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_mmcsd.asm                                                        PAGE  362

   15684                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
   15685              $C$DW$T$82      .dwtag  DW_TAG_pointer_type
   15686                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
   15687                      .dwattr $C$DW$T$82, DW_AT_address_class(0x17)
   15688              
   15689              $C$DW$T$74      .dwtag  DW_TAG_structure_type
   15690                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x18)
   15691              $C$DW$1038      .dwtag  DW_TAG_member
   15692                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$73)
   15693                      .dwattr $C$DW$1038, DW_AT_name("isr")
   15694                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_isr")
   15695                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15696                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
   15697                      .dwendtag $C$DW$T$74
   15698              
   15699              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackObj")
   15700                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$74)
   15701                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
   15702              $C$DW$T$84      .dwtag  DW_TAG_pointer_type
   15703                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   15704                      .dwattr $C$DW$T$84, DW_AT_address_class(0x17)
   15705              
   15706              $C$DW$T$75      .dwtag  DW_TAG_structure_type
   15707                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
   15708              $C$DW$1039      .dwtag  DW_TAG_member
   15709                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$19)
   15710                      .dwattr $C$DW$1039, DW_AT_name("slice127_112")
   15711                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_slice127_112")
