TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE    1

    5182              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Thu Sep 20 01:43:25 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4044              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAPingPongMode")
    4045                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4046                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4047              
    4048              $C$DW$T$43      .dwtag  DW_TAG_enumeration_type
    4049                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    4050              $C$DW$122       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_DISABLE"), DW_AT_const_value(0x00)
    4051              $C$DW$123       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_ENABLE"), DW_AT_const_value(0x01)
    4052                      .dwendtag $C$DW$T$43
    4053              
    4054              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAAutoReloadMode")
    4055                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4056                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4057              
    4058              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    4059                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    4060              $C$DW$124       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_1WORD"), DW_AT_const_value(0x00)
    4061              $C$DW$125       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_2WORD"), DW_AT_const_value(0x01)
    4062              $C$DW$126       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_4WORD"), DW_AT_const_value(0x02)
    4063              $C$DW$127       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_8WORD"), DW_AT_const_value(0x03)
    4064              $C$DW$128       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_16WORD"), DW_AT_const_value(0x04)
    4065                      .dwendtag $C$DW$T$45
    4066              
    4067              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMATxBurstLen")
    4068                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    4069                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4070              
    4071              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  105

    4072                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    4073              $C$DW$129       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_NONE"), DW_AT_const_value(0x00)
    4074              $C$DW$130       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_TX"), DW_AT_const_value(0x01)
    4075              $C$DW$131       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
    4076              $C$DW$132       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
    4077              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
    4078              $C$DW$134       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
    4079              $C$DW$135       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
    4080              $C$DW$136       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
    4081              $C$DW$137       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
    4082              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
    4083              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
    4084              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
    4085              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
    4086              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
    4087              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
    4088              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
    4089              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
    4090              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
    4091              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
    4092              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
    4093              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
    4094              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
    4095                      .dwendtag $C$DW$T$47
    4096              
    4097              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
    4098                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    4099                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4100              
    4101              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4102                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x66)
    4103              $C$DW$151       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    4105                      .dwattr $C$DW$151, DW_AT_name("DMACH0SSAL")
    4106                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_DMACH0SSAL")
    4107                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4108                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    4109              $C$DW$152       .dwtag  DW_TAG_member
    4110                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    4111                      .dwattr $C$DW$152, DW_AT_name("DMACH0SSAU")
    4112                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_DMACH0SSAU")
    4113                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4114                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    4115              $C$DW$153       .dwtag  DW_TAG_member
    4116                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    4117                      .dwattr $C$DW$153, DW_AT_name("DMACH0DSAL")
    4118                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_DMACH0DSAL")
    4119                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4120                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    4121              $C$DW$154       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    4123                      .dwattr $C$DW$154, DW_AT_name("DMACH0DSAU")
    4124                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_DMACH0DSAU")
    4125                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4126                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  106

    4127              $C$DW$155       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    4129                      .dwattr $C$DW$155, DW_AT_name("DMACH0TCR1")
    4130                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DMACH0TCR1")
    4131                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4132                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    4133              $C$DW$156       .dwtag  DW_TAG_member
    4134                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    4135                      .dwattr $C$DW$156, DW_AT_name("DMACH0TCR2")
    4136                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_DMACH0TCR2")
    4137                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4138                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    4139              $C$DW$157       .dwtag  DW_TAG_member
    4140                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$21)
    4141                      .dwattr $C$DW$157, DW_AT_name("RSVD0")
    4142                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_RSVD0")
    4143                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4144                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    4145              $C$DW$158       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    4147                      .dwattr $C$DW$158, DW_AT_name("DMACH1SSAL")
    4148                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_DMACH1SSAL")
    4149                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4150                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    4151              $C$DW$159       .dwtag  DW_TAG_member
    4152                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    4153                      .dwattr $C$DW$159, DW_AT_name("DMACH1SSAU")
    4154                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_DMACH1SSAU")
    4155                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4156                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    4157              $C$DW$160       .dwtag  DW_TAG_member
    4158                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    4159                      .dwattr $C$DW$160, DW_AT_name("DMACH1DSAL")
    4160                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_DMACH1DSAL")
    4161                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4162                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    4163              $C$DW$161       .dwtag  DW_TAG_member
    4164                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    4165                      .dwattr $C$DW$161, DW_AT_name("DMACH1DSAU")
    4166                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_DMACH1DSAU")
    4167                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4168                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    4169              $C$DW$162       .dwtag  DW_TAG_member
    4170                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    4171                      .dwattr $C$DW$162, DW_AT_name("DMACH1TCR1")
    4172                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_DMACH1TCR1")
    4173                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4174                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    4175              $C$DW$163       .dwtag  DW_TAG_member
    4176                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    4177                      .dwattr $C$DW$163, DW_AT_name("DMACH1TCR2")
    4178                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_DMACH1TCR2")
    4179                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4180                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    4181              $C$DW$164       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  107

    4182                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    4183                      .dwattr $C$DW$164, DW_AT_name("RSVD1")
    4184                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_RSVD1")
    4185                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4186                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    4187              $C$DW$165       .dwtag  DW_TAG_member
    4188                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    4189                      .dwattr $C$DW$165, DW_AT_name("DMACH2SSAL")
    4190                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_DMACH2SSAL")
    4191                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4192                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    4193              $C$DW$166       .dwtag  DW_TAG_member
    4194                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    4195                      .dwattr $C$DW$166, DW_AT_name("DMACH2SSAU")
    4196                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_DMACH2SSAU")
    4197                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4198                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    4199              $C$DW$167       .dwtag  DW_TAG_member
    4200                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    4201                      .dwattr $C$DW$167, DW_AT_name("DMACH2DSAL")
    4202                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_DMACH2DSAL")
    4203                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4204                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    4205              $C$DW$168       .dwtag  DW_TAG_member
    4206                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    4207                      .dwattr $C$DW$168, DW_AT_name("DMACH2DSAU")
    4208                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_DMACH2DSAU")
    4209                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4210                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    4211              $C$DW$169       .dwtag  DW_TAG_member
    4212                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    4213                      .dwattr $C$DW$169, DW_AT_name("DMACH2TCR1")
    4214                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_DMACH2TCR1")
    4215                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4216                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    4217              $C$DW$170       .dwtag  DW_TAG_member
    4218                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    4219                      .dwattr $C$DW$170, DW_AT_name("DMACH2TCR2")
    4220                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_DMACH2TCR2")
    4221                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4222                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    4223              $C$DW$171       .dwtag  DW_TAG_member
    4224                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    4225                      .dwattr $C$DW$171, DW_AT_name("RSVD2")
    4226                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD2")
    4227                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4228                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    4229              $C$DW$172       .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    4231                      .dwattr $C$DW$172, DW_AT_name("DMACH3SSAL")
    4232                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_DMACH3SSAL")
    4233                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4234                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    4235              $C$DW$173       .dwtag  DW_TAG_member
    4236                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  108

    4237                      .dwattr $C$DW$173, DW_AT_name("DMACH3SSAU")
    4238                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_DMACH3SSAU")
    4239                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    4240                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    4241              $C$DW$174       .dwtag  DW_TAG_member
    4242                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    4243                      .dwattr $C$DW$174, DW_AT_name("DMACH3DSAL")
    4244                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_DMACH3DSAL")
    4245                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4246                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    4247              $C$DW$175       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$20)
    4249                      .dwattr $C$DW$175, DW_AT_name("DMACH3DSAU")
    4250                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_DMACH3DSAU")
    4251                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    4252                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    4253              $C$DW$176       .dwtag  DW_TAG_member
    4254                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    4255                      .dwattr $C$DW$176, DW_AT_name("DMACH3TCR1")
    4256                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_DMACH3TCR1")
    4257                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4258                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    4259              $C$DW$177       .dwtag  DW_TAG_member
    4260                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    4261                      .dwattr $C$DW$177, DW_AT_name("DMACH3TCR2")
    4262                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_DMACH3TCR2")
    4263                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    4264                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    4265                      .dwendtag $C$DW$T$22
    4266              
    4267              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    4268                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    4269                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4270              $C$DW$178       .dwtag  DW_TAG_TI_far_type
    4271                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$23)
    4272              $C$DW$179       .dwtag  DW_TAG_TI_ioport_type
    4273                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$178)
    4274              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    4275                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$179)
    4276              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    4277                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    4278                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    4279              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    4280                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    4281                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    4282              
    4283              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4284                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x09)
    4285              $C$DW$180       .dwtag  DW_TAG_member
    4286                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$26)
    4287                      .dwattr $C$DW$180, DW_AT_name("dmaRegs")
    4288                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_dmaRegs")
    4289                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4290                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    4291              $C$DW$181       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  109

    4292                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$28)
    4293                      .dwattr $C$DW$181, DW_AT_name("chanNum")
    4294                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_chanNum")
    4295                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4296                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    4297              $C$DW$182       .dwtag  DW_TAG_member
    4298                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$30)
    4299                      .dwattr $C$DW$182, DW_AT_name("dmaInstNum")
    4300                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_dmaInstNum")
    4301                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4302                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    4303              $C$DW$183       .dwtag  DW_TAG_member
    4304                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$31)
    4305                      .dwattr $C$DW$183, DW_AT_name("isChanFree")
    4306                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_isChanFree")
    4307                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4308                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    4309              $C$DW$184       .dwtag  DW_TAG_member
    4310                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$33)
    4311                      .dwattr $C$DW$184, DW_AT_name("chanDir")
    4312                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_chanDir")
    4313                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4314                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    4315              $C$DW$185       .dwtag  DW_TAG_member
    4316                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$35)
    4317                      .dwattr $C$DW$185, DW_AT_name("trigger")
    4318                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_trigger")
    4319                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4320                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    4321              $C$DW$186       .dwtag  DW_TAG_member
    4322                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$37)
    4323                      .dwattr $C$DW$186, DW_AT_name("trfType")
    4324                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_trfType")
    4325                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4326                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    4327              $C$DW$187       .dwtag  DW_TAG_member
    4328                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$39)
    4329                      .dwattr $C$DW$187, DW_AT_name("dmaInt")
    4330                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_dmaInt")
    4331                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4332                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    4333              $C$DW$188       .dwtag  DW_TAG_member
    4334                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
    4335                      .dwattr $C$DW$188, DW_AT_name("pingPongEnabled")
    4336                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_pingPongEnabled")
    4337                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4338                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    4339                      .dwendtag $C$DW$T$40
    4340              
    4341              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
    4342                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$40)
    4343                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4344              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    4345                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    4346                      .dwattr $C$DW$T$56, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  110

    4347              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
    4348                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    4349                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4350              
    4351              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4352                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x0e)
    4353              $C$DW$189       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$42)
    4355                      .dwattr $C$DW$189, DW_AT_name("pingPongMode")
    4356                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_pingPongMode")
    4357                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4358                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    4359              $C$DW$190       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$44)
    4361                      .dwattr $C$DW$190, DW_AT_name("autoMode")
    4362                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_autoMode")
    4363                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4364                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    4365              $C$DW$191       .dwtag  DW_TAG_member
    4366                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$46)
    4367                      .dwattr $C$DW$191, DW_AT_name("burstLen")
    4368                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_burstLen")
    4369                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4370                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    4371              $C$DW$192       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$35)
    4373                      .dwattr $C$DW$192, DW_AT_name("trigger")
    4374                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_trigger")
    4375                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4376                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    4377              $C$DW$193       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$48)
    4379                      .dwattr $C$DW$193, DW_AT_name("dmaEvt")
    4380                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_dmaEvt")
    4381                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4382                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    4383              $C$DW$194       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$39)
    4385                      .dwattr $C$DW$194, DW_AT_name("dmaInt")
    4386                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_dmaInt")
    4387                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4388                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    4389              $C$DW$195       .dwtag  DW_TAG_member
    4390                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$33)
    4391                      .dwattr $C$DW$195, DW_AT_name("chanDir")
    4392                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_chanDir")
    4393                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4394                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    4395              $C$DW$196       .dwtag  DW_TAG_member
    4396                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$37)
    4397                      .dwattr $C$DW$196, DW_AT_name("trfType")
    4398                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_trfType")
    4399                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4400                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    4401              $C$DW$197       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  111

    4402                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    4403                      .dwattr $C$DW$197, DW_AT_name("dataLen")
    4404                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_dataLen")
    4405                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4406                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    4407              $C$DW$198       .dwtag  DW_TAG_member
    4408                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$49)
    4409                      .dwattr $C$DW$198, DW_AT_name("srcAddr")
    4410                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_srcAddr")
    4411                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4412                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    4413              $C$DW$199       .dwtag  DW_TAG_member
    4414                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$49)
    4415                      .dwattr $C$DW$199, DW_AT_name("destAddr")
    4416                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_destAddr")
    4417                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4418                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    4419                      .dwendtag $C$DW$T$50
    4420              
    4421              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
    4422                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$50)
    4423                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4424              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    4425                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    4426                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
    4427              
    4428              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4429                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x48)
    4430              $C$DW$200       .dwtag  DW_TAG_member
    4431                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$20)
    4432                      .dwattr $C$DW$200, DW_AT_name("EBSR")
    4433                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_EBSR")
    4434                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4435                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    4436              $C$DW$201       .dwtag  DW_TAG_member
    4437                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$20)
    4438                      .dwattr $C$DW$201, DW_AT_name("RSVD0")
    4439                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_RSVD0")
    4440                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4441                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    4442              $C$DW$202       .dwtag  DW_TAG_member
    4443                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    4444                      .dwattr $C$DW$202, DW_AT_name("PCGCR1")
    4445                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PCGCR1")
    4446                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4447                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    4448              $C$DW$203       .dwtag  DW_TAG_member
    4449                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    4450                      .dwattr $C$DW$203, DW_AT_name("PCGCR2")
    4451                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PCGCR2")
    4452                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4453                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    4454              $C$DW$204       .dwtag  DW_TAG_member
    4455                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$20)
    4456                      .dwattr $C$DW$204, DW_AT_name("PSRCR")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  112

    4457                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_PSRCR")
    4458                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4459                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    4460              $C$DW$205       .dwtag  DW_TAG_member
    4461                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$20)
    4462                      .dwattr $C$DW$205, DW_AT_name("PRCR")
    4463                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_PRCR")
    4464                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4465                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    4466              $C$DW$206       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$51)
    4468                      .dwattr $C$DW$206, DW_AT_name("RSVD1")
    4469                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_RSVD1")
    4470                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4471                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    4472              $C$DW$207       .dwtag  DW_TAG_member
    4473                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$20)
    4474                      .dwattr $C$DW$207, DW_AT_name("TIAFR")
    4475                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_TIAFR")
    4476                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4477                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    4478              $C$DW$208       .dwtag  DW_TAG_member
    4479                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    4480                      .dwattr $C$DW$208, DW_AT_name("RSVD2")
    4481                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_RSVD2")
    4482                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4483                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    4484              $C$DW$209       .dwtag  DW_TAG_member
    4485                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    4486                      .dwattr $C$DW$209, DW_AT_name("ODSCR")
    4487                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_ODSCR")
    4488                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4489                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    4490              $C$DW$210       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    4492                      .dwattr $C$DW$210, DW_AT_name("PDINHIBR1")
    4493                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_PDINHIBR1")
    4494                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4495                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4496              $C$DW$211       .dwtag  DW_TAG_member
    4497                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    4498                      .dwattr $C$DW$211, DW_AT_name("PDINHIBR2")
    4499                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_PDINHIBR2")
    4500                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4501                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4502              $C$DW$212       .dwtag  DW_TAG_member
    4503                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    4504                      .dwattr $C$DW$212, DW_AT_name("PDINHIBR3")
    4505                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PDINHIBR3")
    4506                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4507                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4508              $C$DW$213       .dwtag  DW_TAG_member
    4509                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    4510                      .dwattr $C$DW$213, DW_AT_name("DMA0CESR1")
    4511                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_DMA0CESR1")
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  113

    4512                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4513                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4514              $C$DW$214       .dwtag  DW_TAG_member
    4515                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$20)
    4516                      .dwattr $C$DW$214, DW_AT_name("DMA0CESR2")
    4517                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DMA0CESR2")
    4518                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4519                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4520              $C$DW$215       .dwtag  DW_TAG_member
    4521                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    4522                      .dwattr $C$DW$215, DW_AT_name("DMA1CESR1")
    4523                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_DMA1CESR1")
    4524                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4525                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4526              $C$DW$216       .dwtag  DW_TAG_member
    4527                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    4528                      .dwattr $C$DW$216, DW_AT_name("DMA1CESR2")
    4529                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_DMA1CESR2")
    4530                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4531                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4532              $C$DW$217       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    4534                      .dwattr $C$DW$217, DW_AT_name("SDRAMCCR")
    4535                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_SDRAMCCR")
    4536                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4537                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4538              $C$DW$218       .dwtag  DW_TAG_member
    4539                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    4540                      .dwattr $C$DW$218, DW_AT_name("CCR2")
    4541                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_CCR2")
    4542                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4543                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4544              $C$DW$219       .dwtag  DW_TAG_member
    4545                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    4546                      .dwattr $C$DW$219, DW_AT_name("CGCR1")
    4547                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_CGCR1")
    4548                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4549                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4550              $C$DW$220       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    4552                      .dwattr $C$DW$220, DW_AT_name("CGICR")
    4553                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_CGICR")
    4554                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4555                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4556              $C$DW$221       .dwtag  DW_TAG_member
    4557                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    4558                      .dwattr $C$DW$221, DW_AT_name("CGCR2")
    4559                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_CGCR2")
    4560                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4561                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4562              $C$DW$222       .dwtag  DW_TAG_member
    4563                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    4564                      .dwattr $C$DW$222, DW_AT_name("CGOCR")
    4565                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_CGOCR")
    4566                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  114

    4567                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4568              $C$DW$223       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    4570                      .dwattr $C$DW$223, DW_AT_name("CCSSR")
    4571                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_CCSSR")
    4572                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4573                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4574              $C$DW$224       .dwtag  DW_TAG_member
    4575                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    4576                      .dwattr $C$DW$224, DW_AT_name("RSVD3")
    4577                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_RSVD3")
    4578                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4579                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4580              $C$DW$225       .dwtag  DW_TAG_member
    4581                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    4582                      .dwattr $C$DW$225, DW_AT_name("ECDR")
    4583                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_ECDR")
    4584                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4585                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4586              $C$DW$226       .dwtag  DW_TAG_member
    4587                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    4588                      .dwattr $C$DW$226, DW_AT_name("RSVD4")
    4589                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_RSVD4")
    4590                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4591                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4592              $C$DW$227       .dwtag  DW_TAG_member
    4593                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    4594                      .dwattr $C$DW$227, DW_AT_name("RAMSLPMDCNTLR1")
    4595                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4596                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4597                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4598              $C$DW$228       .dwtag  DW_TAG_member
    4599                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    4600                      .dwattr $C$DW$228, DW_AT_name("RSVD5")
    4601                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_RSVD5")
    4602                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4603                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4604              $C$DW$229       .dwtag  DW_TAG_member
    4605                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    4606                      .dwattr $C$DW$229, DW_AT_name("RAMSLPMDCNTLR2")
    4607                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4608                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4609                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4610              $C$DW$230       .dwtag  DW_TAG_member
    4611                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    4612                      .dwattr $C$DW$230, DW_AT_name("RAMSLPMDCNTLR3")
    4613                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4614                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4615                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4616              $C$DW$231       .dwtag  DW_TAG_member
    4617                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    4618                      .dwattr $C$DW$231, DW_AT_name("RAMSLPMDCNTLR4")
    4619                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4620                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4621                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  115

    4622              $C$DW$232       .dwtag  DW_TAG_member
    4623                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    4624                      .dwattr $C$DW$232, DW_AT_name("RAMSLPMDCNTLR5")
    4625                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4626                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4627                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4628              $C$DW$233       .dwtag  DW_TAG_member
    4629                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$52)
    4630                      .dwattr $C$DW$233, DW_AT_name("RSVD6")
    4631                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_RSVD6")
    4632                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4633                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4634              $C$DW$234       .dwtag  DW_TAG_member
    4635                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    4636                      .dwattr $C$DW$234, DW_AT_name("DMAIFR")
    4637                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_DMAIFR")
    4638                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4639                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4640              $C$DW$235       .dwtag  DW_TAG_member
    4641                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    4642                      .dwattr $C$DW$235, DW_AT_name("DMAIER")
    4643                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_DMAIER")
    4644                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4645                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4646              $C$DW$236       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    4648                      .dwattr $C$DW$236, DW_AT_name("USBSCR")
    4649                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_USBSCR")
    4650                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4651                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4652              $C$DW$237       .dwtag  DW_TAG_member
    4653                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    4654                      .dwattr $C$DW$237, DW_AT_name("ESCR")
    4655                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ESCR")
    4656                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4657                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4658              $C$DW$238       .dwtag  DW_TAG_member
    4659                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$52)
    4660                      .dwattr $C$DW$238, DW_AT_name("RSVD7")
    4661                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_RSVD7")
    4662                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4663                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4664              $C$DW$239       .dwtag  DW_TAG_member
    4665                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    4666                      .dwattr $C$DW$239, DW_AT_name("DMA2CESR1")
    4667                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_DMA2CESR1")
    4668                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4669                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4670              $C$DW$240       .dwtag  DW_TAG_member
    4671                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    4672                      .dwattr $C$DW$240, DW_AT_name("DMA2CESR2")
    4673                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_DMA2CESR2")
    4674                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4675                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4676              $C$DW$241       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  116

    4677                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
    4678                      .dwattr $C$DW$241, DW_AT_name("DMA3CESR1")
    4679                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_DMA3CESR1")
    4680                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4681                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4682              $C$DW$242       .dwtag  DW_TAG_member
    4683                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    4684                      .dwattr $C$DW$242, DW_AT_name("DMA3CESR2")
    4685                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_DMA3CESR2")
    4686                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4687                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4688              $C$DW$243       .dwtag  DW_TAG_member
    4689                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    4690                      .dwattr $C$DW$243, DW_AT_name("CLKSTOP")
    4691                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_CLKSTOP")
    4692                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4693                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4694              $C$DW$244       .dwtag  DW_TAG_member
    4695                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$53)
    4696                      .dwattr $C$DW$244, DW_AT_name("RSVD8")
    4697                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_RSVD8")
    4698                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4699                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4700              $C$DW$245       .dwtag  DW_TAG_member
    4701                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    4702                      .dwattr $C$DW$245, DW_AT_name("DIEIDR0")
    4703                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_DIEIDR0")
    4704                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4705                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4706              $C$DW$246       .dwtag  DW_TAG_member
    4707                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    4708                      .dwattr $C$DW$246, DW_AT_name("DIEIDR1")
    4709                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_DIEIDR1")
    4710                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4711                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4712              $C$DW$247       .dwtag  DW_TAG_member
    4713                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    4714                      .dwattr $C$DW$247, DW_AT_name("DIEIDR2")
    4715                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_DIEIDR2")
    4716                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4717                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4718              $C$DW$248       .dwtag  DW_TAG_member
    4719                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    4720                      .dwattr $C$DW$248, DW_AT_name("DIEIDR3")
    4721                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_DIEIDR3")
    4722                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4723                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4724              $C$DW$249       .dwtag  DW_TAG_member
    4725                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    4726                      .dwattr $C$DW$249, DW_AT_name("DIEIDR4")
    4727                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_DIEIDR4")
    4728                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4729                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4730              $C$DW$250       .dwtag  DW_TAG_member
    4731                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  117

    4732                      .dwattr $C$DW$250, DW_AT_name("DIEIDR5")
    4733                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_DIEIDR5")
    4734                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4735                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4736              $C$DW$251       .dwtag  DW_TAG_member
    4737                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    4738                      .dwattr $C$DW$251, DW_AT_name("DIEIDR6")
    4739                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_DIEIDR6")
    4740                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4741                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4742              $C$DW$252       .dwtag  DW_TAG_member
    4743                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    4744                      .dwattr $C$DW$252, DW_AT_name("DIEIDR7")
    4745                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_DIEIDR7")
    4746                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4747                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4748                      .dwendtag $C$DW$T$54
    4749              
    4750              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4751                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$54)
    4752                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4753              $C$DW$253       .dwtag  DW_TAG_TI_far_type
    4754                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$64)
    4755              $C$DW$254       .dwtag  DW_TAG_TI_ioport_type
    4756                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$253)
    4757              $C$DW$T$65      .dwtag  DW_TAG_volatile_type
    4758                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$254)
    4759              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    4760                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    4761                      .dwattr $C$DW$T$66, DW_AT_address_class(0x10)
    4762              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4763                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    4764                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    4765              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4766                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4767                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4768                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4769              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4770                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4771                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4772                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4773              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4774                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4775                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4776                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4777              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4778                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4779                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4780                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4781              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4782                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4783                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4784                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4785              $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    4786                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$8)
TMS320C55x Assembler PC v4.4.1 Thu Sep 20 01:43:28 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dma.asm                                                          PAGE  118

    4787                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4788              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    4789                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    4790                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4791              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    4792                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4793                      .dwattr $C$DW$T$60, DW_AT_address_class(0x17)
    4794              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4795                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4796                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4797                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
