TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE    1

    6016              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Tue Sep 18 04:50:43 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4337              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_512"), DW_AT_const_value(0x01)
    4338              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_1024"), DW_AT_const_value(0x02)
    4339              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_PAGESZ_2048"), DW_AT_const_value(0x03)
    4340                      .dwendtag $C$DW$T$42
    4341              
    4342              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandPageSize")
    4343                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4344                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4345              
    4346              $C$DW$T$44      .dwtag  DW_TAG_enumeration_type
    4347                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    4348              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_0"), DW_AT_const_value(0x00)
    4349              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_1"), DW_AT_const_value(0x01)
    4350              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_2"), DW_AT_const_value(0x02)
    4351              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_3"), DW_AT_const_value(0x03)
    4352              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BANK_MAX"), DW_AT_const_value(0x04)
    4353                      .dwendtag $C$DW$T$44
    4354              
    4355              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandBankNo")
    4356                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4357                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4358              
    4359              $C$DW$T$46      .dwtag  DW_TAG_enumeration_type
    4360                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    4361              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_16BIT"), DW_AT_const_value(0x00)
    4362              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_HIGH"), DW_AT_const_value(0x01)
    4363              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_EMIF_8BIT_LOW"), DW_AT_const_value(0x02)
    4364                      .dwendtag $C$DW$T$46
    4365              
    4366              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandEmifAccess")
    4367                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4368                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4369              
    4370              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    4371                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    4372              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_POLLED"), DW_AT_const_value(0x00)
    4373              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_DMA"), DW_AT_const_value(0x01)
    4374              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_OPMODE_INTRRUPT"), DW_AT_const_value(0x02)
    4375                      .dwendtag $C$DW$T$48
    4376              
    4377              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandOpMode")
    4378                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4379                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4380              
    4381              $C$DW$T$50      .dwtag  DW_TAG_enumeration_type
    4382                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    4383              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_NONE"), DW_AT_const_value(0x00)
    4384              $C$DW$256       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_BIG_BLOCK"), DW_AT_const_value(0x01)
    4385              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_SMALL_BLOCK"), DW_AT_const_value(0x02)
    4386              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_INVALID"), DW_AT_const_value(0x03)
    4387                      .dwendtag $C$DW$T$50
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  100

    4388              
    4389              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandType")
    4390                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    4391                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    4392              
    4393              $C$DW$T$52      .dwtag  DW_TAG_enumeration_type
    4394                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    4395              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS2"), DW_AT_const_value(0x00)
    4396              $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS3"), DW_AT_const_value(0x01)
    4397              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS4"), DW_AT_const_value(0x02)
    4398              $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_NAND_CS5"), DW_AT_const_value(0x03)
    4399                      .dwendtag $C$DW$T$52
    4400              
    4401              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandChipSelect")
    4402                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    4403                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4404              
    4405              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4406                      .dwattr $C$DW$T$27, DW_AT_byte_size(0xde)
    4407              $C$DW$263       .dwtag  DW_TAG_member
    4408                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    4409                      .dwattr $C$DW$263, DW_AT_name("REV")
    4410                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_REV")
    4411                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4412                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4413              $C$DW$264       .dwtag  DW_TAG_member
    4414                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    4415                      .dwattr $C$DW$264, DW_AT_name("STATUS")
    4416                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_STATUS")
    4417                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4418                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4419              $C$DW$265       .dwtag  DW_TAG_member
    4420                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$21)
    4421                      .dwattr $C$DW$265, DW_AT_name("RSVD0")
    4422                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_RSVD0")
    4423                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4424                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4425              $C$DW$266       .dwtag  DW_TAG_member
    4426                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    4427                      .dwattr $C$DW$266, DW_AT_name("AWCCR1")
    4428                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_AWCCR1")
    4429                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4430                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4431              $C$DW$267       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    4433                      .dwattr $C$DW$267, DW_AT_name("AWCCR2")
    4434                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_AWCCR2")
    4435                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4436                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4437              $C$DW$268       .dwtag  DW_TAG_member
    4438                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$21)
    4439                      .dwattr $C$DW$268, DW_AT_name("RSVD1")
    4440                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_RSVD1")
    4441                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4442                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  101

    4443              $C$DW$269       .dwtag  DW_TAG_member
    4444                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    4445                      .dwattr $C$DW$269, DW_AT_name("SDCR1")
    4446                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_SDCR1")
    4447                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4448                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4449              $C$DW$270       .dwtag  DW_TAG_member
    4450                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$20)
    4451                      .dwattr $C$DW$270, DW_AT_name("SDCR2")
    4452                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_SDCR2")
    4453                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4454                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4455              $C$DW$271       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$21)
    4457                      .dwattr $C$DW$271, DW_AT_name("RSVD2")
    4458                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_RSVD2")
    4459                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4460                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4461              $C$DW$272       .dwtag  DW_TAG_member
    4462                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    4463                      .dwattr $C$DW$272, DW_AT_name("SDRCR")
    4464                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_SDRCR")
    4465                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4466                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4467              $C$DW$273       .dwtag  DW_TAG_member
    4468                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$22)
    4469                      .dwattr $C$DW$273, DW_AT_name("RSVD3")
    4470                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_RSVD3")
    4471                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4472                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4473              $C$DW$274       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    4475                      .dwattr $C$DW$274, DW_AT_name("ACS2CR1")
    4476                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_ACS2CR1")
    4477                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4478                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4479              $C$DW$275       .dwtag  DW_TAG_member
    4480                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    4481                      .dwattr $C$DW$275, DW_AT_name("ACS2CR2")
    4482                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_ACS2CR2")
    4483                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4484                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4485              $C$DW$276       .dwtag  DW_TAG_member
    4486                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$21)
    4487                      .dwattr $C$DW$276, DW_AT_name("RSVD4")
    4488                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_RSVD4")
    4489                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4490                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4491              $C$DW$277       .dwtag  DW_TAG_member
    4492                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    4493                      .dwattr $C$DW$277, DW_AT_name("ACS3CR1")
    4494                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_ACS3CR1")
    4495                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4496                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4497              $C$DW$278       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  102

    4498                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    4499                      .dwattr $C$DW$278, DW_AT_name("ACS3CR2")
    4500                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_ACS3CR2")
    4501                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4502                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4503              $C$DW$279       .dwtag  DW_TAG_member
    4504                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$21)
    4505                      .dwattr $C$DW$279, DW_AT_name("RSVD5")
    4506                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_RSVD5")
    4507                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4508                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4509              $C$DW$280       .dwtag  DW_TAG_member
    4510                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    4511                      .dwattr $C$DW$280, DW_AT_name("ACS4CR1")
    4512                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_ACS4CR1")
    4513                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4514                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4515              $C$DW$281       .dwtag  DW_TAG_member
    4516                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    4517                      .dwattr $C$DW$281, DW_AT_name("ACS4CR2")
    4518                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_ACS4CR2")
    4519                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4520                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4521              $C$DW$282       .dwtag  DW_TAG_member
    4522                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    4523                      .dwattr $C$DW$282, DW_AT_name("RSVD6")
    4524                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_RSVD6")
    4525                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4526                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4527              $C$DW$283       .dwtag  DW_TAG_member
    4528                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    4529                      .dwattr $C$DW$283, DW_AT_name("ACS5CR1")
    4530                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_ACS5CR1")
    4531                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4532                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4533              $C$DW$284       .dwtag  DW_TAG_member
    4534                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    4535                      .dwattr $C$DW$284, DW_AT_name("ACS5CR2")
    4536                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_ACS5CR2")
    4537                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4538                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4539              $C$DW$285       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    4541                      .dwattr $C$DW$285, DW_AT_name("RSVD7")
    4542                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_RSVD7")
    4543                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4544                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4545              $C$DW$286       .dwtag  DW_TAG_member
    4546                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    4547                      .dwattr $C$DW$286, DW_AT_name("SDTIMR1")
    4548                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_SDTIMR1")
    4549                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4550                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4551              $C$DW$287       .dwtag  DW_TAG_member
    4552                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$23)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  103

    4553                      .dwattr $C$DW$287, DW_AT_name("RSVD8")
    4554                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_RSVD8")
    4555                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4556                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4557              $C$DW$288       .dwtag  DW_TAG_member
    4558                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    4559                      .dwattr $C$DW$288, DW_AT_name("SDSRETR")
    4560                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_SDSRETR")
    4561                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4562                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4563              $C$DW$289       .dwtag  DW_TAG_member
    4564                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$22)
    4565                      .dwattr $C$DW$289, DW_AT_name("RSVD9")
    4566                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_RSVD9")
    4567                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    4568                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4569              $C$DW$290       .dwtag  DW_TAG_member
    4570                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    4571                      .dwattr $C$DW$290, DW_AT_name("EIRR")
    4572                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_EIRR")
    4573                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4574                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4575              $C$DW$291       .dwtag  DW_TAG_member
    4576                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$22)
    4577                      .dwattr $C$DW$291, DW_AT_name("RSVD10")
    4578                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_RSVD10")
    4579                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4580                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4581              $C$DW$292       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    4583                      .dwattr $C$DW$292, DW_AT_name("EIMR")
    4584                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_EIMR")
    4585                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4586                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4587              $C$DW$293       .dwtag  DW_TAG_member
    4588                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$22)
    4589                      .dwattr $C$DW$293, DW_AT_name("RSVD11")
    4590                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_RSVD11")
    4591                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4592                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4593              $C$DW$294       .dwtag  DW_TAG_member
    4594                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    4595                      .dwattr $C$DW$294, DW_AT_name("EIMSR")
    4596                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_EIMSR")
    4597                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4598                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4599              $C$DW$295       .dwtag  DW_TAG_member
    4600                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$22)
    4601                      .dwattr $C$DW$295, DW_AT_name("RSVD12")
    4602                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_RSVD12")
    4603                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    4604                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4605              $C$DW$296       .dwtag  DW_TAG_member
    4606                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    4607                      .dwattr $C$DW$296, DW_AT_name("EIMCR")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  104

    4608                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_EIMCR")
    4609                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4610                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4611              $C$DW$297       .dwtag  DW_TAG_member
    4612                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$24)
    4613                      .dwattr $C$DW$297, DW_AT_name("RSVD13")
    4614                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_RSVD13")
    4615                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    4616                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4617              $C$DW$298       .dwtag  DW_TAG_member
    4618                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    4619                      .dwattr $C$DW$298, DW_AT_name("NANDFCR")
    4620                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_NANDFCR")
    4621                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4622                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4623              $C$DW$299       .dwtag  DW_TAG_member
    4624                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$22)
    4625                      .dwattr $C$DW$299, DW_AT_name("RSVD14")
    4626                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_RSVD14")
    4627                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    4628                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4629              $C$DW$300       .dwtag  DW_TAG_member
    4630                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$20)
    4631                      .dwattr $C$DW$300, DW_AT_name("NANDFSR1")
    4632                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_NANDFSR1")
    4633                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4634                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4635              $C$DW$301       .dwtag  DW_TAG_member
    4636                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    4637                      .dwattr $C$DW$301, DW_AT_name("NANDFSR2")
    4638                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_NANDFSR2")
    4639                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    4640                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4641              $C$DW$302       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$21)
    4643                      .dwattr $C$DW$302, DW_AT_name("RSVD15")
    4644                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_RSVD15")
    4645                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    4646                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4647              $C$DW$303       .dwtag  DW_TAG_member
    4648                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
    4649                      .dwattr $C$DW$303, DW_AT_name("PAGEMODCTRL1")
    4650                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_PAGEMODCTRL1")
    4651                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    4652                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4653              $C$DW$304       .dwtag  DW_TAG_member
    4654                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    4655                      .dwattr $C$DW$304, DW_AT_name("PAGEMODCTRL2")
    4656                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_PAGEMODCTRL2")
    4657                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    4658                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4659              $C$DW$305       .dwtag  DW_TAG_member
    4660                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$25)
    4661                      .dwattr $C$DW$305, DW_AT_name("RSVD16")
    4662                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD16")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  105

    4663                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    4664                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4665              $C$DW$306       .dwtag  DW_TAG_member
    4666                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    4667                      .dwattr $C$DW$306, DW_AT_name("NCS2ECC1")
    4668                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_NCS2ECC1")
    4669                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    4670                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4671              $C$DW$307       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    4673                      .dwattr $C$DW$307, DW_AT_name("NCS2ECC2")
    4674                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_NCS2ECC2")
    4675                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    4676                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4677              $C$DW$308       .dwtag  DW_TAG_member
    4678                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
    4679                      .dwattr $C$DW$308, DW_AT_name("RSVD17")
    4680                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_RSVD17")
    4681                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    4682                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4683              $C$DW$309       .dwtag  DW_TAG_member
    4684                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
    4685                      .dwattr $C$DW$309, DW_AT_name("NCS3ECC1")
    4686                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_NCS3ECC1")
    4687                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    4688                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4689              $C$DW$310       .dwtag  DW_TAG_member
    4690                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    4691                      .dwattr $C$DW$310, DW_AT_name("NCS3ECC2")
    4692                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_NCS3ECC2")
    4693                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x75]
    4694                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4695              $C$DW$311       .dwtag  DW_TAG_member
    4696                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$21)
    4697                      .dwattr $C$DW$311, DW_AT_name("RSVD18")
    4698                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_RSVD18")
    4699                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    4700                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4701              $C$DW$312       .dwtag  DW_TAG_member
    4702                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
    4703                      .dwattr $C$DW$312, DW_AT_name("NCS4ECC1")
    4704                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_NCS4ECC1")
    4705                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4706                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4707              $C$DW$313       .dwtag  DW_TAG_member
    4708                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    4709                      .dwattr $C$DW$313, DW_AT_name("NCS4ECC2")
    4710                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_NCS4ECC2")
    4711                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x79]
    4712                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4713              $C$DW$314       .dwtag  DW_TAG_member
    4714                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    4715                      .dwattr $C$DW$314, DW_AT_name("RSVD19")
    4716                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_RSVD19")
    4717                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  106

    4718                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4719              $C$DW$315       .dwtag  DW_TAG_member
    4720                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
    4721                      .dwattr $C$DW$315, DW_AT_name("NCS5ECC1")
    4722                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_NCS5ECC1")
    4723                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    4724                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4725              $C$DW$316       .dwtag  DW_TAG_member
    4726                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    4727                      .dwattr $C$DW$316, DW_AT_name("NCS5ECC2")
    4728                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_NCS5ECC2")
    4729                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x7d]
    4730                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4731              $C$DW$317       .dwtag  DW_TAG_member
    4732                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$26)
    4733                      .dwattr $C$DW$317, DW_AT_name("RSVD20")
    4734                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_RSVD20")
    4735                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    4736                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4737              $C$DW$318       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
    4739                      .dwattr $C$DW$318, DW_AT_name("NAND4BITECCLOAD")
    4740                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_NAND4BITECCLOAD")
    4741                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4742                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4743              $C$DW$319       .dwtag  DW_TAG_member
    4744                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$22)
    4745                      .dwattr $C$DW$319, DW_AT_name("RSVD21")
    4746                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_RSVD21")
    4747                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xbd]
    4748                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4749              $C$DW$320       .dwtag  DW_TAG_member
    4750                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$20)
    4751                      .dwattr $C$DW$320, DW_AT_name("NAND4BITECC1")
    4752                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_NAND4BITECC1")
    4753                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4754                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4755              $C$DW$321       .dwtag  DW_TAG_member
    4756                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
    4757                      .dwattr $C$DW$321, DW_AT_name("NAND4BITECC2")
    4758                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_NAND4BITECC2")
    4759                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xc1]
    4760                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4761              $C$DW$322       .dwtag  DW_TAG_member
    4762                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    4763                      .dwattr $C$DW$322, DW_AT_name("RSVD22")
    4764                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_RSVD22")
    4765                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    4766                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4767              $C$DW$323       .dwtag  DW_TAG_member
    4768                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
    4769                      .dwattr $C$DW$323, DW_AT_name("NAND4BITECC3")
    4770                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_NAND4BITECC3")
    4771                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4772                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  107

    4773              $C$DW$324       .dwtag  DW_TAG_member
    4774                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$20)
    4775                      .dwattr $C$DW$324, DW_AT_name("NAND4BITECC4")
    4776                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_NAND4BITECC4")
    4777                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
    4778                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4779              $C$DW$325       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
    4781                      .dwattr $C$DW$325, DW_AT_name("RSVD23")
    4782                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_RSVD23")
    4783                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4784                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4785              $C$DW$326       .dwtag  DW_TAG_member
    4786                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$20)
    4787                      .dwattr $C$DW$326, DW_AT_name("NAND4BITECC5")
    4788                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_NAND4BITECC5")
    4789                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4790                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4791              $C$DW$327       .dwtag  DW_TAG_member
    4792                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    4793                      .dwattr $C$DW$327, DW_AT_name("NAND4BITECC6")
    4794                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_NAND4BITECC6")
    4795                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xc9]
    4796                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4797              $C$DW$328       .dwtag  DW_TAG_member
    4798                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
    4799                      .dwattr $C$DW$328, DW_AT_name("RSVD24")
    4800                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_RSVD24")
    4801                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4802                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4803              $C$DW$329       .dwtag  DW_TAG_member
    4804                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$20)
    4805                      .dwattr $C$DW$329, DW_AT_name("NAND4BITECC7")
    4806                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_NAND4BITECC7")
    4807                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4808                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4809              $C$DW$330       .dwtag  DW_TAG_member
    4810                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    4811                      .dwattr $C$DW$330, DW_AT_name("NAND4BITECC8")
    4812                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_NAND4BITECC8")
    4813                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xcd]
    4814                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4815              $C$DW$331       .dwtag  DW_TAG_member
    4816                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    4817                      .dwattr $C$DW$331, DW_AT_name("RSVD25")
    4818                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_RSVD25")
    4819                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4820                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4821              $C$DW$332       .dwtag  DW_TAG_member
    4822                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$20)
    4823                      .dwattr $C$DW$332, DW_AT_name("NANDERRADD1")
    4824                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_NANDERRADD1")
    4825                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4826                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4827              $C$DW$333       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  108

    4828                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
    4829                      .dwattr $C$DW$333, DW_AT_name("NANDERRADD2")
    4830                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_NANDERRADD2")
    4831                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xd1]
    4832                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4833              $C$DW$334       .dwtag  DW_TAG_member
    4834                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$21)
    4835                      .dwattr $C$DW$334, DW_AT_name("RSVD26")
    4836                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_RSVD26")
    4837                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4838                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4839              $C$DW$335       .dwtag  DW_TAG_member
    4840                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$20)
    4841                      .dwattr $C$DW$335, DW_AT_name("NANDERRADD3")
    4842                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_NANDERRADD3")
    4843                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4844                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4845              $C$DW$336       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$20)
    4847                      .dwattr $C$DW$336, DW_AT_name("NANDERRADD4")
    4848                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_NANDERRADD4")
    4849                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xd5]
    4850                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4851              $C$DW$337       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$21)
    4853                      .dwattr $C$DW$337, DW_AT_name("RSVD27")
    4854                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_RSVD27")
    4855                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4856                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4857              $C$DW$338       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$20)
    4859                      .dwattr $C$DW$338, DW_AT_name("NANDERRVAL1")
    4860                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_NANDERRVAL1")
    4861                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4862                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    4863              $C$DW$339       .dwtag  DW_TAG_member
    4864                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
    4865                      .dwattr $C$DW$339, DW_AT_name("NANDERRVAL2")
    4866                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_NANDERRVAL2")
    4867                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xd9]
    4868                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    4869              $C$DW$340       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$21)
    4871                      .dwattr $C$DW$340, DW_AT_name("RSVD28")
    4872                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_RSVD28")
    4873                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4874                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    4875              $C$DW$341       .dwtag  DW_TAG_member
    4876                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$20)
    4877                      .dwattr $C$DW$341, DW_AT_name("NANDERRVAL3")
    4878                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_NANDERRVAL3")
    4879                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4880                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    4881              $C$DW$342       .dwtag  DW_TAG_member
    4882                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  109

    4883                      .dwattr $C$DW$342, DW_AT_name("NANDERRVAL4")
    4884                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_NANDERRVAL4")
    4885                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xdd]
    4886                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    4887                      .dwendtag $C$DW$T$27
    4888              
    4889              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegs")
    4890                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$27)
    4891                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4892              $C$DW$343       .dwtag  DW_TAG_TI_far_type
    4893                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$59)
    4894              $C$DW$344       .dwtag  DW_TAG_TI_ioport_type
    4895                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$343)
    4896              $C$DW$T$60      .dwtag  DW_TAG_volatile_type
    4897                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$344)
    4898              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    4899                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    4900                      .dwattr $C$DW$T$61, DW_AT_address_class(0x10)
    4901              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_EmifRegsOvly")
    4902                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    4903                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4904              
    4905              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4906                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x48)
    4907              $C$DW$345       .dwtag  DW_TAG_member
    4908                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
    4909                      .dwattr $C$DW$345, DW_AT_name("EBSR")
    4910                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_EBSR")
    4911                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4912                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4913              $C$DW$346       .dwtag  DW_TAG_member
    4914                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    4915                      .dwattr $C$DW$346, DW_AT_name("RSVD0")
    4916                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_RSVD0")
    4917                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4918                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4919              $C$DW$347       .dwtag  DW_TAG_member
    4920                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$20)
    4921                      .dwattr $C$DW$347, DW_AT_name("PCGCR1")
    4922                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_PCGCR1")
    4923                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4924                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4925              $C$DW$348       .dwtag  DW_TAG_member
    4926                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    4927                      .dwattr $C$DW$348, DW_AT_name("PCGCR2")
    4928                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_PCGCR2")
    4929                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4930                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4931              $C$DW$349       .dwtag  DW_TAG_member
    4932                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    4933                      .dwattr $C$DW$349, DW_AT_name("PSRCR")
    4934                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_PSRCR")
    4935                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4936                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4937              $C$DW$350       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  110

    4938                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
    4939                      .dwattr $C$DW$350, DW_AT_name("PRCR")
    4940                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_PRCR")
    4941                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4942                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4943              $C$DW$351       .dwtag  DW_TAG_member
    4944                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$28)
    4945                      .dwattr $C$DW$351, DW_AT_name("RSVD1")
    4946                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_RSVD1")
    4947                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4948                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4949              $C$DW$352       .dwtag  DW_TAG_member
    4950                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    4951                      .dwattr $C$DW$352, DW_AT_name("TIAFR")
    4952                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_TIAFR")
    4953                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4954                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4955              $C$DW$353       .dwtag  DW_TAG_member
    4956                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    4957                      .dwattr $C$DW$353, DW_AT_name("RSVD2")
    4958                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_RSVD2")
    4959                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4960                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4961              $C$DW$354       .dwtag  DW_TAG_member
    4962                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    4963                      .dwattr $C$DW$354, DW_AT_name("ODSCR")
    4964                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_ODSCR")
    4965                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4966                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4967              $C$DW$355       .dwtag  DW_TAG_member
    4968                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    4969                      .dwattr $C$DW$355, DW_AT_name("PDINHIBR1")
    4970                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_PDINHIBR1")
    4971                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4972                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4973              $C$DW$356       .dwtag  DW_TAG_member
    4974                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    4975                      .dwattr $C$DW$356, DW_AT_name("PDINHIBR2")
    4976                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_PDINHIBR2")
    4977                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4978                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4979              $C$DW$357       .dwtag  DW_TAG_member
    4980                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    4981                      .dwattr $C$DW$357, DW_AT_name("PDINHIBR3")
    4982                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_PDINHIBR3")
    4983                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4984                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4985              $C$DW$358       .dwtag  DW_TAG_member
    4986                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$20)
    4987                      .dwattr $C$DW$358, DW_AT_name("DMA0CESR1")
    4988                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_DMA0CESR1")
    4989                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4990                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4991              $C$DW$359       .dwtag  DW_TAG_member
    4992                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  111

    4993                      .dwattr $C$DW$359, DW_AT_name("DMA0CESR2")
    4994                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_DMA0CESR2")
    4995                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4996                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4997              $C$DW$360       .dwtag  DW_TAG_member
    4998                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    4999                      .dwattr $C$DW$360, DW_AT_name("DMA1CESR1")
    5000                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_DMA1CESR1")
    5001                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5002                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    5003              $C$DW$361       .dwtag  DW_TAG_member
    5004                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    5005                      .dwattr $C$DW$361, DW_AT_name("DMA1CESR2")
    5006                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_DMA1CESR2")
    5007                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5008                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    5009              $C$DW$362       .dwtag  DW_TAG_member
    5010                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    5011                      .dwattr $C$DW$362, DW_AT_name("SDRAMCCR")
    5012                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_SDRAMCCR")
    5013                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5014                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    5015              $C$DW$363       .dwtag  DW_TAG_member
    5016                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    5017                      .dwattr $C$DW$363, DW_AT_name("CCR2")
    5018                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_CCR2")
    5019                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    5020                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    5021              $C$DW$364       .dwtag  DW_TAG_member
    5022                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    5023                      .dwattr $C$DW$364, DW_AT_name("CGCR1")
    5024                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_CGCR1")
    5025                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5026                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    5027              $C$DW$365       .dwtag  DW_TAG_member
    5028                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    5029                      .dwattr $C$DW$365, DW_AT_name("CGICR")
    5030                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_CGICR")
    5031                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5032                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    5033              $C$DW$366       .dwtag  DW_TAG_member
    5034                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    5035                      .dwattr $C$DW$366, DW_AT_name("CGCR2")
    5036                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_CGCR2")
    5037                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5038                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    5039              $C$DW$367       .dwtag  DW_TAG_member
    5040                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    5041                      .dwattr $C$DW$367, DW_AT_name("CGOCR")
    5042                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_CGOCR")
    5043                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    5044                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    5045              $C$DW$368       .dwtag  DW_TAG_member
    5046                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    5047                      .dwattr $C$DW$368, DW_AT_name("CCSSR")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  112

    5048                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_CCSSR")
    5049                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5050                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    5051              $C$DW$369       .dwtag  DW_TAG_member
    5052                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    5053                      .dwattr $C$DW$369, DW_AT_name("RSVD3")
    5054                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_RSVD3")
    5055                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    5056                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    5057              $C$DW$370       .dwtag  DW_TAG_member
    5058                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    5059                      .dwattr $C$DW$370, DW_AT_name("ECDR")
    5060                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ECDR")
    5061                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5062                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    5063              $C$DW$371       .dwtag  DW_TAG_member
    5064                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    5065                      .dwattr $C$DW$371, DW_AT_name("RSVD4")
    5066                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_RSVD4")
    5067                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    5068                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    5069              $C$DW$372       .dwtag  DW_TAG_member
    5070                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    5071                      .dwattr $C$DW$372, DW_AT_name("RAMSLPMDCNTLR1")
    5072                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    5073                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5074                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    5075              $C$DW$373       .dwtag  DW_TAG_member
    5076                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    5077                      .dwattr $C$DW$373, DW_AT_name("RSVD5")
    5078                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_RSVD5")
    5079                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5080                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    5081              $C$DW$374       .dwtag  DW_TAG_member
    5082                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    5083                      .dwattr $C$DW$374, DW_AT_name("RAMSLPMDCNTLR2")
    5084                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    5085                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5086                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    5087              $C$DW$375       .dwtag  DW_TAG_member
    5088                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    5089                      .dwattr $C$DW$375, DW_AT_name("RAMSLPMDCNTLR3")
    5090                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    5091                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    5092                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    5093              $C$DW$376       .dwtag  DW_TAG_member
    5094                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    5095                      .dwattr $C$DW$376, DW_AT_name("RAMSLPMDCNTLR4")
    5096                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    5097                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5098                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    5099              $C$DW$377       .dwtag  DW_TAG_member
    5100                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    5101                      .dwattr $C$DW$377, DW_AT_name("RAMSLPMDCNTLR5")
    5102                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  113

    5103                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    5104                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    5105              $C$DW$378       .dwtag  DW_TAG_member
    5106                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$21)
    5107                      .dwattr $C$DW$378, DW_AT_name("RSVD6")
    5108                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_RSVD6")
    5109                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    5110                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    5111              $C$DW$379       .dwtag  DW_TAG_member
    5112                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    5113                      .dwattr $C$DW$379, DW_AT_name("DMAIFR")
    5114                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_DMAIFR")
    5115                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5116                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    5117              $C$DW$380       .dwtag  DW_TAG_member
    5118                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    5119                      .dwattr $C$DW$380, DW_AT_name("DMAIER")
    5120                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_DMAIER")
    5121                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    5122                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    5123              $C$DW$381       .dwtag  DW_TAG_member
    5124                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    5125                      .dwattr $C$DW$381, DW_AT_name("USBSCR")
    5126                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_USBSCR")
    5127                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5128                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    5129              $C$DW$382       .dwtag  DW_TAG_member
    5130                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    5131                      .dwattr $C$DW$382, DW_AT_name("ESCR")
    5132                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ESCR")
    5133                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    5134                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    5135              $C$DW$383       .dwtag  DW_TAG_member
    5136                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$21)
    5137                      .dwattr $C$DW$383, DW_AT_name("RSVD7")
    5138                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_RSVD7")
    5139                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5140                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    5141              $C$DW$384       .dwtag  DW_TAG_member
    5142                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$20)
    5143                      .dwattr $C$DW$384, DW_AT_name("DMA2CESR1")
    5144                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_DMA2CESR1")
    5145                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5146                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    5147              $C$DW$385       .dwtag  DW_TAG_member
    5148                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    5149                      .dwattr $C$DW$385, DW_AT_name("DMA2CESR2")
    5150                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_DMA2CESR2")
    5151                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    5152                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    5153              $C$DW$386       .dwtag  DW_TAG_member
    5154                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    5155                      .dwattr $C$DW$386, DW_AT_name("DMA3CESR1")
    5156                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_DMA3CESR1")
    5157                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  114

    5158                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    5159              $C$DW$387       .dwtag  DW_TAG_member
    5160                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$20)
    5161                      .dwattr $C$DW$387, DW_AT_name("DMA3CESR2")
    5162                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_DMA3CESR2")
    5163                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    5164                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    5165              $C$DW$388       .dwtag  DW_TAG_member
    5166                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$20)
    5167                      .dwattr $C$DW$388, DW_AT_name("CLKSTOP")
    5168                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_CLKSTOP")
    5169                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5170                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    5171              $C$DW$389       .dwtag  DW_TAG_member
    5172                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$29)
    5173                      .dwattr $C$DW$389, DW_AT_name("RSVD8")
    5174                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_RSVD8")
    5175                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    5176                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    5177              $C$DW$390       .dwtag  DW_TAG_member
    5178                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    5179                      .dwattr $C$DW$390, DW_AT_name("DIEIDR0")
    5180                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_DIEIDR0")
    5181                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5182                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    5183              $C$DW$391       .dwtag  DW_TAG_member
    5184                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    5185                      .dwattr $C$DW$391, DW_AT_name("DIEIDR1")
    5186                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_DIEIDR1")
    5187                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    5188                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    5189              $C$DW$392       .dwtag  DW_TAG_member
    5190                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    5191                      .dwattr $C$DW$392, DW_AT_name("DIEIDR2")
    5192                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_DIEIDR2")
    5193                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5194                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    5195              $C$DW$393       .dwtag  DW_TAG_member
    5196                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$20)
    5197                      .dwattr $C$DW$393, DW_AT_name("DIEIDR3")
    5198                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_DIEIDR3")
    5199                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    5200                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    5201              $C$DW$394       .dwtag  DW_TAG_member
    5202                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    5203                      .dwattr $C$DW$394, DW_AT_name("DIEIDR4")
    5204                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_DIEIDR4")
    5205                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5206                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    5207              $C$DW$395       .dwtag  DW_TAG_member
    5208                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    5209                      .dwattr $C$DW$395, DW_AT_name("DIEIDR5")
    5210                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_DIEIDR5")
    5211                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    5212                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  115

    5213              $C$DW$396       .dwtag  DW_TAG_member
    5214                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    5215                      .dwattr $C$DW$396, DW_AT_name("DIEIDR6")
    5216                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_DIEIDR6")
    5217                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5218                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    5219              $C$DW$397       .dwtag  DW_TAG_member
    5220                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    5221                      .dwattr $C$DW$397, DW_AT_name("DIEIDR7")
    5222                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_DIEIDR7")
    5223                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    5224                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    5225                      .dwendtag $C$DW$T$30
    5226              
    5227              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    5228                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$30)
    5229                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    5230              $C$DW$398       .dwtag  DW_TAG_TI_far_type
    5231                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$63)
    5232              $C$DW$399       .dwtag  DW_TAG_TI_ioport_type
    5233                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$398)
    5234              $C$DW$T$64      .dwtag  DW_TAG_volatile_type
    5235                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$399)
    5236              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    5237                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    5238                      .dwattr $C$DW$T$65, DW_AT_address_class(0x10)
    5239              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    5240                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    5241                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    5242              
    5243              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5244                      .dwattr $C$DW$T$33, DW_AT_name("CSL_NandAsyncBank")
    5245                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
    5246              $C$DW$400       .dwtag  DW_TAG_member
    5247                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$32)
    5248                      .dwattr $C$DW$400, DW_AT_name("CExDATA")
    5249                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_CExDATA")
    5250                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5251                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5252              $C$DW$401       .dwtag  DW_TAG_member
    5253                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$32)
    5254                      .dwattr $C$DW$401, DW_AT_name("CExALE")
    5255                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_CExALE")
    5256                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5257                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    5258              $C$DW$402       .dwtag  DW_TAG_member
    5259                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$32)
    5260                      .dwattr $C$DW$402, DW_AT_name("CExCLE")
    5261                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_CExCLE")
    5262                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5263                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    5264              $C$DW$403       .dwtag  DW_TAG_member
    5265                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$32)
    5266                      .dwattr $C$DW$403, DW_AT_name("CExNUM")
    5267                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_CExNUM")
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  116

    5268                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5269                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5270                      .dwendtag $C$DW$T$33
    5271              
    5272              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncBank")
    5273                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$33)
    5274                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    5275              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    5276                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$68)
    5277                      .dwattr $C$DW$T$71, DW_AT_address_class(0x17)
    5278              
    5279              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5280                      .dwattr $C$DW$T$34, DW_AT_name("CSL_NandAsyncCfg")
    5281                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    5282              $C$DW$404       .dwtag  DW_TAG_member
    5283                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    5284                      .dwattr $C$DW$404, DW_AT_name("selectStrobe")
    5285                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_selectStrobe")
    5286                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5287                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5288              $C$DW$405       .dwtag  DW_TAG_member
    5289                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    5290                      .dwattr $C$DW$405, DW_AT_name("ewMode")
    5291                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_ewMode")
    5292                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5293                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    5294              $C$DW$406       .dwtag  DW_TAG_member
    5295                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    5296                      .dwattr $C$DW$406, DW_AT_name("w_setup")
    5297                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_w_setup")
    5298                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5299                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5300              $C$DW$407       .dwtag  DW_TAG_member
    5301                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    5302                      .dwattr $C$DW$407, DW_AT_name("w_strobe")
    5303                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_w_strobe")
    5304                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5305                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    5306              $C$DW$408       .dwtag  DW_TAG_member
    5307                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    5308                      .dwattr $C$DW$408, DW_AT_name("w_hold")
    5309                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_w_hold")
    5310                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5311                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    5312              $C$DW$409       .dwtag  DW_TAG_member
    5313                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    5314                      .dwattr $C$DW$409, DW_AT_name("r_setup")
    5315                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_r_setup")
    5316                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5317                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5318              $C$DW$410       .dwtag  DW_TAG_member
    5319                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    5320                      .dwattr $C$DW$410, DW_AT_name("r_strobe")
    5321                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_r_strobe")
    5322                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  117

    5323                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5324              $C$DW$411       .dwtag  DW_TAG_member
    5325                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    5326                      .dwattr $C$DW$411, DW_AT_name("r_hold")
    5327                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_r_hold")
    5328                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5329                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5330              $C$DW$412       .dwtag  DW_TAG_member
    5331                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    5332                      .dwattr $C$DW$412, DW_AT_name("turnAround")
    5333                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_turnAround")
    5334                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5335                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5336              $C$DW$413       .dwtag  DW_TAG_member
    5337                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    5338                      .dwattr $C$DW$413, DW_AT_name("aSize")
    5339                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_aSize")
    5340                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5341                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5342                      .dwendtag $C$DW$T$34
    5343              
    5344              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncCfg")
    5345                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$34)
    5346                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    5347              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    5348                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    5349                      .dwattr $C$DW$T$57, DW_AT_address_class(0x17)
    5350              
    5351              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    5352                      .dwattr $C$DW$T$39, DW_AT_name("CSL_NandAsyncWaitCfg")
    5353                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x03)
    5354              $C$DW$414       .dwtag  DW_TAG_member
    5355                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$36)
    5356                      .dwattr $C$DW$414, DW_AT_name("waitPol")
    5357                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_waitPol")
    5358                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5359                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    5360              $C$DW$415       .dwtag  DW_TAG_member
    5361                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$38)
    5362                      .dwattr $C$DW$415, DW_AT_name("nandPort")
    5363                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_nandPort")
    5364                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5365                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5366              $C$DW$416       .dwtag  DW_TAG_member
    5367                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$19)
    5368                      .dwattr $C$DW$416, DW_AT_name("waitCycles")
    5369                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_waitCycles")
    5370                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5371                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5372                      .dwendtag $C$DW$T$39
    5373              
    5374              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandAsyncWaitCfg")
    5375                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$39)
    5376                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    5377              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  118

    5378                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    5379                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    5380              
    5381              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    5382                      .dwattr $C$DW$T$58, DW_AT_name("CSL_NandConfig")
    5383                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x0c)
    5384              $C$DW$417       .dwtag  DW_TAG_member
    5385                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$41)
    5386                      .dwattr $C$DW$417, DW_AT_name("nandWidth")
    5387                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_nandWidth")
    5388                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5389                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5390              $C$DW$418       .dwtag  DW_TAG_member
    5391                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$43)
    5392                      .dwattr $C$DW$418, DW_AT_name("nandPageSize")
    5393                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_nandPageSize")
    5394                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5395                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5396              $C$DW$419       .dwtag  DW_TAG_member
    5397                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$45)
    5398                      .dwattr $C$DW$419, DW_AT_name("nandBankNo")
    5399                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_nandBankNo")
    5400                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5401                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    5402              $C$DW$420       .dwtag  DW_TAG_member
    5403                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$47)
    5404                      .dwattr $C$DW$420, DW_AT_name("emifAccess")
    5405                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_emifAccess")
    5406                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5407                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5408              $C$DW$421       .dwtag  DW_TAG_member
    5409                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$49)
    5410                      .dwattr $C$DW$421, DW_AT_name("nandOpMode")
    5411                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_nandOpMode")
    5412                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5413                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5414              $C$DW$422       .dwtag  DW_TAG_member
    5415                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$51)
    5416                      .dwattr $C$DW$422, DW_AT_name("nandType")
    5417                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_nandType")
    5418                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5419                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5420              $C$DW$423       .dwtag  DW_TAG_member
    5421                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$53)
    5422                      .dwattr $C$DW$423, DW_AT_name("chipSelect")
    5423                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_chipSelect")
    5424                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5425                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5426              $C$DW$424       .dwtag  DW_TAG_member
    5427                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$55)
    5428                      .dwattr $C$DW$424, DW_AT_name("asyncWaitCfg")
    5429                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_asyncWaitCfg")
    5430                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5431                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5432              $C$DW$425       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  119

    5433                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$57)
    5434                      .dwattr $C$DW$425, DW_AT_name("asyncCfg")
    5435                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_asyncCfg")
    5436                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5437                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5438                      .dwendtag $C$DW$T$58
    5439              
    5440              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandConfig")
    5441                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$58)
    5442                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    5443              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    5444                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    5445                      .dwattr $C$DW$T$73, DW_AT_address_class(0x17)
    5446              
    5447              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    5448                      .dwattr $C$DW$T$70, DW_AT_name("CSL_NandObj")
    5449                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x14)
    5450              $C$DW$426       .dwtag  DW_TAG_member
    5451                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$62)
    5452                      .dwattr $C$DW$426, DW_AT_name("regs")
    5453                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_regs")
    5454                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5455                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5456              $C$DW$427       .dwtag  DW_TAG_member
    5457                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$66)
    5458                      .dwattr $C$DW$427, DW_AT_name("sysCtrlRegs")
    5459                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_sysCtrlRegs")
    5460                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5461                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5462              $C$DW$428       .dwtag  DW_TAG_member
    5463                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    5464                      .dwattr $C$DW$428, DW_AT_name("instId")
    5465                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_instId")
    5466                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5467                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5468              $C$DW$429       .dwtag  DW_TAG_member
    5469                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$41)
    5470                      .dwattr $C$DW$429, DW_AT_name("nandWidth")
    5471                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_nandWidth")
    5472                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5473                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5474              $C$DW$430       .dwtag  DW_TAG_member
    5475                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$67)
    5476                      .dwattr $C$DW$430, DW_AT_name("intrNumNand")
    5477                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_intrNumNand")
    5478                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5479                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5480              $C$DW$431       .dwtag  DW_TAG_member
    5481                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$68)
    5482                      .dwattr $C$DW$431, DW_AT_name("bank")
    5483                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_bank")
    5484                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5485                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5486              $C$DW$432       .dwtag  DW_TAG_member
    5487                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$43)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  120

    5488                      .dwattr $C$DW$432, DW_AT_name("nandPageSize")
    5489                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_nandPageSize")
    5490                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5491                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5492              $C$DW$433       .dwtag  DW_TAG_member
    5493                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
    5494                      .dwattr $C$DW$433, DW_AT_name("addrCycles")
    5495                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_addrCycles")
    5496                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5497                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5498              $C$DW$434       .dwtag  DW_TAG_member
    5499                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$49)
    5500                      .dwattr $C$DW$434, DW_AT_name("nandOpMode")
    5501                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_nandOpMode")
    5502                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5503                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5504              $C$DW$435       .dwtag  DW_TAG_member
    5505                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$51)
    5506                      .dwattr $C$DW$435, DW_AT_name("nandType")
    5507                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_nandType")
    5508                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5509                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5510              $C$DW$436       .dwtag  DW_TAG_member
    5511                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$53)
    5512                      .dwattr $C$DW$436, DW_AT_name("chipSelect")
    5513                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_chipSelect")
    5514                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5515                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5516              $C$DW$437       .dwtag  DW_TAG_member
    5517                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$69)
    5518                      .dwattr $C$DW$437, DW_AT_name("waitPin")
    5519                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_waitPin")
    5520                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    5521                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5522                      .dwendtag $C$DW$T$70
    5523              
    5524              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandObj")
    5525                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$70)
    5526                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    5527              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    5528                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    5529                      .dwattr $C$DW$T$75, DW_AT_address_class(0x17)
    5530              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_NandHandle")
    5531                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    5532                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    5533              $C$DW$T$4       .dwtag  DW_TAG_base_type
    5534                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    5535                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    5536                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    5537              $C$DW$T$5       .dwtag  DW_TAG_base_type
    5538                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    5539                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    5540                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    5541              $C$DW$T$6       .dwtag  DW_TAG_base_type
    5542                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
TMS320C55x Assembler PC v4.4.1 Tue Sep 18 04:50:46 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_nand.asm                                                         PAGE  121

    5543                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    5544                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
