TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE    1

    1878              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 09 00:03:53 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     937                      .dwattr $C$DW$41, DW_AT_TI_end_line(0x206)
     938                      .dwattr $C$DW$41, DW_AT_TI_end_column(0x01)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   21

     939                      .dwendentry
     940                      .dwendtag $C$DW$41
     941              
     942              
     943              ;*******************************************************************************
     944              ;* TYPE INFORMATION                                                            *
     945              ;*******************************************************************************
     946              
     947              $C$DW$T$22      .dwtag  DW_TAG_enumeration_type
     948                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     949              $C$DW$48        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_0"), DW_AT_const_value(0x00)
     950              $C$DW$49        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_1"), DW_AT_const_value(0x01)
     951              $C$DW$50        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_2"), DW_AT_const_value(0x02)
     952              $C$DW$51        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_INVALID"), DW_AT_const_value(0x03)
     953                      .dwendtag $C$DW$T$22
     954              
     955              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Instance")
     956                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     957                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     958              
     959              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
     960                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     961              $C$DW$52        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_AUTO_DISABLE"), DW_AT_const_value(0x00)
     962              $C$DW$53        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_AUTO_ENABLE"), DW_AT_const_value(0x01)
     963                      .dwendtag $C$DW$T$29
     964              
     965              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AutoReLoad")
     966                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
     967                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
     968              
     969              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
     970                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     971              $C$DW$54        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_0"), DW_AT_const_value(0x00)
     972              $C$DW$55        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_1"), DW_AT_const_value(0x01)
     973              $C$DW$56        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_2"), DW_AT_const_value(0x02)
     974              $C$DW$57        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_3"), DW_AT_const_value(0x03)
     975              $C$DW$58        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_4"), DW_AT_const_value(0x04)
     976              $C$DW$59        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_5"), DW_AT_const_value(0x05)
     977              $C$DW$60        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_6"), DW_AT_const_value(0x06)
     978              $C$DW$61        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_7"), DW_AT_const_value(0x07)
     979              $C$DW$62        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_8"), DW_AT_const_value(0x08)
     980              $C$DW$63        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_9"), DW_AT_const_value(0x09)
     981              $C$DW$64        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_10"), DW_AT_const_value(0x0a)
     982              $C$DW$65        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_11"), DW_AT_const_value(0x0b)
     983              $C$DW$66        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_12"), DW_AT_const_value(0x0c)
     984              $C$DW$67        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_PRE_SC_DIV_RESERVE"), DW_AT_const_value(0x0d)
     985                      .dwendtag $C$DW$T$31
     986              
     987              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_PreScale")
     988                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
     989                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     990              
     991              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
     992                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     993              $C$DW$68        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_TIMER_DISABLE"), DW_AT_const_value(0x00)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   22

     994              $C$DW$69        .dwtag  DW_TAG_enumerator, DW_AT_name("GPT_TIMER_ENABLE"), DW_AT_const_value(0x01)
     995                      .dwendtag $C$DW$T$33
     996              
     997              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_CtrlTimer")
     998                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
     999                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1000              
    1001              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1002                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x06)
    1003              $C$DW$70        .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$20)
    1005                      .dwattr $C$DW$70, DW_AT_name("TCR")
    1006                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_TCR")
    1007                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1009              $C$DW$71        .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1011                      .dwattr $C$DW$71, DW_AT_name("RSVD0")
    1012                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_RSVD0")
    1013                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1014                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$72        .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
    1017                      .dwattr $C$DW$72, DW_AT_name("TIMPRD1")
    1018                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_TIMPRD1")
    1019                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1020                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$73        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
    1023                      .dwattr $C$DW$73, DW_AT_name("TIMPRD2")
    1024                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_TIMPRD2")
    1025                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1026                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1027              $C$DW$74        .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
    1029                      .dwattr $C$DW$74, DW_AT_name("TIMCNT1")
    1030                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_TIMCNT1")
    1031                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1032                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$75        .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
    1035                      .dwattr $C$DW$75, DW_AT_name("TIMCNT2")
    1036                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_TIMCNT2")
    1037                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1038                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1039                      .dwendtag $C$DW$T$21
    1040              
    1041              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_TimRegs")
    1042                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
    1043                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1044              $C$DW$76        .dwtag  DW_TAG_TI_far_type
    1045                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$24)
    1046              $C$DW$77        .dwtag  DW_TAG_TI_ioport_type
    1047                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$76)
    1048              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   23

    1049                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$77)
    1050              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1051                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1052                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    1053              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_TimRegsOvly")
    1054                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1055                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1056              
    1057              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1058                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x03)
    1059              $C$DW$78        .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$23)
    1061                      .dwattr $C$DW$78, DW_AT_name("Instance")
    1062                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Instance")
    1063                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1065              $C$DW$79        .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$79, DW_AT_name("EventId")
    1068                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_EventId")
    1069                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1070                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1071              $C$DW$80        .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$27)
    1073                      .dwattr $C$DW$80, DW_AT_name("regs")
    1074                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_regs")
    1075                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1076                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1077                      .dwendtag $C$DW$T$28
    1078              
    1079              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_GptObj")
    1080                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$28)
    1081                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1082              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    1083                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1084                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    1085              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Handle")
    1086                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1087                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1088              
    1089              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1090                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x05)
    1091              $C$DW$81        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$30)
    1093                      .dwattr $C$DW$81, DW_AT_name("autoLoad")
    1094                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_autoLoad")
    1095                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1096                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1097              $C$DW$82        .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$32)
    1099                      .dwattr $C$DW$82, DW_AT_name("preScaleDiv")
    1100                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_preScaleDiv")
    1101                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1102                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1103              $C$DW$83        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   24

    1104                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$34)
    1105                      .dwattr $C$DW$83, DW_AT_name("ctrlTim")
    1106                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_ctrlTim")
    1107                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1108                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1109              $C$DW$84        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$84, DW_AT_name("prdLow")
    1112                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_prdLow")
    1113                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1114                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1115              $C$DW$85        .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1117                      .dwattr $C$DW$85, DW_AT_name("prdHigh")
    1118                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_prdHigh")
    1119                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1120                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1121                      .dwendtag $C$DW$T$35
    1122              
    1123              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Config")
    1124                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$35)
    1125                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1126              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    1127                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1128                      .dwattr $C$DW$T$48, DW_AT_address_class(0x17)
    1129              
    1130              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1131                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x48)
    1132              $C$DW$86        .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    1134                      .dwattr $C$DW$86, DW_AT_name("EBSR")
    1135                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_EBSR")
    1136                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1137                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1138              $C$DW$87        .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    1140                      .dwattr $C$DW$87, DW_AT_name("RSVD0")
    1141                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_RSVD0")
    1142                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1143                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1144              $C$DW$88        .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    1146                      .dwattr $C$DW$88, DW_AT_name("PCGCR1")
    1147                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_PCGCR1")
    1148                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1149                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1150              $C$DW$89        .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    1152                      .dwattr $C$DW$89, DW_AT_name("PCGCR2")
    1153                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_PCGCR2")
    1154                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1155                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$90        .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
    1158                      .dwattr $C$DW$90, DW_AT_name("PSRCR")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   25

    1159                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_PSRCR")
    1160                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1161                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1162              $C$DW$91        .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    1164                      .dwattr $C$DW$91, DW_AT_name("PRCR")
    1165                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_PRCR")
    1166                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1167                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1168              $C$DW$92        .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$36)
    1170                      .dwattr $C$DW$92, DW_AT_name("RSVD1")
    1171                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_RSVD1")
    1172                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1173                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1174              $C$DW$93        .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
    1176                      .dwattr $C$DW$93, DW_AT_name("TIAFR")
    1177                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_TIAFR")
    1178                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1179                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1180              $C$DW$94        .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
    1182                      .dwattr $C$DW$94, DW_AT_name("RSVD2")
    1183                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_RSVD2")
    1184                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1185                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1186              $C$DW$95        .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    1188                      .dwattr $C$DW$95, DW_AT_name("ODSCR")
    1189                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_ODSCR")
    1190                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1191                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1192              $C$DW$96        .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    1194                      .dwattr $C$DW$96, DW_AT_name("PDINHIBR1")
    1195                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_PDINHIBR1")
    1196                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1197                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1198              $C$DW$97        .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    1200                      .dwattr $C$DW$97, DW_AT_name("PDINHIBR2")
    1201                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_PDINHIBR2")
    1202                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1203                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1204              $C$DW$98        .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    1206                      .dwattr $C$DW$98, DW_AT_name("PDINHIBR3")
    1207                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PDINHIBR3")
    1208                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1209                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1210              $C$DW$99        .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    1212                      .dwattr $C$DW$99, DW_AT_name("DMA0CESR1")
    1213                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_DMA0CESR1")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   26

    1214                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1215                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1216              $C$DW$100       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    1218                      .dwattr $C$DW$100, DW_AT_name("DMA0CESR2")
    1219                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_DMA0CESR2")
    1220                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1221                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1222              $C$DW$101       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    1224                      .dwattr $C$DW$101, DW_AT_name("DMA1CESR1")
    1225                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_DMA1CESR1")
    1226                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1227                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1228              $C$DW$102       .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    1230                      .dwattr $C$DW$102, DW_AT_name("DMA1CESR2")
    1231                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_DMA1CESR2")
    1232                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1233                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1234              $C$DW$103       .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1236                      .dwattr $C$DW$103, DW_AT_name("SDRAMCCR")
    1237                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_SDRAMCCR")
    1238                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1239                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1240              $C$DW$104       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    1242                      .dwattr $C$DW$104, DW_AT_name("CCR2")
    1243                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CCR2")
    1244                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1245                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1246              $C$DW$105       .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    1248                      .dwattr $C$DW$105, DW_AT_name("CGCR1")
    1249                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_CGCR1")
    1250                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1251                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1252              $C$DW$106       .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    1254                      .dwattr $C$DW$106, DW_AT_name("CGICR")
    1255                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_CGICR")
    1256                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1257                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1258              $C$DW$107       .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    1260                      .dwattr $C$DW$107, DW_AT_name("CGCR2")
    1261                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CGCR2")
    1262                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1263                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1264              $C$DW$108       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1266                      .dwattr $C$DW$108, DW_AT_name("CGOCR")
    1267                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CGOCR")
    1268                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   27

    1269                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1270              $C$DW$109       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    1272                      .dwattr $C$DW$109, DW_AT_name("CCSSR")
    1273                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CCSSR")
    1274                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1275                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1276              $C$DW$110       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    1278                      .dwattr $C$DW$110, DW_AT_name("RSVD3")
    1279                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_RSVD3")
    1280                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1281                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$111       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    1284                      .dwattr $C$DW$111, DW_AT_name("ECDR")
    1285                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ECDR")
    1286                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1287                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1288              $C$DW$112       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    1290                      .dwattr $C$DW$112, DW_AT_name("RSVD4")
    1291                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_RSVD4")
    1292                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1293                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1294              $C$DW$113       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    1296                      .dwattr $C$DW$113, DW_AT_name("RAMSLPMDCNTLR1")
    1297                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1298                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1299                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1300              $C$DW$114       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1302                      .dwattr $C$DW$114, DW_AT_name("RSVD5")
    1303                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_RSVD5")
    1304                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1305                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$115       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    1308                      .dwattr $C$DW$115, DW_AT_name("RAMSLPMDCNTLR2")
    1309                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1310                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1311                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$116       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1314                      .dwattr $C$DW$116, DW_AT_name("RAMSLPMDCNTLR3")
    1315                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1316                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1317                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1318              $C$DW$117       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    1320                      .dwattr $C$DW$117, DW_AT_name("RAMSLPMDCNTLR4")
    1321                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1322                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1323                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   28

    1324              $C$DW$118       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    1326                      .dwattr $C$DW$118, DW_AT_name("RAMSLPMDCNTLR5")
    1327                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1328                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1329                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1330              $C$DW$119       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$37)
    1332                      .dwattr $C$DW$119, DW_AT_name("RSVD6")
    1333                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_RSVD6")
    1334                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1335                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1336              $C$DW$120       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    1338                      .dwattr $C$DW$120, DW_AT_name("DMAIFR")
    1339                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_DMAIFR")
    1340                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1341                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1342              $C$DW$121       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    1344                      .dwattr $C$DW$121, DW_AT_name("DMAIER")
    1345                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_DMAIER")
    1346                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1347                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$122       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    1350                      .dwattr $C$DW$122, DW_AT_name("USBSCR")
    1351                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_USBSCR")
    1352                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1353                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1354              $C$DW$123       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    1356                      .dwattr $C$DW$123, DW_AT_name("ESCR")
    1357                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ESCR")
    1358                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1359                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1360              $C$DW$124       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$37)
    1362                      .dwattr $C$DW$124, DW_AT_name("RSVD7")
    1363                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_RSVD7")
    1364                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1365                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1366              $C$DW$125       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1368                      .dwattr $C$DW$125, DW_AT_name("DMA2CESR1")
    1369                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_DMA2CESR1")
    1370                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1371                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1372              $C$DW$126       .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1374                      .dwattr $C$DW$126, DW_AT_name("DMA2CESR2")
    1375                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_DMA2CESR2")
    1376                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1377                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$127       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   29

    1379                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    1380                      .dwattr $C$DW$127, DW_AT_name("DMA3CESR1")
    1381                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_DMA3CESR1")
    1382                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1383                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1384              $C$DW$128       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1386                      .dwattr $C$DW$128, DW_AT_name("DMA3CESR2")
    1387                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_DMA3CESR2")
    1388                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1389                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$129       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    1392                      .dwattr $C$DW$129, DW_AT_name("CLKSTOP")
    1393                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CLKSTOP")
    1394                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1395                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1396              $C$DW$130       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$38)
    1398                      .dwattr $C$DW$130, DW_AT_name("RSVD8")
    1399                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_RSVD8")
    1400                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1401                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1402              $C$DW$131       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    1404                      .dwattr $C$DW$131, DW_AT_name("DIEIDR0")
    1405                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_DIEIDR0")
    1406                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1407                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1408              $C$DW$132       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1410                      .dwattr $C$DW$132, DW_AT_name("DIEIDR1")
    1411                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_DIEIDR1")
    1412                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1413                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1414              $C$DW$133       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1416                      .dwattr $C$DW$133, DW_AT_name("DIEIDR2")
    1417                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_DIEIDR2")
    1418                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1419                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1420              $C$DW$134       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1422                      .dwattr $C$DW$134, DW_AT_name("DIEIDR3")
    1423                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_DIEIDR3")
    1424                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1425                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1426              $C$DW$135       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1428                      .dwattr $C$DW$135, DW_AT_name("DIEIDR4")
    1429                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_DIEIDR4")
    1430                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1431                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1432              $C$DW$136       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   30

    1434                      .dwattr $C$DW$136, DW_AT_name("DIEIDR5")
    1435                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_DIEIDR5")
    1436                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1437                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1438              $C$DW$137       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1440                      .dwattr $C$DW$137, DW_AT_name("DIEIDR6")
    1441                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_DIEIDR6")
    1442                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1443                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1444              $C$DW$138       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1446                      .dwattr $C$DW$138, DW_AT_name("DIEIDR7")
    1447                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_DIEIDR7")
    1448                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1449                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1450                      .dwendtag $C$DW$T$39
    1451              
    1452              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1453                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$39)
    1454                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1455              $C$DW$139       .dwtag  DW_TAG_TI_far_type
    1456                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$49)
    1457              $C$DW$140       .dwtag  DW_TAG_TI_ioport_type
    1458                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$139)
    1459              $C$DW$T$50      .dwtag  DW_TAG_volatile_type
    1460                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$140)
    1461              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    1462                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    1463                      .dwattr $C$DW$T$51, DW_AT_address_class(0x10)
    1464              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1465                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1466                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1467                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1468              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1469                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1470                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1471                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1472              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1473                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1474                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1475                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1476              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1477                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1478                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1479                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1480              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1481                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1482                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1483                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1484              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1485                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$8)
    1486                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1487              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1488                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:54 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_gpt.asm                                                          PAGE   31

    1489                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1490              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    1491                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1492                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    1493              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1494                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1495                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1496                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1497              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1498                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1499                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1500              $C$DW$141       .dwtag  DW_TAG_TI_far_type
