TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dat.asm                                                          PAGE    1

    2896              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 09 00:03:42 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2217                      .dwattr $C$DW$72, DW_AT_low_pc($C$DW$L$_DAT_wait$10$B)
    2218                      .dwattr $C$DW$72, DW_AT_high_pc($C$DW$L$_DAT_wait$10$E)
    2219                      .dwendtag $C$DW$70
    2220              
    2221              
    2222              $C$DW$73        .dwtag  DW_TAG_TI_loop
    2223                      .dwattr $C$DW$73, DW_AT_name("F:\eZdsp_C55x_FreeRTOS_Port\VerifiedOKInDbg\eZDSP_5535_Files\ccsws2\tes
    2224                      .dwattr $C$DW$73, DW_AT_TI_begin_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_dat.c")
    2225                      .dwattr $C$DW$73, DW_AT_TI_begin_line(0x32c)
    2226                      .dwattr $C$DW$73, DW_AT_TI_end_line(0x32f)
    2227              $C$DW$74        .dwtag  DW_TAG_TI_loop_range
    2228                      .dwattr $C$DW$74, DW_AT_low_pc($C$DW$L$_DAT_wait$4$B)
    2229                      .dwattr $C$DW$74, DW_AT_high_pc($C$DW$L$_DAT_wait$4$E)
    2230                      .dwendtag $C$DW$73
    2231              
    2232                      .dwattr $C$DW$54, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_dat.c")
    2233                      .dwattr $C$DW$54, DW_AT_TI_end_line(0x355)
    2234                      .dwattr $C$DW$54, DW_AT_TI_end_column(0x01)
    2235                      .dwendentry
    2236                      .dwendtag $C$DW$54
    2237              
    2238              
    2239              ;*******************************************************************************
    2240              ;* TYPE INFORMATION                                                            *
    2241              ;*******************************************************************************
    2242              
    2243              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
    2244                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2245              $C$DW$75        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN0"), DW_AT_const_value(0x00)
    2246              $C$DW$76        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN1"), DW_AT_const_value(0x01)
    2247              $C$DW$77        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN2"), DW_AT_const_value(0x02)
    2248              $C$DW$78        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN3"), DW_AT_const_value(0x03)
    2249              $C$DW$79        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN4"), DW_AT_const_value(0x04)
    2250              $C$DW$80        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN5"), DW_AT_const_value(0x05)
    2251              $C$DW$81        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN6"), DW_AT_const_value(0x06)
    2252              $C$DW$82        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN7"), DW_AT_const_value(0x07)
    2253              $C$DW$83        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN8"), DW_AT_const_value(0x08)
    2254              $C$DW$84        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN9"), DW_AT_const_value(0x09)
    2255              $C$DW$85        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN10"), DW_AT_const_value(0x0a)
    2256              $C$DW$86        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN11"), DW_AT_const_value(0x0b)
    2257              $C$DW$87        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN12"), DW_AT_const_value(0x0c)
    2258              $C$DW$88        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN13"), DW_AT_const_value(0x0d)
    2259              $C$DW$89        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN14"), DW_AT_const_value(0x0e)
    2260              $C$DW$90        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN15"), DW_AT_const_value(0x0f)
    2261              $C$DW$91        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_CHAN_INV"), DW_AT_const_value(0x10)
    2262                      .dwendtag $C$DW$T$27
    2263              
    2264              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DATChanNum")
    2265                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2266                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dat.asm                                                          PAGE   58

    2267              
    2268              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
    2269                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2270              $C$DW$92        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_ENGINE0"), DW_AT_const_value(0x00)
    2271              $C$DW$93        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_ENGINE1"), DW_AT_const_value(0x01)
    2272              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_ENGINE2"), DW_AT_const_value(0x02)
    2273              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_ENGINE3"), DW_AT_const_value(0x03)
    2274              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DAT_ENGINE_INV"), DW_AT_const_value(0x04)
    2275                      .dwendtag $C$DW$T$29
    2276              
    2277              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DATEngineId")
    2278                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2279                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2280              
    2281              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2282                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x66)
    2283              $C$DW$97        .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    2285                      .dwattr $C$DW$97, DW_AT_name("DMACH0SSAL")
    2286                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_DMACH0SSAL")
    2287                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2288                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2289              $C$DW$98        .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    2291                      .dwattr $C$DW$98, DW_AT_name("DMACH0SSAU")
    2292                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_DMACH0SSAU")
    2293                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2294                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2295              $C$DW$99        .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    2297                      .dwattr $C$DW$99, DW_AT_name("DMACH0DSAL")
    2298                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_DMACH0DSAL")
    2299                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2300                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2301              $C$DW$100       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    2303                      .dwattr $C$DW$100, DW_AT_name("DMACH0DSAU")
    2304                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_DMACH0DSAU")
    2305                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2306                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2307              $C$DW$101       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    2309                      .dwattr $C$DW$101, DW_AT_name("DMACH0TCR1")
    2310                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_DMACH0TCR1")
    2311                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2312                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2313              $C$DW$102       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    2315                      .dwattr $C$DW$102, DW_AT_name("DMACH0TCR2")
    2316                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_DMACH0TCR2")
    2317                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2318                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2319              $C$DW$103       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    2321                      .dwattr $C$DW$103, DW_AT_name("RSVD0")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dat.asm                                                          PAGE   59

    2322                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_RSVD0")
    2323                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2324                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2325              $C$DW$104       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    2327                      .dwattr $C$DW$104, DW_AT_name("DMACH1SSAL")
    2328                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_DMACH1SSAL")
    2329                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2330                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2331              $C$DW$105       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    2333                      .dwattr $C$DW$105, DW_AT_name("DMACH1SSAU")
    2334                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_DMACH1SSAU")
    2335                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2336                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2337              $C$DW$106       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    2339                      .dwattr $C$DW$106, DW_AT_name("DMACH1DSAL")
    2340                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_DMACH1DSAL")
    2341                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2342                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$107       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    2345                      .dwattr $C$DW$107, DW_AT_name("DMACH1DSAU")
    2346                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_DMACH1DSAU")
    2347                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2348                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2349              $C$DW$108       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    2351                      .dwattr $C$DW$108, DW_AT_name("DMACH1TCR1")
    2352                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_DMACH1TCR1")
    2353                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2354                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2355              $C$DW$109       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    2357                      .dwattr $C$DW$109, DW_AT_name("DMACH1TCR2")
    2358                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_DMACH1TCR2")
    2359                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2360                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2361              $C$DW$110       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
    2363                      .dwattr $C$DW$110, DW_AT_name("RSVD1")
    2364                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_RSVD1")
    2365                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2366                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2367              $C$DW$111       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    2369                      .dwattr $C$DW$111, DW_AT_name("DMACH2SSAL")
    2370                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_DMACH2SSAL")
    2371                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2372                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2373              $C$DW$112       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    2375                      .dwattr $C$DW$112, DW_AT_name("DMACH2SSAU")
    2376                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_DMACH2SSAU")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dat.asm                                                          PAGE   60

    2377                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2378                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2379              $C$DW$113       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    2381                      .dwattr $C$DW$113, DW_AT_name("DMACH2DSAL")
    2382                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_DMACH2DSAL")
    2383                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2384                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2385              $C$DW$114       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    2387                      .dwattr $C$DW$114, DW_AT_name("DMACH2DSAU")
    2388                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_DMACH2DSAU")
    2389                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2390                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2391              $C$DW$115       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    2393                      .dwattr $C$DW$115, DW_AT_name("DMACH2TCR1")
    2394                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_DMACH2TCR1")
    2395                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2396                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2397              $C$DW$116       .dwtag  DW_TAG_member
    2398                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    2399                      .dwattr $C$DW$116, DW_AT_name("DMACH2TCR2")
    2400                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_DMACH2TCR2")
    2401                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2402                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2403              $C$DW$117       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
    2405                      .dwattr $C$DW$117, DW_AT_name("RSVD2")
    2406                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_RSVD2")
    2407                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2408                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2409              $C$DW$118       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    2411                      .dwattr $C$DW$118, DW_AT_name("DMACH3SSAL")
    2412                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_DMACH3SSAL")
    2413                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2414                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2415              $C$DW$119       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    2417                      .dwattr $C$DW$119, DW_AT_name("DMACH3SSAU")
    2418                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_DMACH3SSAU")
    2419                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    2420                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2421              $C$DW$120       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    2423                      .dwattr $C$DW$120, DW_AT_name("DMACH3DSAL")
    2424                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_DMACH3DSAL")
    2425                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2426                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2427              $C$DW$121       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    2429                      .dwattr $C$DW$121, DW_AT_name("DMACH3DSAU")
    2430                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_DMACH3DSAU")
    2431                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dat.asm                                                          PAGE   61

    2432                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2433              $C$DW$122       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    2435                      .dwattr $C$DW$122, DW_AT_name("DMACH3TCR1")
    2436                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_DMACH3TCR1")
    2437                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2438                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2439              $C$DW$123       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    2441                      .dwattr $C$DW$123, DW_AT_name("DMACH3TCR2")
    2442                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_DMACH3TCR2")
    2443                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    2444                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2445                      .dwendtag $C$DW$T$22
    2446              
    2447              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
    2448                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    2449                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2450              $C$DW$124       .dwtag  DW_TAG_TI_far_type
    2451                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$23)
    2452              $C$DW$125       .dwtag  DW_TAG_TI_ioport_type
    2453                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$124)
    2454              $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    2455                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$125)
    2456              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    2457                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2458                      .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    2459              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
    2460                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2461                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2462              
    2463              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2464                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x05)
    2465              $C$DW$126       .dwtag  DW_TAG_member
    2466                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$26)
    2467                      .dwattr $C$DW$126, DW_AT_name("dmaRegs")
    2468                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_dmaRegs")
    2469                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2470                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2471              $C$DW$127       .dwtag  DW_TAG_member
    2472                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$28)
    2473                      .dwattr $C$DW$127, DW_AT_name("chanNum")
    2474                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_chanNum")
    2475                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2476                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2477              $C$DW$128       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$30)
    2479                      .dwattr $C$DW$128, DW_AT_name("datInstNum")
    2480                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_datInstNum")
    2481                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2482                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2483              $C$DW$129       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2485                      .dwattr $C$DW$129, DW_AT_name("chanPrio")
    2486                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_chanPrio")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dat.asm                                                          PAGE   62

    2487                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2488                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2489              $C$DW$130       .dwtag  DW_TAG_member
    2490                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$31)
    2491                      .dwattr $C$DW$130, DW_AT_name("isChanFree")
    2492                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_isChanFree")
    2493                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2494                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2495                      .dwendtag $C$DW$T$32
    2496              
    2497              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DAT_ChannelObj")
    2498                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2499                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2500              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2501                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2502                      .dwattr $C$DW$T$34, DW_AT_address_class(0x17)
    2503              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_DAT_Handle")
    2504                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2505                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2506              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2507                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2508                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2509                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2510              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2511                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2512                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2513                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2514              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2515                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2516                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2517                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2518              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2519                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2520                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2521                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2522              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2523                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2524                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2525                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2526              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2527                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$8)
    2528                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2529              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2530                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2531                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2532              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    2533                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2534                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    2535              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2536                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2537                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2538                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2539              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    2540                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2541                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:03:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_dat.asm                                                          PAGE   63

    2542              $C$DW$131       .dwtag  DW_TAG_TI_far_type
    2543                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2544              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
