TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE    1

   10229              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sun Sep 09 00:04:42 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    8828              $C$DW$465       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ENDIAN_BIG"), DW_AT_const_value(0x01)
    8829                      .dwendtag $C$DW$T$38
    8830              
    8831              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioEndianMode")
    8832                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    8833                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    8834              
    8835              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    8836                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    8837              $C$DW$466       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_INST0"), DW_AT_const_value(0x00)
    8838              $C$DW$467       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_INST1"), DW_AT_const_value(0x01)
    8839              $C$DW$468       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_INST_INV"), DW_AT_const_value(0x02)
    8840                      .dwendtag $C$DW$T$47
    8841              
    8842              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioInstId")
    8843                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    8844                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    8845              
    8846              $C$DW$T$49      .dwtag  DW_TAG_enumeration_type
    8847                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    8848              $C$DW$469       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_NO"), DW_AT_const_value(0x00)
    8849              $C$DW$470       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R1"), DW_AT_const_value(0x01)
    8850              $C$DW$471       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R2"), DW_AT_const_value(0x02)
    8851              $C$DW$472       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R3"), DW_AT_const_value(0x03)
    8852              $C$DW$473       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R4"), DW_AT_const_value(0x04)
    8853              $C$DW$474       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R5"), DW_AT_const_value(0x05)
    8854              $C$DW$475       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R6"), DW_AT_const_value(0x06)
    8855                      .dwendtag $C$DW$T$49
    8856              
    8857              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioRespType")
    8858                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    8859                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    8860              
    8861              $C$DW$T$51      .dwtag  DW_TAG_enumeration_type
    8862                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    8863              $C$DW$476       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_EDATDNE_INTERRUPT"), DW_AT_const_value(0x00)
    8864              $C$DW$477       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_EBSYDNE_INTERRUPT"), DW_AT_const_value(0x01)
    8865              $C$DW$478       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ERSPDNE_INTERRUPT"), DW_AT_const_value(0x02)
    8866              $C$DW$479       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ETOUTRD_INTERRUPT"), DW_AT_const_value(0x03)
    8867              $C$DW$480       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ETOUTRS_INTERRUPT"), DW_AT_const_value(0x04)
    8868              $C$DW$481       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ECRCWR_INTERRUPT"), DW_AT_const_value(0x05)
    8869              $C$DW$482       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ECRCRD_INTERRUPT"), DW_AT_const_value(0x06)
    8870              $C$DW$483       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ECRCRS_INTERRUPT"), DW_AT_const_value(0x07)
    8871              $C$DW$484       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RSV_BIT"), DW_AT_const_value(0x08)
    8872              $C$DW$485       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_EDXRDY_INTERRUPT"), DW_AT_const_value(0x09)
    8873              $C$DW$486       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_EDRRDY_INTERRUPT"), DW_AT_const_value(0x0a)
    8874              $C$DW$487       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_EDATED_INTERRUPT"), DW_AT_const_value(0x0b)
    8875              $C$DW$488       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ETRNDNE_INTERRUPT"), DW_AT_const_value(0x0c)
    8876              $C$DW$489       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_MMCIM_ALL_INTERRUPT"), DW_AT_const_value(0x0d
    8877              $C$DW$490       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_READWAIT_INTERRUPT"), DW_AT_const_value(0x0e)
    8878              $C$DW$491       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_CARD_INTERRUPT"), DW_AT_const_value(0x0f)
    8879              $C$DW$492       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_SDIOIEN_ALL_INTERRUPT"), DW_AT_const_value(0x
    8880                      .dwendtag $C$DW$T$51
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  211

    8881              
    8882              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioEventType")
    8883                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    8884                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    8885              
    8886              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    8887                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x75)
    8888              $C$DW$493       .dwtag  DW_TAG_member
    8889                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$20)
    8890                      .dwattr $C$DW$493, DW_AT_name("MMCCTL")
    8891                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_MMCCTL")
    8892                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8893                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    8894              $C$DW$494       .dwtag  DW_TAG_member
    8895                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$21)
    8896                      .dwattr $C$DW$494, DW_AT_name("RSVD0")
    8897                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_RSVD0")
    8898                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8899                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    8900              $C$DW$495       .dwtag  DW_TAG_member
    8901                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
    8902                      .dwattr $C$DW$495, DW_AT_name("MMCCLK")
    8903                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_MMCCLK")
    8904                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8905                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    8906              $C$DW$496       .dwtag  DW_TAG_member
    8907                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$21)
    8908                      .dwattr $C$DW$496, DW_AT_name("RSVD1")
    8909                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_RSVD1")
    8910                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8911                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    8912              $C$DW$497       .dwtag  DW_TAG_member
    8913                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$20)
    8914                      .dwattr $C$DW$497, DW_AT_name("MMCST0")
    8915                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_MMCST0")
    8916                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8917                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    8918              $C$DW$498       .dwtag  DW_TAG_member
    8919                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$21)
    8920                      .dwattr $C$DW$498, DW_AT_name("RSVD2")
    8921                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_RSVD2")
    8922                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8923                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    8924              $C$DW$499       .dwtag  DW_TAG_member
    8925                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$20)
    8926                      .dwattr $C$DW$499, DW_AT_name("MMCST1")
    8927                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_MMCST1")
    8928                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8929                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    8930              $C$DW$500       .dwtag  DW_TAG_member
    8931                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$21)
    8932                      .dwattr $C$DW$500, DW_AT_name("RSVD3")
    8933                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_RSVD3")
    8934                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8935                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  212

    8936              $C$DW$501       .dwtag  DW_TAG_member
    8937                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$20)
    8938                      .dwattr $C$DW$501, DW_AT_name("MMCIM")
    8939                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_MMCIM")
    8940                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8941                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    8942              $C$DW$502       .dwtag  DW_TAG_member
    8943                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$21)
    8944                      .dwattr $C$DW$502, DW_AT_name("RSVD4")
    8945                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_RSVD4")
    8946                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    8947                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    8948              $C$DW$503       .dwtag  DW_TAG_member
    8949                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$20)
    8950                      .dwattr $C$DW$503, DW_AT_name("MMCTOR")
    8951                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_MMCTOR")
    8952                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8953                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    8954              $C$DW$504       .dwtag  DW_TAG_member
    8955                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$21)
    8956                      .dwattr $C$DW$504, DW_AT_name("RSVD5")
    8957                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_RSVD5")
    8958                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8959                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    8960              $C$DW$505       .dwtag  DW_TAG_member
    8961                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$20)
    8962                      .dwattr $C$DW$505, DW_AT_name("MMCTOD")
    8963                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_MMCTOD")
    8964                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8965                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    8966              $C$DW$506       .dwtag  DW_TAG_member
    8967                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$21)
    8968                      .dwattr $C$DW$506, DW_AT_name("RSVD6")
    8969                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_RSVD6")
    8970                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    8971                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    8972              $C$DW$507       .dwtag  DW_TAG_member
    8973                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$20)
    8974                      .dwattr $C$DW$507, DW_AT_name("MMCBLEN")
    8975                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_MMCBLEN")
    8976                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8977                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    8978              $C$DW$508       .dwtag  DW_TAG_member
    8979                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$21)
    8980                      .dwattr $C$DW$508, DW_AT_name("RSVD7")
    8981                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_RSVD7")
    8982                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8983                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    8984              $C$DW$509       .dwtag  DW_TAG_member
    8985                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$20)
    8986                      .dwattr $C$DW$509, DW_AT_name("MMCNBLK")
    8987                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_MMCNBLK")
    8988                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8989                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    8990              $C$DW$510       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  213

    8991                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$21)
    8992                      .dwattr $C$DW$510, DW_AT_name("RSVD8")
    8993                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_RSVD8")
    8994                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    8995                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    8996              $C$DW$511       .dwtag  DW_TAG_member
    8997                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$20)
    8998                      .dwattr $C$DW$511, DW_AT_name("MMCNBLC")
    8999                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_MMCNBLC")
    9000                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    9001                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    9002              $C$DW$512       .dwtag  DW_TAG_member
    9003                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$21)
    9004                      .dwattr $C$DW$512, DW_AT_name("RSVD9")
    9005                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_RSVD9")
    9006                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    9007                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    9008              $C$DW$513       .dwtag  DW_TAG_member
    9009                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$20)
    9010                      .dwattr $C$DW$513, DW_AT_name("MMCDRR1")
    9011                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_MMCDRR1")
    9012                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9013                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    9014              $C$DW$514       .dwtag  DW_TAG_member
    9015                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$20)
    9016                      .dwattr $C$DW$514, DW_AT_name("MMCDRR2")
    9017                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_MMCDRR2")
    9018                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    9019                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    9020              $C$DW$515       .dwtag  DW_TAG_member
    9021                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$22)
    9022                      .dwattr $C$DW$515, DW_AT_name("RSVD10")
    9023                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_RSVD10")
    9024                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9025                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    9026              $C$DW$516       .dwtag  DW_TAG_member
    9027                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$20)
    9028                      .dwattr $C$DW$516, DW_AT_name("MMCDXR1")
    9029                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_MMCDXR1")
    9030                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9031                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    9032              $C$DW$517       .dwtag  DW_TAG_member
    9033                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$20)
    9034                      .dwattr $C$DW$517, DW_AT_name("MMCDXR2")
    9035                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_MMCDXR2")
    9036                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    9037                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    9038              $C$DW$518       .dwtag  DW_TAG_member
    9039                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$22)
    9040                      .dwattr $C$DW$518, DW_AT_name("RSVD11")
    9041                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_RSVD11")
    9042                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    9043                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    9044              $C$DW$519       .dwtag  DW_TAG_member
    9045                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  214

    9046                      .dwattr $C$DW$519, DW_AT_name("MMCCMD1")
    9047                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_MMCCMD1")
    9048                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9049                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    9050              $C$DW$520       .dwtag  DW_TAG_member
    9051                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$20)
    9052                      .dwattr $C$DW$520, DW_AT_name("MMCCMD2")
    9053                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_MMCCMD2")
    9054                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    9055                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    9056              $C$DW$521       .dwtag  DW_TAG_member
    9057                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$22)
    9058                      .dwattr $C$DW$521, DW_AT_name("RSVD12")
    9059                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_RSVD12")
    9060                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9061                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    9062              $C$DW$522       .dwtag  DW_TAG_member
    9063                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$20)
    9064                      .dwattr $C$DW$522, DW_AT_name("MMCARG1")
    9065                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_MMCARG1")
    9066                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9067                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    9068              $C$DW$523       .dwtag  DW_TAG_member
    9069                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$20)
    9070                      .dwattr $C$DW$523, DW_AT_name("MMCARG2")
    9071                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_MMCARG2")
    9072                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    9073                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    9074              $C$DW$524       .dwtag  DW_TAG_member
    9075                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$22)
    9076                      .dwattr $C$DW$524, DW_AT_name("RSVD13")
    9077                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_RSVD13")
    9078                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9079                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    9080              $C$DW$525       .dwtag  DW_TAG_member
    9081                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$20)
    9082                      .dwattr $C$DW$525, DW_AT_name("MMCRSP0")
    9083                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_MMCRSP0")
    9084                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9085                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    9086              $C$DW$526       .dwtag  DW_TAG_member
    9087                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$20)
    9088                      .dwattr $C$DW$526, DW_AT_name("MMCRSP1")
    9089                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_MMCRSP1")
    9090                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    9091                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    9092              $C$DW$527       .dwtag  DW_TAG_member
    9093                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$22)
    9094                      .dwattr $C$DW$527, DW_AT_name("RSVD14")
    9095                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_RSVD14")
    9096                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9097                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    9098              $C$DW$528       .dwtag  DW_TAG_member
    9099                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$20)
    9100                      .dwattr $C$DW$528, DW_AT_name("MMCRSP2")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  215

    9101                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_MMCRSP2")
    9102                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9103                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    9104              $C$DW$529       .dwtag  DW_TAG_member
    9105                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$20)
    9106                      .dwattr $C$DW$529, DW_AT_name("MMCRSP3")
    9107                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_MMCRSP3")
    9108                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    9109                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    9110              $C$DW$530       .dwtag  DW_TAG_member
    9111                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$22)
    9112                      .dwattr $C$DW$530, DW_AT_name("RSVD15")
    9113                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_RSVD15")
    9114                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    9115                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    9116              $C$DW$531       .dwtag  DW_TAG_member
    9117                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$20)
    9118                      .dwattr $C$DW$531, DW_AT_name("MMCRSP4")
    9119                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_MMCRSP4")
    9120                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9121                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    9122              $C$DW$532       .dwtag  DW_TAG_member
    9123                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$20)
    9124                      .dwattr $C$DW$532, DW_AT_name("MMCRSP5")
    9125                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_MMCRSP5")
    9126                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    9127                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    9128              $C$DW$533       .dwtag  DW_TAG_member
    9129                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$22)
    9130                      .dwattr $C$DW$533, DW_AT_name("RSVD16")
    9131                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_RSVD16")
    9132                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    9133                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    9134              $C$DW$534       .dwtag  DW_TAG_member
    9135                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$20)
    9136                      .dwattr $C$DW$534, DW_AT_name("MMCRSP6")
    9137                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_MMCRSP6")
    9138                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9139                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    9140              $C$DW$535       .dwtag  DW_TAG_member
    9141                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$20)
    9142                      .dwattr $C$DW$535, DW_AT_name("MMCRSP7")
    9143                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_MMCRSP7")
    9144                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    9145                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    9146              $C$DW$536       .dwtag  DW_TAG_member
    9147                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$22)
    9148                      .dwattr $C$DW$536, DW_AT_name("RSVD17")
    9149                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_RSVD17")
    9150                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9151                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    9152              $C$DW$537       .dwtag  DW_TAG_member
    9153                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$20)
    9154                      .dwattr $C$DW$537, DW_AT_name("MMCDRSP")
    9155                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_MMCDRSP")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  216

    9156                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    9157                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    9158              $C$DW$538       .dwtag  DW_TAG_member
    9159                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$23)
    9160                      .dwattr $C$DW$538, DW_AT_name("RSVD18")
    9161                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_RSVD18")
    9162                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    9163                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    9164              $C$DW$539       .dwtag  DW_TAG_member
    9165                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$20)
    9166                      .dwattr $C$DW$539, DW_AT_name("MMCCIDX")
    9167                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_MMCCIDX")
    9168                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    9169                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    9170              $C$DW$540       .dwtag  DW_TAG_member
    9171                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$24)
    9172                      .dwattr $C$DW$540, DW_AT_name("RSVD19")
    9173                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_RSVD19")
    9174                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    9175                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    9176              $C$DW$541       .dwtag  DW_TAG_member
    9177                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$20)
    9178                      .dwattr $C$DW$541, DW_AT_name("SDIOCTL")
    9179                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_SDIOCTL")
    9180                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    9181                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    9182              $C$DW$542       .dwtag  DW_TAG_member
    9183                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$21)
    9184                      .dwattr $C$DW$542, DW_AT_name("RSVD20")
    9185                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_RSVD20")
    9186                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
    9187                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    9188              $C$DW$543       .dwtag  DW_TAG_member
    9189                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$20)
    9190                      .dwattr $C$DW$543, DW_AT_name("SDIOST0")
    9191                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_SDIOST0")
    9192                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    9193                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    9194              $C$DW$544       .dwtag  DW_TAG_member
    9195                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$21)
    9196                      .dwattr $C$DW$544, DW_AT_name("RSVD21")
    9197                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_RSVD21")
    9198                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
    9199                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    9200              $C$DW$545       .dwtag  DW_TAG_member
    9201                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$20)
    9202                      .dwattr $C$DW$545, DW_AT_name("SDIOIEN")
    9203                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_SDIOIEN")
    9204                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    9205                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    9206              $C$DW$546       .dwtag  DW_TAG_member
    9207                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$21)
    9208                      .dwattr $C$DW$546, DW_AT_name("RSVD22")
    9209                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_RSVD22")
    9210                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  217

    9211                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    9212              $C$DW$547       .dwtag  DW_TAG_member
    9213                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$20)
    9214                      .dwattr $C$DW$547, DW_AT_name("SDIOIST")
    9215                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_SDIOIST")
    9216                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    9217                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    9218              $C$DW$548       .dwtag  DW_TAG_member
    9219                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$21)
    9220                      .dwattr $C$DW$548, DW_AT_name("RSVD23")
    9221                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_RSVD23")
    9222                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
    9223                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    9224              $C$DW$549       .dwtag  DW_TAG_member
    9225                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$20)
    9226                      .dwattr $C$DW$549, DW_AT_name("MMCFIFOCTL")
    9227                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_MMCFIFOCTL")
    9228                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    9229                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    9230                      .dwendtag $C$DW$T$25
    9231              
    9232              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
    9233                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$25)
    9234                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    9235              $C$DW$550       .dwtag  DW_TAG_TI_far_type
    9236                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$32)
    9237              $C$DW$551       .dwtag  DW_TAG_TI_ioport_type
    9238                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$550)
    9239              $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    9240                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$551)
    9241              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    9242                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    9243                      .dwattr $C$DW$T$34, DW_AT_address_class(0x10)
    9244              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
    9245                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    9246                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    9247              
    9248              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    9249                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    9250              $C$DW$552       .dwtag  DW_TAG_member
    9251                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$19)
    9252                      .dwattr $C$DW$552, DW_AT_name("rca")
    9253                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_rca")
    9254                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9255                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    9256              $C$DW$553       .dwtag  DW_TAG_member
    9257                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$26)
    9258                      .dwattr $C$DW$553, DW_AT_name("ocr")
    9259                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_ocr")
    9260                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9261                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    9262              $C$DW$554       .dwtag  DW_TAG_member
    9263                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$27)
    9264                      .dwattr $C$DW$554, DW_AT_name("funCount")
    9265                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_funCount")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  218

    9266                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9267                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    9268              $C$DW$555       .dwtag  DW_TAG_member
    9269                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$28)
    9270                      .dwattr $C$DW$555, DW_AT_name("cardReady")
    9271                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_cardReady")
    9272                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9273                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    9274              $C$DW$556       .dwtag  DW_TAG_member
    9275                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$28)
    9276                      .dwattr $C$DW$556, DW_AT_name("cardActive")
    9277                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_cardActive")
    9278                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9279                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    9280              $C$DW$557       .dwtag  DW_TAG_member
    9281                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$28)
    9282                      .dwattr $C$DW$557, DW_AT_name("sdHcDetected")
    9283                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_sdHcDetected")
    9284                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9285                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    9286              $C$DW$558       .dwtag  DW_TAG_member
    9287                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$30)
    9288                      .dwattr $C$DW$558, DW_AT_name("sdioCardType")
    9289                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_sdioCardType")
    9290                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9291                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    9292                      .dwendtag $C$DW$T$31
    9293              
    9294              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioCardObj")
    9295                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$31)
    9296                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    9297              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    9298                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    9299                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    9300              
    9301              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9302                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x08)
    9303              $C$DW$559       .dwtag  DW_TAG_member
    9304                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$35)
    9305                      .dwattr $C$DW$559, DW_AT_name("sdioRegs")
    9306                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_sdioRegs")
    9307                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9308                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    9309              $C$DW$560       .dwtag  DW_TAG_member
    9310                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$37)
    9311                      .dwattr $C$DW$560, DW_AT_name("pSdioCardObj")
    9312                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_pSdioCardObj")
    9313                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9314                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    9315              $C$DW$561       .dwtag  DW_TAG_member
    9316                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$39)
    9317                      .dwattr $C$DW$561, DW_AT_name("readEndianMode")
    9318                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_readEndianMode")
    9319                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9320                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  219

    9321              $C$DW$562       .dwtag  DW_TAG_member
    9322                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$39)
    9323                      .dwattr $C$DW$562, DW_AT_name("writeEndianMode")
    9324                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_writeEndianMode")
    9325                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9326                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    9327              $C$DW$563       .dwtag  DW_TAG_member
    9328                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$28)
    9329                      .dwattr $C$DW$563, DW_AT_name("cmd8Resp")
    9330                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_cmd8Resp")
    9331                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9332                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    9333                      .dwendtag $C$DW$T$40
    9334              
    9335              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioControllerObj")
    9336                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$40)
    9337                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    9338              $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    9339                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    9340                      .dwattr $C$DW$T$54, DW_AT_address_class(0x17)
    9341              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioHandle")
    9342                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    9343                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    9344              
    9345              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9346                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0a)
    9347              $C$DW$564       .dwtag  DW_TAG_member
    9348                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$19)
    9349                      .dwattr $C$DW$564, DW_AT_name("mmcctl")
    9350                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_mmcctl")
    9351                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9352                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    9353              $C$DW$565       .dwtag  DW_TAG_member
    9354                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$19)
    9355                      .dwattr $C$DW$565, DW_AT_name("mmcclk")
    9356                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_mmcclk")
    9357                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9358                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    9359              $C$DW$566       .dwtag  DW_TAG_member
    9360                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$19)
    9361                      .dwattr $C$DW$566, DW_AT_name("mmcim")
    9362                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_mmcim")
    9363                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9364                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    9365              $C$DW$567       .dwtag  DW_TAG_member
    9366                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$19)
    9367                      .dwattr $C$DW$567, DW_AT_name("mmctor")
    9368                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_mmctor")
    9369                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9370                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    9371              $C$DW$568       .dwtag  DW_TAG_member
    9372                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$19)
    9373                      .dwattr $C$DW$568, DW_AT_name("mmctod")
    9374                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_mmctod")
    9375                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  220

    9376                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    9377              $C$DW$569       .dwtag  DW_TAG_member
    9378                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$19)
    9379                      .dwattr $C$DW$569, DW_AT_name("mmcblen")
    9380                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_mmcblen")
    9381                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9382                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    9383              $C$DW$570       .dwtag  DW_TAG_member
    9384                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$19)
    9385                      .dwattr $C$DW$570, DW_AT_name("mmcnblk")
    9386                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_mmcnblk")
    9387                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9388                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    9389              $C$DW$571       .dwtag  DW_TAG_member
    9390                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$19)
    9391                      .dwattr $C$DW$571, DW_AT_name("mmcfifoctl")
    9392                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_mmcfifoctl")
    9393                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9394                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    9395              $C$DW$572       .dwtag  DW_TAG_member
    9396                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$19)
    9397                      .dwattr $C$DW$572, DW_AT_name("sdioctl")
    9398                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_sdioctl")
    9399                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9400                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    9401              $C$DW$573       .dwtag  DW_TAG_member
    9402                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$19)
    9403                      .dwattr $C$DW$573, DW_AT_name("sdioien")
    9404                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_sdioien")
    9405                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    9406                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    9407                      .dwendtag $C$DW$T$41
    9408              
    9409              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioConfig")
    9410                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$41)
    9411                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    9412              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    9413                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    9414                      .dwattr $C$DW$T$61, DW_AT_address_class(0x17)
    9415              
    9416              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    9417                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
    9418              $C$DW$574       .dwtag  DW_TAG_member
    9419                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$42)
    9420                      .dwattr $C$DW$574, DW_AT_name("respBuf")
    9421                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_respBuf")
    9422                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9423                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    9424                      .dwendtag $C$DW$T$43
    9425              
    9426              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioResponse")
    9427                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$43)
    9428                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    9429              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    9430                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  221

    9431                      .dwattr $C$DW$T$63, DW_AT_address_class(0x17)
    9432              
    9433              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    9434                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x48)
    9435              $C$DW$575       .dwtag  DW_TAG_member
    9436                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$20)
    9437                      .dwattr $C$DW$575, DW_AT_name("EBSR")
    9438                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_EBSR")
    9439                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9440                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    9441              $C$DW$576       .dwtag  DW_TAG_member
    9442                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$20)
    9443                      .dwattr $C$DW$576, DW_AT_name("RSVD0")
    9444                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_RSVD0")
    9445                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9446                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    9447              $C$DW$577       .dwtag  DW_TAG_member
    9448                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$20)
    9449                      .dwattr $C$DW$577, DW_AT_name("PCGCR1")
    9450                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_PCGCR1")
    9451                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9452                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    9453              $C$DW$578       .dwtag  DW_TAG_member
    9454                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$20)
    9455                      .dwattr $C$DW$578, DW_AT_name("PCGCR2")
    9456                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_PCGCR2")
    9457                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9458                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    9459              $C$DW$579       .dwtag  DW_TAG_member
    9460                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$20)
    9461                      .dwattr $C$DW$579, DW_AT_name("PSRCR")
    9462                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_PSRCR")
    9463                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9464                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    9465              $C$DW$580       .dwtag  DW_TAG_member
    9466                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$20)
    9467                      .dwattr $C$DW$580, DW_AT_name("PRCR")
    9468                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_PRCR")
    9469                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9470                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    9471              $C$DW$581       .dwtag  DW_TAG_member
    9472                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$44)
    9473                      .dwattr $C$DW$581, DW_AT_name("RSVD1")
    9474                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_RSVD1")
    9475                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9476                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    9477              $C$DW$582       .dwtag  DW_TAG_member
    9478                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$20)
    9479                      .dwattr $C$DW$582, DW_AT_name("TIAFR")
    9480                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_TIAFR")
    9481                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9482                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    9483              $C$DW$583       .dwtag  DW_TAG_member
    9484                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$20)
    9485                      .dwattr $C$DW$583, DW_AT_name("RSVD2")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  222

    9486                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_RSVD2")
    9487                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    9488                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    9489              $C$DW$584       .dwtag  DW_TAG_member
    9490                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$20)
    9491                      .dwattr $C$DW$584, DW_AT_name("ODSCR")
    9492                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_ODSCR")
    9493                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9494                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    9495              $C$DW$585       .dwtag  DW_TAG_member
    9496                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$20)
    9497                      .dwattr $C$DW$585, DW_AT_name("PDINHIBR1")
    9498                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_PDINHIBR1")
    9499                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    9500                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    9501              $C$DW$586       .dwtag  DW_TAG_member
    9502                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$20)
    9503                      .dwattr $C$DW$586, DW_AT_name("PDINHIBR2")
    9504                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_PDINHIBR2")
    9505                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9506                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    9507              $C$DW$587       .dwtag  DW_TAG_member
    9508                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$20)
    9509                      .dwattr $C$DW$587, DW_AT_name("PDINHIBR3")
    9510                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_PDINHIBR3")
    9511                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    9512                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    9513              $C$DW$588       .dwtag  DW_TAG_member
    9514                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$20)
    9515                      .dwattr $C$DW$588, DW_AT_name("DMA0CESR1")
    9516                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_DMA0CESR1")
    9517                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9518                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    9519              $C$DW$589       .dwtag  DW_TAG_member
    9520                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$20)
    9521                      .dwattr $C$DW$589, DW_AT_name("DMA0CESR2")
    9522                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_DMA0CESR2")
    9523                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    9524                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    9525              $C$DW$590       .dwtag  DW_TAG_member
    9526                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$20)
    9527                      .dwattr $C$DW$590, DW_AT_name("DMA1CESR1")
    9528                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_DMA1CESR1")
    9529                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9530                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    9531              $C$DW$591       .dwtag  DW_TAG_member
    9532                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$20)
    9533                      .dwattr $C$DW$591, DW_AT_name("DMA1CESR2")
    9534                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_DMA1CESR2")
    9535                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    9536                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    9537              $C$DW$592       .dwtag  DW_TAG_member
    9538                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$20)
    9539                      .dwattr $C$DW$592, DW_AT_name("SDRAMCCR")
    9540                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_SDRAMCCR")
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  223

    9541                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9542                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    9543              $C$DW$593       .dwtag  DW_TAG_member
    9544                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$20)
    9545                      .dwattr $C$DW$593, DW_AT_name("CCR2")
    9546                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_CCR2")
    9547                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    9548                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    9549              $C$DW$594       .dwtag  DW_TAG_member
    9550                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$20)
    9551                      .dwattr $C$DW$594, DW_AT_name("CGCR1")
    9552                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_CGCR1")
    9553                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9554                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    9555              $C$DW$595       .dwtag  DW_TAG_member
    9556                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$20)
    9557                      .dwattr $C$DW$595, DW_AT_name("CGICR")
    9558                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_CGICR")
    9559                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    9560                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    9561              $C$DW$596       .dwtag  DW_TAG_member
    9562                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$20)
    9563                      .dwattr $C$DW$596, DW_AT_name("CGCR2")
    9564                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_CGCR2")
    9565                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    9566                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    9567              $C$DW$597       .dwtag  DW_TAG_member
    9568                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$20)
    9569                      .dwattr $C$DW$597, DW_AT_name("CGOCR")
    9570                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_CGOCR")
    9571                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    9572                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    9573              $C$DW$598       .dwtag  DW_TAG_member
    9574                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$20)
    9575                      .dwattr $C$DW$598, DW_AT_name("CCSSR")
    9576                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_CCSSR")
    9577                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    9578                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    9579              $C$DW$599       .dwtag  DW_TAG_member
    9580                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$20)
    9581                      .dwattr $C$DW$599, DW_AT_name("RSVD3")
    9582                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_RSVD3")
    9583                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    9584                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    9585              $C$DW$600       .dwtag  DW_TAG_member
    9586                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$20)
    9587                      .dwattr $C$DW$600, DW_AT_name("ECDR")
    9588                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_ECDR")
    9589                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    9590                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    9591              $C$DW$601       .dwtag  DW_TAG_member
    9592                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$20)
    9593                      .dwattr $C$DW$601, DW_AT_name("RSVD4")
    9594                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_RSVD4")
    9595                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  224

    9596                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    9597              $C$DW$602       .dwtag  DW_TAG_member
    9598                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$20)
    9599                      .dwattr $C$DW$602, DW_AT_name("RAMSLPMDCNTLR1")
    9600                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    9601                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9602                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    9603              $C$DW$603       .dwtag  DW_TAG_member
    9604                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$20)
    9605                      .dwattr $C$DW$603, DW_AT_name("RSVD5")
    9606                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_RSVD5")
    9607                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    9608                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    9609              $C$DW$604       .dwtag  DW_TAG_member
    9610                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$20)
    9611                      .dwattr $C$DW$604, DW_AT_name("RAMSLPMDCNTLR2")
    9612                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    9613                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9614                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    9615              $C$DW$605       .dwtag  DW_TAG_member
    9616                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$20)
    9617                      .dwattr $C$DW$605, DW_AT_name("RAMSLPMDCNTLR3")
    9618                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    9619                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    9620                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    9621              $C$DW$606       .dwtag  DW_TAG_member
    9622                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$20)
    9623                      .dwattr $C$DW$606, DW_AT_name("RAMSLPMDCNTLR4")
    9624                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    9625                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9626                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    9627              $C$DW$607       .dwtag  DW_TAG_member
    9628                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$20)
    9629                      .dwattr $C$DW$607, DW_AT_name("RAMSLPMDCNTLR5")
    9630                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    9631                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    9632                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    9633              $C$DW$608       .dwtag  DW_TAG_member
    9634                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$22)
    9635                      .dwattr $C$DW$608, DW_AT_name("RSVD6")
    9636                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_RSVD6")
    9637                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    9638                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    9639              $C$DW$609       .dwtag  DW_TAG_member
    9640                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$20)
    9641                      .dwattr $C$DW$609, DW_AT_name("DMAIFR")
    9642                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_DMAIFR")
    9643                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9644                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    9645              $C$DW$610       .dwtag  DW_TAG_member
    9646                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$20)
    9647                      .dwattr $C$DW$610, DW_AT_name("DMAIER")
    9648                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_DMAIER")
    9649                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    9650                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  225

    9651              $C$DW$611       .dwtag  DW_TAG_member
    9652                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$20)
    9653                      .dwattr $C$DW$611, DW_AT_name("USBSCR")
    9654                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_USBSCR")
    9655                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9656                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    9657              $C$DW$612       .dwtag  DW_TAG_member
    9658                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$20)
    9659                      .dwattr $C$DW$612, DW_AT_name("ESCR")
    9660                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_ESCR")
    9661                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    9662                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    9663              $C$DW$613       .dwtag  DW_TAG_member
    9664                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$22)
    9665                      .dwattr $C$DW$613, DW_AT_name("RSVD7")
    9666                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_RSVD7")
    9667                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9668                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    9669              $C$DW$614       .dwtag  DW_TAG_member
    9670                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$20)
    9671                      .dwattr $C$DW$614, DW_AT_name("DMA2CESR1")
    9672                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_DMA2CESR1")
    9673                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9674                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    9675              $C$DW$615       .dwtag  DW_TAG_member
    9676                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$20)
    9677                      .dwattr $C$DW$615, DW_AT_name("DMA2CESR2")
    9678                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_DMA2CESR2")
    9679                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    9680                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    9681              $C$DW$616       .dwtag  DW_TAG_member
    9682                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$20)
    9683                      .dwattr $C$DW$616, DW_AT_name("DMA3CESR1")
    9684                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_DMA3CESR1")
    9685                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9686                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    9687              $C$DW$617       .dwtag  DW_TAG_member
    9688                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$20)
    9689                      .dwattr $C$DW$617, DW_AT_name("DMA3CESR2")
    9690                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_DMA3CESR2")
    9691                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    9692                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    9693              $C$DW$618       .dwtag  DW_TAG_member
    9694                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$20)
    9695                      .dwattr $C$DW$618, DW_AT_name("CLKSTOP")
    9696                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_CLKSTOP")
    9697                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9698                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    9699              $C$DW$619       .dwtag  DW_TAG_member
    9700                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$45)
    9701                      .dwattr $C$DW$619, DW_AT_name("RSVD8")
    9702                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_RSVD8")
    9703                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    9704                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    9705              $C$DW$620       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  226

    9706                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$20)
    9707                      .dwattr $C$DW$620, DW_AT_name("DIEIDR0")
    9708                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_DIEIDR0")
    9709                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9710                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    9711              $C$DW$621       .dwtag  DW_TAG_member
    9712                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$20)
    9713                      .dwattr $C$DW$621, DW_AT_name("DIEIDR1")
    9714                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_DIEIDR1")
    9715                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    9716                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    9717              $C$DW$622       .dwtag  DW_TAG_member
    9718                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$20)
    9719                      .dwattr $C$DW$622, DW_AT_name("DIEIDR2")
    9720                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_DIEIDR2")
    9721                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    9722                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    9723              $C$DW$623       .dwtag  DW_TAG_member
    9724                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$20)
    9725                      .dwattr $C$DW$623, DW_AT_name("DIEIDR3")
    9726                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_DIEIDR3")
    9727                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    9728                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    9729              $C$DW$624       .dwtag  DW_TAG_member
    9730                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$20)
    9731                      .dwattr $C$DW$624, DW_AT_name("DIEIDR4")
    9732                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_DIEIDR4")
    9733                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9734                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    9735              $C$DW$625       .dwtag  DW_TAG_member
    9736                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$20)
    9737                      .dwattr $C$DW$625, DW_AT_name("DIEIDR5")
    9738                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_DIEIDR5")
    9739                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    9740                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    9741              $C$DW$626       .dwtag  DW_TAG_member
    9742                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$20)
    9743                      .dwattr $C$DW$626, DW_AT_name("DIEIDR6")
    9744                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_DIEIDR6")
    9745                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    9746                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    9747              $C$DW$627       .dwtag  DW_TAG_member
    9748                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$20)
    9749                      .dwattr $C$DW$627, DW_AT_name("DIEIDR7")
    9750                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_DIEIDR7")
    9751                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    9752                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    9753                      .dwendtag $C$DW$T$46
    9754              
    9755              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    9756                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$46)
    9757                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    9758              $C$DW$628       .dwtag  DW_TAG_TI_far_type
    9759                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$64)
    9760              $C$DW$629       .dwtag  DW_TAG_TI_ioport_type
TMS320C55x Assembler PC v4.4.1 Sun Sep 09 00:04:49 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_sdio.asm                                                         PAGE  227

    9761                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$628)
    9762              $C$DW$T$65      .dwtag  DW_TAG_volatile_type
    9763                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$629)
    9764              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    9765                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    9766                      .dwattr $C$DW$T$66, DW_AT_address_class(0x10)
    9767              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    9768                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    9769                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    9770              $C$DW$T$4       .dwtag  DW_TAG_base_type
    9771                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    9772                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    9773                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    9774              $C$DW$T$5       .dwtag  DW_TAG_base_type
    9775                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    9776                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    9777                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    9778              $C$DW$T$6       .dwtag  DW_TAG_base_type
    9779                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    9780                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    9781                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    9782              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    9783                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    9784                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    9785              $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    9786                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$27)
    9787                      .dwattr $C$DW$T$68, DW_AT_address_class(0x17)
    9788              $C$DW$T$7       .dwtag  DW_TAG_base_type
    9789                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    9790                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    9791                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    9792              $C$DW$T$8       .dwtag  DW_TAG_base_type
    9793                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    9794                      .dwattr $C$DW$T$8, DW_AT_name("short")
    9795                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    9796              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    9797                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$8)
    9798                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    9799              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    9800                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    9801                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    9802              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
