TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE    1

    1822              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 23:29:47 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     851 000221 EB00          MOV XAR0, dbl(*SP(#0))
         000223 85   
     852                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_wdt.c",line 515,column 2,is_stmt
     853 000224 ED00          MOV dbl(*SP(#0)), XAR3
         000226 BF   
     854              
     855 000227 90B0          MOV XAR3, AC0
     856 000229 3D01  ||      MOV #0, AC1 ; |515| 
     857              
     858 00022b 121C          CMPU AC1 != AC0, TC1 ; |515| 
         00022d 04   
     859 00022e 6264          BCC $C$L25,TC1 ; |515| 
     860                                                      ; branchcc occurs ; |515| 
     861                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_wdt.c",line 517,column 3,is_stmt
     862 000230 3E54          MOV #-5, T0
     863 000232 4A2E          B $C$L27  ; |517| 
     864                                                      ; branch occurs ; |517| 
     865 000234       $C$L25:    
     866                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_wdt.c",line 520,column 2,is_stmt
     867 000234 ED04          MOV dbl(*SP(#2)), XAR3
         000236 BF   
     868 000237 90B0          MOV XAR3, AC0
     869 000239 121C          CMPU AC1 != AC0, TC1 ; |520| 
         00023b 04   
     870 00023c 6264          BCC $C$L26,TC1 ; |520| 
     871                                                      ; branchcc occurs ; |520| 
     872                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_wdt.c",line 522,column 3,is_stmt
     873 00023e 3E64          MOV #-6, T0
     874 000240 4A20          B $C$L27  ; |522| 
     875                                                      ; branch occurs ; |522| 
     876 000242       $C$L26:    
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   19

     877                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_wdt.c",line 525,column 2,is_stmt
     878 000242 ED00          MOV dbl(*SP(#0)), XAR3
         000244 BF   
     879 000245 A973          MOV *AR3(short(#1)), AR1 ; |525| 
     880 000247 C908          MOV AR1, *SP(#4) ; |525| 
     881                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_wdt.c",line 527,column 2,is_stmt
     882 000249 229B          MOV AR1, AR3
     883 00024b ED04          MOV dbl(*SP(#2)), XAR2
         00024d AF   
     884 00024e A97D          MOV port(*AR3(short(#6))), AR1 ; |527| 
         000250 99   
     885 000251 C941          MOV AR1, *AR2 ; |527| 
     886                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_wdt.c",line 528,column 2,is_stmt
     887 000253 AB08          MOV *SP(#4), AR3 ; |528| 
     888 000255 140E          AMOV #14, T0
         000257 45   
     889 000258 A96B          MOV port(*AR3(T0)), AR1 ; |528| 
         00025a 99   
     890 00025b ED04          MOV dbl(*SP(#2)), XAR3
         00025d BF   
     891 00025e C973          MOV AR1, *AR3(short(#1)) ; |528| 
     892                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_wdt.c",line 530,column 2,is_stmt
     893 000260 3C04          MOV #0, T0
     894 000262       $C$L27:    
     895                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_wdt.c",line 531,column 1,is_stmt
     896 000262 4E05          AADD #5, SP
     897                      .dwcfi  cfa_offset, 1
     898              $C$DW$51        .dwtag  DW_TAG_TI_branch
     899                      .dwattr $C$DW$51, DW_AT_low_pc(0x00)
     900                      .dwattr $C$DW$51, DW_AT_TI_return
     901 000264 4804          RET
     902                                                      ; return occurs
     903                      .dwattr $C$DW$45, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_wdt.c")
     904                      .dwattr $C$DW$45, DW_AT_TI_end_line(0x213)
     905                      .dwattr $C$DW$45, DW_AT_TI_end_column(0x01)
     906                      .dwendentry
     907                      .dwendtag $C$DW$45
     908              
     909              
     910              ;*******************************************************************************
     911              ;* TYPE INFORMATION                                                            *
     912              ;*******************************************************************************
     913              
     914              $C$DW$T$22      .dwtag  DW_TAG_enumeration_type
     915                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     916              $C$DW$52        .dwtag  DW_TAG_enumerator, DW_AT_name("WDT_INST_0"), DW_AT_const_value(0x00)
     917              $C$DW$53        .dwtag  DW_TAG_enumerator, DW_AT_name("WDT_INST_INVALID"), DW_AT_const_value(0x01)
     918                      .dwendtag $C$DW$T$22
     919              
     920              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("WDT_Instance")
     921                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     922                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     923              
     924              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     925                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0f)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   20

     926              $C$DW$54        .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
     928                      .dwattr $C$DW$54, DW_AT_name("WDKCKLK")
     929                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_WDKCKLK")
     930                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     931                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     932              $C$DW$55        .dwtag  DW_TAG_member
     933                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$20)
     934                      .dwattr $C$DW$55, DW_AT_name("RSVD0")
     935                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_RSVD0")
     936                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     937                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     938              $C$DW$56        .dwtag  DW_TAG_member
     939                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$20)
     940                      .dwattr $C$DW$56, DW_AT_name("WDKICK")
     941                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_WDKICK")
     942                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     943                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     944              $C$DW$57        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
     946                      .dwattr $C$DW$57, DW_AT_name("RSVD1")
     947                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_RSVD1")
     948                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     949                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     950              $C$DW$58        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     952                      .dwattr $C$DW$58, DW_AT_name("WDSVLR")
     953                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_WDSVLR")
     954                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     955                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     956              $C$DW$59        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
     958                      .dwattr $C$DW$59, DW_AT_name("RSVD2")
     959                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_RSVD2")
     960                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     961                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     962              $C$DW$60        .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
     964                      .dwattr $C$DW$60, DW_AT_name("WDSVR")
     965                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_WDSVR")
     966                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     967                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     968              $C$DW$61        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$20)
     970                      .dwattr $C$DW$61, DW_AT_name("RSVD3")
     971                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_RSVD3")
     972                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     973                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     974              $C$DW$62        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
     976                      .dwattr $C$DW$62, DW_AT_name("WDENLOK")
     977                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_WDENLOK")
     978                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     979                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     980              $C$DW$63        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   21

     981                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$20)
     982                      .dwattr $C$DW$63, DW_AT_name("RSVD4")
     983                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_RSVD4")
     984                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     985                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     986              $C$DW$64        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
     988                      .dwattr $C$DW$64, DW_AT_name("WDEN")
     989                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_WDEN")
     990                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     991                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     992              $C$DW$65        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$20)
     994                      .dwattr $C$DW$65, DW_AT_name("RSVD5")
     995                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_RSVD5")
     996                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     997                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     998              $C$DW$66        .dwtag  DW_TAG_member
     999                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
    1000                      .dwattr $C$DW$66, DW_AT_name("WDPSLR")
    1001                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_WDPSLR")
    1002                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1003                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1004              $C$DW$67        .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
    1006                      .dwattr $C$DW$67, DW_AT_name("RSVD6")
    1007                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_RSVD6")
    1008                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1009                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1010              $C$DW$68        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
    1012                      .dwattr $C$DW$68, DW_AT_name("WDPS")
    1013                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_WDPS")
    1014                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1015                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1016                      .dwendtag $C$DW$T$21
    1017              
    1018              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_WdtRegs")
    1019                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
    1020                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1021              $C$DW$69        .dwtag  DW_TAG_TI_far_type
    1022                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$24)
    1023              $C$DW$70        .dwtag  DW_TAG_TI_ioport_type
    1024                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$69)
    1025              $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1026                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$70)
    1027              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1028                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1029                      .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    1030              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_WdtRegsOvly")
    1031                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1032                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1033              
    1034              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1035                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   22

    1036              $C$DW$71        .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$23)
    1038                      .dwattr $C$DW$71, DW_AT_name("wdtInstance")
    1039                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_wdtInstance")
    1040                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1041                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1042              $C$DW$72        .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$27)
    1044                      .dwattr $C$DW$72, DW_AT_name("hwRegs")
    1045                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_hwRegs")
    1046                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1047                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1048                      .dwendtag $C$DW$T$28
    1049              
    1050              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_WdtObj")
    1051                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$28)
    1052                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1053              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1054                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1055                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1056              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_WdtHandle")
    1057                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1058                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1059              
    1060              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1061                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1062              $C$DW$73        .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$73, DW_AT_name("counter")
    1065                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_counter")
    1066                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1067                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1068              $C$DW$74        .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$74, DW_AT_name("prescale")
    1071                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_prescale")
    1072                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1073                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1074                      .dwendtag $C$DW$T$29
    1075              
    1076              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("WDTIM_Config")
    1077                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$29)
    1078                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1079              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1080                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1081                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    1082              
    1083              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1084                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x48)
    1085              $C$DW$75        .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
    1087                      .dwattr $C$DW$75, DW_AT_name("EBSR")
    1088                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_EBSR")
    1089                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   23

    1091              $C$DW$76        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1093                      .dwattr $C$DW$76, DW_AT_name("RSVD0")
    1094                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_RSVD0")
    1095                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1096                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1097              $C$DW$77        .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
    1099                      .dwattr $C$DW$77, DW_AT_name("PCGCR1")
    1100                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_PCGCR1")
    1101                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1102                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1103              $C$DW$78        .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1105                      .dwattr $C$DW$78, DW_AT_name("PCGCR2")
    1106                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PCGCR2")
    1107                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1108                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1109              $C$DW$79        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    1111                      .dwattr $C$DW$79, DW_AT_name("PSRCR")
    1112                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_PSRCR")
    1113                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1114                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1115              $C$DW$80        .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    1117                      .dwattr $C$DW$80, DW_AT_name("PRCR")
    1118                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_PRCR")
    1119                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1120                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1121              $C$DW$81        .dwtag  DW_TAG_member
    1122                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$30)
    1123                      .dwattr $C$DW$81, DW_AT_name("RSVD1")
    1124                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_RSVD1")
    1125                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1126                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1127              $C$DW$82        .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    1129                      .dwattr $C$DW$82, DW_AT_name("TIAFR")
    1130                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_TIAFR")
    1131                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1132                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1133              $C$DW$83        .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1135                      .dwattr $C$DW$83, DW_AT_name("RSVD2")
    1136                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_RSVD2")
    1137                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1138                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1139              $C$DW$84        .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    1141                      .dwattr $C$DW$84, DW_AT_name("ODSCR")
    1142                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_ODSCR")
    1143                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1144                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1145              $C$DW$85        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   24

    1146                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1147                      .dwattr $C$DW$85, DW_AT_name("PDINHIBR1")
    1148                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_PDINHIBR1")
    1149                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1150                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1151              $C$DW$86        .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    1153                      .dwattr $C$DW$86, DW_AT_name("PDINHIBR2")
    1154                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_PDINHIBR2")
    1155                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1156                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1157              $C$DW$87        .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    1159                      .dwattr $C$DW$87, DW_AT_name("PDINHIBR3")
    1160                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_PDINHIBR3")
    1161                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1162                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1163              $C$DW$88        .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    1165                      .dwattr $C$DW$88, DW_AT_name("DMA0CESR1")
    1166                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_DMA0CESR1")
    1167                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1168                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1169              $C$DW$89        .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    1171                      .dwattr $C$DW$89, DW_AT_name("DMA0CESR2")
    1172                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_DMA0CESR2")
    1173                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1174                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1175              $C$DW$90        .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
    1177                      .dwattr $C$DW$90, DW_AT_name("DMA1CESR1")
    1178                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_DMA1CESR1")
    1179                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1180                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1181              $C$DW$91        .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    1183                      .dwattr $C$DW$91, DW_AT_name("DMA1CESR2")
    1184                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_DMA1CESR2")
    1185                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1186                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1187              $C$DW$92        .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    1189                      .dwattr $C$DW$92, DW_AT_name("SDRAMCCR")
    1190                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_SDRAMCCR")
    1191                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1192                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1193              $C$DW$93        .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
    1195                      .dwattr $C$DW$93, DW_AT_name("CCR2")
    1196                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_CCR2")
    1197                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1198                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1199              $C$DW$94        .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   25

    1201                      .dwattr $C$DW$94, DW_AT_name("CGCR1")
    1202                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_CGCR1")
    1203                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1204                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1205              $C$DW$95        .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    1207                      .dwattr $C$DW$95, DW_AT_name("CGICR")
    1208                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_CGICR")
    1209                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1210                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1211              $C$DW$96        .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    1213                      .dwattr $C$DW$96, DW_AT_name("CGCR2")
    1214                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_CGCR2")
    1215                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1216                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1217              $C$DW$97        .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    1219                      .dwattr $C$DW$97, DW_AT_name("CGOCR")
    1220                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_CGOCR")
    1221                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1222                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$98        .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    1225                      .dwattr $C$DW$98, DW_AT_name("CCSSR")
    1226                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_CCSSR")
    1227                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1228                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$99        .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    1231                      .dwattr $C$DW$99, DW_AT_name("RSVD3")
    1232                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_RSVD3")
    1233                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1234                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$100       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    1237                      .dwattr $C$DW$100, DW_AT_name("ECDR")
    1238                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_ECDR")
    1239                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1240                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1241              $C$DW$101       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    1243                      .dwattr $C$DW$101, DW_AT_name("RSVD4")
    1244                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_RSVD4")
    1245                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    1246                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$102       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    1249                      .dwattr $C$DW$102, DW_AT_name("RAMSLPMDCNTLR1")
    1250                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1251                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1252                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1253              $C$DW$103       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1255                      .dwattr $C$DW$103, DW_AT_name("RSVD5")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   26

    1256                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_RSVD5")
    1257                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1258                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1259              $C$DW$104       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    1261                      .dwattr $C$DW$104, DW_AT_name("RAMSLPMDCNTLR2")
    1262                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1263                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1264                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1265              $C$DW$105       .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    1267                      .dwattr $C$DW$105, DW_AT_name("RAMSLPMDCNTLR3")
    1268                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1269                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1270                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1271              $C$DW$106       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    1273                      .dwattr $C$DW$106, DW_AT_name("RAMSLPMDCNTLR4")
    1274                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1275                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1276                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1277              $C$DW$107       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    1279                      .dwattr $C$DW$107, DW_AT_name("RAMSLPMDCNTLR5")
    1280                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1281                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1282                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1283              $C$DW$108       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$31)
    1285                      .dwattr $C$DW$108, DW_AT_name("RSVD6")
    1286                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_RSVD6")
    1287                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1288                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1289              $C$DW$109       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    1291                      .dwattr $C$DW$109, DW_AT_name("DMAIFR")
    1292                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_DMAIFR")
    1293                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1294                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1295              $C$DW$110       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    1297                      .dwattr $C$DW$110, DW_AT_name("DMAIER")
    1298                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_DMAIER")
    1299                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1300                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1301              $C$DW$111       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    1303                      .dwattr $C$DW$111, DW_AT_name("USBSCR")
    1304                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_USBSCR")
    1305                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1306                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1307              $C$DW$112       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    1309                      .dwattr $C$DW$112, DW_AT_name("ESCR")
    1310                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_ESCR")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   27

    1311                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1312                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1313              $C$DW$113       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$31)
    1315                      .dwattr $C$DW$113, DW_AT_name("RSVD7")
    1316                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_RSVD7")
    1317                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1318                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1319              $C$DW$114       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1321                      .dwattr $C$DW$114, DW_AT_name("DMA2CESR1")
    1322                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_DMA2CESR1")
    1323                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1324                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1325              $C$DW$115       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    1327                      .dwattr $C$DW$115, DW_AT_name("DMA2CESR2")
    1328                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_DMA2CESR2")
    1329                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1330                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$116       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1333                      .dwattr $C$DW$116, DW_AT_name("DMA3CESR1")
    1334                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_DMA3CESR1")
    1335                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1336                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1337              $C$DW$117       .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    1339                      .dwattr $C$DW$117, DW_AT_name("DMA3CESR2")
    1340                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_DMA3CESR2")
    1341                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1342                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1343              $C$DW$118       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    1345                      .dwattr $C$DW$118, DW_AT_name("CLKSTOP")
    1346                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_CLKSTOP")
    1347                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1348                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1349              $C$DW$119       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$32)
    1351                      .dwattr $C$DW$119, DW_AT_name("RSVD8")
    1352                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_RSVD8")
    1353                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    1354                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1355              $C$DW$120       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    1357                      .dwattr $C$DW$120, DW_AT_name("DIEIDR0")
    1358                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_DIEIDR0")
    1359                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1360                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1361              $C$DW$121       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    1363                      .dwattr $C$DW$121, DW_AT_name("DIEIDR1")
    1364                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_DIEIDR1")
    1365                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   28

    1366                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1367              $C$DW$122       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    1369                      .dwattr $C$DW$122, DW_AT_name("DIEIDR2")
    1370                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_DIEIDR2")
    1371                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1372                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1373              $C$DW$123       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    1375                      .dwattr $C$DW$123, DW_AT_name("DIEIDR3")
    1376                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_DIEIDR3")
    1377                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1378                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1379              $C$DW$124       .dwtag  DW_TAG_member
    1380                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    1381                      .dwattr $C$DW$124, DW_AT_name("DIEIDR4")
    1382                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_DIEIDR4")
    1383                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1384                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$125       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1387                      .dwattr $C$DW$125, DW_AT_name("DIEIDR5")
    1388                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_DIEIDR5")
    1389                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1390                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1391              $C$DW$126       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1393                      .dwattr $C$DW$126, DW_AT_name("DIEIDR6")
    1394                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_DIEIDR6")
    1395                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1396                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1397              $C$DW$127       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    1399                      .dwattr $C$DW$127, DW_AT_name("DIEIDR7")
    1400                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_DIEIDR7")
    1401                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1402                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1403                      .dwendtag $C$DW$T$33
    1404              
    1405              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1406                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$33)
    1407                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1408              $C$DW$128       .dwtag  DW_TAG_TI_far_type
    1409                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$43)
    1410              $C$DW$129       .dwtag  DW_TAG_TI_ioport_type
    1411                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$128)
    1412              $C$DW$T$44      .dwtag  DW_TAG_volatile_type
    1413                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$129)
    1414              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    1415                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1416                      .dwattr $C$DW$T$45, DW_AT_address_class(0x10)
    1417              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1418                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1419                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1420                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 23:29:47 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_wdt.asm                                                          PAGE   29

    1421              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1422                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1423                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1424                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1425              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1426                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1427                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1428                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1429              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1430                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1431                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1432                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1433              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1434                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1435                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1436                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1437              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1438                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$8)
    1439                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1440              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1441                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1442                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1443              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    1444                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1445                      .dwattr $C$DW$T$39, DW_AT_address_class(0x17)
    1446              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1447                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1448                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1449                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1450              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1451                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1452                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1453              $C$DW$130       .dwtag  DW_TAG_TI_far_type
