TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE    1

    5400              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 07 02:27:31 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4007              $C$DW$T$60      .dwtag  DW_TAG_enumeration_type
    4008                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
    4009              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_UNLOCK"), DW_AT_const_value(0x00)
    4010              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_LOCK"), DW_AT_const_value(0x01)
    4011                      .dwendtag $C$DW$T$60
    4012              
    4013              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcMediaLockStatus")
    4014                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    4015                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4016              
    4017              $C$DW$T$80      .dwtag  DW_TAG_enumeration_type
    4018                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
    4019              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
    4020              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    4021              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    4022              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    4023              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    4024              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    4025              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    4026              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    4027              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    4028              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    4029              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    4030              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    4031              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    4032              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    4033              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    4034              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    4035                      .dwendtag $C$DW$T$80
    4036              
    4037              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    4038                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    4039                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    4040              
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   90

    4041              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    4042                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    4043              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    4044              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    4045              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    4046              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    4047              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    4048                      .dwendtag $C$DW$T$82
    4049              
    4050              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    4051                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    4052                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    4053              
    4054              $C$DW$T$91      .dwtag  DW_TAG_enumeration_type
    4055                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x01)
    4056              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_DEVICE_DESCR"), DW_AT_const_value(0x00)
    4057              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_DEVICE_QUAL_DESCR"), DW_AT_const_value(0x01)
    4058              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_CONFIG_DESCR"), DW_AT_const_value(0x02)
    4059              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_INTERFACE_DESCR"), DW_AT_const_value(0x03)
    4060              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_AC_STRING_LANGID_DESC"), DW_AT_const_value(0x04)
    4061                      .dwendtag $C$DW$T$91
    4062              
    4063              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcDescrId")
    4064                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    4065                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    4066              
    4067              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    4068                      .dwattr $C$DW$T$21, DW_AT_name("CSL_AcClassStruct")
    4069                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x2f6)
    4070              $C$DW$363       .dwtag  DW_TAG_member
    4071                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    4072                      .dwattr $C$DW$363, DW_AT_name("ctrlHandle")
    4073                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_ctrlHandle")
    4074                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4075                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4076              $C$DW$364       .dwtag  DW_TAG_member
    4077                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    4078                      .dwattr $C$DW$364, DW_AT_name("acHandle")
    4079                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_acHandle")
    4080                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x18a]
    4081                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4082                      .dwendtag $C$DW$T$21
    4083              
    4084              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcClassStruct")
    4085                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$21)
    4086                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    4087              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    4088                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    4089                      .dwattr $C$DW$T$94, DW_AT_address_class(0x17)
    4090              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("pAcClassHandle")
    4091                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    4092                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    4093              
    4094              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4095                      .dwattr $C$DW$T$48, DW_AT_name("CSL_AcCtrlObject")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   91

    4096                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x18a)
    4097              $C$DW$365       .dwtag  DW_TAG_member
    4098                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$22)
    4099                      .dwattr $C$DW$365, DW_AT_name("ctrlInEpObj")
    4100                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_ctrlInEpObj")
    4101                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4102                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4103              $C$DW$366       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$24)
    4105                      .dwattr $C$DW$366, DW_AT_name("devNum")
    4106                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_devNum")
    4107                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4108                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4109              $C$DW$367       .dwtag  DW_TAG_member
    4110                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$22)
    4111                      .dwattr $C$DW$367, DW_AT_name("ctrlOutEpObj")
    4112                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ctrlOutEpObj")
    4113                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4114                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4115              $C$DW$368       .dwtag  DW_TAG_member
    4116                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$25)
    4117                      .dwattr $C$DW$368, DW_AT_name("suspendFlag")
    4118                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_suspendFlag")
    4119                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4120                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4121              $C$DW$369       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$28)
    4123                      .dwattr $C$DW$369, DW_AT_name("hEpObjArray")
    4124                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_hEpObjArray")
    4125                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4126                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4127              $C$DW$370       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$29)
    4129                      .dwattr $C$DW$370, DW_AT_name("usbSetup")
    4130                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_usbSetup")
    4131                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4132                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4133              $C$DW$371       .dwtag  DW_TAG_member
    4134                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$30)
    4135                      .dwattr $C$DW$371, DW_AT_name("leftVolBuf")
    4136                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_leftVolBuf")
    4137                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4138                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4139              $C$DW$372       .dwtag  DW_TAG_member
    4140                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$30)
    4141                      .dwattr $C$DW$372, DW_AT_name("rightVolBuf")
    4142                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rightVolBuf")
    4143                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4144                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4145              $C$DW$373       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$31)
    4147                      .dwattr $C$DW$373, DW_AT_name("leftRightVolBuf")
    4148                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_leftRightVolBuf")
    4149                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4150                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   92

    4151              $C$DW$374       .dwtag  DW_TAG_member
    4152                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$30)
    4153                      .dwattr $C$DW$374, DW_AT_name("muteCtrlBuf")
    4154                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_muteCtrlBuf")
    4155                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4156                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4157              $C$DW$375       .dwtag  DW_TAG_member
    4158                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$32)
    4159                      .dwattr $C$DW$375, DW_AT_name("getMinBuffer")
    4160                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_getMinBuffer")
    4161                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4162                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4163              $C$DW$376       .dwtag  DW_TAG_member
    4164                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$32)
    4165                      .dwattr $C$DW$376, DW_AT_name("getMaxBuffer")
    4166                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_getMaxBuffer")
    4167                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4168                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4169              $C$DW$377       .dwtag  DW_TAG_member
    4170                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$32)
    4171                      .dwattr $C$DW$377, DW_AT_name("getResBuffer")
    4172                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_getResBuffer")
    4173                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4174                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4175              $C$DW$378       .dwtag  DW_TAG_member
    4176                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$33)
    4177                      .dwattr $C$DW$378, DW_AT_name("dummydesc")
    4178                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_dummydesc")
    4179                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    4180                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4181              $C$DW$379       .dwtag  DW_TAG_member
    4182                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$31)
    4183                      .dwattr $C$DW$379, DW_AT_name("deviceQualifierDescr")
    4184                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_deviceQualifierDescr")
    4185                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xa5]
    4186                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4187              $C$DW$380       .dwtag  DW_TAG_member
    4188                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$34)
    4189                      .dwattr $C$DW$380, DW_AT_name("deviceDescr")
    4190                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_deviceDescr")
    4191                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xb1]
    4192                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4193              $C$DW$381       .dwtag  DW_TAG_member
    4194                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$35)
    4195                      .dwattr $C$DW$381, DW_AT_name("confDescr")
    4196                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_confDescr")
    4197                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xc5]
    4198                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4199              $C$DW$382       .dwtag  DW_TAG_member
    4200                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$31)
    4201                      .dwattr $C$DW$382, DW_AT_name("audioClassIntDescr")
    4202                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_audioClassIntDescr")
    4203                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x141]
    4204                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4205              $C$DW$383       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   93

    4206                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$36)
    4207                      .dwattr $C$DW$383, DW_AT_name("audioClassIsoOutEndptDescr")
    4208                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_audioClassIsoOutEndptDescr")
    4209                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x14d]
    4210                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4211              $C$DW$384       .dwtag  DW_TAG_member
    4212                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$37)
    4213                      .dwattr $C$DW$384, DW_AT_name("audioClassInterfcLnk")
    4214                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_audioClassInterfcLnk")
    4215                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x152]
    4216                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4217              $C$DW$385       .dwtag  DW_TAG_member
    4218                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$36)
    4219                      .dwattr $C$DW$385, DW_AT_name("audioClassIsoInEndptDescr")
    4220                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_audioClassIsoInEndptDescr")
    4221                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
    4222                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4223              $C$DW$386       .dwtag  DW_TAG_member
    4224                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$37)
    4225                      .dwattr $C$DW$386, DW_AT_name("audioClassIsoOutEndptLnk")
    4226                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_audioClassIsoOutEndptLnk")
    4227                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x15e]
    4228                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4229              $C$DW$387       .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$31)
    4231                      .dwattr $C$DW$387, DW_AT_name("stringDescrLangid")
    4232                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_stringDescrLangid")
    4233                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    4234                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4235              $C$DW$388       .dwtag  DW_TAG_member
    4236                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$25)
    4237                      .dwattr $C$DW$388, DW_AT_name("curConfigStat")
    4238                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_curConfigStat")
    4239                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
    4240                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4241              $C$DW$389       .dwtag  DW_TAG_member
    4242                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$37)
    4243                      .dwattr $C$DW$389, DW_AT_name("audioClassIsoInEndptLnk")
    4244                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_audioClassIsoInEndptLnk")
    4245                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x172]
    4246                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4247              $C$DW$390       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$36)
    4249                      .dwattr $C$DW$390, DW_AT_name("ctrlBuffer")
    4250                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_ctrlBuffer")
    4251                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
    4252                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4253              $C$DW$391       .dwtag  DW_TAG_member
    4254                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$37)
    4255                      .dwattr $C$DW$391, DW_AT_name("configDescrLnk")
    4256                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_configDescrLnk")
    4257                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x17e]
    4258                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4259              $C$DW$392       .dwtag  DW_TAG_member
    4260                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$40)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   94

    4261                      .dwattr $C$DW$392, DW_AT_name("strDescr")
    4262                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_strDescr")
    4263                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
    4264                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4265              $C$DW$393       .dwtag  DW_TAG_member
    4266                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$42)
    4267                      .dwattr $C$DW$393, DW_AT_name("acReqTable")
    4268                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_acReqTable")
    4269                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x186]
    4270                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4271              $C$DW$394       .dwtag  DW_TAG_member
    4272                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$47)
    4273                      .dwattr $C$DW$394, DW_AT_name("fpRequestHandler")
    4274                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_fpRequestHandler")
    4275                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
    4276                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4277                      .dwendtag $C$DW$T$48
    4278              
    4279              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcCtrlObject")
    4280                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$48)
    4281                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4282              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    4283                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$19)
    4284                      .dwattr $C$DW$T$96, DW_AT_address_class(0x17)
    4285              
    4286              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4287                      .dwattr $C$DW$T$67, DW_AT_name("CSL_AcInitStructApp")
    4288                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x22)
    4289              $C$DW$395       .dwtag  DW_TAG_member
    4290                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$3)
    4291                      .dwattr $C$DW$395, DW_AT_name("pAcObj")
    4292                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_pAcObj")
    4293                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4294                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4295              $C$DW$396       .dwtag  DW_TAG_member
    4296                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$25)
    4297                      .dwattr $C$DW$396, DW_AT_name("pId")
    4298                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_pId")
    4299                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4300                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4301              $C$DW$397       .dwtag  DW_TAG_member
    4302                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$25)
    4303                      .dwattr $C$DW$397, DW_AT_name("vId")
    4304                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_vId")
    4305                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4306                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4307              $C$DW$398       .dwtag  DW_TAG_member
    4308                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$25)
    4309                      .dwattr $C$DW$398, DW_AT_name("numLun")
    4310                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_numLun")
    4311                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4312                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4313              $C$DW$399       .dwtag  DW_TAG_member
    4314                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$25)
    4315                      .dwattr $C$DW$399, DW_AT_name("txPktSize")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   95

    4316                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_txPktSize")
    4317                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4318                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4319              $C$DW$400       .dwtag  DW_TAG_member
    4320                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$25)
    4321                      .dwattr $C$DW$400, DW_AT_name("rxPktSize")
    4322                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rxPktSize")
    4323                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4324                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4325              $C$DW$401       .dwtag  DW_TAG_member
    4326                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$40)
    4327                      .dwattr $C$DW$401, DW_AT_name("strDescrApp")
    4328                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_strDescrApp")
    4329                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4330                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4331              $C$DW$402       .dwtag  DW_TAG_member
    4332                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$49)
    4333                      .dwattr $C$DW$402, DW_AT_name("lbaBufferApp")
    4334                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_lbaBufferApp")
    4335                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4336                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4337              $C$DW$403       .dwtag  DW_TAG_member
    4338                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$42)
    4339                      .dwattr $C$DW$403, DW_AT_name("acReqTableApp")
    4340                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_acReqTableApp")
    4341                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4342                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4343              $C$DW$404       .dwtag  DW_TAG_member
    4344                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$51)
    4345                      .dwattr $C$DW$404, DW_AT_name("isoHandler")
    4346                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_isoHandler")
    4347                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4348                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4349              $C$DW$405       .dwtag  DW_TAG_member
    4350                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$51)
    4351                      .dwattr $C$DW$405, DW_AT_name("ctrlHandler")
    4352                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_ctrlHandler")
    4353                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4354                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4355              $C$DW$406       .dwtag  DW_TAG_member
    4356                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$55)
    4357                      .dwattr $C$DW$406, DW_AT_name("playAudioApp")
    4358                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_playAudioApp")
    4359                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4360                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4361              $C$DW$407       .dwtag  DW_TAG_member
    4362                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$57)
    4363                      .dwattr $C$DW$407, DW_AT_name("stopAudioApp")
    4364                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_stopAudioApp")
    4365                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4366                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4367              $C$DW$408       .dwtag  DW_TAG_member
    4368                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$55)
    4369                      .dwattr $C$DW$408, DW_AT_name("recordAudioApp")
    4370                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_recordAudioApp")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   96

    4371                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4372                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4373              $C$DW$409       .dwtag  DW_TAG_member
    4374                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$59)
    4375                      .dwattr $C$DW$409, DW_AT_name("mediaGetPresentStateApp")
    4376                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_mediaGetPresentStateApp")
    4377                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4378                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4379              $C$DW$410       .dwtag  DW_TAG_member
    4380                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$59)
    4381                      .dwattr $C$DW$410, DW_AT_name("mediaInitApp")
    4382                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_mediaInitApp")
    4383                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4384                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4385              $C$DW$411       .dwtag  DW_TAG_member
    4386                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$59)
    4387                      .dwattr $C$DW$411, DW_AT_name("mediaEjectApp")
    4388                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_mediaEjectApp")
    4389                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4390                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4391              $C$DW$412       .dwtag  DW_TAG_member
    4392                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$63)
    4393                      .dwattr $C$DW$412, DW_AT_name("mediaLockUnitApp")
    4394                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_mediaLockUnitApp")
    4395                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4396                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4397              $C$DW$413       .dwtag  DW_TAG_member
    4398                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$66)
    4399                      .dwattr $C$DW$413, DW_AT_name("getMediaSizeApp")
    4400                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_getMediaSizeApp")
    4401                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4402                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4403                      .dwendtag $C$DW$T$67
    4404              
    4405              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcInitStructApp")
    4406                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$67)
    4407                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    4408              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    4409                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    4410                      .dwattr $C$DW$T$98, DW_AT_address_class(0x17)
    4411              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("pAcAppClassHandle")
    4412                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    4413                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    4414              
    4415              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    4416                      .dwattr $C$DW$T$69, DW_AT_name("CSL_AcLogicalUnit")
    4417                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x3e)
    4418              $C$DW$414       .dwtag  DW_TAG_member
    4419                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$68)
    4420                      .dwattr $C$DW$414, DW_AT_name("scsiInquiryData")
    4421                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_scsiInquiryData")
    4422                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4423                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4424              $C$DW$415       .dwtag  DW_TAG_member
    4425                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$64)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   97

    4426                      .dwattr $C$DW$415, DW_AT_name("mediaSize")
    4427                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_mediaSize")
    4428                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4429                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4430              $C$DW$416       .dwtag  DW_TAG_member
    4431                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$64)
    4432                      .dwattr $C$DW$416, DW_AT_name("currLba")
    4433                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_currLba")
    4434                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4435                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4436              $C$DW$417       .dwtag  DW_TAG_member
    4437                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$64)
    4438                      .dwattr $C$DW$417, DW_AT_name("lbaSize")
    4439                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_lbaSize")
    4440                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4441                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4442              $C$DW$418       .dwtag  DW_TAG_member
    4443                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$25)
    4444                      .dwattr $C$DW$418, DW_AT_name("removeable")
    4445                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_removeable")
    4446                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4447                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4448              $C$DW$419       .dwtag  DW_TAG_member
    4449                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$25)
    4450                      .dwattr $C$DW$419, DW_AT_name("mediaState")
    4451                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_mediaState")
    4452                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4453                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4454              $C$DW$420       .dwtag  DW_TAG_member
    4455                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$25)
    4456                      .dwattr $C$DW$420, DW_AT_name("readwrite")
    4457                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_readwrite")
    4458                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4459                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4460              $C$DW$421       .dwtag  DW_TAG_member
    4461                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$25)
    4462                      .dwattr $C$DW$421, DW_AT_name("lbaCnt")
    4463                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_lbaCnt")
    4464                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4465                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4466              $C$DW$422       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$25)
    4468                      .dwattr $C$DW$422, DW_AT_name("verifyFlag")
    4469                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_verifyFlag")
    4470                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4471                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4472                      .dwendtag $C$DW$T$69
    4473              
    4474              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcLogicalUnit")
    4475                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    4476                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    4477              
    4478              $C$DW$T$71      .dwtag  DW_TAG_array_type
    4479                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    4480                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   98

    4481                      .dwattr $C$DW$T$71, DW_AT_byte_size(0xf8)
    4482              $C$DW$423       .dwtag  DW_TAG_subrange_type
    4483                      .dwattr $C$DW$423, DW_AT_upper_bound(0x03)
    4484                      .dwendtag $C$DW$T$71
    4485              
    4486              
    4487              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4488                      .dwattr $C$DW$T$75, DW_AT_name("CSL_AcObject")
    4489                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x16c)
    4490              $C$DW$424       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$55)
    4492                      .dwattr $C$DW$424, DW_AT_name("recordAudio")
    4493                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_recordAudio")
    4494                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4495                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4496              $C$DW$425       .dwtag  DW_TAG_member
    4497                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$55)
    4498                      .dwattr $C$DW$425, DW_AT_name("playAudio")
    4499                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_playAudio")
    4500                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4501                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4502              $C$DW$426       .dwtag  DW_TAG_member
    4503                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$57)
    4504                      .dwattr $C$DW$426, DW_AT_name("stopAudio")
    4505                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_stopAudio")
    4506                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4507                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4508              $C$DW$427       .dwtag  DW_TAG_member
    4509                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$59)
    4510                      .dwattr $C$DW$427, DW_AT_name("mediaGetPresentState")
    4511                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_mediaGetPresentState")
    4512                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4513                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4514              $C$DW$428       .dwtag  DW_TAG_member
    4515                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$59)
    4516                      .dwattr $C$DW$428, DW_AT_name("mediaInit")
    4517                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_mediaInit")
    4518                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4519                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4520              $C$DW$429       .dwtag  DW_TAG_member
    4521                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$59)
    4522                      .dwattr $C$DW$429, DW_AT_name("mediaEject")
    4523                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_mediaEject")
    4524                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4525                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4526              $C$DW$430       .dwtag  DW_TAG_member
    4527                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$63)
    4528                      .dwattr $C$DW$430, DW_AT_name("mediaLockUnit")
    4529                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_mediaLockUnit")
    4530                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4531                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4532              $C$DW$431       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$66)
    4534                      .dwattr $C$DW$431, DW_AT_name("getMediaSize")
    4535                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_getMediaSize")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE   99

    4536                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4537                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4538              $C$DW$432       .dwtag  DW_TAG_member
    4539                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$49)
    4540                      .dwattr $C$DW$432, DW_AT_name("lbaBuffer")
    4541                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_lbaBuffer")
    4542                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4543                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4544              $C$DW$433       .dwtag  DW_TAG_member
    4545                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$64)
    4546                      .dwattr $C$DW$433, DW_AT_name("cbwDataTransferLength")
    4547                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_cbwDataTransferLength")
    4548                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4549                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4550              $C$DW$434       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$71)
    4552                      .dwattr $C$DW$434, DW_AT_name("lun")
    4553                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_lun")
    4554                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4555                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4556              $C$DW$435       .dwtag  DW_TAG_member
    4557                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$72)
    4558                      .dwattr $C$DW$435, DW_AT_name("senseData")
    4559                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_senseData")
    4560                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    4561                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4562              $C$DW$436       .dwtag  DW_TAG_member
    4563                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$25)
    4564                      .dwattr $C$DW$436, DW_AT_name("activityPresentFlag")
    4565                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_activityPresentFlag")
    4566                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x11b]
    4567                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4568              $C$DW$437       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$73)
    4570                      .dwattr $C$DW$437, DW_AT_name("csw")
    4571                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_csw")
    4572                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    4573                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4574              $C$DW$438       .dwtag  DW_TAG_member
    4575                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$30)
    4576                      .dwattr $C$DW$438, DW_AT_name("readCapacity")
    4577                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_readCapacity")
    4578                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    4579                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4580              $C$DW$439       .dwtag  DW_TAG_member
    4581                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$74)
    4582                      .dwattr $C$DW$439, DW_AT_name("cbw")
    4583                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_cbw")
    4584                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x12a]
    4585                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4586              $C$DW$440       .dwtag  DW_TAG_member
    4587                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
    4588                      .dwattr $C$DW$440, DW_AT_name("isoInEpObj")
    4589                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_isoInEpObj")
    4590                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  100

    4591                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4592              $C$DW$441       .dwtag  DW_TAG_member
    4593                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    4594                      .dwattr $C$DW$441, DW_AT_name("isoOutEpObj")
    4595                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_isoOutEpObj")
    4596                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
    4597                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4598              $C$DW$442       .dwtag  DW_TAG_member
    4599                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$25)
    4600                      .dwattr $C$DW$442, DW_AT_name("noOfLun")
    4601                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_noOfLun")
    4602                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    4603                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4604              $C$DW$443       .dwtag  DW_TAG_member
    4605                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$25)
    4606                      .dwattr $C$DW$443, DW_AT_name("mediaState")
    4607                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_mediaState")
    4608                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x165]
    4609                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4610              $C$DW$444       .dwtag  DW_TAG_member
    4611                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$25)
    4612                      .dwattr $C$DW$444, DW_AT_name("playBackActive")
    4613                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_playBackActive")
    4614                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x166]
    4615                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4616              $C$DW$445       .dwtag  DW_TAG_member
    4617                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$25)
    4618                      .dwattr $C$DW$445, DW_AT_name("mediaInitDone")
    4619                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_mediaInitDone")
    4620                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x167]
    4621                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4622              $C$DW$446       .dwtag  DW_TAG_member
    4623                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$32)
    4624                      .dwattr $C$DW$446, DW_AT_name("tempBuffer")
    4625                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_tempBuffer")
    4626                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
    4627                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4628                      .dwendtag $C$DW$T$75
    4629              
    4630              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcObject")
    4631                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$75)
    4632                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4633              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    4634                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$20)
    4635                      .dwattr $C$DW$T$100, DW_AT_address_class(0x17)
    4636              
    4637              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    4638                      .dwattr $C$DW$T$77, DW_AT_name("CSL_AcRequestStruct")
    4639                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
    4640              $C$DW$447       .dwtag  DW_TAG_member
    4641                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$76)
    4642                      .dwattr $C$DW$447, DW_AT_name("request")
    4643                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_request")
    4644                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4645                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  101

    4646              $C$DW$448       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$47)
    4648                      .dwattr $C$DW$448, DW_AT_name("fpRequestHandler")
    4649                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_fpRequestHandler")
    4650                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4651                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4652                      .dwendtag $C$DW$T$77
    4653              
    4654              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_AcRequestStruct")
    4655                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$77)
    4656                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4657              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    4658                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4659                      .dwattr $C$DW$T$42, DW_AT_address_class(0x17)
    4660              
    4661              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    4662                      .dwattr $C$DW$T$79, DW_AT_name("CSL_UsbDataStruct")
    4663                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x06)
    4664              $C$DW$449       .dwtag  DW_TAG_member
    4665                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$25)
    4666                      .dwattr $C$DW$449, DW_AT_name("bytes")
    4667                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_bytes")
    4668                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4669                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4670              $C$DW$450       .dwtag  DW_TAG_member
    4671                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$49)
    4672                      .dwattr $C$DW$450, DW_AT_name("pBuffer")
    4673                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_pBuffer")
    4674                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4675                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4676              $C$DW$451       .dwtag  DW_TAG_member
    4677                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$78)
    4678                      .dwattr $C$DW$451, DW_AT_name("pNextBuffer")
    4679                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_pNextBuffer")
    4680                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4681                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4682                      .dwendtag $C$DW$T$79
    4683              
    4684              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDataStruct")
    4685                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$79)
    4686                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4687              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    4688                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$37)
    4689                      .dwattr $C$DW$T$85, DW_AT_address_class(0x17)
    4690              $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    4691                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$79)
    4692                      .dwattr $C$DW$T$78, DW_AT_address_class(0x17)
    4693              
    4694              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    4695                      .dwattr $C$DW$T$86, DW_AT_name("CSL_UsbEpObj")
    4696                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x14)
    4697              $C$DW$452       .dwtag  DW_TAG_member
    4698                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$81)
    4699                      .dwattr $C$DW$452, DW_AT_name("epNum")
    4700                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_epNum")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  102

    4701                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4702                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4703              $C$DW$453       .dwtag  DW_TAG_member
    4704                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$83)
    4705                      .dwattr $C$DW$453, DW_AT_name("xferType")
    4706                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_xferType")
    4707                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4708                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4709              $C$DW$454       .dwtag  DW_TAG_member
    4710                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$25)
    4711                      .dwattr $C$DW$454, DW_AT_name("maxPktSiz")
    4712                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_maxPktSiz")
    4713                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4714                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4715              $C$DW$455       .dwtag  DW_TAG_member
    4716                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$25)
    4717                      .dwattr $C$DW$455, DW_AT_name("eventMask")
    4718                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_eventMask")
    4719                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4720                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4721              $C$DW$456       .dwtag  DW_TAG_member
    4722                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$84)
    4723                      .dwattr $C$DW$456, DW_AT_name("fxn")
    4724                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_fxn")
    4725                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4726                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4727              $C$DW$457       .dwtag  DW_TAG_member
    4728                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$25)
    4729                      .dwattr $C$DW$457, DW_AT_name("dataFlags")
    4730                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_dataFlags")
    4731                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4732                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4733              $C$DW$458       .dwtag  DW_TAG_member
    4734                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$25)
    4735                      .dwattr $C$DW$458, DW_AT_name("status")
    4736                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_status")
    4737                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4738                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4739              $C$DW$459       .dwtag  DW_TAG_member
    4740                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$25)
    4741                      .dwattr $C$DW$459, DW_AT_name("epDescRegSAddr")
    4742                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_epDescRegSAddr")
    4743                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4744                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4745              $C$DW$460       .dwtag  DW_TAG_member
    4746                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$25)
    4747                      .dwattr $C$DW$460, DW_AT_name("dmaRegSAddr")
    4748                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_dmaRegSAddr")
    4749                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4750                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4751              $C$DW$461       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$25)
    4753                      .dwattr $C$DW$461, DW_AT_name("totByteCnt")
    4754                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_totByteCnt")
    4755                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  103

    4756                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4757              $C$DW$462       .dwtag  DW_TAG_member
    4758                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$25)
    4759                      .dwattr $C$DW$462, DW_AT_name("byteInThisSeg")
    4760                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_byteInThisSeg")
    4761                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4762                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4763              $C$DW$463       .dwtag  DW_TAG_member
    4764                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$49)
    4765                      .dwattr $C$DW$463, DW_AT_name("xferBytCnt")
    4766                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_xferBytCnt")
    4767                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4768                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4769              $C$DW$464       .dwtag  DW_TAG_member
    4770                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$49)
    4771                      .dwattr $C$DW$464, DW_AT_name("pBuffer")
    4772                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_pBuffer")
    4773                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4774                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4775              $C$DW$465       .dwtag  DW_TAG_member
    4776                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$85)
    4777                      .dwattr $C$DW$465, DW_AT_name("pNextBuffer")
    4778                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_pNextBuffer")
    4779                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4780                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4781              $C$DW$466       .dwtag  DW_TAG_member
    4782                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$25)
    4783                      .dwattr $C$DW$466, DW_AT_name("eventFlag")
    4784                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_eventFlag")
    4785                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4786                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4787                      .dwendtag $C$DW$T$86
    4788              
    4789              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpObj")
    4790                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$86)
    4791                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4792              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    4793                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
    4794                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
    4795              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("pUsbEpHandle")
    4796                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    4797                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4798              
    4799              $C$DW$T$28      .dwtag  DW_TAG_array_type
    4800                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4801                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4802                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    4803              $C$DW$467       .dwtag  DW_TAG_subrange_type
    4804                      .dwattr $C$DW$467, DW_AT_upper_bound(0x04)
    4805                      .dwendtag $C$DW$T$28
    4806              
    4807              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    4808                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$27)
    4809                      .dwattr $C$DW$T$101, DW_AT_address_class(0x17)
    4810              
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  104

    4811              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    4812                      .dwattr $C$DW$T$87, DW_AT_name("CSL_UsbSetupStruct")
    4813                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x06)
    4814              $C$DW$468       .dwtag  DW_TAG_member
    4815                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$10)
    4816                      .dwattr $C$DW$468, DW_AT_name("newPacket")
    4817                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_newPacket")
    4818                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4819                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4820              $C$DW$469       .dwtag  DW_TAG_member
    4821                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$25)
    4822                      .dwattr $C$DW$469, DW_AT_name("bmRequestType")
    4823                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_bmRequestType")
    4824                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4825                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4826              $C$DW$470       .dwtag  DW_TAG_member
    4827                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$25)
    4828                      .dwattr $C$DW$470, DW_AT_name("bRequest")
    4829                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_bRequest")
    4830                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4831                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4832              $C$DW$471       .dwtag  DW_TAG_member
    4833                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$25)
    4834                      .dwattr $C$DW$471, DW_AT_name("wValue")
    4835                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_wValue")
    4836                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4837                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4838              $C$DW$472       .dwtag  DW_TAG_member
    4839                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$25)
    4840                      .dwattr $C$DW$472, DW_AT_name("wIndex")
    4841                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_wIndex")
    4842                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4843                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4844              $C$DW$473       .dwtag  DW_TAG_member
    4845                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$25)
    4846                      .dwattr $C$DW$473, DW_AT_name("wLength")
    4847                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_wLength")
    4848                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4849                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4850                      .dwendtag $C$DW$T$87
    4851              
    4852              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbSetupStruct")
    4853                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$87)
    4854                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4855              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4856                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$29)
    4857                      .dwattr $C$DW$T$45, DW_AT_address_class(0x17)
    4858              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4859                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    4860              
    4861              $C$DW$T$50      .dwtag  DW_TAG_subroutine_type
    4862                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4863              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    4864                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    4865                      .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:33 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_audioClass.asm                                                   PAGE  105

    4866              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_EVENT_ISR")
    4867                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$51)
    4868                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    4869              $C$DW$474       .dwtag  DW_TAG_TI_far_type
    4870              $C$DW$T$103     .dwtag  DW_TAG_const_type
    4871                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$474)
    4872              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    4873                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    4874                      .dwattr $C$DW$T$104, DW_AT_address_class(0x17)
    4875              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4876                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4877                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4878                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4879              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4880                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4881                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4882                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4883              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4884                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4885                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4886                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4887              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4888                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4889                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4890                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4891              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4892                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4893                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4894                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4895              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    4896                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$8)
    4897                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4898              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    4899                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    4900                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
