TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE    1

    3359              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 07 02:27:46 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2227                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2228                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2229              
    2230              $C$DW$T$52      .dwtag  DW_TAG_enumeration_type
    2231                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2232              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_DISABLE"), DW_AT_const_value(0x00)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   53

    2233              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SIGNEXT_ENABLE"), DW_AT_const_value(0x01)
    2234                      .dwendtag $C$DW$T$52
    2235              
    2236              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_SignextType")
    2237                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2238                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2239              
    2240              $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
    2241                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    2242              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_SLAVE"), DW_AT_const_value(0x00)
    2243              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_MASTER"), DW_AT_const_value(0x01)
    2244                      .dwendtag $C$DW$T$54
    2245              
    2246              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Mode")
    2247                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2248                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2249              
    2250              $C$DW$T$56      .dwtag  DW_TAG_enumeration_type
    2251                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    2252              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_LJUST"), DW_AT_const_value(0x00)
    2253              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_DATAFORMAT_DSP"), DW_AT_const_value(0x01)
    2254                      .dwendtag $C$DW$T$56
    2255              
    2256              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_DataFormat")
    2257                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2258                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2259              
    2260              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
    2261                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    2262              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV2"), DW_AT_const_value(0x00)
    2263              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV4"), DW_AT_const_value(0x01)
    2264              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV8"), DW_AT_const_value(0x02)
    2265              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV16"), DW_AT_const_value(0x03)
    2266              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV32"), DW_AT_const_value(0x04)
    2267              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV64"), DW_AT_const_value(0x05)
    2268              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV128"), DW_AT_const_value(0x06)
    2269              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_CLKDIV256"), DW_AT_const_value(0x07)
    2270                      .dwendtag $C$DW$T$58
    2271              
    2272              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Clkdiv")
    2273                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2274                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2275              
    2276              $C$DW$T$60      .dwtag  DW_TAG_enumeration_type
    2277                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
    2278              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_DISABLE"), DW_AT_const_value(0x00)
    2279              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_FSERROR_ENABLE"), DW_AT_const_value(0x01)
    2280                      .dwendtag $C$DW$T$60
    2281              
    2282              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_FsErr")
    2283                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    2284                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2285              
    2286              $C$DW$T$62      .dwtag  DW_TAG_enumeration_type
    2287                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   54

    2288              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_DISABLE"), DW_AT_const_value(0x00)
    2289              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("I2S_OUERROR_ENABLE"), DW_AT_const_value(0x01)
    2290                      .dwendtag $C$DW$T$62
    2291              
    2292              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_OuErr")
    2293                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    2294                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2295              
    2296              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2297                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x2e)
    2298              $C$DW$162       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    2300                      .dwattr $C$DW$162, DW_AT_name("I2SSCTRL")
    2301                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_I2SSCTRL")
    2302                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2303                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2304              $C$DW$163       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    2306                      .dwattr $C$DW$163, DW_AT_name("RSVD0")
    2307                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_RSVD0")
    2308                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2309                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2310              $C$DW$164       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    2312                      .dwattr $C$DW$164, DW_AT_name("I2SSRATE")
    2313                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_I2SSRATE")
    2314                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2315                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2316              $C$DW$165       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    2318                      .dwattr $C$DW$165, DW_AT_name("RSVD1")
    2319                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_RSVD1")
    2320                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2321                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2322              $C$DW$166       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    2324                      .dwattr $C$DW$166, DW_AT_name("I2STXLT0")
    2325                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_I2STXLT0")
    2326                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2327                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2328              $C$DW$167       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2330                      .dwattr $C$DW$167, DW_AT_name("I2STXLT1")
    2331                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_I2STXLT1")
    2332                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2333                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2334              $C$DW$168       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    2336                      .dwattr $C$DW$168, DW_AT_name("RSVD2")
    2337                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD2")
    2338                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2339                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2340              $C$DW$169       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$20)
    2342                      .dwattr $C$DW$169, DW_AT_name("I2STXRT0")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   55

    2343                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_I2STXRT0")
    2344                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2345                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2346              $C$DW$170       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$20)
    2348                      .dwattr $C$DW$170, DW_AT_name("I2STXRT1")
    2349                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_I2STXRT1")
    2350                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2351                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2352              $C$DW$171       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    2354                      .dwattr $C$DW$171, DW_AT_name("RSVD3")
    2355                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD3")
    2356                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2357                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2358              $C$DW$172       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2360                      .dwattr $C$DW$172, DW_AT_name("I2SINTFL")
    2361                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_I2SINTFL")
    2362                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2363                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2364              $C$DW$173       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    2366                      .dwattr $C$DW$173, DW_AT_name("RSVD4")
    2367                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RSVD4")
    2368                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2369                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2370              $C$DW$174       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
    2372                      .dwattr $C$DW$174, DW_AT_name("I2SINTMASK")
    2373                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_I2SINTMASK")
    2374                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2375                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2376              $C$DW$175       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    2378                      .dwattr $C$DW$175, DW_AT_name("RSVD5")
    2379                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RSVD5")
    2380                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2381                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2382              $C$DW$176       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    2384                      .dwattr $C$DW$176, DW_AT_name("I2SRXLT0")
    2385                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_I2SRXLT0")
    2386                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2387                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2388              $C$DW$177       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
    2390                      .dwattr $C$DW$177, DW_AT_name("I2SRXLT1")
    2391                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_I2SRXLT1")
    2392                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2393                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2394              $C$DW$178       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
    2396                      .dwattr $C$DW$178, DW_AT_name("RSVD6")
    2397                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RSVD6")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   56

    2398                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2399                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2400              $C$DW$179       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    2402                      .dwattr $C$DW$179, DW_AT_name("I2SRXRT0")
    2403                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_I2SRXRT0")
    2404                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2405                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2406              $C$DW$180       .dwtag  DW_TAG_member
    2407                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    2408                      .dwattr $C$DW$180, DW_AT_name("I2SRXRT1")
    2409                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_I2SRXRT1")
    2410                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2411                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2412                      .dwendtag $C$DW$T$24
    2413              
    2414              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sRegs")
    2415                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$24)
    2416                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2417              $C$DW$181       .dwtag  DW_TAG_TI_far_type
    2418                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$31)
    2419              $C$DW$182       .dwtag  DW_TAG_TI_ioport_type
    2420                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$181)
    2421              $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    2422                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$182)
    2423              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2424                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2425                      .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    2426              
    2427              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2428                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    2429              $C$DW$183       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$26)
    2431                      .dwattr $C$DW$183, DW_AT_name("i2sNum")
    2432                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_i2sNum")
    2433                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2434                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2435              $C$DW$184       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$28)
    2437                      .dwattr $C$DW$184, DW_AT_name("opMode")
    2438                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_opMode")
    2439                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2440                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2441              $C$DW$185       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$30)
    2443                      .dwattr $C$DW$185, DW_AT_name("chType")
    2444                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_chType")
    2445                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2446                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2447              $C$DW$186       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$33)
    2449                      .dwattr $C$DW$186, DW_AT_name("hwRegs")
    2450                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_hwRegs")
    2451                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2452                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   57

    2453              $C$DW$187       .dwtag  DW_TAG_member
    2454                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2455                      .dwattr $C$DW$187, DW_AT_name("configured")
    2456                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_configured")
    2457                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2458                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2459              $C$DW$188       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$35)
    2461                      .dwattr $C$DW$188, DW_AT_name("datapack")
    2462                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_datapack")
    2463                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2464                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2465              $C$DW$189       .dwtag  DW_TAG_member
    2466                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$37)
    2467                      .dwattr $C$DW$189, DW_AT_name("fsDiv")
    2468                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_fsDiv")
    2469                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2470                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2471              $C$DW$190       .dwtag  DW_TAG_member
    2472                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$39)
    2473                      .dwattr $C$DW$190, DW_AT_name("wordLen")
    2474                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_wordLen")
    2475                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2476                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2477              $C$DW$191       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$41)
    2479                      .dwattr $C$DW$191, DW_AT_name("loopBackMode")
    2480                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_loopBackMode")
    2481                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2482                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2483              $C$DW$192       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$42)
    2485                      .dwattr $C$DW$192, DW_AT_name("firstRead")
    2486                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_firstRead")
    2487                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2488                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2489                      .dwendtag $C$DW$T$43
    2490              
    2491              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sObj")
    2492                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$43)
    2493                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2494              $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    2495                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2496                      .dwattr $C$DW$T$69, DW_AT_address_class(0x17)
    2497              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sHandle")
    2498                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2499                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2500              
    2501              $C$DW$T$72      .dwtag  DW_TAG_array_type
    2502                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$68)
    2503                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2504                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x28)
    2505              $C$DW$193       .dwtag  DW_TAG_subrange_type
    2506                      .dwattr $C$DW$193, DW_AT_upper_bound(0x03)
    2507                      .dwendtag $C$DW$T$72
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   58

    2508              
    2509              
    2510              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    2511                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x0e)
    2512              $C$DW$194       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$45)
    2514                      .dwattr $C$DW$194, DW_AT_name("dataType")
    2515                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_dataType")
    2516                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2517                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2518              $C$DW$195       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$41)
    2520                      .dwattr $C$DW$195, DW_AT_name("loopBackMode")
    2521                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_loopBackMode")
    2522                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2523                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2524              $C$DW$196       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$47)
    2526                      .dwattr $C$DW$196, DW_AT_name("fsPol")
    2527                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_fsPol")
    2528                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2529                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2530              $C$DW$197       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$49)
    2532                      .dwattr $C$DW$197, DW_AT_name("clkPol")
    2533                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_clkPol")
    2534                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2535                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2536              $C$DW$198       .dwtag  DW_TAG_member
    2537                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$51)
    2538                      .dwattr $C$DW$198, DW_AT_name("datadelay")
    2539                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_datadelay")
    2540                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2541                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2542              $C$DW$199       .dwtag  DW_TAG_member
    2543                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$35)
    2544                      .dwattr $C$DW$199, DW_AT_name("datapack")
    2545                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_datapack")
    2546                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2547                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2548              $C$DW$200       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$53)
    2550                      .dwattr $C$DW$200, DW_AT_name("signext")
    2551                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_signext")
    2552                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2553                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2554              $C$DW$201       .dwtag  DW_TAG_member
    2555                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$39)
    2556                      .dwattr $C$DW$201, DW_AT_name("wordLen")
    2557                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_wordLen")
    2558                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2559                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2560              $C$DW$202       .dwtag  DW_TAG_member
    2561                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$55)
    2562                      .dwattr $C$DW$202, DW_AT_name("i2sMode")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   59

    2563                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_i2sMode")
    2564                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2565                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2566              $C$DW$203       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$57)
    2568                      .dwattr $C$DW$203, DW_AT_name("dataFormat")
    2569                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_dataFormat")
    2570                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2571                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2572              $C$DW$204       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$37)
    2574                      .dwattr $C$DW$204, DW_AT_name("fsDiv")
    2575                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_fsDiv")
    2576                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2577                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2578              $C$DW$205       .dwtag  DW_TAG_member
    2579                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$59)
    2580                      .dwattr $C$DW$205, DW_AT_name("clkDiv")
    2581                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_clkDiv")
    2582                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2583                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2584              $C$DW$206       .dwtag  DW_TAG_member
    2585                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$61)
    2586                      .dwattr $C$DW$206, DW_AT_name("FError")
    2587                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_FError")
    2588                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2589                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2590              $C$DW$207       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$63)
    2592                      .dwattr $C$DW$207, DW_AT_name("OuError")
    2593                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_OuError")
    2594                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2595                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2596                      .dwendtag $C$DW$T$64
    2597              
    2598              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("I2S_Config")
    2599                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$64)
    2600                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2601              $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    2602                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2603                      .dwattr $C$DW$T$74, DW_AT_address_class(0x17)
    2604              
    2605              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    2606                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x48)
    2607              $C$DW$208       .dwtag  DW_TAG_member
    2608                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$20)
    2609                      .dwattr $C$DW$208, DW_AT_name("EBSR")
    2610                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_EBSR")
    2611                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2612                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2613              $C$DW$209       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    2615                      .dwattr $C$DW$209, DW_AT_name("RSVD0")
    2616                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_RSVD0")
    2617                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   60

    2618                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2619              $C$DW$210       .dwtag  DW_TAG_member
    2620                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    2621                      .dwattr $C$DW$210, DW_AT_name("PCGCR1")
    2622                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_PCGCR1")
    2623                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2624                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2625              $C$DW$211       .dwtag  DW_TAG_member
    2626                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    2627                      .dwattr $C$DW$211, DW_AT_name("PCGCR2")
    2628                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_PCGCR2")
    2629                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2630                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2631              $C$DW$212       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    2633                      .dwattr $C$DW$212, DW_AT_name("PSRCR")
    2634                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PSRCR")
    2635                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2636                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2637              $C$DW$213       .dwtag  DW_TAG_member
    2638                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$20)
    2639                      .dwattr $C$DW$213, DW_AT_name("PRCR")
    2640                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_PRCR")
    2641                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2642                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2643              $C$DW$214       .dwtag  DW_TAG_member
    2644                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$65)
    2645                      .dwattr $C$DW$214, DW_AT_name("RSVD1")
    2646                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_RSVD1")
    2647                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2648                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2649              $C$DW$215       .dwtag  DW_TAG_member
    2650                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$20)
    2651                      .dwattr $C$DW$215, DW_AT_name("TIAFR")
    2652                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_TIAFR")
    2653                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2654                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2655              $C$DW$216       .dwtag  DW_TAG_member
    2656                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$20)
    2657                      .dwattr $C$DW$216, DW_AT_name("RSVD2")
    2658                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_RSVD2")
    2659                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2660                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2661              $C$DW$217       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    2663                      .dwattr $C$DW$217, DW_AT_name("ODSCR")
    2664                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_ODSCR")
    2665                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2666                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2667              $C$DW$218       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$20)
    2669                      .dwattr $C$DW$218, DW_AT_name("PDINHIBR1")
    2670                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PDINHIBR1")
    2671                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2672                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   61

    2673              $C$DW$219       .dwtag  DW_TAG_member
    2674                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$20)
    2675                      .dwattr $C$DW$219, DW_AT_name("PDINHIBR2")
    2676                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_PDINHIBR2")
    2677                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2678                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2679              $C$DW$220       .dwtag  DW_TAG_member
    2680                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$20)
    2681                      .dwattr $C$DW$220, DW_AT_name("PDINHIBR3")
    2682                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_PDINHIBR3")
    2683                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2684                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2685              $C$DW$221       .dwtag  DW_TAG_member
    2686                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
    2687                      .dwattr $C$DW$221, DW_AT_name("DMA0CESR1")
    2688                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_DMA0CESR1")
    2689                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2690                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2691              $C$DW$222       .dwtag  DW_TAG_member
    2692                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    2693                      .dwattr $C$DW$222, DW_AT_name("DMA0CESR2")
    2694                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_DMA0CESR2")
    2695                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2696                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2697              $C$DW$223       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    2699                      .dwattr $C$DW$223, DW_AT_name("DMA1CESR1")
    2700                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_DMA1CESR1")
    2701                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2702                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2703              $C$DW$224       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$20)
    2705                      .dwattr $C$DW$224, DW_AT_name("DMA1CESR2")
    2706                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_DMA1CESR2")
    2707                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2708                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2709              $C$DW$225       .dwtag  DW_TAG_member
    2710                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$20)
    2711                      .dwattr $C$DW$225, DW_AT_name("SDRAMCCR")
    2712                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_SDRAMCCR")
    2713                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2714                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2715              $C$DW$226       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$20)
    2717                      .dwattr $C$DW$226, DW_AT_name("CCR2")
    2718                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_CCR2")
    2719                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2720                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2721              $C$DW$227       .dwtag  DW_TAG_member
    2722                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$20)
    2723                      .dwattr $C$DW$227, DW_AT_name("CGCR1")
    2724                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_CGCR1")
    2725                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2726                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2727              $C$DW$228       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   62

    2728                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$20)
    2729                      .dwattr $C$DW$228, DW_AT_name("CGICR")
    2730                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_CGICR")
    2731                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2732                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2733              $C$DW$229       .dwtag  DW_TAG_member
    2734                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$20)
    2735                      .dwattr $C$DW$229, DW_AT_name("CGCR2")
    2736                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_CGCR2")
    2737                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2738                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2739              $C$DW$230       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$20)
    2741                      .dwattr $C$DW$230, DW_AT_name("CGOCR")
    2742                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_CGOCR")
    2743                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2744                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2745              $C$DW$231       .dwtag  DW_TAG_member
    2746                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    2747                      .dwattr $C$DW$231, DW_AT_name("CCSSR")
    2748                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_CCSSR")
    2749                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2750                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2751              $C$DW$232       .dwtag  DW_TAG_member
    2752                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    2753                      .dwattr $C$DW$232, DW_AT_name("RSVD3")
    2754                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_RSVD3")
    2755                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2756                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2757              $C$DW$233       .dwtag  DW_TAG_member
    2758                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$20)
    2759                      .dwattr $C$DW$233, DW_AT_name("ECDR")
    2760                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_ECDR")
    2761                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2762                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2763              $C$DW$234       .dwtag  DW_TAG_member
    2764                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$20)
    2765                      .dwattr $C$DW$234, DW_AT_name("RSVD4")
    2766                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_RSVD4")
    2767                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2768                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2769              $C$DW$235       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$20)
    2771                      .dwattr $C$DW$235, DW_AT_name("RAMSLPMDCNTLR1")
    2772                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2773                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2774                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2775              $C$DW$236       .dwtag  DW_TAG_member
    2776                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    2777                      .dwattr $C$DW$236, DW_AT_name("RSVD5")
    2778                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_RSVD5")
    2779                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2780                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2781              $C$DW$237       .dwtag  DW_TAG_member
    2782                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   63

    2783                      .dwattr $C$DW$237, DW_AT_name("RAMSLPMDCNTLR2")
    2784                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2785                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2786                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2787              $C$DW$238       .dwtag  DW_TAG_member
    2788                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    2789                      .dwattr $C$DW$238, DW_AT_name("RAMSLPMDCNTLR3")
    2790                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2791                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2792                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2793              $C$DW$239       .dwtag  DW_TAG_member
    2794                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    2795                      .dwattr $C$DW$239, DW_AT_name("RAMSLPMDCNTLR4")
    2796                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2797                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2798                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2799              $C$DW$240       .dwtag  DW_TAG_member
    2800                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    2801                      .dwattr $C$DW$240, DW_AT_name("RAMSLPMDCNTLR5")
    2802                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2803                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2804                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2805              $C$DW$241       .dwtag  DW_TAG_member
    2806                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$22)
    2807                      .dwattr $C$DW$241, DW_AT_name("RSVD6")
    2808                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_RSVD6")
    2809                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2810                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2811              $C$DW$242       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2813                      .dwattr $C$DW$242, DW_AT_name("DMAIFR")
    2814                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_DMAIFR")
    2815                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2816                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2817              $C$DW$243       .dwtag  DW_TAG_member
    2818                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$20)
    2819                      .dwattr $C$DW$243, DW_AT_name("DMAIER")
    2820                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_DMAIER")
    2821                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2822                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2823              $C$DW$244       .dwtag  DW_TAG_member
    2824                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2825                      .dwattr $C$DW$244, DW_AT_name("USBSCR")
    2826                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_USBSCR")
    2827                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2828                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2829              $C$DW$245       .dwtag  DW_TAG_member
    2830                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
    2831                      .dwattr $C$DW$245, DW_AT_name("ESCR")
    2832                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_ESCR")
    2833                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2834                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2835              $C$DW$246       .dwtag  DW_TAG_member
    2836                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$22)
    2837                      .dwattr $C$DW$246, DW_AT_name("RSVD7")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   64

    2838                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_RSVD7")
    2839                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2840                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2841              $C$DW$247       .dwtag  DW_TAG_member
    2842                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2843                      .dwattr $C$DW$247, DW_AT_name("DMA2CESR1")
    2844                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_DMA2CESR1")
    2845                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2846                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2847              $C$DW$248       .dwtag  DW_TAG_member
    2848                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2849                      .dwattr $C$DW$248, DW_AT_name("DMA2CESR2")
    2850                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_DMA2CESR2")
    2851                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2852                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2853              $C$DW$249       .dwtag  DW_TAG_member
    2854                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2855                      .dwattr $C$DW$249, DW_AT_name("DMA3CESR1")
    2856                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_DMA3CESR1")
    2857                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2858                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2859              $C$DW$250       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    2861                      .dwattr $C$DW$250, DW_AT_name("DMA3CESR2")
    2862                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_DMA3CESR2")
    2863                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2864                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2865              $C$DW$251       .dwtag  DW_TAG_member
    2866                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    2867                      .dwattr $C$DW$251, DW_AT_name("CLKSTOP")
    2868                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_CLKSTOP")
    2869                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2870                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2871              $C$DW$252       .dwtag  DW_TAG_member
    2872                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$66)
    2873                      .dwattr $C$DW$252, DW_AT_name("RSVD8")
    2874                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_RSVD8")
    2875                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2876                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2877              $C$DW$253       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    2879                      .dwattr $C$DW$253, DW_AT_name("DIEIDR0")
    2880                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_DIEIDR0")
    2881                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2882                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2883              $C$DW$254       .dwtag  DW_TAG_member
    2884                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2885                      .dwattr $C$DW$254, DW_AT_name("DIEIDR1")
    2886                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_DIEIDR1")
    2887                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2888                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2889              $C$DW$255       .dwtag  DW_TAG_member
    2890                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2891                      .dwattr $C$DW$255, DW_AT_name("DIEIDR2")
    2892                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_DIEIDR2")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   65

    2893                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2894                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2895              $C$DW$256       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2897                      .dwattr $C$DW$256, DW_AT_name("DIEIDR3")
    2898                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_DIEIDR3")
    2899                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2900                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2901              $C$DW$257       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2903                      .dwattr $C$DW$257, DW_AT_name("DIEIDR4")
    2904                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_DIEIDR4")
    2905                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2906                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2907              $C$DW$258       .dwtag  DW_TAG_member
    2908                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    2909                      .dwattr $C$DW$258, DW_AT_name("DIEIDR5")
    2910                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_DIEIDR5")
    2911                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2912                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2913              $C$DW$259       .dwtag  DW_TAG_member
    2914                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2915                      .dwattr $C$DW$259, DW_AT_name("DIEIDR6")
    2916                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_DIEIDR6")
    2917                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2918                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2919              $C$DW$260       .dwtag  DW_TAG_member
    2920                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    2921                      .dwattr $C$DW$260, DW_AT_name("DIEIDR7")
    2922                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_DIEIDR7")
    2923                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2924                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2925                      .dwendtag $C$DW$T$67
    2926              
    2927              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    2928                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$67)
    2929                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2930              $C$DW$261       .dwtag  DW_TAG_TI_far_type
    2931                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$75)
    2932              $C$DW$262       .dwtag  DW_TAG_TI_ioport_type
    2933                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$261)
    2934              $C$DW$T$76      .dwtag  DW_TAG_volatile_type
    2935                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$262)
    2936              $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    2937                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    2938                      .dwattr $C$DW$T$77, DW_AT_address_class(0x10)
    2939              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2940                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2941                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2942                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2943              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2944                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2945                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2946                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2947              $C$DW$T$6       .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:48 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_i2s.asm                                                          PAGE   66

    2948                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2949                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2950                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2951              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2952                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2953                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2954                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2955              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2956                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2957                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2958                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2959              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2960                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$8)
    2961                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2962              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2963                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    2964                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2965              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2966                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2967                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2968                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2969              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    2970                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2971                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2972              $C$DW$263       .dwtag  DW_TAG_TI_far_type
    2973                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2974              $C$DW$T$20      .dwtag  DW_TAG_volatile_type
    2975                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$263)
