TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE    1

    5403              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 07 02:28:26 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4214 0010ca ED00          MOV dbl(*SP(#0)), XAR3
         0010cc BF   
    4215 0010cd ED04          MOV dbl(*SP(#2)), XAR2
         0010cf AF   
    4216 0010d0 140C          AADD #12, AR3 ; |1609| 
         0010d2 B4   
    4217 0010d3 8041          MOV dbl(*AR2), dbl(*AR3) ; |1609| 
         0010d5 80   
    4218                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_uart.c",line 1610,column 2,is_stmt
    4219 0010d6 ED04          MOV dbl(*SP(#2)), XAR3
         0010d8 BF   
    4220 0010d9 ED75          MOV dbl(*AR3(short(#2))), AC0 ; |1610| 
         0010db 08   
    4221 0010dc ED00          MOV dbl(*SP(#0)), XAR3
         0010de BF   
    4222 0010df EB6D          MOV AC0, dbl(*AR3(#10)) ; |1610| 
         0010e1 0800 
         0010e3 0A   
    4223                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_uart.c",line 1611,column 2,is_stmt
    4224 0010e4 ED04          MOV dbl(*SP(#2)), XAR3
         0010e6 BF   
    4225 0010e7 ED79          MOV dbl(*AR3(short(#4))), AC0 ; |1611| 
         0010e9 08   
    4226 0010ea ED00          MOV dbl(*SP(#0)), XAR3
         0010ec BF   
    4227 0010ed EB6D          MOV AC0, dbl(*AR3(#8)) ; |1611| 
         0010ef 0800 
         0010f1 08   
    4228                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_uart.c",line 1612,column 2,is_stmt
    4229 0010f2 ED04          MOV dbl(*SP(#2)), XAR3
         0010f4 BF   
    4230 0010f5 ED7D          MOV dbl(*AR3(short(#6))), AC0 ; |1612| 
         0010f7 08   
    4231 0010f8 ED00          MOV dbl(*SP(#0)), XAR3
         0010fa BF   
    4232 0010fb EB6D          MOV AC0, dbl(*AR3(#18)) ; |1612| 
         0010fd 0800 
         0010ff 12   
    4233                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_uart.c",line 1613,column 2,is_stmt
    4234 001100 A408          MOV *SP(#4), T0 ; |1613| 
    4235 001102       $C$L152:    
    4236                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_uart.c",line 1614,column 1,is_stmt
    4237 001102 4E05          AADD #5, SP
    4238                      .dwcfi  cfa_offset, 1
    4239              $C$DW$239       .dwtag  DW_TAG_TI_branch
    4240                      .dwattr $C$DW$239, DW_AT_low_pc(0x00)
    4241                      .dwattr $C$DW$239, DW_AT_TI_return
    4242 001104 4804          RET
    4243                                                      ; return occurs
    4244                      .dwattr $C$DW$233, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_uart.c")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE   97

    4245                      .dwattr $C$DW$233, DW_AT_TI_end_line(0x64e)
    4246                      .dwattr $C$DW$233, DW_AT_TI_end_column(0x01)
    4247                      .dwendentry
    4248                      .dwendtag $C$DW$233
    4249              
    4250              ;******************************************************************************
    4251              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    4252              ;******************************************************************************
    4253                      .global __divul
    4254                      .global __remul
    4255              
    4256              ;*******************************************************************************
    4257              ;* TYPE INFORMATION                                                            *
    4258              ;*******************************************************************************
    4259              
    4260              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
    4261                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    4262              $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("UART_POLLED"), DW_AT_const_value(0x00)
    4263              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("UART_INTERRUPT"), DW_AT_const_value(0x01)
    4264              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("UART_OPMODE_OTHER"), DW_AT_const_value(0x02)
    4265                      .dwendtag $C$DW$T$41
    4266              
    4267              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartOpmode")
    4268                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4269                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4270              
    4271              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    4272                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    4273              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_FIFO_MODE"), DW_AT_const_value(0x00)
    4274              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_NON_FIFO_MODE"), DW_AT_const_value(0x01)
    4275              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_MODE_UNDEFINED"), DW_AT_const_value(0x02)
    4276                      .dwendtag $C$DW$T$45
    4277              
    4278              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartXferMode")
    4279                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    4280                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4281              
    4282              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4283                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x19)
    4284              $C$DW$246       .dwtag  DW_TAG_member
    4285                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    4286                      .dwattr $C$DW$246, DW_AT_name("THR")
    4287                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_THR")
    4288                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4289                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4290              $C$DW$247       .dwtag  DW_TAG_member
    4291                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    4292                      .dwattr $C$DW$247, DW_AT_name("RSVD0")
    4293                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_RSVD0")
    4294                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4295                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4296              $C$DW$248       .dwtag  DW_TAG_member
    4297                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    4298                      .dwattr $C$DW$248, DW_AT_name("IER")
    4299                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_IER")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE   98

    4300                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4301                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4302              $C$DW$249       .dwtag  DW_TAG_member
    4303                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    4304                      .dwattr $C$DW$249, DW_AT_name("RSVD1")
    4305                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_RSVD1")
    4306                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4307                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4308              $C$DW$250       .dwtag  DW_TAG_member
    4309                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    4310                      .dwattr $C$DW$250, DW_AT_name("FCR")
    4311                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_FCR")
    4312                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4313                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4314              $C$DW$251       .dwtag  DW_TAG_member
    4315                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$20)
    4316                      .dwattr $C$DW$251, DW_AT_name("RSVD2")
    4317                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_RSVD2")
    4318                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4319                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4320              $C$DW$252       .dwtag  DW_TAG_member
    4321                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    4322                      .dwattr $C$DW$252, DW_AT_name("LCR")
    4323                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_LCR")
    4324                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4325                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    4326              $C$DW$253       .dwtag  DW_TAG_member
    4327                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    4328                      .dwattr $C$DW$253, DW_AT_name("RSVD3")
    4329                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_RSVD3")
    4330                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4331                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    4332              $C$DW$254       .dwtag  DW_TAG_member
    4333                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    4334                      .dwattr $C$DW$254, DW_AT_name("MCR")
    4335                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_MCR")
    4336                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4337                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4338              $C$DW$255       .dwtag  DW_TAG_member
    4339                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    4340                      .dwattr $C$DW$255, DW_AT_name("RSVD4")
    4341                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_RSVD4")
    4342                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4343                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4344              $C$DW$256       .dwtag  DW_TAG_member
    4345                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    4346                      .dwattr $C$DW$256, DW_AT_name("LSR")
    4347                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_LSR")
    4348                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4349                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    4350              $C$DW$257       .dwtag  DW_TAG_member
    4351                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$21)
    4352                      .dwattr $C$DW$257, DW_AT_name("RSVD5")
    4353                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_RSVD5")
    4354                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE   99

    4355                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    4356              $C$DW$258       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    4358                      .dwattr $C$DW$258, DW_AT_name("SCR")
    4359                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_SCR")
    4360                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4361                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    4362              $C$DW$259       .dwtag  DW_TAG_member
    4363                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    4364                      .dwattr $C$DW$259, DW_AT_name("RSVD6")
    4365                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_RSVD6")
    4366                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4367                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    4368              $C$DW$260       .dwtag  DW_TAG_member
    4369                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    4370                      .dwattr $C$DW$260, DW_AT_name("DLL")
    4371                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_DLL")
    4372                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4373                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4374              $C$DW$261       .dwtag  DW_TAG_member
    4375                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    4376                      .dwattr $C$DW$261, DW_AT_name("RSVD7")
    4377                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_RSVD7")
    4378                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4379                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4380              $C$DW$262       .dwtag  DW_TAG_member
    4381                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    4382                      .dwattr $C$DW$262, DW_AT_name("DLH")
    4383                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_DLH")
    4384                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4385                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$263       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$22)
    4388                      .dwattr $C$DW$263, DW_AT_name("RSVD8")
    4389                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_RSVD8")
    4390                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    4391                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4392              $C$DW$264       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    4394                      .dwattr $C$DW$264, DW_AT_name("PWREMU_MGMT")
    4395                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_PWREMU_MGMT")
    4396                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4397                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4398                      .dwendtag $C$DW$T$23
    4399              
    4400              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegs")
    4401                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$23)
    4402                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4403              $C$DW$265       .dwtag  DW_TAG_TI_far_type
    4404                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$33)
    4405              $C$DW$266       .dwtag  DW_TAG_TI_ioport_type
    4406                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$265)
    4407              $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    4408                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$266)
    4409              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  100

    4410                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4411                      .dwattr $C$DW$T$35, DW_AT_address_class(0x10)
    4412              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartRegsOvly")
    4413                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4414                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4415              
    4416              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4417                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
    4418              $C$DW$267       .dwtag  DW_TAG_member
    4419                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    4420                      .dwattr $C$DW$267, DW_AT_name("EBSR")
    4421                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_EBSR")
    4422                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4423                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4424              $C$DW$268       .dwtag  DW_TAG_member
    4425                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    4426                      .dwattr $C$DW$268, DW_AT_name("RSVD0")
    4427                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_RSVD0")
    4428                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4429                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4430              $C$DW$269       .dwtag  DW_TAG_member
    4431                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    4432                      .dwattr $C$DW$269, DW_AT_name("PCGCR1")
    4433                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_PCGCR1")
    4434                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4435                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4436              $C$DW$270       .dwtag  DW_TAG_member
    4437                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$20)
    4438                      .dwattr $C$DW$270, DW_AT_name("PCGCR2")
    4439                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_PCGCR2")
    4440                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4441                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4442              $C$DW$271       .dwtag  DW_TAG_member
    4443                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    4444                      .dwattr $C$DW$271, DW_AT_name("PSRCR")
    4445                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_PSRCR")
    4446                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4447                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4448              $C$DW$272       .dwtag  DW_TAG_member
    4449                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    4450                      .dwattr $C$DW$272, DW_AT_name("PRCR")
    4451                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_PRCR")
    4452                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4453                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4454              $C$DW$273       .dwtag  DW_TAG_member
    4455                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$24)
    4456                      .dwattr $C$DW$273, DW_AT_name("RSVD1")
    4457                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_RSVD1")
    4458                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4459                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4460              $C$DW$274       .dwtag  DW_TAG_member
    4461                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    4462                      .dwattr $C$DW$274, DW_AT_name("TIAFR")
    4463                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_TIAFR")
    4464                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  101

    4465                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4466              $C$DW$275       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    4468                      .dwattr $C$DW$275, DW_AT_name("RSVD2")
    4469                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_RSVD2")
    4470                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4471                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4472              $C$DW$276       .dwtag  DW_TAG_member
    4473                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    4474                      .dwattr $C$DW$276, DW_AT_name("ODSCR")
    4475                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_ODSCR")
    4476                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4477                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4478              $C$DW$277       .dwtag  DW_TAG_member
    4479                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    4480                      .dwattr $C$DW$277, DW_AT_name("PDINHIBR1")
    4481                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_PDINHIBR1")
    4482                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4483                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4484              $C$DW$278       .dwtag  DW_TAG_member
    4485                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    4486                      .dwattr $C$DW$278, DW_AT_name("PDINHIBR2")
    4487                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_PDINHIBR2")
    4488                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4489                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4490              $C$DW$279       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    4492                      .dwattr $C$DW$279, DW_AT_name("PDINHIBR3")
    4493                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_PDINHIBR3")
    4494                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4495                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4496              $C$DW$280       .dwtag  DW_TAG_member
    4497                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    4498                      .dwattr $C$DW$280, DW_AT_name("DMA0CESR1")
    4499                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_DMA0CESR1")
    4500                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4501                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4502              $C$DW$281       .dwtag  DW_TAG_member
    4503                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    4504                      .dwattr $C$DW$281, DW_AT_name("DMA0CESR2")
    4505                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_DMA0CESR2")
    4506                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4507                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4508              $C$DW$282       .dwtag  DW_TAG_member
    4509                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    4510                      .dwattr $C$DW$282, DW_AT_name("DMA1CESR1")
    4511                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_DMA1CESR1")
    4512                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4513                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4514              $C$DW$283       .dwtag  DW_TAG_member
    4515                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    4516                      .dwattr $C$DW$283, DW_AT_name("DMA1CESR2")
    4517                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_DMA1CESR2")
    4518                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4519                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  102

    4520              $C$DW$284       .dwtag  DW_TAG_member
    4521                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    4522                      .dwattr $C$DW$284, DW_AT_name("SDRAMCCR")
    4523                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_SDRAMCCR")
    4524                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4525                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4526              $C$DW$285       .dwtag  DW_TAG_member
    4527                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    4528                      .dwattr $C$DW$285, DW_AT_name("CCR2")
    4529                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_CCR2")
    4530                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4531                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4532              $C$DW$286       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    4534                      .dwattr $C$DW$286, DW_AT_name("CGCR1")
    4535                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_CGCR1")
    4536                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4537                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4538              $C$DW$287       .dwtag  DW_TAG_member
    4539                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    4540                      .dwattr $C$DW$287, DW_AT_name("CGICR")
    4541                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_CGICR")
    4542                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4543                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4544              $C$DW$288       .dwtag  DW_TAG_member
    4545                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    4546                      .dwattr $C$DW$288, DW_AT_name("CGCR2")
    4547                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_CGCR2")
    4548                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4549                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4550              $C$DW$289       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    4552                      .dwattr $C$DW$289, DW_AT_name("CGOCR")
    4553                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_CGOCR")
    4554                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    4555                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4556              $C$DW$290       .dwtag  DW_TAG_member
    4557                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    4558                      .dwattr $C$DW$290, DW_AT_name("CCSSR")
    4559                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_CCSSR")
    4560                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4561                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4562              $C$DW$291       .dwtag  DW_TAG_member
    4563                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$20)
    4564                      .dwattr $C$DW$291, DW_AT_name("RSVD3")
    4565                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_RSVD3")
    4566                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4567                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4568              $C$DW$292       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$20)
    4570                      .dwattr $C$DW$292, DW_AT_name("ECDR")
    4571                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_ECDR")
    4572                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4573                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4574              $C$DW$293       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  103

    4575                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$20)
    4576                      .dwattr $C$DW$293, DW_AT_name("RSVD4")
    4577                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_RSVD4")
    4578                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    4579                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4580              $C$DW$294       .dwtag  DW_TAG_member
    4581                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    4582                      .dwattr $C$DW$294, DW_AT_name("RAMSLPMDCNTLR1")
    4583                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    4584                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4585                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4586              $C$DW$295       .dwtag  DW_TAG_member
    4587                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$20)
    4588                      .dwattr $C$DW$295, DW_AT_name("RSVD5")
    4589                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_RSVD5")
    4590                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    4591                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4592              $C$DW$296       .dwtag  DW_TAG_member
    4593                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$20)
    4594                      .dwattr $C$DW$296, DW_AT_name("RAMSLPMDCNTLR2")
    4595                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    4596                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4597                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4598              $C$DW$297       .dwtag  DW_TAG_member
    4599                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
    4600                      .dwattr $C$DW$297, DW_AT_name("RAMSLPMDCNTLR3")
    4601                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    4602                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4603                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4604              $C$DW$298       .dwtag  DW_TAG_member
    4605                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$20)
    4606                      .dwattr $C$DW$298, DW_AT_name("RAMSLPMDCNTLR4")
    4607                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    4608                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4609                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4610              $C$DW$299       .dwtag  DW_TAG_member
    4611                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$20)
    4612                      .dwattr $C$DW$299, DW_AT_name("RAMSLPMDCNTLR5")
    4613                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    4614                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4615                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4616              $C$DW$300       .dwtag  DW_TAG_member
    4617                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$25)
    4618                      .dwattr $C$DW$300, DW_AT_name("RSVD6")
    4619                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_RSVD6")
    4620                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4621                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4622              $C$DW$301       .dwtag  DW_TAG_member
    4623                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$20)
    4624                      .dwattr $C$DW$301, DW_AT_name("DMAIFR")
    4625                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_DMAIFR")
    4626                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4627                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4628              $C$DW$302       .dwtag  DW_TAG_member
    4629                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  104

    4630                      .dwattr $C$DW$302, DW_AT_name("DMAIER")
    4631                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_DMAIER")
    4632                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4633                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4634              $C$DW$303       .dwtag  DW_TAG_member
    4635                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$20)
    4636                      .dwattr $C$DW$303, DW_AT_name("USBSCR")
    4637                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_USBSCR")
    4638                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4639                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4640              $C$DW$304       .dwtag  DW_TAG_member
    4641                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$20)
    4642                      .dwattr $C$DW$304, DW_AT_name("ESCR")
    4643                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_ESCR")
    4644                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    4645                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4646              $C$DW$305       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$25)
    4648                      .dwattr $C$DW$305, DW_AT_name("RSVD7")
    4649                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD7")
    4650                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4651                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4652              $C$DW$306       .dwtag  DW_TAG_member
    4653                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    4654                      .dwattr $C$DW$306, DW_AT_name("DMA2CESR1")
    4655                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_DMA2CESR1")
    4656                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4657                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4658              $C$DW$307       .dwtag  DW_TAG_member
    4659                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
    4660                      .dwattr $C$DW$307, DW_AT_name("DMA2CESR2")
    4661                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_DMA2CESR2")
    4662                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    4663                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4664              $C$DW$308       .dwtag  DW_TAG_member
    4665                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$20)
    4666                      .dwattr $C$DW$308, DW_AT_name("DMA3CESR1")
    4667                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_DMA3CESR1")
    4668                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4669                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4670              $C$DW$309       .dwtag  DW_TAG_member
    4671                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
    4672                      .dwattr $C$DW$309, DW_AT_name("DMA3CESR2")
    4673                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_DMA3CESR2")
    4674                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    4675                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4676              $C$DW$310       .dwtag  DW_TAG_member
    4677                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$20)
    4678                      .dwattr $C$DW$310, DW_AT_name("CLKSTOP")
    4679                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_CLKSTOP")
    4680                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4681                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4682              $C$DW$311       .dwtag  DW_TAG_member
    4683                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$22)
    4684                      .dwattr $C$DW$311, DW_AT_name("RSVD8")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  105

    4685                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_RSVD8")
    4686                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    4687                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4688              $C$DW$312       .dwtag  DW_TAG_member
    4689                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$20)
    4690                      .dwattr $C$DW$312, DW_AT_name("DIEIDR0")
    4691                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_DIEIDR0")
    4692                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4693                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4694              $C$DW$313       .dwtag  DW_TAG_member
    4695                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
    4696                      .dwattr $C$DW$313, DW_AT_name("DIEIDR1")
    4697                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_DIEIDR1")
    4698                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    4699                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4700              $C$DW$314       .dwtag  DW_TAG_member
    4701                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$20)
    4702                      .dwattr $C$DW$314, DW_AT_name("DIEIDR2")
    4703                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_DIEIDR2")
    4704                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4705                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4706              $C$DW$315       .dwtag  DW_TAG_member
    4707                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
    4708                      .dwattr $C$DW$315, DW_AT_name("DIEIDR3")
    4709                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_DIEIDR3")
    4710                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    4711                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4712              $C$DW$316       .dwtag  DW_TAG_member
    4713                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    4714                      .dwattr $C$DW$316, DW_AT_name("DIEIDR4")
    4715                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_DIEIDR4")
    4716                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4717                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4718              $C$DW$317       .dwtag  DW_TAG_member
    4719                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$20)
    4720                      .dwattr $C$DW$317, DW_AT_name("DIEIDR5")
    4721                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_DIEIDR5")
    4722                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    4723                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4724              $C$DW$318       .dwtag  DW_TAG_member
    4725                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$20)
    4726                      .dwattr $C$DW$318, DW_AT_name("DIEIDR6")
    4727                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_DIEIDR6")
    4728                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4729                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4730              $C$DW$319       .dwtag  DW_TAG_member
    4731                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
    4732                      .dwattr $C$DW$319, DW_AT_name("DIEIDR7")
    4733                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_DIEIDR7")
    4734                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    4735                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4736                      .dwendtag $C$DW$T$26
    4737              
    4738              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    4739                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$26)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  106

    4740                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4741              $C$DW$320       .dwtag  DW_TAG_TI_far_type
    4742                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$37)
    4743              $C$DW$321       .dwtag  DW_TAG_TI_ioport_type
    4744                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$320)
    4745              $C$DW$T$38      .dwtag  DW_TAG_volatile_type
    4746                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$321)
    4747              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4748                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    4749                      .dwattr $C$DW$T$39, DW_AT_address_class(0x10)
    4750              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    4751                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4752                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4753              
    4754              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4755                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    4756              $C$DW$322       .dwtag  DW_TAG_member
    4757                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$27)
    4758                      .dwattr $C$DW$322, DW_AT_name("clkInput")
    4759                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_clkInput")
    4760                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4761                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4762              $C$DW$323       .dwtag  DW_TAG_member
    4763                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$27)
    4764                      .dwattr $C$DW$323, DW_AT_name("baud")
    4765                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_baud")
    4766                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4767                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4768              $C$DW$324       .dwtag  DW_TAG_member
    4769                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    4770                      .dwattr $C$DW$324, DW_AT_name("wordLength")
    4771                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_wordLength")
    4772                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4773                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4774              $C$DW$325       .dwtag  DW_TAG_member
    4775                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    4776                      .dwattr $C$DW$325, DW_AT_name("stopBits")
    4777                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_stopBits")
    4778                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4779                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4780              $C$DW$326       .dwtag  DW_TAG_member
    4781                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    4782                      .dwattr $C$DW$326, DW_AT_name("parity")
    4783                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_parity")
    4784                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4785                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4786              $C$DW$327       .dwtag  DW_TAG_member
    4787                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    4788                      .dwattr $C$DW$327, DW_AT_name("fifoControl")
    4789                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_fifoControl")
    4790                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4791                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4792              $C$DW$328       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    4794                      .dwattr $C$DW$328, DW_AT_name("loopBackEnable")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  107

    4795                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_loopBackEnable")
    4796                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4797                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4798              $C$DW$329       .dwtag  DW_TAG_member
    4799                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    4800                      .dwattr $C$DW$329, DW_AT_name("afeEnable")
    4801                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_afeEnable")
    4802                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4803                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4804              $C$DW$330       .dwtag  DW_TAG_member
    4805                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    4806                      .dwattr $C$DW$330, DW_AT_name("rtsEnable")
    4807                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_rtsEnable")
    4808                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4809                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4810                      .dwendtag $C$DW$T$28
    4811              
    4812              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartSetup")
    4813                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$28)
    4814                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4815              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    4816                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    4817                      .dwattr $C$DW$T$53, DW_AT_address_class(0x17)
    4818              
    4819              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4820                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x05)
    4821              $C$DW$331       .dwtag  DW_TAG_member
    4822                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    4823                      .dwattr $C$DW$331, DW_AT_name("DLL")
    4824                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_DLL")
    4825                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4826                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4827              $C$DW$332       .dwtag  DW_TAG_member
    4828                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    4829                      .dwattr $C$DW$332, DW_AT_name("DLH")
    4830                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_DLH")
    4831                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4832                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4833              $C$DW$333       .dwtag  DW_TAG_member
    4834                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    4835                      .dwattr $C$DW$333, DW_AT_name("LCR")
    4836                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_LCR")
    4837                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4838                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4839              $C$DW$334       .dwtag  DW_TAG_member
    4840                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    4841                      .dwattr $C$DW$334, DW_AT_name("FCR")
    4842                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_FCR")
    4843                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4844                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4845              $C$DW$335       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    4847                      .dwattr $C$DW$335, DW_AT_name("MCR")
    4848                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_MCR")
    4849                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  108

    4850                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4851                      .dwendtag $C$DW$T$29
    4852              
    4853              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartConfig")
    4854                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$29)
    4855                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    4856              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    4857                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4858                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    4859              
    4860              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4861                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
    4862              $C$DW$336       .dwtag  DW_TAG_member
    4863                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$31)
    4864                      .dwattr $C$DW$336, DW_AT_name("lsiAddr")
    4865                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_lsiAddr")
    4866                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4867                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4868              $C$DW$337       .dwtag  DW_TAG_member
    4869                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$31)
    4870                      .dwattr $C$DW$337, DW_AT_name("rbiAddr")
    4871                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_rbiAddr")
    4872                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4873                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4874              $C$DW$338       .dwtag  DW_TAG_member
    4875                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$31)
    4876                      .dwattr $C$DW$338, DW_AT_name("tbeiAddr")
    4877                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_tbeiAddr")
    4878                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4879                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    4880              $C$DW$339       .dwtag  DW_TAG_member
    4881                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$31)
    4882                      .dwattr $C$DW$339, DW_AT_name("ctoi")
    4883                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_ctoi")
    4884                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4885                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    4886                      .dwendtag $C$DW$T$32
    4887              
    4888              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartIsrAddr")
    4889                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$32)
    4890                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    4891              $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    4892                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    4893                      .dwattr $C$DW$T$57, DW_AT_address_class(0x17)
    4894              
    4895              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
    4896                      .dwattr $C$DW$T$58, DW_AT_name("CSL_UartEventType")
    4897                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    4898              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_RECVOR_REG_DATA_INTERRUPT"), DW_AT_const_valu
    4899              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_XMITOR_REG_EMPTY_INTERRUPT"), DW_AT_const_val
    4900              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_UART_RECVOR_LINE_STATUS_INTERRUPT"), DW_AT_const_v
    4901                      .dwendtag $C$DW$T$58
    4902              
    4903              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartEventType")
    4904                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  109

    4905                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4906              
    4907              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4908                      .dwattr $C$DW$T$44, DW_AT_name("CSL_UartObj")
    4909                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x14)
    4910              $C$DW$343       .dwtag  DW_TAG_member
    4911                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    4912                      .dwattr $C$DW$343, DW_AT_name("insId")
    4913                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_insId")
    4914                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4915                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    4916              $C$DW$344       .dwtag  DW_TAG_member
    4917                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$36)
    4918                      .dwattr $C$DW$344, DW_AT_name("uartRegs")
    4919                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_uartRegs")
    4920                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4921                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4922              $C$DW$345       .dwtag  DW_TAG_member
    4923                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$40)
    4924                      .dwattr $C$DW$345, DW_AT_name("sysAddr")
    4925                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_sysAddr")
    4926                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4927                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4928              $C$DW$346       .dwtag  DW_TAG_member
    4929                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$42)
    4930                      .dwattr $C$DW$346, DW_AT_name("opmode")
    4931                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_opmode")
    4932                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4933                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4934              $C$DW$347       .dwtag  DW_TAG_member
    4935                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    4936                      .dwattr $C$DW$347, DW_AT_name("trigLevel")
    4937                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_trigLevel")
    4938                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4939                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4940              $C$DW$348       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$43)
    4942                      .dwattr $C$DW$348, DW_AT_name("UART_isrDispatchTable")
    4943                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_UART_isrDispatchTable")
    4944                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4945                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4946                      .dwendtag $C$DW$T$44
    4947              
    4948              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartObj")
    4949                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$44)
    4950                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4951              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    4952                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    4953                      .dwattr $C$DW$T$48, DW_AT_address_class(0x17)
    4954              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UartHandle")
    4955                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4956                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4957              
    4958              $C$DW$T$30      .dwtag  DW_TAG_subroutine_type
    4959                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:28:29 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_uart.asm                                                         PAGE  110

    4960              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    4961                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    4962                      .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    4963              $C$DW$T$4       .dwtag  DW_TAG_base_type
    4964                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4965                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    4966                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4967              $C$DW$T$5       .dwtag  DW_TAG_base_type
    4968                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4969                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4970                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4971              $C$DW$T$6       .dwtag  DW_TAG_base_type
    4972                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4973                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4974                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4975              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    4976                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$6)
    4977                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4978              $C$DW$T$7       .dwtag  DW_TAG_base_type
    4979                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4980                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4981                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    4982              $C$DW$T$8       .dwtag  DW_TAG_base_type
    4983                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4984                      .dwattr $C$DW$T$8, DW_AT_name("short")
    4985                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    4986              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    4987                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$8)
    4988                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    4989              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    4990                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    4991                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4992              $C$DW$T$9       .dwtag  DW_TAG_base_type
    4993                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4994                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4995                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
