TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE    1

    1373              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 07 01:41:45 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     919              $C$DW$T$6       .dwtag  DW_TAG_base_type
     920                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     921                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     922                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     923              $C$DW$T$7       .dwtag  DW_TAG_base_type
     924                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     925                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     926                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     927              $C$DW$T$8       .dwtag  DW_TAG_base_type
     928                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     929                      .dwattr $C$DW$T$8, DW_AT_name("short")
     930                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     931              $C$DW$T$9       .dwtag  DW_TAG_base_type
     932                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     933                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     934                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     935              $C$DW$T$10      .dwtag  DW_TAG_base_type
     936                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     937                      .dwattr $C$DW$T$10, DW_AT_name("int")
     938                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE   21

     939              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
     940                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$10)
     941                      .dwattr $C$DW$T$44, DW_AT_address_class(0x17)
     942              $C$DW$T$11      .dwtag  DW_TAG_base_type
     943                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     944                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     945                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     946              
     947              $C$DW$T$53      .dwtag  DW_TAG_array_type
     948                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$11)
     949                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     950                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
     951              $C$DW$82        .dwtag  DW_TAG_subrange_type
     952                      .dwattr $C$DW$82, DW_AT_upper_bound(0x03)
     953                      .dwendtag $C$DW$T$53
     954              
     955              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     956                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$11)
     957                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     958              $C$DW$T$12      .dwtag  DW_TAG_base_type
     959                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     960                      .dwattr $C$DW$T$12, DW_AT_name("long")
     961                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     962              $C$DW$T$13      .dwtag  DW_TAG_base_type
     963                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     964                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     965                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     966              $C$DW$T$14      .dwtag  DW_TAG_base_type
     967                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     968                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     969                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     970                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
     971                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
     972              $C$DW$T$15      .dwtag  DW_TAG_base_type
     973                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     974                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     975                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     976                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
     977                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
     978              $C$DW$T$16      .dwtag  DW_TAG_base_type
     979                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     980                      .dwattr $C$DW$T$16, DW_AT_name("float")
     981                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     982              $C$DW$T$17      .dwtag  DW_TAG_base_type
     983                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     984                      .dwattr $C$DW$T$17, DW_AT_name("double")
     985                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     986              $C$DW$T$18      .dwtag  DW_TAG_base_type
     987                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     988                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     989                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
     990              
     991              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     992                      .dwattr $C$DW$T$24, DW_AT_name("corCoRoutineControlBlock")
     993                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x1a)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE   22

     994              $C$DW$83        .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
     996                      .dwattr $C$DW$83, DW_AT_name("pxCoRoutineFunction")
     997                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_pxCoRoutineFunction")
     998                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1000              $C$DW$84        .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$23)
    1002                      .dwattr $C$DW$84, DW_AT_name("xGenericListItem")
    1003                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_xGenericListItem")
    1004                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1005                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1006              $C$DW$85        .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$23)
    1008                      .dwattr $C$DW$85, DW_AT_name("xEventListItem")
    1009                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_xEventListItem")
    1010                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1011                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1012              $C$DW$86        .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1014                      .dwattr $C$DW$86, DW_AT_name("uxPriority")
    1015                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_uxPriority")
    1016                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1017                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$87        .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1020                      .dwattr $C$DW$87, DW_AT_name("uxIndex")
    1021                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_uxIndex")
    1022                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1023                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$88        .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$9)
    1026                      .dwattr $C$DW$88, DW_AT_name("uxState")
    1027                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_uxState")
    1028                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1029                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1030                      .dwendtag $C$DW$T$24
    1031              
    1032              $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("corCRCB")
    1033                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$24)
    1034                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1035              
    1036              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1037                      .dwattr $C$DW$T$28, DW_AT_name("xLIST_ITEM")
    1038                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    1039              $C$DW$89        .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$25)
    1041                      .dwattr $C$DW$89, DW_AT_name("xItemValue")
    1042                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_xItemValue")
    1043                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$90        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$27)
    1047                      .dwattr $C$DW$90, DW_AT_name("pxNext")
    1048                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_pxNext")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE   23

    1049                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1050                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1051              $C$DW$91        .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$27)
    1053                      .dwattr $C$DW$91, DW_AT_name("pxPrevious")
    1054                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_pxPrevious")
    1055                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1056                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$92        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$3)
    1059                      .dwattr $C$DW$92, DW_AT_name("pvOwner")
    1060                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_pvOwner")
    1061                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1062                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1063              $C$DW$93        .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$3)
    1065                      .dwattr $C$DW$93, DW_AT_name("pvContainer")
    1066                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_pvContainer")
    1067                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1068                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1069                      .dwendtag $C$DW$T$28
    1070              
    1071              $C$DW$94        .dwtag  DW_TAG_TI_far_type
    1072                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$28)
    1073              $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    1074                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$94)
    1075              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    1076                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1077                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
    1078              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1079                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$28)
    1080                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1081                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1082              
    1083              ;***************************************************************
    1084              ;* DWARF CIE ENTRIES                                           *
    1085              ;***************************************************************
    1086              
    1087              $C$DW$CIE       .dwcie 91
    1088                      .dwcfi  cfa_register, 36
    1089                      .dwcfi  cfa_offset, 0
    1090                      .dwcfi  undefined, 0
    1091                      .dwcfi  undefined, 1
    1092                      .dwcfi  undefined, 2
    1093                      .dwcfi  undefined, 3
    1094                      .dwcfi  undefined, 4
    1095                      .dwcfi  undefined, 5
    1096                      .dwcfi  undefined, 6
    1097                      .dwcfi  undefined, 7
    1098                      .dwcfi  undefined, 8
    1099                      .dwcfi  undefined, 9
    1100                      .dwcfi  undefined, 10
    1101                      .dwcfi  undefined, 11
    1102                      .dwcfi  undefined, 12
    1103                      .dwcfi  undefined, 13
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 01:41:45 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE   24

    1104                      .dwcfi  same_value, 14
    1105                      .dwcfi  same_value, 15
    1106                      .dwcfi  undefined, 16
    1107                      .dwcfi  undefined, 17
    1108                      .dwcfi  undefined, 18
    1109                      .dwcfi  undefined, 19
    1110                      .dwcfi  undefined, 20
    1111                      .dwcfi  undefined, 21
    1112                      .dwcfi  undefined, 22
    1113                      .dwcfi  undefined, 23
    1114                      .dwcfi  undefined, 24
    1115                      .dwcfi  undefined, 25
    1116                      .dwcfi  same_value, 26
    1117                      .dwcfi  same_value, 27
    1118                      .dwcfi  same_value, 28
    1119                      .dwcfi  same_value, 29
    1120                      .dwcfi  same_value, 30
    1121                      .dwcfi  same_value, 31
    1122                      .dwcfi  undefined, 32
    1123                      .dwcfi  undefined, 33
    1124                      .dwcfi  undefined, 34
    1125                      .dwcfi  undefined, 35
    1126                      .dwcfi  undefined, 36
    1127                      .dwcfi  undefined, 37
    1128                      .dwcfi  undefined, 38
    1129                      .dwcfi  undefined, 39
    1130                      .dwcfi  undefined, 40
    1131                      .dwcfi  undefined, 41
    1132                      .dwcfi  undefined, 42
    1133                      .dwcfi  undefined, 43
