TMS320C55x Assembler PC v4.4.1 Sat Sep 08 07:11:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE    1

    1471              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 07:11:01 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     961                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$84)
     962              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
     963                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$50)
     964                      .dwattr $C$DW$T$58, DW_AT_address_class(0x17)
     965              $C$DW$T$9       .dwtag  DW_TAG_base_type
     966                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     967                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     968                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     969              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("UBaseType_t")
     970                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
     971                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     972              $C$DW$85        .dwtag  DW_TAG_TI_far_type
     973                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
     974              $C$DW$T$28      .dwtag  DW_TAG_volatile_type
     975                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$85)
     976              $C$DW$86        .dwtag  DW_TAG_TI_far_type
     977                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
     978              $C$DW$T$39      .dwtag  DW_TAG_const_type
     979                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$86)
     980              
     981              $C$DW$T$67      .dwtag  DW_TAG_array_type
     982                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$21)
     983                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     984                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
     985              $C$DW$87        .dwtag  DW_TAG_subrange_type
     986                      .dwattr $C$DW$87, DW_AT_upper_bound(0x03)
     987                      .dwendtag $C$DW$T$67
     988              
     989              $C$DW$T$10      .dwtag  DW_TAG_base_type
     990                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     991                      .dwattr $C$DW$T$10, DW_AT_name("int")
     992                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     993              $C$DW$T$11      .dwtag  DW_TAG_base_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 07:11:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE   22

     994                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     995                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     996                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     997              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("TickType_t")
     998                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$11)
     999                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1000              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1001                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$11)
    1002                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1003              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1004                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1005                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1006                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1007              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1008                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1009                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1010                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1011              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1012                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1013                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1014                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1015                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    1016                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    1017              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1018                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1019                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1020                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1021                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    1022                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    1023              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1024                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1025                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1026                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1027              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1028                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1029                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1030                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1031              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1032                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1033                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1034                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    1035              
    1036              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1037                      .dwattr $C$DW$T$27, DW_AT_name("corCoRoutineControlBlock")
    1038                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x1a)
    1039              $C$DW$88        .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$24)
    1041                      .dwattr $C$DW$88, DW_AT_name("pxCoRoutineFunction")
    1042                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_pxCoRoutineFunction")
    1043                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$89        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$25)
    1047                      .dwattr $C$DW$89, DW_AT_name("xGenericListItem")
    1048                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_xGenericListItem")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 07:11:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE   23

    1049                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1050                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1051              $C$DW$90        .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$25)
    1053                      .dwattr $C$DW$90, DW_AT_name("xEventListItem")
    1054                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_xEventListItem")
    1055                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1056                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$91        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
    1059                      .dwattr $C$DW$91, DW_AT_name("uxPriority")
    1060                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_uxPriority")
    1061                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1062                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1063              $C$DW$92        .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1065                      .dwattr $C$DW$92, DW_AT_name("uxIndex")
    1066                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_uxIndex")
    1067                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1068                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1069              $C$DW$93        .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$26)
    1071                      .dwattr $C$DW$93, DW_AT_name("uxState")
    1072                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_uxState")
    1073                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1074                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1075                      .dwendtag $C$DW$T$27
    1076              
    1077              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("CRCB_t")
    1078                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$27)
    1079                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1080              
    1081              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1082                      .dwattr $C$DW$T$31, DW_AT_name("xLIST")
    1083                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    1084              $C$DW$94        .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$28)
    1086                      .dwattr $C$DW$94, DW_AT_name("uxNumberOfItems")
    1087                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_uxNumberOfItems")
    1088                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1090              $C$DW$95        .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$29)
    1092                      .dwattr $C$DW$95, DW_AT_name("pxIndex")
    1093                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_pxIndex")
    1094                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1095                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1096              $C$DW$96        .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$30)
    1098                      .dwattr $C$DW$96, DW_AT_name("xListEnd")
    1099                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_xListEnd")
    1100                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1101                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1102                      .dwendtag $C$DW$T$31
    1103              
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 07:11:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE   24

    1104              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1105                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    1106                      .dwattr $C$DW$T$34, DW_AT_address_class(0x17)
    1107              
    1108              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1109                      .dwattr $C$DW$T$35, DW_AT_name("xLIST_ITEM")
    1110                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0a)
    1111              $C$DW$97        .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$32)
    1113                      .dwattr $C$DW$97, DW_AT_name("xItemValue")
    1114                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_xItemValue")
    1115                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$98        .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$33)
    1119                      .dwattr $C$DW$98, DW_AT_name("pxNext")
    1120                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_pxNext")
    1121                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1122                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$99        .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$33)
    1125                      .dwattr $C$DW$99, DW_AT_name("pxPrevious")
    1126                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_pxPrevious")
    1127                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1128                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1129              $C$DW$100       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$3)
    1131                      .dwattr $C$DW$100, DW_AT_name("pvOwner")
    1132                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_pvOwner")
    1133                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1134                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$101       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$34)
    1137                      .dwattr $C$DW$101, DW_AT_name("pvContainer")
    1138                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_pvContainer")
    1139                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1140                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1141                      .dwendtag $C$DW$T$35
    1142              
    1143              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("ListItem_t")
    1144                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$35)
    1145                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1146              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    1147                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    1148                      .dwattr $C$DW$T$29, DW_AT_address_class(0x17)
    1149              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1150                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$35)
    1151                      .dwattr $C$DW$T$33, DW_AT_address_class(0x17)
    1152              
    1153              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1154                      .dwattr $C$DW$T$36, DW_AT_name("xMINI_LIST_ITEM")
    1155                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x06)
    1156              $C$DW$102       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$32)
    1158                      .dwattr $C$DW$102, DW_AT_name("xItemValue")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 07:11:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE   25

    1159                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_xItemValue")
    1160                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1162              $C$DW$103       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$33)
    1164                      .dwattr $C$DW$103, DW_AT_name("pxNext")
    1165                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_pxNext")
    1166                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1167                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1168              $C$DW$104       .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$33)
    1170                      .dwattr $C$DW$104, DW_AT_name("pxPrevious")
    1171                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_pxPrevious")
    1172                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1173                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1174                      .dwendtag $C$DW$T$36
    1175              
    1176              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("MiniListItem_t")
    1177                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$36)
    1178                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1179                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1180              
    1181              ;***************************************************************
    1182              ;* DWARF CIE ENTRIES                                           *
    1183              ;***************************************************************
    1184              
    1185              $C$DW$CIE       .dwcie 91
    1186                      .dwcfi  cfa_register, 36
    1187                      .dwcfi  cfa_offset, 0
    1188                      .dwcfi  undefined, 0
    1189                      .dwcfi  undefined, 1
    1190                      .dwcfi  undefined, 2
    1191                      .dwcfi  undefined, 3
    1192                      .dwcfi  undefined, 4
    1193                      .dwcfi  undefined, 5
    1194                      .dwcfi  undefined, 6
    1195                      .dwcfi  undefined, 7
    1196                      .dwcfi  undefined, 8
    1197                      .dwcfi  undefined, 9
    1198                      .dwcfi  undefined, 10
    1199                      .dwcfi  undefined, 11
    1200                      .dwcfi  undefined, 12
    1201                      .dwcfi  undefined, 13
    1202                      .dwcfi  same_value, 14
    1203                      .dwcfi  same_value, 15
    1204                      .dwcfi  undefined, 16
    1205                      .dwcfi  undefined, 17
    1206                      .dwcfi  undefined, 18
    1207                      .dwcfi  undefined, 19
    1208                      .dwcfi  undefined, 20
    1209                      .dwcfi  undefined, 21
    1210                      .dwcfi  undefined, 22
    1211                      .dwcfi  undefined, 23
    1212                      .dwcfi  undefined, 24
    1213                      .dwcfi  undefined, 25
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 07:11:02 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
crhook.asm                                                           PAGE   26

    1214                      .dwcfi  same_value, 26
    1215                      .dwcfi  same_value, 27
    1216                      .dwcfi  same_value, 28
    1217                      .dwcfi  same_value, 29
    1218                      .dwcfi  same_value, 30
    1219                      .dwcfi  same_value, 31
    1220                      .dwcfi  undefined, 32
    1221                      .dwcfi  undefined, 33
    1222                      .dwcfi  undefined, 34
    1223                      .dwcfi  undefined, 35
    1224                      .dwcfi  undefined, 36
    1225                      .dwcfi  undefined, 37
    1226                      .dwcfi  undefined, 38
    1227                      .dwcfi  undefined, 39
    1228                      .dwcfi  undefined, 40
    1229                      .dwcfi  undefined, 41
    1230                      .dwcfi  undefined, 42
    1231                      .dwcfi  undefined, 43
    1232                      .dwcfi  undefined, 44
    1233                      .dwcfi  undefined, 45
    1234                      .dwcfi  undefined, 46
    1235                      .dwcfi  undefined, 47
    1236                      .dwcfi  undefined, 48
    1237                      .dwcfi  undefined, 49
    1238                      .dwcfi  undefined, 50
    1239                      .dwcfi  undefined, 51
    1240                      .dwcfi  undefined, 52
    1241                      .dwcfi  undefined, 53
