;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Fri Sep 07 02:28:17 2018                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_sdio.c")

                                        ; branch occurs ; |3916| 
$C$L267:    
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_sdio.c",line 3919,column 13,is_stmt
        MOV #-6, *SP(#3) ; |3919| 
$C$L268:    
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_sdio.c",line 3923,column 5,is_stmt
        MOV *SP(#3), T0 ; |3923| 
	.dwpsn	file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_sdio.c",line 3924,column 1,is_stmt
        AADD #5, SP
	.dwcfi	cfa_offset, 1
$C$DW$459	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$459, DW_AT_low_pc(0x00)
	.dwattr $C$DW$459, DW_AT_TI_return
        RET
                                        ; return occurs
	.dwattr $C$DW$452, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_sdio.c")
	.dwattr $C$DW$452, DW_AT_TI_end_line(0xf54)
	.dwattr $C$DW$452, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$452


;*******************************************************************************
;* TYPE INFORMATION                                                            *
;*******************************************************************************

$C$DW$T$29	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
$C$DW$460	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_CARD_NONE"), DW_AT_const_value(0x00)
$C$DW$461	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_IO_CARD"), DW_AT_const_value(0x01)
$C$DW$462	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_COMBO_CARD"), DW_AT_const_value(0x02)
$C$DW$463	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_INVALID_CARD"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$29

$C$DW$T$30	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioCardType")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)

$C$DW$T$38	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
$C$DW$464	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
$C$DW$465	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ENDIAN_BIG"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$38

$C$DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioEndianMode")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)

$C$DW$T$47	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
$C$DW$466	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_INST0"), DW_AT_const_value(0x00)
$C$DW$467	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_INST1"), DW_AT_const_value(0x01)
$C$DW$468	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_INST_INV"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$47

$C$DW$T$48	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioInstId")
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)

$C$DW$T$49	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
$C$DW$469	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_NO"), DW_AT_const_value(0x00)
$C$DW$470	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R1"), DW_AT_const_value(0x01)
$C$DW$471	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R2"), DW_AT_const_value(0x02)
$C$DW$472	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R3"), DW_AT_const_value(0x03)
$C$DW$473	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R4"), DW_AT_const_value(0x04)
$C$DW$474	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R5"), DW_AT_const_value(0x05)
$C$DW$475	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RESPTYPE_R6"), DW_AT_const_value(0x06)
	.dwendtag $C$DW$T$49

$C$DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioRespType")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)

$C$DW$T$51	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
$C$DW$476	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_EDATDNE_INTERRUPT"), DW_AT_const_value(0x00)
$C$DW$477	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_EBSYDNE_INTERRUPT"), DW_AT_const_value(0x01)
$C$DW$478	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ERSPDNE_INTERRUPT"), DW_AT_const_value(0x02)
$C$DW$479	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ETOUTRD_INTERRUPT"), DW_AT_const_value(0x03)
$C$DW$480	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ETOUTRS_INTERRUPT"), DW_AT_const_value(0x04)
$C$DW$481	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ECRCWR_INTERRUPT"), DW_AT_const_value(0x05)
$C$DW$482	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ECRCRD_INTERRUPT"), DW_AT_const_value(0x06)
$C$DW$483	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ECRCRS_INTERRUPT"), DW_AT_const_value(0x07)
$C$DW$484	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_RSV_BIT"), DW_AT_const_value(0x08)
$C$DW$485	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_EDXRDY_INTERRUPT"), DW_AT_const_value(0x09)
$C$DW$486	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_EDRRDY_INTERRUPT"), DW_AT_const_value(0x0a)
$C$DW$487	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_EDATED_INTERRUPT"), DW_AT_const_value(0x0b)
$C$DW$488	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_ETRNDNE_INTERRUPT"), DW_AT_const_value(0x0c)
$C$DW$489	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_MMCIM_ALL_INTERRUPT"), DW_AT_const_value(0x0d)
$C$DW$490	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_READWAIT_INTERRUPT"), DW_AT_const_value(0x0e)
$C$DW$491	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_CARD_INTERRUPT"), DW_AT_const_value(0x0f)
$C$DW$492	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_SDIO_SDIOIEN_ALL_INTERRUPT"), DW_AT_const_value(0x10)
	.dwendtag $C$DW$T$51

$C$DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioEventType")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x75)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$493, DW_AT_name("MMCCTL")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_MMCCTL")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$494, DW_AT_name("RSVD0")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$495, DW_AT_name("MMCCLK")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_MMCCLK")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$496, DW_AT_name("RSVD1")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$497, DW_AT_name("MMCST0")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_MMCST0")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$498, DW_AT_name("RSVD2")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$499, DW_AT_name("MMCST1")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_MMCST1")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$500, DW_AT_name("RSVD3")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$501, DW_AT_name("MMCIM")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_MMCIM")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$502, DW_AT_name("RSVD4")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$503, DW_AT_name("MMCTOR")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_MMCTOR")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$504, DW_AT_name("RSVD5")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$505, DW_AT_name("MMCTOD")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_MMCTOD")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$506, DW_AT_name("RSVD6")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$507, DW_AT_name("MMCBLEN")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_MMCBLEN")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$508, DW_AT_name("RSVD7")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$509, DW_AT_name("MMCNBLK")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_MMCNBLK")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$510, DW_AT_name("RSVD8")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$511, DW_AT_name("MMCNBLC")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_MMCNBLC")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$512, DW_AT_name("RSVD9")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$513, DW_AT_name("MMCDRR1")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_MMCDRR1")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$514, DW_AT_name("MMCDRR2")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_MMCDRR2")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$515, DW_AT_name("RSVD10")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$516, DW_AT_name("MMCDXR1")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_MMCDXR1")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$517, DW_AT_name("MMCDXR2")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_MMCDXR2")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$518, DW_AT_name("RSVD11")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$519, DW_AT_name("MMCCMD1")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_MMCCMD1")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$520, DW_AT_name("MMCCMD2")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_MMCCMD2")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$521, DW_AT_name("RSVD12")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$522, DW_AT_name("MMCARG1")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_MMCARG1")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$523, DW_AT_name("MMCARG2")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_MMCARG2")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$524, DW_AT_name("RSVD13")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$525, DW_AT_name("MMCRSP0")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_MMCRSP0")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$526, DW_AT_name("MMCRSP1")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_MMCRSP1")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$527, DW_AT_name("RSVD14")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_RSVD14")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$528, DW_AT_name("MMCRSP2")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_MMCRSP2")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$529, DW_AT_name("MMCRSP3")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_MMCRSP3")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$530, DW_AT_name("RSVD15")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_RSVD15")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$531, DW_AT_name("MMCRSP4")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_MMCRSP4")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$532, DW_AT_name("MMCRSP5")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_MMCRSP5")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$533, DW_AT_name("RSVD16")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_RSVD16")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$534, DW_AT_name("MMCRSP6")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_MMCRSP6")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$535, DW_AT_name("MMCRSP7")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_MMCRSP7")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$536, DW_AT_name("RSVD17")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_RSVD17")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$537, DW_AT_name("MMCDRSP")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_MMCDRSP")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$538, DW_AT_name("RSVD18")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_RSVD18")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$539, DW_AT_name("MMCCIDX")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_MMCCIDX")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$540, DW_AT_name("RSVD19")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_RSVD19")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$541, DW_AT_name("SDIOCTL")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_SDIOCTL")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$542, DW_AT_name("RSVD20")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_RSVD20")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$543, DW_AT_name("SDIOST0")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_SDIOST0")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$544, DW_AT_name("RSVD21")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_RSVD21")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$545, DW_AT_name("SDIOIEN")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_SDIOIEN")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$546, DW_AT_name("RSVD22")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_RSVD22")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$547, DW_AT_name("SDIOIST")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_SDIOIST")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$548, DW_AT_name("RSVD23")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_RSVD23")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$549, DW_AT_name("MMCFIFOCTL")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_MMCFIFOCTL")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$25

$C$DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
$C$DW$550	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$32)
$C$DW$551	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$550)
$C$DW$T$33	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$551)
$C$DW$T$34	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_address_class(0x10)
$C$DW$T$35	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$552, DW_AT_name("rca")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_rca")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$553, DW_AT_name("ocr")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_ocr")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$554, DW_AT_name("funCount")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_funCount")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$555, DW_AT_name("cardReady")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_cardReady")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$556, DW_AT_name("cardActive")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_cardActive")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$557, DW_AT_name("sdHcDetected")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_sdHcDetected")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$558, DW_AT_name("sdioCardType")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_sdioCardType")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$31

$C$DW$T$36	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioCardObj")
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x17)

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x08)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$559, DW_AT_name("sdioRegs")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_sdioRegs")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$560, DW_AT_name("pSdioCardObj")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_pSdioCardObj")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$561, DW_AT_name("readEndianMode")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_readEndianMode")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$562, DW_AT_name("writeEndianMode")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_writeEndianMode")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$563, DW_AT_name("cmd8Resp")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_cmd8Resp")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$40

$C$DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioControllerObj")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
$C$DW$T$54	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$54, DW_AT_address_class(0x17)
$C$DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioHandle")
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x0a)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$564, DW_AT_name("mmcctl")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_mmcctl")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$565, DW_AT_name("mmcclk")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_mmcclk")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$566, DW_AT_name("mmcim")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_mmcim")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$567, DW_AT_name("mmctor")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_mmctor")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$568, DW_AT_name("mmctod")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_mmctod")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$569, DW_AT_name("mmcblen")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("_mmcblen")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$570, DW_AT_name("mmcnblk")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("_mmcnblk")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$571, DW_AT_name("mmcfifoctl")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_mmcfifoctl")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$572, DW_AT_name("sdioctl")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_sdioctl")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$573, DW_AT_name("sdioien")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_sdioien")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$41

$C$DW$T$60	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioConfig")
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
$C$DW$T$61	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$61, DW_AT_address_class(0x17)

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$574, DW_AT_name("respBuf")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_respBuf")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$43

$C$DW$T$62	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SdioResponse")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
$C$DW$T$63	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$63, DW_AT_address_class(0x17)

$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x48)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$575, DW_AT_name("EBSR")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_EBSR")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$576, DW_AT_name("RSVD0")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$577, DW_AT_name("PCGCR1")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_PCGCR1")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$578, DW_AT_name("PCGCR2")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_PCGCR2")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$579, DW_AT_name("PSRCR")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_PSRCR")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$580, DW_AT_name("PRCR")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_PRCR")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$581, DW_AT_name("RSVD1")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$582, DW_AT_name("TIAFR")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_TIAFR")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$583, DW_AT_name("RSVD2")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$584, DW_AT_name("ODSCR")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("_ODSCR")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$585, DW_AT_name("PDINHIBR1")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("_PDINHIBR1")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$586, DW_AT_name("PDINHIBR2")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("_PDINHIBR2")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$587, DW_AT_name("PDINHIBR3")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("_PDINHIBR3")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$588, DW_AT_name("DMA0CESR1")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("_DMA0CESR1")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$589, DW_AT_name("DMA0CESR2")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("_DMA0CESR2")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$590, DW_AT_name("DMA1CESR1")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("_DMA1CESR1")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$591, DW_AT_name("DMA1CESR2")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("_DMA1CESR2")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$592, DW_AT_name("SDRAMCCR")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("_SDRAMCCR")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$593, DW_AT_name("CCR2")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("_CCR2")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$594, DW_AT_name("CGCR1")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("_CGCR1")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$595, DW_AT_name("CGICR")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("_CGICR")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$596, DW_AT_name("CGCR2")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("_CGCR2")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$597, DW_AT_name("CGOCR")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("_CGOCR")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$598, DW_AT_name("CCSSR")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("_CCSSR")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$599, DW_AT_name("RSVD3")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$600, DW_AT_name("ECDR")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("_ECDR")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$601, DW_AT_name("RSVD4")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$602, DW_AT_name("RAMSLPMDCNTLR1")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$603, DW_AT_name("RSVD5")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$604, DW_AT_name("RAMSLPMDCNTLR2")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$605, DW_AT_name("RAMSLPMDCNTLR3")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$606, DW_AT_name("RAMSLPMDCNTLR4")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$607, DW_AT_name("RAMSLPMDCNTLR5")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$608, DW_AT_name("RSVD6")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$609, DW_AT_name("DMAIFR")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("_DMAIFR")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$610, DW_AT_name("DMAIER")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("_DMAIER")
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$611, DW_AT_name("USBSCR")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("_USBSCR")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$612, DW_AT_name("ESCR")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("_ESCR")
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$613, DW_AT_name("RSVD7")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$614, DW_AT_name("DMA2CESR1")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("_DMA2CESR1")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$615, DW_AT_name("DMA2CESR2")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("_DMA2CESR2")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$616, DW_AT_name("DMA3CESR1")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("_DMA3CESR1")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$617, DW_AT_name("DMA3CESR2")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("_DMA3CESR2")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$618, DW_AT_name("CLKSTOP")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("_CLKSTOP")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$619, DW_AT_name("RSVD8")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$620, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("_DIEIDR0")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$621, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("_DIEIDR1")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$622, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("_DIEIDR2")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$623, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("_DIEIDR3")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$624, DW_AT_name("DIEIDR4")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("_DIEIDR4")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$625, DW_AT_name("DIEIDR5")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("_DIEIDR5")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$626, DW_AT_name("DIEIDR6")
	.dwattr $C$DW$626, DW_AT_TI_symbol_name("_DIEIDR6")
	.dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$627	.dwtag  DW_TAG_member
	.dwattr $C$DW$627, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$627, DW_AT_name("DIEIDR7")
	.dwattr $C$DW$627, DW_AT_TI_symbol_name("_DIEIDR7")
	.dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$46

$C$DW$T$64	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
$C$DW$628	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$64)
$C$DW$629	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$628)
$C$DW$T$65	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$629)
$C$DW$T$66	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$66, DW_AT_address_class(0x10)
$C$DW$T$67	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
$C$DW$T$68	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$68, DW_AT_address_class(0x17)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$56	.dwtag  DW_TAG_typedef, DW_AT_name("Int16")
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
$C$DW$T$57	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
$C$DW$T$58	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_address_class(0x17)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$630	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$19)
$C$DW$T$20	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$630)

$C$DW$T$21	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x03)
$C$DW$631	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$631, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$21


$C$DW$T$22	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
$C$DW$632	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$632, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$22


$C$DW$T$23	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x07)
$C$DW$633	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$633, DW_AT_upper_bound(0x06)
	.dwendtag $C$DW$T$23


$C$DW$T$24	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x13)
$C$DW$634	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$634, DW_AT_upper_bound(0x12)
	.dwendtag $C$DW$T$24
