;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Sat Sep 08 23:29:06 2018                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_mmcsd_ataIf.c")

	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)

$C$DW$T$63	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
$C$DW$268	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_INTERRUPT_DISABLE"), DW_AT_const_value(0x00)
$C$DW$269	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_INTERRUPT_ENABLE"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$63

$C$DW$T$64	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAInterruptState")
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)

$C$DW$T$66	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
$C$DW$270	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_PING_PONG_DISABLE"), DW_AT_const_value(0x00)
$C$DW$271	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_PING_PONG_ENABLE"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$66

$C$DW$T$67	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAPingPongMode")
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)

$C$DW$T$68	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x01)
$C$DW$272	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_DISABLE"), DW_AT_const_value(0x00)
$C$DW$273	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_AUTORELOAD_ENABLE"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$68

$C$DW$T$69	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAAutoReloadMode")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)

$C$DW$T$70	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x01)
$C$DW$274	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_1WORD"), DW_AT_const_value(0x00)
$C$DW$275	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_2WORD"), DW_AT_const_value(0x01)
$C$DW$276	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_4WORD"), DW_AT_const_value(0x02)
$C$DW$277	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_8WORD"), DW_AT_const_value(0x03)
$C$DW$278	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_TXBURST_16WORD"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$70

$C$DW$T$71	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMATxBurstLen")
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)

$C$DW$T$72	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x01)
$C$DW$279	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_NONE"), DW_AT_const_value(0x00)
$C$DW$280	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_TX"), DW_AT_const_value(0x01)
$C$DW$281	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S0_RX"), DW_AT_const_value(0x02)
$C$DW$282	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_TX"), DW_AT_const_value(0x01)
$C$DW$283	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S1_RX"), DW_AT_const_value(0x02)
$C$DW$284	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_TX"), DW_AT_const_value(0x01)
$C$DW$285	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S2_RX"), DW_AT_const_value(0x02)
$C$DW$286	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_TX"), DW_AT_const_value(0x04)
$C$DW$287	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2S3_RX"), DW_AT_const_value(0x05)
$C$DW$288	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_TX"), DW_AT_const_value(0x05)
$C$DW$289	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD0_RX"), DW_AT_const_value(0x06)
$C$DW$290	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_TX"), DW_AT_const_value(0x07)
$C$DW$291	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_MMC_SD1_RX"), DW_AT_const_value(0x08)
$C$DW$292	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER0"), DW_AT_const_value(0x0c)
$C$DW$293	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER1"), DW_AT_const_value(0x0d)
$C$DW$294	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_TIMER2"), DW_AT_const_value(0x0e)
$C$DW$295	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_TX"), DW_AT_const_value(0x05)
$C$DW$296	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_UART_RX"), DW_AT_const_value(0x06)
$C$DW$297	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_TX"), DW_AT_const_value(0x01)
$C$DW$298	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_I2C_RX"), DW_AT_const_value(0x02)
$C$DW$299	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_SAR_AD"), DW_AT_const_value(0x03)
$C$DW$300	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_DMA_EVT_INVALID"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$72

$C$DW$T$73	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMAEvtType")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)

$C$DW$T$85	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
$C$DW$301	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_POLLED"), DW_AT_const_value(0x00)
$C$DW$302	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_INTERRUPT"), DW_AT_const_value(0x01)
$C$DW$303	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_DMA"), DW_AT_const_value(0x02)
$C$DW$304	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_OPMODE_NONE"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$85

$C$DW$T$86	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDOpMode")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)

$C$DW$T$96	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
$C$DW$305	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_LITTLE"), DW_AT_const_value(0x00)
$C$DW$306	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MMCSD_ENDIAN_BIG"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$96

$C$DW$T$97	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdEndianMode")
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x75)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$307, DW_AT_name("MMCCTL")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_MMCCTL")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$308, DW_AT_name("RSVD0")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$309, DW_AT_name("MMCCLK")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_MMCCLK")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$310, DW_AT_name("RSVD1")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$311, DW_AT_name("MMCST0")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_MMCST0")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$312, DW_AT_name("RSVD2")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$313, DW_AT_name("MMCST1")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_MMCST1")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$314, DW_AT_name("RSVD3")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$315, DW_AT_name("MMCIM")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_MMCIM")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$316, DW_AT_name("RSVD4")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$317, DW_AT_name("MMCTOR")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_MMCTOR")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$318, DW_AT_name("RSVD5")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$319, DW_AT_name("MMCTOD")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_MMCTOD")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$320, DW_AT_name("RSVD6")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$321, DW_AT_name("MMCBLEN")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_MMCBLEN")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$322, DW_AT_name("RSVD7")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$323, DW_AT_name("MMCNBLK")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_MMCNBLK")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$324, DW_AT_name("RSVD8")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$325, DW_AT_name("MMCNBLC")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_MMCNBLC")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$326, DW_AT_name("RSVD9")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$327, DW_AT_name("MMCDRR1")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_MMCDRR1")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$328, DW_AT_name("MMCDRR2")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_MMCDRR2")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$329, DW_AT_name("RSVD10")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$330, DW_AT_name("MMCDXR1")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_MMCDXR1")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$331, DW_AT_name("MMCDXR2")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_MMCDXR2")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$332, DW_AT_name("RSVD11")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$333, DW_AT_name("MMCCMD1")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_MMCCMD1")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$334, DW_AT_name("MMCCMD2")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_MMCCMD2")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$335, DW_AT_name("RSVD12")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$336, DW_AT_name("MMCARG1")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_MMCARG1")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$337, DW_AT_name("MMCARG2")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_MMCARG2")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$338, DW_AT_name("RSVD13")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$339, DW_AT_name("MMCRSP0")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_MMCRSP0")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$340, DW_AT_name("MMCRSP1")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_MMCRSP1")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$341, DW_AT_name("RSVD14")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_RSVD14")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$342, DW_AT_name("MMCRSP2")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_MMCRSP2")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$343, DW_AT_name("MMCRSP3")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_MMCRSP3")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$344, DW_AT_name("RSVD15")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_RSVD15")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$345, DW_AT_name("MMCRSP4")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_MMCRSP4")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$346, DW_AT_name("MMCRSP5")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_MMCRSP5")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$347, DW_AT_name("RSVD16")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_RSVD16")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$348, DW_AT_name("MMCRSP6")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_MMCRSP6")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$349, DW_AT_name("MMCRSP7")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_MMCRSP7")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$350, DW_AT_name("RSVD17")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_RSVD17")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$351, DW_AT_name("MMCDRSP")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_MMCDRSP")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$352, DW_AT_name("RSVD18")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_RSVD18")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$353, DW_AT_name("MMCCIDX")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_MMCCIDX")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$354, DW_AT_name("RSVD19")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_RSVD19")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$355, DW_AT_name("SDIOCTL")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_SDIOCTL")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$356, DW_AT_name("RSVD20")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_RSVD20")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$357, DW_AT_name("SDIOST0")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_SDIOST0")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$358, DW_AT_name("RSVD21")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_RSVD21")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$359, DW_AT_name("SDIOIEN")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_SDIOIEN")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$360, DW_AT_name("RSVD22")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_RSVD22")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$361, DW_AT_name("SDIOIST")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_SDIOIST")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$362, DW_AT_name("RSVD23")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_RSVD23")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$363, DW_AT_name("MMCFIFOCTL")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_MMCFIFOCTL")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$25

$C$DW$T$77	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegs")
	.dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
$C$DW$364	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$77)
$C$DW$365	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$364)
$C$DW$T$78	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$365)
$C$DW$T$79	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$79, DW_AT_address_class(0x10)
$C$DW$T$80	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdRegsOvly")
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)

$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$366, DW_AT_name("mfgId")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_mfgId")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$367, DW_AT_name("oemAppId")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_oemAppId")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$368, DW_AT_name("productName")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_productName")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$369, DW_AT_name("productRev")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_productRev")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$370, DW_AT_name("serialNumber")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_serialNumber")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$371, DW_AT_name("month")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_month")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$372, DW_AT_name("year")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_year")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$373, DW_AT_name("checksum")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_checksum")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$29

$C$DW$T$34	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardIdObj")
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
$C$DW$T$35	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_address_class(0x17)

$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x22)
$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$374, DW_AT_name("csdStruct")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_csdStruct")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$375, DW_AT_name("mmcProt")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_mmcProt")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$376, DW_AT_name("taac")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_taac")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$377, DW_AT_name("nsac")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_nsac")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$378, DW_AT_name("tranSpeed")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_tranSpeed")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$379, DW_AT_name("ccc")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_ccc")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$380, DW_AT_name("readBlLen")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_readBlLen")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$381, DW_AT_name("readBlPartial")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_readBlPartial")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$382, DW_AT_name("writeBlkMisalign")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_writeBlkMisalign")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$383, DW_AT_name("readBlkMisalign")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_readBlkMisalign")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$384, DW_AT_name("dsrImp")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_dsrImp")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$385, DW_AT_name("cSize")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_cSize")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$386, DW_AT_name("vddRCurrMin")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_vddRCurrMin")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$387, DW_AT_name("vddRCurrMax")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_vddRCurrMax")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$388, DW_AT_name("vddWCurrMin")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_vddWCurrMin")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$389, DW_AT_name("vddWCurrMax")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_vddWCurrMax")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$390, DW_AT_name("cSizeMult")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_cSizeMult")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$391, DW_AT_name("eraseBlkEnable")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_eraseBlkEnable")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$392, DW_AT_name("eraseGrpSize")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_eraseGrpSize")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$393, DW_AT_name("eraseGrpMult")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_eraseGrpMult")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$394, DW_AT_name("wpGrpSize")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_wpGrpSize")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$395, DW_AT_name("wpGrpEnable")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_wpGrpEnable")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$396, DW_AT_name("defaultEcc")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_defaultEcc")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$397, DW_AT_name("r2wFactor")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_r2wFactor")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$398, DW_AT_name("writeBlLen")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_writeBlLen")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$399, DW_AT_name("writeBlPartial")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_writeBlPartial")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$400, DW_AT_name("contProtApp")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_contProtApp")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$401, DW_AT_name("fileFmtGrp")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_fileFmtGrp")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$402, DW_AT_name("copyFlag")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_copyFlag")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$403, DW_AT_name("permWriteProtect")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_permWriteProtect")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$404, DW_AT_name("tmpWriteProtect")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_tmpWriteProtect")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$405, DW_AT_name("fileFmt")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_fileFmt")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$406, DW_AT_name("ecc")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_ecc")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$407, DW_AT_name("crc")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_crc")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$30

$C$DW$T$36	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardCsdObj")
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x17)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x06)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$408, DW_AT_name("securitySysId")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_securitySysId")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$409, DW_AT_name("securitySysVers")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_securitySysVers")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$410, DW_AT_name("maxLicenses")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_maxLicenses")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$411, DW_AT_name("xStatus")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_xStatus")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$31

$C$DW$T$38	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardXCsdObj")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
$C$DW$T$39	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_address_class(0x17)

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x1e)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$412, DW_AT_name("rca")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_rca")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$413, DW_AT_name("ST0")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_ST0")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$414, DW_AT_name("ST1")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_ST1")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$415, DW_AT_name("cardIndex")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_cardIndex")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$416, DW_AT_name("maxXfrRate")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_maxXfrRate")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$417, DW_AT_name("readAccessTime")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_readAccessTime")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$418, DW_AT_name("cardCapacity")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_cardCapacity")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$419, DW_AT_name("blockLength")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_blockLength")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$420, DW_AT_name("totalSectors")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_totalSectors")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$421, DW_AT_name("lastAddrRead")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_lastAddrRead")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$422, DW_AT_name("lastAddrWritten")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_lastAddrWritten")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$423, DW_AT_name("cardType")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_cardType")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$424, DW_AT_name("cid")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_cid")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$425, DW_AT_name("csd")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_csd")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$426, DW_AT_name("xcsd")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_xcsd")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$427, DW_AT_name("sdHcDetected")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_sdHcDetected")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$428, DW_AT_name("cardAtaFsOpen")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_cardAtaFsOpen")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$429, DW_AT_name("cardMscStatus")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_cardMscStatus")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$41

$C$DW$T$81	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCardObj")
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
$C$DW$T$82	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$T$82, DW_AT_address_class(0x17)

$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$430, DW_AT_name("isr")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_isr")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$46

$C$DW$T$83	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackObj")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
$C$DW$T$84	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$84, DW_AT_address_class(0x17)

$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x66)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$431, DW_AT_name("DMACH0SSAL")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_DMACH0SSAL")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$432, DW_AT_name("DMACH0SSAU")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_DMACH0SSAU")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$433, DW_AT_name("DMACH0DSAL")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_DMACH0DSAL")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$434, DW_AT_name("DMACH0DSAU")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_DMACH0DSAU")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$435, DW_AT_name("DMACH0TCR1")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_DMACH0TCR1")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$436, DW_AT_name("DMACH0TCR2")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_DMACH0TCR2")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$437, DW_AT_name("RSVD0")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$438, DW_AT_name("DMACH1SSAL")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_DMACH1SSAL")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$439, DW_AT_name("DMACH1SSAU")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_DMACH1SSAU")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$440, DW_AT_name("DMACH1DSAL")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_DMACH1DSAL")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$441, DW_AT_name("DMACH1DSAU")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_DMACH1DSAU")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$442, DW_AT_name("DMACH1TCR1")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_DMACH1TCR1")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$443, DW_AT_name("DMACH1TCR2")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_DMACH1TCR2")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$444, DW_AT_name("RSVD1")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$445, DW_AT_name("DMACH2SSAL")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_DMACH2SSAL")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$446, DW_AT_name("DMACH2SSAU")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_DMACH2SSAU")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$447, DW_AT_name("DMACH2DSAL")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_DMACH2DSAL")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$448, DW_AT_name("DMACH2DSAU")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_DMACH2DSAU")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$449, DW_AT_name("DMACH2TCR1")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_DMACH2TCR1")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$450, DW_AT_name("DMACH2TCR2")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_DMACH2TCR2")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$451, DW_AT_name("RSVD2")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$452, DW_AT_name("DMACH3SSAL")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_DMACH3SSAL")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$453, DW_AT_name("DMACH3SSAU")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_DMACH3SSAU")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$454, DW_AT_name("DMACH3DSAL")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_DMACH3DSAL")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$455, DW_AT_name("DMACH3DSAU")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_DMACH3DSAU")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$456, DW_AT_name("DMACH3TCR1")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_DMACH3TCR1")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$457, DW_AT_name("DMACH3TCR2")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_DMACH3TCR2")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$48

$C$DW$T$49	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegs")
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
$C$DW$458	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$49)
$C$DW$459	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$458)
$C$DW$T$50	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$459)
$C$DW$T$51	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_address_class(0x10)
$C$DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DmaRegsOvly")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)

$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x09)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$460, DW_AT_name("dmaRegs")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_dmaRegs")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$461, DW_AT_name("chanNum")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_chanNum")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$462, DW_AT_name("dmaInstNum")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_dmaInstNum")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$463, DW_AT_name("isChanFree")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_isChanFree")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$464, DW_AT_name("chanDir")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_chanDir")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$465, DW_AT_name("trigger")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_trigger")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$466, DW_AT_name("trfType")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_trfType")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$467, DW_AT_name("dmaInt")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_dmaInt")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$468, DW_AT_name("pingPongEnabled")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_pingPongEnabled")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$65

$C$DW$T$87	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_ChannelObj")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
$C$DW$T$88	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$88, DW_AT_address_class(0x17)
$C$DW$T$89	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Handle")
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)

$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x0e)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$469, DW_AT_name("pingPongMode")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_pingPongMode")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$470, DW_AT_name("autoMode")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_autoMode")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$471, DW_AT_name("burstLen")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_burstLen")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$472, DW_AT_name("trigger")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_trigger")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$473, DW_AT_name("dmaEvt")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_dmaEvt")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$474, DW_AT_name("dmaInt")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_dmaInt")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$475, DW_AT_name("chanDir")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_chanDir")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$476, DW_AT_name("trfType")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_trfType")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$477, DW_AT_name("dataLen")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_dataLen")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$478, DW_AT_name("srcAddr")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_srcAddr")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$479, DW_AT_name("destAddr")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_destAddr")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$74

$C$DW$T$90	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_DMA_Config")
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)

$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$480, DW_AT_name("slice127_112")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_slice127_112")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$481, DW_AT_name("slice111_96")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_slice111_96")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$482, DW_AT_name("slice95_80")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_slice95_80")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$483, DW_AT_name("slice79_64")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_slice79_64")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$484, DW_AT_name("slice63_48")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_slice63_48")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$485, DW_AT_name("slice47_32")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_slice47_32")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$486, DW_AT_name("slice31_16")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_slice31_16")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$487, DW_AT_name("slice15_0")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_slice15_0")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$75

$C$DW$T$94	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDCidStruct")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)

$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x08)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$488, DW_AT_name("slice127_112")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_slice127_112")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$489, DW_AT_name("slice111_96")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_slice111_96")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$490, DW_AT_name("slice95_80")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_slice95_80")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$491, DW_AT_name("slice79_64")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_slice79_64")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$492, DW_AT_name("slice63_48")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_slice63_48")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$493, DW_AT_name("slice47_32")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_slice47_32")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$494, DW_AT_name("slice31_16")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_slice31_16")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$495, DW_AT_name("slice15_0")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_slice15_0")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$76

$C$DW$T$95	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCSDCsdStruct")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)

$C$DW$T$98	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$98, DW_AT_byte_size(0x40)
$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$496, DW_AT_name("mmcRegs")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_mmcRegs")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$497, DW_AT_name("cardObj")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_cardObj")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$498, DW_AT_name("numCardsActive")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_numCardsActive")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$499, DW_AT_name("callBackTbl")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_callBackTbl")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$500, DW_AT_name("opMode")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$501, DW_AT_name("hDmaWrite")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_hDmaWrite")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$502, DW_AT_name("hDmaRead")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_hDmaRead")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$503, DW_AT_name("dmaWriteCfg")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_dmaWriteCfg")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$504, DW_AT_name("dmaReadCfg")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_dmaReadCfg")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$505, DW_AT_name("dataTransferCallback")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_dataTransferCallback")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$506, DW_AT_name("isCallbackSet")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_isCallbackSet")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$507, DW_AT_name("cidSliceInfo")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_cidSliceInfo")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$508, DW_AT_name("csdSliceInfo")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_csdSliceInfo")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$509, DW_AT_name("readEndianMode")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_readEndianMode")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$510, DW_AT_name("writeEndianMode")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_writeEndianMode")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$511, DW_AT_name("blockLen")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_blockLen")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$98

$C$DW$T$133	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCControllerObj")
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
$C$DW$T$134	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
	.dwattr $C$DW$T$134, DW_AT_address_class(0x17)
$C$DW$T$135	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MmcsdHandle")
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)

$C$DW$T$104	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$104, DW_AT_name("AtaMMCState")
	.dwattr $C$DW$T$104, DW_AT_byte_size(0x14)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$512, DW_AT_name("hMmcSd")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_hMmcSd")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$513, DW_AT_name("pDrive")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_pDrive")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$514, DW_AT_name("pMmcSdptr")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_pMmcSdptr")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$515, DW_AT_name("pReadBuf")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_pReadBuf")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$516, DW_AT_name("pWriteBuf")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_pWriteBuf")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$517, DW_AT_name("currentsectorR")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_currentsectorR")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$518, DW_AT_name("currentwordR")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_currentwordR")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$519, DW_AT_name("currentsectorWr")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_currentsectorWr")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$520, DW_AT_name("currentwordWr")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_currentwordWr")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$521, DW_AT_name("mmcsdCallBack")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_mmcsdCallBack")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$104

$C$DW$T$136	.dwtag  DW_TAG_typedef, DW_AT_name("AtaMMCState")
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
$C$DW$T$137	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
	.dwattr $C$DW$T$137, DW_AT_address_class(0x17)

$C$DW$T$131	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$131, DW_AT_name("AtaStateStruct")
	.dwattr $C$DW$T$131, DW_AT_byte_size(0x44)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$522, DW_AT_name("BootPhySector")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_BootPhySector")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$523, DW_AT_name("FatType")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_FatType")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$524, DW_AT_name("WordsPerLogSector")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_WordsPerLogSector")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$525, DW_AT_name("LogSectorsPerCluster")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_LogSectorsPerCluster")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$526, DW_AT_name("RootDirEntries")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_RootDirEntries")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$527, DW_AT_name("LogSectorsPerFat")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_LogSectorsPerFat")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$528, DW_AT_name("FirstFatSector")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_FirstFatSector")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$529, DW_AT_name("RootDirSector")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_RootDirSector")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$530, DW_AT_name("FirstDataSector")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_FirstDataSector")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$531, DW_AT_name("TotalSectors")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_TotalSectors")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$532, DW_AT_name("Data")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_Data")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$533, DW_AT_name("CurrentWord")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_CurrentWord")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$534, DW_AT_name("CurrentPhySector")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_CurrentPhySector")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$535, DW_AT_name("WordsPerCluster")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_WordsPerCluster")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$536, DW_AT_name("NumberOfFats")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_NumberOfFats")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$537, DW_AT_name("MFWFlag")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_MFWFlag")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$538, DW_AT_name("Err_Status")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_Err_Status")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$539, DW_AT_name("pAtaMediaState")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_pAtaMediaState")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$540, DW_AT_name("AtaReset")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_AtaReset")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$541, DW_AT_name("AtaCommandReadyStatusCheck")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_AtaCommandReadyStatusCheck")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$542, DW_AT_name("AtaBusyStatusCheck")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_AtaBusyStatusCheck")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$543, DW_AT_name("AtaGetSerialID")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_AtaGetSerialID")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$544, DW_AT_name("AtaIssueReadCommand")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_AtaIssueReadCommand")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$545, DW_AT_name("AtaDataReadyStatusCheck")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_AtaDataReadyStatusCheck")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$120)
	.dwattr $C$DW$546, DW_AT_name("AtaReadNextWord")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_AtaReadNextWord")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$547, DW_AT_name("AtaReadNextWord1")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_AtaReadNextWord1")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$548, DW_AT_name("AtaReadNextNWords")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_AtaReadNextNWords")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$549, DW_AT_name("AtaWriteSector")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_AtaWriteSector")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$550, DW_AT_name("AtaWriteSectorFlush")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_AtaWriteSectorFlush")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$551, DW_AT_name("AtaInitAtaMediaState")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_AtaInitAtaMediaState")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$552, DW_AT_name("AtaFlushFat")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_AtaFlushFat")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$553, DW_AT_name("AtaErrorCallback")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_AtaErrorCallback")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$554, DW_AT_name("AtaFileSystemType")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_AtaFileSystemType")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$555, DW_AT_name("get_mod_time")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_get_mod_time")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$556, DW_AT_name("get_mod_date")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_get_mod_date")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$557, DW_AT_name("get_time")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_get_time")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$130)
	.dwattr $C$DW$558, DW_AT_name("get_date")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_get_date")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$559, DW_AT_name("_AtaWriteBuffer")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("__AtaWriteBuffer")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$560, DW_AT_name("_AtaWriteCurrentPhySector")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("__AtaWriteCurrentPhySector")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$131

$C$DW$T$99	.dwtag  DW_TAG_typedef, DW_AT_name("AtaState")
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
$C$DW$T$100	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$100, DW_AT_address_class(0x17)
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_address_class(0x17)

$C$DW$T$42	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
$C$DW$T$43	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$43, DW_AT_address_class(0x20)
$C$DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCCallBackPtr")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)

$C$DW$T$45	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x18)
$C$DW$561	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$561, DW_AT_upper_bound(0x0b)
	.dwendtag $C$DW$T$45


$C$DW$T$91	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
$C$DW$562	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$91

$C$DW$T$92	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$92, DW_AT_address_class(0x20)
$C$DW$T$93	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_MMCDataTxferCallBackPtr")
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)

$C$DW$T$125	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
$C$DW$563	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$9)
	.dwendtag $C$DW$T$125

$C$DW$T$126	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$T$126, DW_AT_address_class(0x20)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)

$C$DW$T$27	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x06)
$C$DW$564	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$564, DW_AT_upper_bound(0x05)
	.dwendtag $C$DW$T$27

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$138	.dwtag  DW_TAG_typedef, DW_AT_name("Int16")
	.dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
$C$DW$T$139	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$T$101	.dwtag  DW_TAG_typedef, DW_AT_name("AtaUint16")
