TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE    1

   10752              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 17:42:04 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    9373                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$59)
    9374                      .dwendtag $C$DW$T$60
    9375              
    9376              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    9377                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    9378                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    9379              
    9380              $C$DW$T$58      .dwtag  DW_TAG_enumeration_type
    9381                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    9382              $C$DW$639       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_UNLOCK"), DW_AT_const_value(0x00)
    9383              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_MSC_LOCK"), DW_AT_const_value(0x01)
    9384                      .dwendtag $C$DW$T$58
    9385              
    9386              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscMediaLockStatus")
    9387                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    9388                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    9389              
    9390              $C$DW$T$78      .dwtag  DW_TAG_enumeration_type
    9391                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x01)
    9392              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
    9393              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    9394              $C$DW$643       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    9395              $C$DW$644       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    9396              $C$DW$645       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    9397              $C$DW$646       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    9398              $C$DW$647       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    9399              $C$DW$648       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    9400              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    9401              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    9402              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    9403              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    9404              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    9405              $C$DW$654       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    9406              $C$DW$655       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    9407              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    9408                      .dwendtag $C$DW$T$78
    9409              
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  227

    9410              $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    9411                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    9412                      .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    9413              
    9414              $C$DW$T$80      .dwtag  DW_TAG_enumeration_type
    9415                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x01)
    9416              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    9417              $C$DW$658       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    9418              $C$DW$659       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    9419              $C$DW$660       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    9420              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    9421                      .dwendtag $C$DW$T$80
    9422              
    9423              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    9424                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    9425                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    9426              
    9427              $C$DW$T$86      .dwtag  DW_TAG_enumeration_type
    9428                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
    9429              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_FALSE"), DW_AT_const_value(0x00)
    9430              $C$DW$663       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_TRUE"), DW_AT_const_value(0x01)
    9431                      .dwendtag $C$DW$T$86
    9432              
    9433              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBoolean")
    9434                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    9435                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    9436              
    9437              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    9438                      .dwattr $C$DW$T$21, DW_AT_name("CSL_MscClassStruct")
    9439                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x220)
    9440              $C$DW$664       .dwtag  DW_TAG_member
    9441                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$19)
    9442                      .dwattr $C$DW$664, DW_AT_name("ctrlHandle")
    9443                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ctrlHandle")
    9444                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9445                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    9446              $C$DW$665       .dwtag  DW_TAG_member
    9447                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$20)
    9448                      .dwattr $C$DW$665, DW_AT_name("mscHandle")
    9449                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_mscHandle")
    9450                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    9451                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    9452                      .dwendtag $C$DW$T$21
    9453              
    9454              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscClassStruct")
    9455                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$21)
    9456                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    9457              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    9458                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    9459                      .dwattr $C$DW$T$97, DW_AT_address_class(0x17)
    9460              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("pMscClassHandle")
    9461                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    9462                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    9463              
    9464              $C$DW$T$48      .dwtag  DW_TAG_structure_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  228

    9465                      .dwattr $C$DW$T$48, DW_AT_name("CSL_MscCtrlObject")
    9466                      .dwattr $C$DW$T$48, DW_AT_byte_size(0xb6)
    9467              $C$DW$666       .dwtag  DW_TAG_member
    9468                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$22)
    9469                      .dwattr $C$DW$666, DW_AT_name("ctrlInEpObj")
    9470                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_ctrlInEpObj")
    9471                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9472                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    9473              $C$DW$667       .dwtag  DW_TAG_member
    9474                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$24)
    9475                      .dwattr $C$DW$667, DW_AT_name("devNum")
    9476                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_devNum")
    9477                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9478                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    9479              $C$DW$668       .dwtag  DW_TAG_member
    9480                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$22)
    9481                      .dwattr $C$DW$668, DW_AT_name("ctrlOutEpObj")
    9482                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ctrlOutEpObj")
    9483                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9484                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    9485              $C$DW$669       .dwtag  DW_TAG_member
    9486                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$25)
    9487                      .dwattr $C$DW$669, DW_AT_name("suspendFlag")
    9488                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_suspendFlag")
    9489                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    9490                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    9491              $C$DW$670       .dwtag  DW_TAG_member
    9492                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$28)
    9493                      .dwattr $C$DW$670, DW_AT_name("hEpObjArray")
    9494                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_hEpObjArray")
    9495                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9496                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    9497              $C$DW$671       .dwtag  DW_TAG_member
    9498                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$29)
    9499                      .dwattr $C$DW$671, DW_AT_name("usbSetup")
    9500                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_usbSetup")
    9501                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9502                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    9503              $C$DW$672       .dwtag  DW_TAG_member
    9504                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$30)
    9505                      .dwattr $C$DW$672, DW_AT_name("highSpeedCfgDescr")
    9506                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_highSpeedCfgDescr")
    9507                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9508                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    9509              $C$DW$673       .dwtag  DW_TAG_member
    9510                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$30)
    9511                      .dwattr $C$DW$673, DW_AT_name("fullSpeedCfgDescr")
    9512                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_fullSpeedCfgDescr")
    9513                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
    9514                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    9515              $C$DW$674       .dwtag  DW_TAG_member
    9516                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$31)
    9517                      .dwattr $C$DW$674, DW_AT_name("deviceDescr")
    9518                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_deviceDescr")
    9519                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  229

    9520                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    9521              $C$DW$675       .dwtag  DW_TAG_member
    9522                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$32)
    9523                      .dwattr $C$DW$675, DW_AT_name("deviceQualDescr")
    9524                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_deviceQualDescr")
    9525                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    9526                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    9527              $C$DW$676       .dwtag  DW_TAG_member
    9528                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$32)
    9529                      .dwattr $C$DW$676, DW_AT_name("confDescr")
    9530                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_confDescr")
    9531                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    9532                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    9533              $C$DW$677       .dwtag  DW_TAG_member
    9534                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$32)
    9535                      .dwattr $C$DW$677, DW_AT_name("massStorageIntDescr")
    9536                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_massStorageIntDescr")
    9537                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    9538                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    9539              $C$DW$678       .dwtag  DW_TAG_member
    9540                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$33)
    9541                      .dwattr $C$DW$678, DW_AT_name("massStorageBulkOutEndptDescr")
    9542                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_massStorageBulkOutEndptDescr")
    9543                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    9544                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    9545              $C$DW$679       .dwtag  DW_TAG_member
    9546                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$34)
    9547                      .dwattr $C$DW$679, DW_AT_name("massStorageInterfcLnk")
    9548                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_massStorageInterfcLnk")
    9549                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    9550                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    9551              $C$DW$680       .dwtag  DW_TAG_member
    9552                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$33)
    9553                      .dwattr $C$DW$680, DW_AT_name("massStorageBulkInEndptDescr")
    9554                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_massStorageBulkInEndptDescr")
    9555                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    9556                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    9557              $C$DW$681       .dwtag  DW_TAG_member
    9558                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$34)
    9559                      .dwattr $C$DW$681, DW_AT_name("massStorageBulkOutEndptLnk")
    9560                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_massStorageBulkOutEndptLnk")
    9561                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    9562                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    9563              $C$DW$682       .dwtag  DW_TAG_member
    9564                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$35)
    9565                      .dwattr $C$DW$682, DW_AT_name("stringDescrLangid")
    9566                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_stringDescrLangid")
    9567                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    9568                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    9569              $C$DW$683       .dwtag  DW_TAG_member
    9570                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$25)
    9571                      .dwattr $C$DW$683, DW_AT_name("curConfigStat")
    9572                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_curConfigStat")
    9573                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    9574                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  230

    9575              $C$DW$684       .dwtag  DW_TAG_member
    9576                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$34)
    9577                      .dwattr $C$DW$684, DW_AT_name("massStorageBulkInEndptLnk")
    9578                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_massStorageBulkInEndptLnk")
    9579                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    9580                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    9581              $C$DW$685       .dwtag  DW_TAG_member
    9582                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$33)
    9583                      .dwattr $C$DW$685, DW_AT_name("ctrlBuffer")
    9584                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ctrlBuffer")
    9585                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    9586                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    9587              $C$DW$686       .dwtag  DW_TAG_member
    9588                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$34)
    9589                      .dwattr $C$DW$686, DW_AT_name("configDescrLnk")
    9590                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_configDescrLnk")
    9591                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    9592                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    9593              $C$DW$687       .dwtag  DW_TAG_member
    9594                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$38)
    9595                      .dwattr $C$DW$687, DW_AT_name("strDescr")
    9596                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_strDescr")
    9597                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    9598                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    9599              $C$DW$688       .dwtag  DW_TAG_member
    9600                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$40)
    9601                      .dwattr $C$DW$688, DW_AT_name("mscReqTable")
    9602                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_mscReqTable")
    9603                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    9604                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    9605              $C$DW$689       .dwtag  DW_TAG_member
    9606                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$45)
    9607                      .dwattr $C$DW$689, DW_AT_name("fpRequestHandler")
    9608                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_fpRequestHandler")
    9609                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    9610                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    9611              $C$DW$690       .dwtag  DW_TAG_member
    9612                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$46)
    9613                      .dwattr $C$DW$690, DW_AT_name("usbSpeedCfg")
    9614                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_usbSpeedCfg")
    9615                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    9616                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    9617              $C$DW$691       .dwtag  DW_TAG_member
    9618                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$47)
    9619                      .dwattr $C$DW$691, DW_AT_name("pCfgDescr")
    9620                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_pCfgDescr")
    9621                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    9622                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    9623              $C$DW$692       .dwtag  DW_TAG_member
    9624                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$47)
    9625                      .dwattr $C$DW$692, DW_AT_name("pOtherSpeedCfgDescr")
    9626                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_pOtherSpeedCfgDescr")
    9627                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    9628                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    9629                      .dwendtag $C$DW$T$48
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  231

    9630              
    9631              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscCtrlObject")
    9632                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$48)
    9633                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    9634              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    9635                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$19)
    9636                      .dwattr $C$DW$T$99, DW_AT_address_class(0x17)
    9637              
    9638              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    9639                      .dwattr $C$DW$T$64, DW_AT_name("CSL_MscInitStructApp")
    9640                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x1e)
    9641              $C$DW$693       .dwtag  DW_TAG_member
    9642                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$3)
    9643                      .dwattr $C$DW$693, DW_AT_name("pMscObj")
    9644                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_pMscObj")
    9645                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9646                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    9647              $C$DW$694       .dwtag  DW_TAG_member
    9648                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$25)
    9649                      .dwattr $C$DW$694, DW_AT_name("pId")
    9650                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_pId")
    9651                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9652                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    9653              $C$DW$695       .dwtag  DW_TAG_member
    9654                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$25)
    9655                      .dwattr $C$DW$695, DW_AT_name("vId")
    9656                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_vId")
    9657                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9658                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    9659              $C$DW$696       .dwtag  DW_TAG_member
    9660                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$25)
    9661                      .dwattr $C$DW$696, DW_AT_name("numLun")
    9662                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_numLun")
    9663                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9664                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    9665              $C$DW$697       .dwtag  DW_TAG_member
    9666                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$38)
    9667                      .dwattr $C$DW$697, DW_AT_name("strDescrApp")
    9668                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_strDescrApp")
    9669                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9670                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    9671              $C$DW$698       .dwtag  DW_TAG_member
    9672                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$47)
    9673                      .dwattr $C$DW$698, DW_AT_name("lbaBufferApp")
    9674                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_lbaBufferApp")
    9675                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9676                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    9677              $C$DW$699       .dwtag  DW_TAG_member
    9678                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$40)
    9679                      .dwattr $C$DW$699, DW_AT_name("mscReqTableApp")
    9680                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_mscReqTableApp")
    9681                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9682                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    9683              $C$DW$700       .dwtag  DW_TAG_member
    9684                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$50)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  232

    9685                      .dwattr $C$DW$700, DW_AT_name("bulkHandler")
    9686                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_bulkHandler")
    9687                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9688                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    9689              $C$DW$701       .dwtag  DW_TAG_member
    9690                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$50)
    9691                      .dwattr $C$DW$701, DW_AT_name("ctrlHandler")
    9692                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ctrlHandler")
    9693                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9694                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    9695              $C$DW$702       .dwtag  DW_TAG_member
    9696                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$55)
    9697                      .dwattr $C$DW$702, DW_AT_name("readMediaApp")
    9698                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_readMediaApp")
    9699                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9700                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    9701              $C$DW$703       .dwtag  DW_TAG_member
    9702                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$55)
    9703                      .dwattr $C$DW$703, DW_AT_name("writeMediaApp")
    9704                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_writeMediaApp")
    9705                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9706                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    9707              $C$DW$704       .dwtag  DW_TAG_member
    9708                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$57)
    9709                      .dwattr $C$DW$704, DW_AT_name("mediaGetPresentStateApp")
    9710                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_mediaGetPresentStateApp")
    9711                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9712                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    9713              $C$DW$705       .dwtag  DW_TAG_member
    9714                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$57)
    9715                      .dwattr $C$DW$705, DW_AT_name("mediaInitApp")
    9716                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_mediaInitApp")
    9717                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9718                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    9719              $C$DW$706       .dwtag  DW_TAG_member
    9720                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$57)
    9721                      .dwattr $C$DW$706, DW_AT_name("mediaEjectApp")
    9722                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_mediaEjectApp")
    9723                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9724                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    9725              $C$DW$707       .dwtag  DW_TAG_member
    9726                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$61)
    9727                      .dwattr $C$DW$707, DW_AT_name("mediaLockUnitApp")
    9728                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_mediaLockUnitApp")
    9729                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    9730                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    9731              $C$DW$708       .dwtag  DW_TAG_member
    9732                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$63)
    9733                      .dwattr $C$DW$708, DW_AT_name("getMediaSizeApp")
    9734                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_getMediaSizeApp")
    9735                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9736                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    9737                      .dwendtag $C$DW$T$64
    9738              
    9739              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscInitStructApp")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  233

    9740                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$64)
    9741                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    9742              $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    9743                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    9744                      .dwattr $C$DW$T$101, DW_AT_address_class(0x17)
    9745              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("pMscAppClassHandle")
    9746                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    9747                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    9748              
    9749              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    9750                      .dwattr $C$DW$T$66, DW_AT_name("CSL_MscLogicalUnit")
    9751                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x3e)
    9752              $C$DW$709       .dwtag  DW_TAG_member
    9753                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$65)
    9754                      .dwattr $C$DW$709, DW_AT_name("scsiInquiryData")
    9755                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_scsiInquiryData")
    9756                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9757                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    9758              $C$DW$710       .dwtag  DW_TAG_member
    9759                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$53)
    9760                      .dwattr $C$DW$710, DW_AT_name("mediaSize")
    9761                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_mediaSize")
    9762                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    9763                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    9764              $C$DW$711       .dwtag  DW_TAG_member
    9765                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$53)
    9766                      .dwattr $C$DW$711, DW_AT_name("currLba")
    9767                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_currLba")
    9768                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9769                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    9770              $C$DW$712       .dwtag  DW_TAG_member
    9771                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$53)
    9772                      .dwattr $C$DW$712, DW_AT_name("lbaSize")
    9773                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_lbaSize")
    9774                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    9775                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    9776              $C$DW$713       .dwtag  DW_TAG_member
    9777                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$25)
    9778                      .dwattr $C$DW$713, DW_AT_name("removeable")
    9779                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_removeable")
    9780                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9781                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    9782              $C$DW$714       .dwtag  DW_TAG_member
    9783                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$25)
    9784                      .dwattr $C$DW$714, DW_AT_name("mediaState")
    9785                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_mediaState")
    9786                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    9787                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    9788              $C$DW$715       .dwtag  DW_TAG_member
    9789                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$25)
    9790                      .dwattr $C$DW$715, DW_AT_name("readwrite")
    9791                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_readwrite")
    9792                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    9793                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    9794              $C$DW$716       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  234

    9795                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$25)
    9796                      .dwattr $C$DW$716, DW_AT_name("lbaCnt")
    9797                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_lbaCnt")
    9798                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    9799                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    9800              $C$DW$717       .dwtag  DW_TAG_member
    9801                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$25)
    9802                      .dwattr $C$DW$717, DW_AT_name("verifyFlag")
    9803                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_verifyFlag")
    9804                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9805                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    9806                      .dwendtag $C$DW$T$66
    9807              
    9808              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscLogicalUnit")
    9809                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$66)
    9810                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    9811              
    9812              $C$DW$T$70      .dwtag  DW_TAG_array_type
    9813                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    9814                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    9815                      .dwattr $C$DW$T$70, DW_AT_byte_size(0xf8)
    9816              $C$DW$718       .dwtag  DW_TAG_subrange_type
    9817                      .dwattr $C$DW$718, DW_AT_upper_bound(0x03)
    9818                      .dwendtag $C$DW$T$70
    9819              
    9820              
    9821              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    9822                      .dwattr $C$DW$T$68, DW_AT_name("CSL_MscLunAttribApp")
    9823                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x20)
    9824              $C$DW$719       .dwtag  DW_TAG_member
    9825                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$53)
    9826                      .dwattr $C$DW$719, DW_AT_name("lbaSizeApp")
    9827                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_lbaSizeApp")
    9828                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9829                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    9830              $C$DW$720       .dwtag  DW_TAG_member
    9831                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$53)
    9832                      .dwattr $C$DW$720, DW_AT_name("mediaSizeApp")
    9833                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_mediaSizeApp")
    9834                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9835                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    9836              $C$DW$721       .dwtag  DW_TAG_member
    9837                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$25)
    9838                      .dwattr $C$DW$721, DW_AT_name("removeableApp")
    9839                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_removeableApp")
    9840                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9841                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    9842              $C$DW$722       .dwtag  DW_TAG_member
    9843                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$67)
    9844                      .dwattr $C$DW$722, DW_AT_name("scsiInquiryConfData")
    9845                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_scsiInquiryConfData")
    9846                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9847                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    9848              $C$DW$723       .dwtag  DW_TAG_member
    9849                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$25)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  235

    9850                      .dwattr $C$DW$723, DW_AT_name("mediaStateApp")
    9851                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_mediaStateApp")
    9852                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    9853                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    9854              $C$DW$724       .dwtag  DW_TAG_member
    9855                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$25)
    9856                      .dwattr $C$DW$724, DW_AT_name("readwriteApp")
    9857                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_readwriteApp")
    9858                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    9859                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    9860                      .dwendtag $C$DW$T$68
    9861              
    9862              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscLunAttribApp")
    9863                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$68)
    9864                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    9865              $C$DW$T$106     .dwtag  DW_TAG_pointer_type
    9866                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
    9867                      .dwattr $C$DW$T$106, DW_AT_address_class(0x17)
    9868              
    9869              $C$DW$T$73      .dwtag  DW_TAG_structure_type
    9870                      .dwattr $C$DW$T$73, DW_AT_name("CSL_MscObject")
    9871                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x16a)
    9872              $C$DW$725       .dwtag  DW_TAG_member
    9873                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$55)
    9874                      .dwattr $C$DW$725, DW_AT_name("readMedia")
    9875                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_readMedia")
    9876                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9877                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    9878              $C$DW$726       .dwtag  DW_TAG_member
    9879                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$55)
    9880                      .dwattr $C$DW$726, DW_AT_name("writeMedia")
    9881                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_writeMedia")
    9882                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9883                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    9884              $C$DW$727       .dwtag  DW_TAG_member
    9885                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$57)
    9886                      .dwattr $C$DW$727, DW_AT_name("mediaGetPresentState")
    9887                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_mediaGetPresentState")
    9888                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9889                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    9890              $C$DW$728       .dwtag  DW_TAG_member
    9891                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$57)
    9892                      .dwattr $C$DW$728, DW_AT_name("mediaInit")
    9893                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_mediaInit")
    9894                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9895                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    9896              $C$DW$729       .dwtag  DW_TAG_member
    9897                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$57)
    9898                      .dwattr $C$DW$729, DW_AT_name("mediaEject")
    9899                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_mediaEject")
    9900                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9901                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    9902              $C$DW$730       .dwtag  DW_TAG_member
    9903                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$61)
    9904                      .dwattr $C$DW$730, DW_AT_name("mediaLockUnit")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  236

    9905                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_mediaLockUnit")
    9906                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9907                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    9908              $C$DW$731       .dwtag  DW_TAG_member
    9909                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$63)
    9910                      .dwattr $C$DW$731, DW_AT_name("getMediaSize")
    9911                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_getMediaSize")
    9912                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9913                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    9914              $C$DW$732       .dwtag  DW_TAG_member
    9915                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$47)
    9916                      .dwattr $C$DW$732, DW_AT_name("lbaBuffer")
    9917                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_lbaBuffer")
    9918                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9919                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    9920              $C$DW$733       .dwtag  DW_TAG_member
    9921                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$53)
    9922                      .dwattr $C$DW$733, DW_AT_name("cbwDataTransferLength")
    9923                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_cbwDataTransferLength")
    9924                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9925                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    9926              $C$DW$734       .dwtag  DW_TAG_member
    9927                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$70)
    9928                      .dwattr $C$DW$734, DW_AT_name("lun")
    9929                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_lun")
    9930                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9931                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    9932              $C$DW$735       .dwtag  DW_TAG_member
    9933                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$71)
    9934                      .dwattr $C$DW$735, DW_AT_name("senseData")
    9935                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_senseData")
    9936                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    9937                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    9938              $C$DW$736       .dwtag  DW_TAG_member
    9939                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$25)
    9940                      .dwattr $C$DW$736, DW_AT_name("activityPresentFlag")
    9941                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_activityPresentFlag")
    9942                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x119]
    9943                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    9944              $C$DW$737       .dwtag  DW_TAG_member
    9945                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$72)
    9946                      .dwattr $C$DW$737, DW_AT_name("csw")
    9947                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_csw")
    9948                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
    9949                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    9950              $C$DW$738       .dwtag  DW_TAG_member
    9951                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$32)
    9952                      .dwattr $C$DW$738, DW_AT_name("readCapacity")
    9953                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_readCapacity")
    9954                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x122]
    9955                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    9956              $C$DW$739       .dwtag  DW_TAG_member
    9957                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$30)
    9958                      .dwattr $C$DW$739, DW_AT_name("cbw")
    9959                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_cbw")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  237

    9960                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    9961                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    9962              $C$DW$740       .dwtag  DW_TAG_member
    9963                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$22)
    9964                      .dwattr $C$DW$740, DW_AT_name("bulkInEpObj")
    9965                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_bulkInEpObj")
    9966                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
    9967                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    9968              $C$DW$741       .dwtag  DW_TAG_member
    9969                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$22)
    9970                      .dwattr $C$DW$741, DW_AT_name("bulkOutEpObj")
    9971                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_bulkOutEpObj")
    9972                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x14e]
    9973                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    9974              $C$DW$742       .dwtag  DW_TAG_member
    9975                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$25)
    9976                      .dwattr $C$DW$742, DW_AT_name("noOfLun")
    9977                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_noOfLun")
    9978                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x162]
    9979                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    9980              $C$DW$743       .dwtag  DW_TAG_member
    9981                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$25)
    9982                      .dwattr $C$DW$743, DW_AT_name("storageState")
    9983                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_storageState")
    9984                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x163]
    9985                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    9986              $C$DW$744       .dwtag  DW_TAG_member
    9987                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$33)
    9988                      .dwattr $C$DW$744, DW_AT_name("modeSenseData")
    9989                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_modeSenseData")
    9990                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
    9991                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    9992              $C$DW$745       .dwtag  DW_TAG_member
    9993                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$46)
    9994                      .dwattr $C$DW$745, DW_AT_name("writeToMedia")
    9995                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_writeToMedia")
    9996                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x169]
    9997                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    9998                      .dwendtag $C$DW$T$73
    9999              
   10000              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscObject")
   10001                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$73)
   10002                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
   10003              $C$DW$T$107     .dwtag  DW_TAG_pointer_type
   10004                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$20)
   10005                      .dwattr $C$DW$T$107, DW_AT_address_class(0x17)
   10006              
   10007              $C$DW$T$75      .dwtag  DW_TAG_structure_type
   10008                      .dwattr $C$DW$T$75, DW_AT_name("CSL_MscRequestStruct")
   10009                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x04)
   10010              $C$DW$746       .dwtag  DW_TAG_member
   10011                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$74)
   10012                      .dwattr $C$DW$746, DW_AT_name("request")
   10013                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_request")
   10014                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  238

   10015                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
   10016              $C$DW$747       .dwtag  DW_TAG_member
   10017                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$45)
   10018                      .dwattr $C$DW$747, DW_AT_name("fpRequestHandler")
   10019                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_fpRequestHandler")
   10020                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10021                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
   10022                      .dwendtag $C$DW$T$75
   10023              
   10024              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_MscRequestStruct")
   10025                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$75)
   10026                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
   10027              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
   10028                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
   10029                      .dwattr $C$DW$T$40, DW_AT_address_class(0x17)
   10030              
   10031              $C$DW$T$77      .dwtag  DW_TAG_structure_type
   10032                      .dwattr $C$DW$T$77, DW_AT_name("CSL_UsbDataStruct")
   10033                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x06)
   10034              $C$DW$748       .dwtag  DW_TAG_member
   10035                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$25)
   10036                      .dwattr $C$DW$748, DW_AT_name("bytes")
   10037                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_bytes")
   10038                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10039                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
   10040              $C$DW$749       .dwtag  DW_TAG_member
   10041                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$47)
   10042                      .dwattr $C$DW$749, DW_AT_name("pBuffer")
   10043                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_pBuffer")
   10044                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10045                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
   10046              $C$DW$750       .dwtag  DW_TAG_member
   10047                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$76)
   10048                      .dwattr $C$DW$750, DW_AT_name("pNextBuffer")
   10049                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_pNextBuffer")
   10050                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10051                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
   10052                      .dwendtag $C$DW$T$77
   10053              
   10054              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDataStruct")
   10055                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$77)
   10056                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
   10057              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
   10058                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$34)
   10059                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
   10060              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
   10061                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$77)
   10062                      .dwattr $C$DW$T$76, DW_AT_address_class(0x17)
   10063              
   10064              $C$DW$T$84      .dwtag  DW_TAG_structure_type
   10065                      .dwattr $C$DW$T$84, DW_AT_name("CSL_UsbEpObj")
   10066                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x14)
   10067              $C$DW$751       .dwtag  DW_TAG_member
   10068                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$79)
   10069                      .dwattr $C$DW$751, DW_AT_name("epNum")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  239

   10070                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_epNum")
   10071                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10072                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
   10073              $C$DW$752       .dwtag  DW_TAG_member
   10074                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$81)
   10075                      .dwattr $C$DW$752, DW_AT_name("xferType")
   10076                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_xferType")
   10077                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10078                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
   10079              $C$DW$753       .dwtag  DW_TAG_member
   10080                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$25)
   10081                      .dwattr $C$DW$753, DW_AT_name("maxPktSiz")
   10082                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_maxPktSiz")
   10083                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10084                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
   10085              $C$DW$754       .dwtag  DW_TAG_member
   10086                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$25)
   10087                      .dwattr $C$DW$754, DW_AT_name("eventMask")
   10088                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_eventMask")
   10089                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10090                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
   10091              $C$DW$755       .dwtag  DW_TAG_member
   10092                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$82)
   10093                      .dwattr $C$DW$755, DW_AT_name("fxn")
   10094                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_fxn")
   10095                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10096                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
   10097              $C$DW$756       .dwtag  DW_TAG_member
   10098                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$25)
   10099                      .dwattr $C$DW$756, DW_AT_name("dataFlags")
   10100                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_dataFlags")
   10101                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10102                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
   10103              $C$DW$757       .dwtag  DW_TAG_member
   10104                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$25)
   10105                      .dwattr $C$DW$757, DW_AT_name("status")
   10106                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_status")
   10107                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10108                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
   10109              $C$DW$758       .dwtag  DW_TAG_member
   10110                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$25)
   10111                      .dwattr $C$DW$758, DW_AT_name("epDescRegSAddr")
   10112                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_epDescRegSAddr")
   10113                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10114                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
   10115              $C$DW$759       .dwtag  DW_TAG_member
   10116                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$25)
   10117                      .dwattr $C$DW$759, DW_AT_name("dmaRegSAddr")
   10118                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_dmaRegSAddr")
   10119                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   10120                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
   10121              $C$DW$760       .dwtag  DW_TAG_member
   10122                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$25)
   10123                      .dwattr $C$DW$760, DW_AT_name("totByteCnt")
   10124                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_totByteCnt")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  240

   10125                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10126                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
   10127              $C$DW$761       .dwtag  DW_TAG_member
   10128                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$25)
   10129                      .dwattr $C$DW$761, DW_AT_name("byteInThisSeg")
   10130                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_byteInThisSeg")
   10131                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10132                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
   10133              $C$DW$762       .dwtag  DW_TAG_member
   10134                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$47)
   10135                      .dwattr $C$DW$762, DW_AT_name("xferBytCnt")
   10136                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_xferBytCnt")
   10137                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10138                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
   10139              $C$DW$763       .dwtag  DW_TAG_member
   10140                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$47)
   10141                      .dwattr $C$DW$763, DW_AT_name("pBuffer")
   10142                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_pBuffer")
   10143                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10144                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
   10145              $C$DW$764       .dwtag  DW_TAG_member
   10146                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$83)
   10147                      .dwattr $C$DW$764, DW_AT_name("pNextBuffer")
   10148                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_pNextBuffer")
   10149                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10150                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
   10151              $C$DW$765       .dwtag  DW_TAG_member
   10152                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$25)
   10153                      .dwattr $C$DW$765, DW_AT_name("eventFlag")
   10154                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_eventFlag")
   10155                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10156                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
   10157                      .dwendtag $C$DW$T$84
   10158              
   10159              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpObj")
   10160                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$84)
   10161                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
   10162              $C$DW$T$26      .dwtag  DW_TAG_pointer_type
   10163                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
   10164                      .dwattr $C$DW$T$26, DW_AT_address_class(0x17)
   10165              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("pUsbEpHandle")
   10166                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
   10167                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
   10168              
   10169              $C$DW$T$28      .dwtag  DW_TAG_array_type
   10170                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
   10171                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
   10172                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
   10173              $C$DW$766       .dwtag  DW_TAG_subrange_type
   10174                      .dwattr $C$DW$766, DW_AT_upper_bound(0x04)
   10175                      .dwendtag $C$DW$T$28
   10176              
   10177              $C$DW$T$108     .dwtag  DW_TAG_pointer_type
   10178                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$27)
   10179                      .dwattr $C$DW$T$108, DW_AT_address_class(0x17)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  241

   10180              
   10181              $C$DW$T$85      .dwtag  DW_TAG_structure_type
   10182                      .dwattr $C$DW$T$85, DW_AT_name("CSL_UsbSetupStruct")
   10183                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x06)
   10184              $C$DW$767       .dwtag  DW_TAG_member
   10185                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$10)
   10186                      .dwattr $C$DW$767, DW_AT_name("newPacket")
   10187                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_newPacket")
   10188                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10189                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
   10190              $C$DW$768       .dwtag  DW_TAG_member
   10191                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$25)
   10192                      .dwattr $C$DW$768, DW_AT_name("bmRequestType")
   10193                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_bmRequestType")
   10194                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10195                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
   10196              $C$DW$769       .dwtag  DW_TAG_member
   10197                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$25)
   10198                      .dwattr $C$DW$769, DW_AT_name("bRequest")
   10199                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_bRequest")
   10200                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10201                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
   10202              $C$DW$770       .dwtag  DW_TAG_member
   10203                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$25)
   10204                      .dwattr $C$DW$770, DW_AT_name("wValue")
   10205                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_wValue")
   10206                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10207                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
   10208              $C$DW$771       .dwtag  DW_TAG_member
   10209                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$25)
   10210                      .dwattr $C$DW$771, DW_AT_name("wIndex")
   10211                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_wIndex")
   10212                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10213                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
   10214              $C$DW$772       .dwtag  DW_TAG_member
   10215                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$25)
   10216                      .dwattr $C$DW$772, DW_AT_name("wLength")
   10217                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_wLength")
   10218                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10219                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
   10220                      .dwendtag $C$DW$T$85
   10221              
   10222              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbSetupStruct")
   10223                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$85)
   10224                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
   10225              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
   10226                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$29)
   10227                      .dwattr $C$DW$T$43, DW_AT_address_class(0x17)
   10228              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
   10229                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
   10230              
   10231              $C$DW$T$49      .dwtag  DW_TAG_subroutine_type
   10232                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
   10233              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
   10234                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:10 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_msc.asm                                                          PAGE  242

   10235                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
   10236              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_USB_EVENT_ISR")
   10237                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$50)
   10238                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   10239              $C$DW$773       .dwtag  DW_TAG_TI_far_type
   10240              $C$DW$T$110     .dwtag  DW_TAG_const_type
   10241                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$773)
   10242              $C$DW$T$111     .dwtag  DW_TAG_pointer_type
   10243                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
   10244                      .dwattr $C$DW$T$111, DW_AT_address_class(0x17)
   10245              $C$DW$T$4       .dwtag  DW_TAG_base_type
   10246                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
   10247                      .dwattr $C$DW$T$4, DW_AT_name("bool")
   10248                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
   10249              $C$DW$T$5       .dwtag  DW_TAG_base_type
   10250                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
   10251                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
   10252                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
   10253              $C$DW$T$6       .dwtag  DW_TAG_base_type
   10254                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
   10255                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
   10256                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
   10257              $C$DW$T$7       .dwtag  DW_TAG_base_type
   10258                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
   10259                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
   10260                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
   10261              $C$DW$T$8       .dwtag  DW_TAG_base_type
   10262                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
   10263                      .dwattr $C$DW$T$8, DW_AT_name("short")
   10264                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
   10265              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
   10266                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$8)
   10267                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
   10268              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
   10269                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
   10270                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
