TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE    1

    1610              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Sat Sep 08 17:42:13 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

     733 000245 E604          MOV #0, *SP(#2) ; |376| 
         000247 00   
     734                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 378,column 2,is_stmt
     735 000248 ED00          MOV dbl(*SP(#0)), XAR3
         00024a BF   
     736              
     737 00024b 90B0          MOV XAR3, AC0
     738 00024d 3D01  ||      MOV #0, AC1 ; |378| 
     739              
     740 00024f 121C          CMPU AC1 != AC0, TC1 ; |378| 
         000251 04   
     741 000252 6464          BCC $C$L17,TC1 ; |378| 
     742                                                      ; branchcc occurs ; |378| 
     743                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 380,column 3,is_stmt
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   17

     744 000254 E604          MOV #-5, *SP(#2) ; |380| 
         000256 FB   
     745                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 381,column 3,is_stmt
     746 000257 A404          MOV *SP(#2), T0 ; |381| 
     747 000259 0600          B $C$L18  ; |381| 
         00025b 4C   
     748                                                      ; branch occurs ; |381| 
     749 00025c       $C$L17:    
     750                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 385,column 5,is_stmt
     751 00025c 7600          MOV #31, T0 ; |385| 
         00025e 1F48 
     752 000260 AB79          MOV *AR3(short(#4)), AR3 ; |385| 
     753 000262 A96B          MOV port(*AR3(T0)), AR1 ; |385| 
         000264 99   
     754 000265 ED00          MOV dbl(*SP(#0)), XAR3
         000267 BF   
     755 000268 AB79          MOV *AR3(short(#4)), AR3 ; |385| 
     756 00026a EC00          BCLR @#0, AR1 ; |385| 
         00026c 92   
     757 00026d C96B          MOV AR1, port(*AR3(T0)) ; |385| 
         00026f 9A   
     758                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 388,column 5,is_stmt
     759 000270 ED00          MOV dbl(*SP(#0)), XAR3
         000272 BF   
     760 000273 7600          MOV #32, T0 ; |388| 
         000275 2048 
     761 000277 AB79          MOV *AR3(short(#4)), AR3 ; |388| 
     762 000279 FB6B          MOV #4096, port(*AR3(T0)) ; |388| 
         00027b 1000 
         00027d 9A   
     763                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 389,column 2,is_stmt
     764 00027e ED00          MOV dbl(*SP(#0)), XAR3
         000280 BF   
     765 000281 7600          MOV #33, T0 ; |389| 
         000283 2148 
     766 000285 AB79          MOV *AR3(short(#4)), AR3 ; |389| 
     767 000287 E66B          MOV #0, port(*AR3(T0)) ; |389| 
         000289 00   
         00028a 9A   
     768                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 390,column 2,is_stmt
     769 00028b ED00          MOV dbl(*SP(#0)), XAR3
         00028d BF   
     770 00028e 7600          MOV #35, T0 ; |390| 
         000290 2348 
     771 000292 AB79          MOV *AR3(short(#4)), AR3 ; |390| 
     772 000294 E66B          MOV #0, port(*AR3(T0)) ; |390| 
         000296 00   
         000297 9A   
     773                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 391,column 2,is_stmt
     774 000298 ED00          MOV dbl(*SP(#0)), XAR3
         00029a BF   
     775 00029b 7600          MOV #34, T0 ; |391| 
         00029d 2248 
     776 00029f AB79          MOV *AR3(short(#4)), AR3 ; |391| 
     777 0002a1 FB6B          MOV #2054, port(*AR3(T0)) ; |391| 
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   18

         0002a3 0806 
         0002a5 9A   
     778                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 393,column 2,is_stmt
     779 0002a6 A404          MOV *SP(#2), T0 ; |393| 
     780 0002a8       $C$L18:    
     781                      .dwpsn  file "../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c",line 394,column 1,is_stmt
     782 0002a8 4E03          AADD #3, SP
     783                      .dwcfi  cfa_offset, 1
     784              $C$DW$44        .dwtag  DW_TAG_TI_branch
     785                      .dwattr $C$DW$44, DW_AT_low_pc(0x00)
     786                      .dwattr $C$DW$44, DW_AT_TI_return
     787 0002aa 4804          RET
     788                                                      ; return occurs
     789                      .dwattr $C$DW$40, DW_AT_TI_end_file("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_pll.c")
     790                      .dwattr $C$DW$40, DW_AT_TI_end_line(0x18a)
     791                      .dwattr $C$DW$40, DW_AT_TI_end_column(0x01)
     792                      .dwendentry
     793                      .dwendtag $C$DW$40
     794              
     795              
     796              ;*******************************************************************************
     797              ;* TYPE INFORMATION                                                            *
     798              ;*******************************************************************************
     799              
     800              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     801                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     802              $C$DW$45        .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     804                      .dwattr $C$DW$45, DW_AT_name("PLLCNTL1")
     805                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_PLLCNTL1")
     806                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     807                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     808              $C$DW$46        .dwtag  DW_TAG_member
     809                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     810                      .dwattr $C$DW$46, DW_AT_name("PLLINCNTL")
     811                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_PLLINCNTL")
     812                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     813                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     814              $C$DW$47        .dwtag  DW_TAG_member
     815                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     816                      .dwattr $C$DW$47, DW_AT_name("PLLCNTL2")
     817                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_PLLCNTL2")
     818                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     819                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     820              $C$DW$48        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     822                      .dwattr $C$DW$48, DW_AT_name("PLLOUTCNTL")
     823                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_PLLOUTCNTL")
     824                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     825                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     826                      .dwendtag $C$DW$T$20
     827              
     828              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
     829                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
     830                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   19

     831              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
     832                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     833                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
     834              
     835              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     836                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
     837              $C$DW$49        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     839                      .dwattr $C$DW$49, DW_AT_name("EBSR")
     840                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_EBSR")
     841                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     843              $C$DW$50        .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     845                      .dwattr $C$DW$50, DW_AT_name("RSVD0")
     846                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_RSVD0")
     847                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     848                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     849              $C$DW$51        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     851                      .dwattr $C$DW$51, DW_AT_name("PCGCR1")
     852                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PCGCR1")
     853                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     854                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     855              $C$DW$52        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
     857                      .dwattr $C$DW$52, DW_AT_name("PCGCR2")
     858                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_PCGCR2")
     859                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     860                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     861              $C$DW$53        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     863                      .dwattr $C$DW$53, DW_AT_name("PSRCR")
     864                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PSRCR")
     865                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     866                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     867              $C$DW$54        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
     869                      .dwattr $C$DW$54, DW_AT_name("PRCR")
     870                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PRCR")
     871                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     872                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     873              $C$DW$55        .dwtag  DW_TAG_member
     874                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$22)
     875                      .dwattr $C$DW$55, DW_AT_name("RSVD1")
     876                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_RSVD1")
     877                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     878                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     879              $C$DW$56        .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
     881                      .dwattr $C$DW$56, DW_AT_name("TIAFR")
     882                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_TIAFR")
     883                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     884                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     885              $C$DW$57        .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   20

     886                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     887                      .dwattr $C$DW$57, DW_AT_name("RSVD2")
     888                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_RSVD2")
     889                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     890                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     891              $C$DW$58        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     893                      .dwattr $C$DW$58, DW_AT_name("ODSCR")
     894                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_ODSCR")
     895                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     896                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     897              $C$DW$59        .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     899                      .dwattr $C$DW$59, DW_AT_name("PDINHIBR1")
     900                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PDINHIBR1")
     901                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     902                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     903              $C$DW$60        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
     905                      .dwattr $C$DW$60, DW_AT_name("PDINHIBR2")
     906                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PDINHIBR2")
     907                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     908                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     909              $C$DW$61        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     911                      .dwattr $C$DW$61, DW_AT_name("PDINHIBR3")
     912                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PDINHIBR3")
     913                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     914                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     915              $C$DW$62        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$21)
     917                      .dwattr $C$DW$62, DW_AT_name("DMA0CESR1")
     918                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_DMA0CESR1")
     919                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     920                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     921              $C$DW$63        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
     923                      .dwattr $C$DW$63, DW_AT_name("DMA0CESR2")
     924                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_DMA0CESR2")
     925                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     926                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     927              $C$DW$64        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$21)
     929                      .dwattr $C$DW$64, DW_AT_name("DMA1CESR1")
     930                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_DMA1CESR1")
     931                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     932                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     933              $C$DW$65        .dwtag  DW_TAG_member
     934                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
     935                      .dwattr $C$DW$65, DW_AT_name("DMA1CESR2")
     936                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_DMA1CESR2")
     937                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     938                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     939              $C$DW$66        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   21

     941                      .dwattr $C$DW$66, DW_AT_name("SDRAMCCR")
     942                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_SDRAMCCR")
     943                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     944                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     945              $C$DW$67        .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
     947                      .dwattr $C$DW$67, DW_AT_name("CCR2")
     948                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_CCR2")
     949                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     950                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     951              $C$DW$68        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
     953                      .dwattr $C$DW$68, DW_AT_name("CGCR1")
     954                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_CGCR1")
     955                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     956                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     957              $C$DW$69        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
     959                      .dwattr $C$DW$69, DW_AT_name("CGICR")
     960                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_CGICR")
     961                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
     962                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     963              $C$DW$70        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
     965                      .dwattr $C$DW$70, DW_AT_name("CGCR2")
     966                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_CGCR2")
     967                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     968                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     969              $C$DW$71        .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
     971                      .dwattr $C$DW$71, DW_AT_name("CGOCR")
     972                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_CGOCR")
     973                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
     974                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     975              $C$DW$72        .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
     977                      .dwattr $C$DW$72, DW_AT_name("CCSSR")
     978                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CCSSR")
     979                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     980                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     981              $C$DW$73        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
     983                      .dwattr $C$DW$73, DW_AT_name("RSVD3")
     984                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_RSVD3")
     985                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
     986                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     987              $C$DW$74        .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
     989                      .dwattr $C$DW$74, DW_AT_name("ECDR")
     990                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ECDR")
     991                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     992                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     993              $C$DW$75        .dwtag  DW_TAG_member
     994                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
     995                      .dwattr $C$DW$75, DW_AT_name("RSVD4")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   22

     996                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_RSVD4")
     997                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
     998                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     999              $C$DW$76        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
    1001                      .dwattr $C$DW$76, DW_AT_name("RAMSLPMDCNTLR1")
    1002                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    1003                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1004                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1005              $C$DW$77        .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
    1007                      .dwattr $C$DW$77, DW_AT_name("RSVD5")
    1008                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_RSVD5")
    1009                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1010                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1011              $C$DW$78        .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
    1013                      .dwattr $C$DW$78, DW_AT_name("RAMSLPMDCNTLR2")
    1014                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    1015                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1016                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$79        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
    1019                      .dwattr $C$DW$79, DW_AT_name("RAMSLPMDCNTLR3")
    1020                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    1021                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1022                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1023              $C$DW$80        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1025                      .dwattr $C$DW$80, DW_AT_name("RAMSLPMDCNTLR4")
    1026                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    1027                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1028                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1029              $C$DW$81        .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
    1031                      .dwattr $C$DW$81, DW_AT_name("RAMSLPMDCNTLR5")
    1032                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    1033                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1034                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1035              $C$DW$82        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$23)
    1037                      .dwattr $C$DW$82, DW_AT_name("RSVD6")
    1038                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_RSVD6")
    1039                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1040                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1041              $C$DW$83        .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1043                      .dwattr $C$DW$83, DW_AT_name("DMAIFR")
    1044                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_DMAIFR")
    1045                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1046                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1047              $C$DW$84        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1049                      .dwattr $C$DW$84, DW_AT_name("DMAIER")
    1050                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_DMAIER")
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   23

    1051                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1052                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1053              $C$DW$85        .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
    1055                      .dwattr $C$DW$85, DW_AT_name("USBSCR")
    1056                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_USBSCR")
    1057                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1058                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1059              $C$DW$86        .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1061                      .dwattr $C$DW$86, DW_AT_name("ESCR")
    1062                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ESCR")
    1063                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    1064                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1065              $C$DW$87        .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$23)
    1067                      .dwattr $C$DW$87, DW_AT_name("RSVD7")
    1068                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_RSVD7")
    1069                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1070                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1071              $C$DW$88        .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1073                      .dwattr $C$DW$88, DW_AT_name("DMA2CESR1")
    1074                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_DMA2CESR1")
    1075                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1076                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1077              $C$DW$89        .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
    1079                      .dwattr $C$DW$89, DW_AT_name("DMA2CESR2")
    1080                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_DMA2CESR2")
    1081                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1082                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1083              $C$DW$90        .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1085                      .dwattr $C$DW$90, DW_AT_name("DMA3CESR1")
    1086                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_DMA3CESR1")
    1087                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1088                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1089              $C$DW$91        .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
    1091                      .dwattr $C$DW$91, DW_AT_name("DMA3CESR2")
    1092                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_DMA3CESR2")
    1093                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    1094                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1095              $C$DW$92        .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1097                      .dwattr $C$DW$92, DW_AT_name("CLKSTOP")
    1098                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_CLKSTOP")
    1099                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1100                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1101              $C$DW$93        .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$24)
    1103                      .dwattr $C$DW$93, DW_AT_name("RSVD8")
    1104                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_RSVD8")
    1105                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   24

    1106                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1107              $C$DW$94        .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
    1109                      .dwattr $C$DW$94, DW_AT_name("DIEIDR0")
    1110                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_DIEIDR0")
    1111                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1112                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1113              $C$DW$95        .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
    1115                      .dwattr $C$DW$95, DW_AT_name("DIEIDR1")
    1116                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_DIEIDR1")
    1117                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    1118                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1119              $C$DW$96        .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
    1121                      .dwattr $C$DW$96, DW_AT_name("DIEIDR2")
    1122                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_DIEIDR2")
    1123                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1124                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1125              $C$DW$97        .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
    1127                      .dwattr $C$DW$97, DW_AT_name("DIEIDR3")
    1128                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_DIEIDR3")
    1129                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    1130                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1131              $C$DW$98        .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$21)
    1133                      .dwattr $C$DW$98, DW_AT_name("DIEIDR4")
    1134                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_DIEIDR4")
    1135                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1136                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$99        .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$21)
    1139                      .dwattr $C$DW$99, DW_AT_name("DIEIDR5")
    1140                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_DIEIDR5")
    1141                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    1142                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1143              $C$DW$100       .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    1145                      .dwattr $C$DW$100, DW_AT_name("DIEIDR6")
    1146                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_DIEIDR6")
    1147                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1148                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$101       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
    1151                      .dwattr $C$DW$101, DW_AT_name("DIEIDR7")
    1152                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_DIEIDR7")
    1153                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    1154                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1155                      .dwendtag $C$DW$T$25
    1156              
    1157              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
    1158                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    1159                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1160              $C$DW$102       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   25

    1161                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$29)
    1162              $C$DW$103       .dwtag  DW_TAG_TI_ioport_type
    1163                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$102)
    1164              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    1165                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$103)
    1166              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1167                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1168                      .dwattr $C$DW$T$31, DW_AT_address_class(0x10)
    1169              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    1170                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1171                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1172              
    1173              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1174                      .dwattr $C$DW$T$33, DW_AT_name("PLL_Obj")
    1175                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    1176              $C$DW$104       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$27)
    1178                      .dwattr $C$DW$104, DW_AT_name("pllConfig")
    1179                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_pllConfig")
    1180                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1181                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1182              $C$DW$105       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    1184                      .dwattr $C$DW$105, DW_AT_name("instId")
    1185                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_instId")
    1186                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1187                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1188              $C$DW$106       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$32)
    1190                      .dwattr $C$DW$106, DW_AT_name("sysAddr")
    1191                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_sysAddr")
    1192                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1193                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1194                      .dwendtag $C$DW$T$33
    1195              
    1196              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    1197                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1198                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1199              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1200                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1201                      .dwattr $C$DW$T$35, DW_AT_address_class(0x17)
    1202              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1203                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
    1204                      .dwattr $C$DW$T$36, DW_AT_address_class(0x17)
    1205              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    1206                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1207                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1208              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1209                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1210                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1211                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1212              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1213                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1214                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1215                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Sat Sep 08 17:42:14 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
csl_pll.asm                                                          PAGE   26

    1216              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1217                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1218                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1219                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1220              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1221                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1222                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1223                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1224              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1225                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1226                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1227                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1228              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    1229                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$8)
    1230                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1231              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    1232                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    1233                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1234              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1235                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1236                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1237                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1238              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1239                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1240                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1241              $C$DW$107       .dwtag  DW_TAG_TI_far_type
    1242                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1243              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
