;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
;* Date/Time created: Fri Aug 19 02:56:40 2016                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../c5535_bsl_revc/ezdsp5535_v1/c55xx_csl/src/csl_cdc.c")

$C$DW$231	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OPMODE_DMA_TXONLY"), DW_AT_const_value(0x02)
	.dwendtag $C$DW$T$85

$C$DW$T$86	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbOpMode")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)

$C$DW$T$92	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$92, DW_AT_byte_size(0x01)
$C$DW$232	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_FALSE"), DW_AT_const_value(0x00)
$C$DW$233	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_TRUE"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$92

$C$DW$T$93	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBoolean")
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)

$C$DW$T$96	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x01)
$C$DW$234	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_UNKNOWN_SPEED"), DW_AT_const_value(0x00)
$C$DW$235	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_FULL_SPEED"), DW_AT_const_value(0x02)
$C$DW$236	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BS_HIGH_SPEED"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$96

$C$DW$T$97	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbBusSpeed")
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)

$C$DW$T$98	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$98, DW_AT_byte_size(0x01)
$C$DW$237	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_IDLE"), DW_AT_const_value(0x00)
$C$DW$238	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_STATUS_IN"), DW_AT_const_value(0x01)
$C$DW$239	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_TX"), DW_AT_const_value(0x02)
$C$DW$240	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_RX"), DW_AT_const_value(0x03)
	.dwendtag $C$DW$T$98

$C$DW$T$99	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEp0State")
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)

$C$DW$T$100	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
$C$DW$241	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
$C$DW$242	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
	.dwendtag $C$DW$T$100

$C$DW$T$101	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)

$C$DW$T$114	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$114, DW_AT_byte_size(0x01)
$C$DW$243	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
$C$DW$244	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
$C$DW$245	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
$C$DW$246	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
$C$DW$247	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
$C$DW$248	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
$C$DW$249	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
$C$DW$250	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
$C$DW$251	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
$C$DW$252	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
$C$DW$253	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
$C$DW$254	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
$C$DW$255	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
$C$DW$256	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
$C$DW$257	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
$C$DW$258	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
	.dwendtag $C$DW$T$114

$C$DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)

$C$DW$T$116	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$116, DW_AT_byte_size(0x01)
$C$DW$259	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
$C$DW$260	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
$C$DW$261	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
$C$DW$262	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
$C$DW$263	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
	.dwendtag $C$DW$T$116

$C$DW$T$117	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
	.dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)

$C$DW$T$132	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$132, DW_AT_byte_size(0x01)
$C$DW$264	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_DONE"), DW_AT_const_value(0x00)
$C$DW$265	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_STALL"), DW_AT_const_value(0x01)
$C$DW$266	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_SEND_ACK"), DW_AT_const_value(0x02)
$C$DW$267	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_GET_ACK"), DW_AT_const_value(0x03)
$C$DW$268	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_DATA_IN"), DW_AT_const_value(0x04)
$C$DW$269	.dwtag  DW_TAG_enumerator, DW_AT_name("CSL_CDC_REQUEST_DATA_OUT"), DW_AT_const_value(0x05)
	.dwendtag $C$DW$T$132

$C$DW$T$133	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CdcRequestRet")
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x06)
$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$270, DW_AT_name("dwBaudRate")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("_dwBaudRate")
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$271, DW_AT_name("wCharFormat")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("_wCharFormat")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$272, DW_AT_name("wParityType")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("_wParityType")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$273, DW_AT_name("wDataBits")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("_wDataBits")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$21

$C$DW$T$83	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CdcLineCoding")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$274, DW_AT_name("TXFUNCADDR")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("_TXFUNCADDR")
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$275, DW_AT_name("TXHUBADDR_TXHUBPORT")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("_TXHUBADDR_TXHUBPORT")
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$276, DW_AT_name("RSVD0")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$277, DW_AT_name("RXFUNCADDR")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("_RXFUNCADDR")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$278, DW_AT_name("RXHUBADDR_RXHUBPORT")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("_RXHUBADDR_RXHUBPORT")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$279, DW_AT_name("RSVD36")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("_RSVD36")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$24

$C$DW$T$41	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEptrgRegs")
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)

$C$DW$T$42	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x28)
$C$DW$280	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$280, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$42


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$281, DW_AT_name("TXMAXP")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("_TXMAXP")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$282, DW_AT_name("PERI_TXCSR")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("_PERI_TXCSR")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$283, DW_AT_name("RSVD0")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$284, DW_AT_name("RXMAXP")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("_RXMAXP")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$285, DW_AT_name("PERI_RXCSR")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("_PERI_RXCSR")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$286, DW_AT_name("RSVD1")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$287, DW_AT_name("RXCOUNT")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("_RXCOUNT")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$288, DW_AT_name("RSVD41")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("_RSVD41")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$26

$C$DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpcsrRegs")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)

$C$DW$T$45	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
$C$DW$289	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$289, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$45


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x20)
$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$290, DW_AT_name("TXGCR1")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("_TXGCR1")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$291, DW_AT_name("TXGCR2")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("_TXGCR2")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$292, DW_AT_name("RSVD0")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$293, DW_AT_name("RXGCR1")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("_RXGCR1")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$294, DW_AT_name("RXGCR2")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("_RXGCR2")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$295, DW_AT_name("RSVD1")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$296, DW_AT_name("RXHPCR1A")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("_RXHPCR1A")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$297, DW_AT_name("RXHPCR2A")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("_RXHPCR2A")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$298, DW_AT_name("RSVD2")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$299, DW_AT_name("RXHPCR1B")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("_RXHPCR1B")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$300, DW_AT_name("RXHPCR2B")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_RXHPCR2B")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$301, DW_AT_name("RSVD46")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_RSVD46")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$29

$C$DW$T$48	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbChannelRegs")
	.dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)

$C$DW$T$49	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x80)
$C$DW$302	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$302, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$49


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$303, DW_AT_name("ENTRYLSW")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_ENTRYLSW")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$304, DW_AT_name("ENTRYMSW")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_ENTRYMSW")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$305, DW_AT_name("RSVD49")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD49")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$30

$C$DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbCdmaschetblwordRegs")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)

$C$DW$T$53	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x100)
$C$DW$306	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$306, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$53


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$307, DW_AT_name("QMEMRBASE1")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_QMEMRBASE1")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$308, DW_AT_name("QMEMRBASE2")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_QMEMRBASE2")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$309, DW_AT_name("RSVD0")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$310, DW_AT_name("QMEMRCTRL1")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_QMEMRCTRL1")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$311, DW_AT_name("QMEMRCTRL2")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_QMEMRCTRL2")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$312, DW_AT_name("RSVD63")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_RSVD63")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$32

$C$DW$T$58	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmmemregrRegs")
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)

$C$DW$T$59	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x100)
$C$DW$313	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$313, DW_AT_upper_bound(0x0f)
	.dwendtag $C$DW$T$59


$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$314, DW_AT_name("RSVD0")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$315, DW_AT_name("CTRL1D")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_CTRL1D")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$316, DW_AT_name("CTRL2D")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_CTRL2D")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$317, DW_AT_name("RSVD65")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_RSVD65")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$34

$C$DW$T$61	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnRegs")
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)

$C$DW$T$62	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x400)
$C$DW$318	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$318, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$62


$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$319, DW_AT_name("QSTATA")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_QSTATA")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$320, DW_AT_name("RSVD0")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$321, DW_AT_name("QSTAT1B")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_QSTAT1B")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$322, DW_AT_name("QSTAT2B")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_QSTAT2B")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$323, DW_AT_name("RSVD1")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$324, DW_AT_name("QSTAT1C")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_QSTAT1C")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$325, DW_AT_name("RSVD67")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_RSVD67")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$36

$C$DW$T$64	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnsRegs")
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)

$C$DW$T$65	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x400)
$C$DW$326	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$326, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$65


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x6c00)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$327, DW_AT_name("REVID1")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_REVID1")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$328, DW_AT_name("REVID2")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_REVID2")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$329, DW_AT_name("RSVD0")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$330, DW_AT_name("CTRLR")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_CTRLR")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$331, DW_AT_name("RSVD1")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$332, DW_AT_name("STATR")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_STATR")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$333, DW_AT_name("RSVD2")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$334, DW_AT_name("EMUR")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_EMUR")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$335, DW_AT_name("RSVD3")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$336, DW_AT_name("MODE1")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_MODE1")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$337, DW_AT_name("MODE2")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_MODE2")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$338, DW_AT_name("RSVD4")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$339, DW_AT_name("AUTOREQ")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_AUTOREQ")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$340, DW_AT_name("RSVD5")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$341, DW_AT_name("SPRFIXTIME1")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_SPRFIXTIME1")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$342, DW_AT_name("SPRFIXTIME2")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_SPRFIXTIME2")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$343, DW_AT_name("RSVD6")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$344, DW_AT_name("TEARDOWN1")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_TEARDOWN1")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$345, DW_AT_name("TEARDOWN2")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_TEARDOWN2")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$346, DW_AT_name("RSVD7")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$347, DW_AT_name("INTSRCR1")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_INTSRCR1")
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$348, DW_AT_name("INTSRCR2")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_INTSRCR2")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$349, DW_AT_name("RSVD8")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$350, DW_AT_name("INTSETR1")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_INTSETR1")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$351, DW_AT_name("INTSETR2")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_INTSETR2")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$352, DW_AT_name("RSVD9")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$353, DW_AT_name("INTCLRR1")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_INTCLRR1")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$354, DW_AT_name("INTCLRR2")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_INTCLRR2")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$355, DW_AT_name("RSVD10")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$356, DW_AT_name("INTMSKR1")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_INTMSKR1")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$357, DW_AT_name("INTMSKR2")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_INTMSKR2")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$358, DW_AT_name("RSVD11")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$359, DW_AT_name("INTMSKSETR1")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_INTMSKSETR1")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$360, DW_AT_name("INTMSKSETR2")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_INTMSKSETR2")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$361, DW_AT_name("RSVD12")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$362, DW_AT_name("INTMSKCLRR1")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_INTMSKCLRR1")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$363, DW_AT_name("INTMSKCLRR2")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_INTMSKCLRR2")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$364, DW_AT_name("RSVD13")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$365, DW_AT_name("INTMASKEDR1")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_INTMASKEDR1")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$366, DW_AT_name("INTMASKEDR2")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_INTMASKEDR2")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$367, DW_AT_name("RSVD14")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_RSVD14")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$368, DW_AT_name("EOIR")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_EOIR")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$369, DW_AT_name("RSVD15")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_RSVD15")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$370, DW_AT_name("INTVECTR1")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_INTVECTR1")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$371, DW_AT_name("INTVECTR2")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_INTVECTR2")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$372, DW_AT_name("RSVD16")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_RSVD16")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$373, DW_AT_name("GREP1SZR1")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_GREP1SZR1")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$374, DW_AT_name("GREP1SZR2")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_GREP1SZR2")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$375, DW_AT_name("RSVD17")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_RSVD17")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$376, DW_AT_name("GREP2SZR1")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_GREP2SZR1")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$377, DW_AT_name("GREP2SZR2")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_GREP2SZR2")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$378, DW_AT_name("RSVD18")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_RSVD18")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$379, DW_AT_name("GREP3SZR1")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_GREP3SZR1")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$380, DW_AT_name("GREP3SZR2")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_GREP3SZR2")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$381, DW_AT_name("RSVD19")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_RSVD19")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$382, DW_AT_name("GREP4SZR1")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_GREP4SZR1")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$383, DW_AT_name("GREP4SZR2")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_GREP4SZR2")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$384, DW_AT_name("RSVD20")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_RSVD20")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$385, DW_AT_name("FADDR_POWER")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_FADDR_POWER")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x401]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$386, DW_AT_name("INTRTX")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_INTRTX")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x402]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$387, DW_AT_name("RSVD21")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_RSVD21")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x403]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$388, DW_AT_name("INTRRX")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_INTRRX")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$389, DW_AT_name("INTRTXE")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_INTRTXE")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$390, DW_AT_name("RSVD22")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_RSVD22")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$391, DW_AT_name("INTRRXE")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_INTRRXE")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x409]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$392, DW_AT_name("INTRUSB_INTRUSBE")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_INTRUSB_INTRUSBE")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x40a]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$393, DW_AT_name("RSVD23")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_RSVD23")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x40b]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$394, DW_AT_name("FRAME")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_FRAME")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x40d]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$395, DW_AT_name("INDEX_TESTMODE")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_INDEX_TESTMODE")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x40e]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$396, DW_AT_name("RSVD24")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_RSVD24")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x40f]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$397, DW_AT_name("TXMAXP_INDX")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_TXMAXP_INDX")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x411]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$398, DW_AT_name("PERI_CSR0_INDX")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_PERI_CSR0_INDX")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x412]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$399, DW_AT_name("RSVD25")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_RSVD25")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x413]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$400, DW_AT_name("RXMAXP_INDX")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_RXMAXP_INDX")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x415]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$401, DW_AT_name("PERI_RXCSR_INDX")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_PERI_RXCSR_INDX")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x416]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$402, DW_AT_name("RSVD26")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_RSVD26")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x417]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$403, DW_AT_name("COUNT0_INDX")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_COUNT0_INDX")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x419]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$404, DW_AT_name("RSVD27")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_RSVD27")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x41a]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$405, DW_AT_name("CONFIGDATA_INDX")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_CONFIGDATA_INDX")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x41e]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$406, DW_AT_name("RSVD28")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_RSVD28")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x41f]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$407, DW_AT_name("FIFO0R1")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_FIFO0R1")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x421]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$408, DW_AT_name("FIFO0R2")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_FIFO0R2")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x422]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$409, DW_AT_name("RSVD29")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_RSVD29")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x423]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$410, DW_AT_name("FIFO1R1")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_FIFO1R1")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x425]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$411, DW_AT_name("FIFO1R2")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_FIFO1R2")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x426]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$412, DW_AT_name("RSVD30")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_RSVD30")
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x427]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$413, DW_AT_name("FIFO2R1")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_FIFO2R1")
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x429]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$414, DW_AT_name("FIFO2R2")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_FIFO2R2")
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x42a]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$415, DW_AT_name("RSVD31")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_RSVD31")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x42b]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$416, DW_AT_name("FIFO3R1")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_FIFO3R1")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x42d]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$417, DW_AT_name("FIFO3R2")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_FIFO3R2")
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x42e]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$418, DW_AT_name("RSVD32")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_RSVD32")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x42f]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$419, DW_AT_name("FIFO4R1")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_FIFO4R1")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x431]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$420, DW_AT_name("FIFO4R2")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_FIFO4R2")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x432]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$421, DW_AT_name("RSVD33")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_RSVD33")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x433]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$422, DW_AT_name("DEVCTL")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_DEVCTL")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x461]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$423, DW_AT_name("TXFIFOSZ_RXFIFOSZ")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_TXFIFOSZ_RXFIFOSZ")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x462]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$424, DW_AT_name("RSVD34")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_RSVD34")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x463]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$425, DW_AT_name("TXFIFOADDR")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_TXFIFOADDR")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x465]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$426, DW_AT_name("RXFIFOADDR")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_RXFIFOADDR")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x466]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$427, DW_AT_name("RSVD35")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_RSVD35")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x467]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$428, DW_AT_name("HWVERS")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_HWVERS")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x46d]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$429, DW_AT_name("RSVD37")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_RSVD37")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$430, DW_AT_name("EPTRG")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_EPTRG")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x481]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$431, DW_AT_name("RSVD38")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_RSVD38")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a9]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$432, DW_AT_name("PERI_CSR0")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_PERI_CSR0")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x502]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$433, DW_AT_name("RSVD39")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_RSVD39")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x503]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$434, DW_AT_name("COUNT0")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_COUNT0")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x509]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$435, DW_AT_name("RSVD40")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_RSVD40")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x50a]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$436, DW_AT_name("CONFIGDATA")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_CONFIGDATA")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x50e]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$437, DW_AT_name("RSVD42")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_RSVD42")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x50f]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$438, DW_AT_name("EPCSR")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_EPCSR")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x511]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$439, DW_AT_name("RSVD43")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_RSVD43")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x551]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$440, DW_AT_name("DMAREVID1")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_DMAREVID1")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1000]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$441, DW_AT_name("DMAREVID2")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_DMAREVID2")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x1001]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$442, DW_AT_name("RSVD44")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_RSVD44")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1002]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$443, DW_AT_name("TDFDQ")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_TDFDQ")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x1004]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$444, DW_AT_name("RSVD45")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_RSVD45")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1005]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$445, DW_AT_name("DMAEMU")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_DMAEMU")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x1008]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$446, DW_AT_name("RSVD47")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_RSVD47")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x1009]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$447, DW_AT_name("CHANNEL")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_CHANNEL")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1800]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$448, DW_AT_name("RSVD48")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_RSVD48")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1880]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$449, DW_AT_name("DMA_SCHED_CTRL1")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL1")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x2000]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$450, DW_AT_name("DMA_SCHED_CTRL2")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL2")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x2001]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$451, DW_AT_name("RSVD50")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_RSVD50")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2002]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$452, DW_AT_name("CDMASCHETBLWORD")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_CDMASCHETBLWORD")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2800]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$453, DW_AT_name("RSVD51")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_RSVD51")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2900]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$454, DW_AT_name("QMGRREVID1")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_QMGRREVID1")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4000]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$455, DW_AT_name("QMGRREVID2")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_QMGRREVID2")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x4001]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$456, DW_AT_name("RSVD52")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_RSVD52")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4002]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$457, DW_AT_name("DIVERSION1")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_DIVERSION1")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x4008]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$458, DW_AT_name("DIVERSION2")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_DIVERSION2")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x4009]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$459, DW_AT_name("RSVD53")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_RSVD53")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x400a]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$460, DW_AT_name("FDBSC0")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_FDBSC0")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4020]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$461, DW_AT_name("FDBSC1")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_FDBSC1")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x4021]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$462, DW_AT_name("RSVD54")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_RSVD54")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4022]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$463, DW_AT_name("FDBSC2")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_FDBSC2")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x4024]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$464, DW_AT_name("FDBSC3")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_FDBSC3")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4025]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$465, DW_AT_name("RSVD55")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_RSVD55")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4026]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$466, DW_AT_name("FDBSC4")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_FDBSC4")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x4028]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$467, DW_AT_name("FDBSC5")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_FDBSC5")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4029]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$468, DW_AT_name("RSVD56")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_RSVD56")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x402a]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$469, DW_AT_name("FDBSC6")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_FDBSC6")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x402c]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$470, DW_AT_name("FDBSC7")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_FDBSC7")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x402d]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$471, DW_AT_name("RSVD57")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_RSVD57")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x402e]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$472, DW_AT_name("LRAM0BASE1")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_LRAM0BASE1")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4080]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$473, DW_AT_name("LRAM0BASE2")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_LRAM0BASE2")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x4081]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$474, DW_AT_name("RSVD58")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_RSVD58")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4082]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$475, DW_AT_name("LRAM0SIZE")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_LRAM0SIZE")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x4084]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$476, DW_AT_name("RSVD59")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_RSVD59")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4085]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$477, DW_AT_name("LRAM1BASE1")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_LRAM1BASE1")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x4088]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$478, DW_AT_name("LRAM1BASE2")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_LRAM1BASE2")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x4089]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$479, DW_AT_name("RSVD60")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_RSVD60")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x408a]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$480, DW_AT_name("PEND0")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_PEND0")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4090]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$481, DW_AT_name("PEND1")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_PEND1")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x4091]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$482, DW_AT_name("RSVD61")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_RSVD61")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x4092]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$483, DW_AT_name("PEND2")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_PEND2")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x4094]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$484, DW_AT_name("PEND3")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_PEND3")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4095]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$485, DW_AT_name("RSVD62")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_RSVD62")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4096]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$486, DW_AT_name("PEND4")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_PEND4")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4098]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$487, DW_AT_name("PEND5")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_PEND5")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4099]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$488, DW_AT_name("RSVD64")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_RSVD64")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x409a]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$489, DW_AT_name("QMMEMREGR")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_QMMEMREGR")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x5000]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$490, DW_AT_name("RSVD66")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_RSVD66")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x5100]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$491, DW_AT_name("QMQN")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_QMQN")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x6000]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$492, DW_AT_name("RSVD68")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_RSVD68")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x6400]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$493, DW_AT_name("QMQNS")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_QMQNS")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x6800]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$66

$C$DW$T$140	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbRegs")
	.dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
$C$DW$494	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$140)
$C$DW$495	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$494)
$C$DW$T$141	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$141, DW_AT_type(*$C$DW$495)
$C$DW$T$142	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$141)
	.dwattr $C$DW$T$142, DW_AT_address_class(0x10)
$C$DW$T$143	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbRegsOvly")
	.dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$142)
	.dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)

$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_name("CSL_CdcClassStruct")
	.dwattr $C$DW$T$69, DW_AT_byte_size(0xa0)
$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$496, DW_AT_name("ctrlHandle")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_ctrlHandle")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$497, DW_AT_name("cdcHandle")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_cdcHandle")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$69

$C$DW$T$137	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CdcClassStruct")
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
$C$DW$T$138	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$138, DW_AT_address_class(0x17)
$C$DW$T$144	.dwtag  DW_TAG_typedef, DW_AT_name("pCdcClassHandle")
	.dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)

$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_name("CSL_CdcCtrlObject")
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x44)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$498, DW_AT_name("ctrlInEpObj")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_ctrlInEpObj")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$499, DW_AT_name("devNum")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_devNum")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$500, DW_AT_name("ctrlOutEpObj")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_ctrlOutEpObj")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$501, DW_AT_name("suspendFlag")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_suspendFlag")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$502, DW_AT_name("hEpObjArray")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_hEpObjArray")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$503, DW_AT_name("usbSetup")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_usbSetup")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$504, DW_AT_name("curConfigStat")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_curConfigStat")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$505, DW_AT_name("usbSpeedCfg")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_usbSpeedCfg")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$78

$C$DW$T$67	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CdcCtrlObject")
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
$C$DW$T$145	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$145, DW_AT_address_class(0x17)

$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_name("CSL_CdcInitStructApp")
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x1c)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$506, DW_AT_name("pCdcObj")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_pCdcObj")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$507, DW_AT_name("pId")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_pId")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$508, DW_AT_name("vId")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_vId")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$509, DW_AT_name("rxBufferPtr")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_rxBufferPtr")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$510, DW_AT_name("rxStartIdx")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_rxStartIdx")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$511, DW_AT_name("rxEndIdx")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_rxEndIdx")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$512, DW_AT_name("txBufferPtr")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_txBufferPtr")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$513, DW_AT_name("txStartIdx")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_txStartIdx")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$514, DW_AT_name("txEndIdx")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_txEndIdx")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$515, DW_AT_name("txWorkBufPtr")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_txWorkBufPtr")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$516, DW_AT_name("txWorkBufIdx")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_txWorkBufIdx")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$517, DW_AT_name("bulkHandler")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_bulkHandler")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$518, DW_AT_name("ctrlHandler")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_ctrlHandler")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$519, DW_AT_name("intrHandler")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_intrHandler")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$520, DW_AT_name("bulkInCallback")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_bulkInCallback")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$521, DW_AT_name("bulkOutCallback")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_bulkOutCallback")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$522, DW_AT_name("intrInCallback")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_intrInCallback")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$82

$C$DW$T$146	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CdcInitStructApp")
	.dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
$C$DW$T$147	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
	.dwattr $C$DW$T$147, DW_AT_address_class(0x17)
$C$DW$T$148	.dwtag  DW_TAG_typedef, DW_AT_name("pCdcAppClassHandle")
	.dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
	.dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)

$C$DW$T$84	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$84, DW_AT_name("CSL_CdcObject")
	.dwattr $C$DW$T$84, DW_AT_byte_size(0x5c)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$523, DW_AT_name("lbaBuffer")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_lbaBuffer")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$524, DW_AT_name("activityPresentFlag")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_activityPresentFlag")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$525, DW_AT_name("bulkInEpObj")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_bulkInEpObj")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$526, DW_AT_name("bulkOutEpObj")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_bulkOutEpObj")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$527, DW_AT_name("intrInEpObj")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_intrInEpObj")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$528, DW_AT_name("intrOutEpObj")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_intrOutEpObj")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$529, DW_AT_name("lineCoding")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_lineCoding")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$530, DW_AT_name("controlLineState")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_controlLineState")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$84

$C$DW$T$68	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CdcObject")
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
$C$DW$T$149	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$149, DW_AT_address_class(0x17)

$C$DW$T$111	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$111, DW_AT_name("CSL_UsbContext")
	.dwattr $C$DW$T$111, DW_AT_byte_size(0xc8)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$531, DW_AT_name("opMode")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_opMode")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$532, DW_AT_name("maxCurrent")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_maxCurrent")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$533, DW_AT_name("fInitialized")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_fInitialized")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$534, DW_AT_name("fSetupPktCmd")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_fSetupPktCmd")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$535, DW_AT_name("fOutPhaseCmd")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_fOutPhaseCmd")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$536, DW_AT_name("fWaitingOnFlagA")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_fWaitingOnFlagA")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$537, DW_AT_name("fWaitingOnFlagB")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_fWaitingOnFlagB")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$538, DW_AT_name("fWaitingOnEP0BUFAvail")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_fWaitingOnEP0BUFAvail")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$539, DW_AT_name("fWaitingOnEP1InBUFAvail")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_fWaitingOnEP1InBUFAvail")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$540, DW_AT_name("rgbDescriptors")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_rgbDescriptors")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$541, DW_AT_name("cbDescriptors")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_cbDescriptors")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$542, DW_AT_name("dwFlagAEndpointAssigned")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_dwFlagAEndpointAssigned")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$543, DW_AT_name("dwFlagBEndpointAssigned")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_dwFlagBEndpointAssigned")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$544, DW_AT_name("pFIFOBaseAddress")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_pFIFOBaseAddress")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$545, DW_AT_name("pInterruptAddr")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_pInterruptAddr")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$546, DW_AT_name("fSendHandshake")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_fSendHandshake")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$547, DW_AT_name("fMUSBIsReady")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_fMUSBIsReady")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$548, DW_AT_name("cbOutEP0Buf")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_cbOutEP0Buf")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$549, DW_AT_name("cbOutEP0DataReceived")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_cbOutEP0DataReceived")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$550, DW_AT_name("dwOutEP0Buf")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_dwOutEP0Buf")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$551, DW_AT_name("fEP0BUFAvailable")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_fEP0BUFAvailable")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$552, DW_AT_name("fEP1InBUFAvailable")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_fEP1InBUFAvailable")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x5b]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$553, DW_AT_name("dwQueuePend1")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_dwQueuePend1")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$554, DW_AT_name("fEP3InBUFAvailable")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_fEP3InBUFAvailable")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$555, DW_AT_name("dwIntSourceL")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_dwIntSourceL")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$556, DW_AT_name("dwIntSourceH")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_dwIntSourceH")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$557, DW_AT_name("remoteWkpStat")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_remoteWkpStat")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$558, DW_AT_name("pEpStatus")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_pEpStatus")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$559, DW_AT_name("busSpeed")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_busSpeed")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$560, DW_AT_name("ep0State")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_ep0State")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
