TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE    1

    8169              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Mon Aug 15 03:55:14 2016                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    4850                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    4851                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4852              
    4853              $C$DW$T$97      .dwtag  DW_TAG_enumeration_type
    4854                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x01)
    4855              $C$DW$317       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_IDLE"), DW_AT_const_value(0x00)
    4856              $C$DW$318       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_STATUS_IN"), DW_AT_const_value(0x01)
    4857              $C$DW$319       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_TX"), DW_AT_const_value(0x02)
    4858              $C$DW$320       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_EP0_RX"), DW_AT_const_value(0x03)
    4859                      .dwendtag $C$DW$T$97
    4860              
    4861              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEp0State")
    4862                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    4863                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    4864              
    4865              $C$DW$T$99      .dwtag  DW_TAG_enumeration_type
    4866                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x01)
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  123

    4867              $C$DW$321       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_DETACH"), DW_AT_const_value(0x00)
    4868              $C$DW$322       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_DEVICE_ATTACH"), DW_AT_const_value(0x01)
    4869                      .dwendtag $C$DW$T$99
    4870              
    4871              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbDeviceEvent")
    4872                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    4873                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    4874              
    4875              $C$DW$T$111     .dwtag  DW_TAG_enumeration_type
    4876                      .dwattr $C$DW$T$111, DW_AT_byte_size(0x01)
    4877              $C$DW$323       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP0"), DW_AT_const_value(0x00)
    4878              $C$DW$324       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP1"), DW_AT_const_value(0x01)
    4879              $C$DW$325       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP2"), DW_AT_const_value(0x02)
    4880              $C$DW$326       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP3"), DW_AT_const_value(0x03)
    4881              $C$DW$327       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP4"), DW_AT_const_value(0x04)
    4882              $C$DW$328       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP5"), DW_AT_const_value(0x05)
    4883              $C$DW$329       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP6"), DW_AT_const_value(0x06)
    4884              $C$DW$330       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_OUT_EP7"), DW_AT_const_value(0x07)
    4885              $C$DW$331       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP0"), DW_AT_const_value(0x08)
    4886              $C$DW$332       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP1"), DW_AT_const_value(0x09)
    4887              $C$DW$333       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP2"), DW_AT_const_value(0x0a)
    4888              $C$DW$334       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP3"), DW_AT_const_value(0x0b)
    4889              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP4"), DW_AT_const_value(0x0c)
    4890              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP5"), DW_AT_const_value(0x0d)
    4891              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP6"), DW_AT_const_value(0x0e)
    4892              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_IN_EP7"), DW_AT_const_value(0x0f)
    4893                      .dwendtag $C$DW$T$111
    4894              
    4895              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpNum")
    4896                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    4897                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    4898              
    4899              $C$DW$T$113     .dwtag  DW_TAG_enumeration_type
    4900                      .dwattr $C$DW$T$113, DW_AT_byte_size(0x01)
    4901              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_CTRL"), DW_AT_const_value(0x00)
    4902              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_BULK"), DW_AT_const_value(0x01)
    4903              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_INTR"), DW_AT_const_value(0x02)
    4904              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_ISO"), DW_AT_const_value(0x03)
    4905              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("CSL_USB_HPORT"), DW_AT_const_value(0x04)
    4906                      .dwendtag $C$DW$T$113
    4907              
    4908              $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbXferType")
    4909                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    4910                      .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    4911              
    4912              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4913                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    4914              $C$DW$344       .dwtag  DW_TAG_member
    4915                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$20)
    4916                      .dwattr $C$DW$344, DW_AT_name("TXFUNCADDR")
    4917                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_TXFUNCADDR")
    4918                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4919                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4920              $C$DW$345       .dwtag  DW_TAG_member
    4921                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  124

    4922                      .dwattr $C$DW$345, DW_AT_name("TXHUBADDR_TXHUBPORT")
    4923                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_TXHUBADDR_TXHUBPORT")
    4924                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4925                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4926              $C$DW$346       .dwtag  DW_TAG_member
    4927                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$21)
    4928                      .dwattr $C$DW$346, DW_AT_name("RSVD0")
    4929                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_RSVD0")
    4930                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4931                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4932              $C$DW$347       .dwtag  DW_TAG_member
    4933                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$20)
    4934                      .dwattr $C$DW$347, DW_AT_name("RXFUNCADDR")
    4935                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_RXFUNCADDR")
    4936                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4937                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4938              $C$DW$348       .dwtag  DW_TAG_member
    4939                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    4940                      .dwattr $C$DW$348, DW_AT_name("RXHUBADDR_RXHUBPORT")
    4941                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_RXHUBADDR_RXHUBPORT")
    4942                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4943                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4944              $C$DW$349       .dwtag  DW_TAG_member
    4945                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$21)
    4946                      .dwattr $C$DW$349, DW_AT_name("RSVD36")
    4947                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_RSVD36")
    4948                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4949                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4950                      .dwendtag $C$DW$T$22
    4951              
    4952              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEptrgRegs")
    4953                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$22)
    4954                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4955              
    4956              $C$DW$T$40      .dwtag  DW_TAG_array_type
    4957                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4958                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4959                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x28)
    4960              $C$DW$350       .dwtag  DW_TAG_subrange_type
    4961                      .dwattr $C$DW$350, DW_AT_upper_bound(0x04)
    4962                      .dwendtag $C$DW$T$40
    4963              
    4964              
    4965              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4966                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    4967              $C$DW$351       .dwtag  DW_TAG_member
    4968                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    4969                      .dwattr $C$DW$351, DW_AT_name("TXMAXP")
    4970                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_TXMAXP")
    4971                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4972                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4973              $C$DW$352       .dwtag  DW_TAG_member
    4974                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    4975                      .dwattr $C$DW$352, DW_AT_name("PERI_TXCSR")
    4976                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_PERI_TXCSR")
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  125

    4977                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4978                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4979              $C$DW$353       .dwtag  DW_TAG_member
    4980                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$21)
    4981                      .dwattr $C$DW$353, DW_AT_name("RSVD0")
    4982                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_RSVD0")
    4983                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4984                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4985              $C$DW$354       .dwtag  DW_TAG_member
    4986                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    4987                      .dwattr $C$DW$354, DW_AT_name("RXMAXP")
    4988                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_RXMAXP")
    4989                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4990                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4991              $C$DW$355       .dwtag  DW_TAG_member
    4992                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$20)
    4993                      .dwattr $C$DW$355, DW_AT_name("PERI_RXCSR")
    4994                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_PERI_RXCSR")
    4995                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4996                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4997              $C$DW$356       .dwtag  DW_TAG_member
    4998                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$21)
    4999                      .dwattr $C$DW$356, DW_AT_name("RSVD1")
    5000                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_RSVD1")
    5001                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5002                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    5003              $C$DW$357       .dwtag  DW_TAG_member
    5004                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    5005                      .dwattr $C$DW$357, DW_AT_name("RXCOUNT")
    5006                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_RXCOUNT")
    5007                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5008                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    5009              $C$DW$358       .dwtag  DW_TAG_member
    5010                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    5011                      .dwattr $C$DW$358, DW_AT_name("RSVD41")
    5012                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_RSVD41")
    5013                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5014                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    5015                      .dwendtag $C$DW$T$24
    5016              
    5017              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbEpcsrRegs")
    5018                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$24)
    5019                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    5020              
    5021              $C$DW$T$43      .dwtag  DW_TAG_array_type
    5022                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    5023                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5024                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x40)
    5025              $C$DW$359       .dwtag  DW_TAG_subrange_type
    5026                      .dwattr $C$DW$359, DW_AT_upper_bound(0x03)
    5027                      .dwendtag $C$DW$T$43
    5028              
    5029              
    5030              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5031                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  126

    5032              $C$DW$360       .dwtag  DW_TAG_member
    5033                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    5034                      .dwattr $C$DW$360, DW_AT_name("TXGCR1")
    5035                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_TXGCR1")
    5036                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5037                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    5038              $C$DW$361       .dwtag  DW_TAG_member
    5039                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    5040                      .dwattr $C$DW$361, DW_AT_name("TXGCR2")
    5041                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_TXGCR2")
    5042                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5043                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    5044              $C$DW$362       .dwtag  DW_TAG_member
    5045                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$25)
    5046                      .dwattr $C$DW$362, DW_AT_name("RSVD0")
    5047                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_RSVD0")
    5048                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5049                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    5050              $C$DW$363       .dwtag  DW_TAG_member
    5051                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    5052                      .dwattr $C$DW$363, DW_AT_name("RXGCR1")
    5053                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_RXGCR1")
    5054                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5055                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    5056              $C$DW$364       .dwtag  DW_TAG_member
    5057                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    5058                      .dwattr $C$DW$364, DW_AT_name("RXGCR2")
    5059                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_RXGCR2")
    5060                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5061                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    5062              $C$DW$365       .dwtag  DW_TAG_member
    5063                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$21)
    5064                      .dwattr $C$DW$365, DW_AT_name("RSVD1")
    5065                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_RSVD1")
    5066                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5067                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    5068              $C$DW$366       .dwtag  DW_TAG_member
    5069                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    5070                      .dwattr $C$DW$366, DW_AT_name("RXHPCR1A")
    5071                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_RXHPCR1A")
    5072                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5073                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    5074              $C$DW$367       .dwtag  DW_TAG_member
    5075                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    5076                      .dwattr $C$DW$367, DW_AT_name("RXHPCR2A")
    5077                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_RXHPCR2A")
    5078                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5079                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    5080              $C$DW$368       .dwtag  DW_TAG_member
    5081                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$21)
    5082                      .dwattr $C$DW$368, DW_AT_name("RSVD2")
    5083                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_RSVD2")
    5084                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5085                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    5086              $C$DW$369       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  127

    5087                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    5088                      .dwattr $C$DW$369, DW_AT_name("RXHPCR1B")
    5089                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_RXHPCR1B")
    5090                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5091                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    5092              $C$DW$370       .dwtag  DW_TAG_member
    5093                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    5094                      .dwattr $C$DW$370, DW_AT_name("RXHPCR2B")
    5095                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_RXHPCR2B")
    5096                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5097                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    5098              $C$DW$371       .dwtag  DW_TAG_member
    5099                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$26)
    5100                      .dwattr $C$DW$371, DW_AT_name("RSVD46")
    5101                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_RSVD46")
    5102                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5103                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    5104                      .dwendtag $C$DW$T$27
    5105              
    5106              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbChannelRegs")
    5107                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$27)
    5108                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5109              
    5110              $C$DW$T$47      .dwtag  DW_TAG_array_type
    5111                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    5112                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    5113                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x80)
    5114              $C$DW$372       .dwtag  DW_TAG_subrange_type
    5115                      .dwattr $C$DW$372, DW_AT_upper_bound(0x03)
    5116                      .dwendtag $C$DW$T$47
    5117              
    5118              
    5119              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5120                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    5121              $C$DW$373       .dwtag  DW_TAG_member
    5122                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    5123                      .dwattr $C$DW$373, DW_AT_name("ENTRYLSW")
    5124                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_ENTRYLSW")
    5125                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5126                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    5127              $C$DW$374       .dwtag  DW_TAG_member
    5128                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    5129                      .dwattr $C$DW$374, DW_AT_name("ENTRYMSW")
    5130                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_ENTRYMSW")
    5131                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5132                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    5133              $C$DW$375       .dwtag  DW_TAG_member
    5134                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$21)
    5135                      .dwattr $C$DW$375, DW_AT_name("RSVD49")
    5136                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_RSVD49")
    5137                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5138                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    5139                      .dwendtag $C$DW$T$28
    5140              
    5141              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbCdmaschetblwordRegs")
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  128

    5142                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$28)
    5143                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    5144              
    5145              $C$DW$T$51      .dwtag  DW_TAG_array_type
    5146                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    5147                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    5148                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x100)
    5149              $C$DW$376       .dwtag  DW_TAG_subrange_type
    5150                      .dwattr $C$DW$376, DW_AT_upper_bound(0x3f)
    5151                      .dwendtag $C$DW$T$51
    5152              
    5153              
    5154              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5155                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    5156              $C$DW$377       .dwtag  DW_TAG_member
    5157                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    5158                      .dwattr $C$DW$377, DW_AT_name("QMEMRBASE1")
    5159                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_QMEMRBASE1")
    5160                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5161                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    5162              $C$DW$378       .dwtag  DW_TAG_member
    5163                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    5164                      .dwattr $C$DW$378, DW_AT_name("QMEMRBASE2")
    5165                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_QMEMRBASE2")
    5166                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5167                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    5168              $C$DW$379       .dwtag  DW_TAG_member
    5169                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$21)
    5170                      .dwattr $C$DW$379, DW_AT_name("RSVD0")
    5171                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_RSVD0")
    5172                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5173                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    5174              $C$DW$380       .dwtag  DW_TAG_member
    5175                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    5176                      .dwattr $C$DW$380, DW_AT_name("QMEMRCTRL1")
    5177                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_QMEMRCTRL1")
    5178                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5179                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    5180              $C$DW$381       .dwtag  DW_TAG_member
    5181                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    5182                      .dwattr $C$DW$381, DW_AT_name("QMEMRCTRL2")
    5183                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_QMEMRCTRL2")
    5184                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5185                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    5186              $C$DW$382       .dwtag  DW_TAG_member
    5187                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$29)
    5188                      .dwattr $C$DW$382, DW_AT_name("RSVD63")
    5189                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_RSVD63")
    5190                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5191                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    5192                      .dwendtag $C$DW$T$30
    5193              
    5194              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmmemregrRegs")
    5195                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$30)
    5196                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  129

    5197              
    5198              $C$DW$T$57      .dwtag  DW_TAG_array_type
    5199                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    5200                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    5201                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x100)
    5202              $C$DW$383       .dwtag  DW_TAG_subrange_type
    5203                      .dwattr $C$DW$383, DW_AT_upper_bound(0x0f)
    5204                      .dwendtag $C$DW$T$57
    5205              
    5206              
    5207              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5208                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    5209              $C$DW$384       .dwtag  DW_TAG_member
    5210                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$31)
    5211                      .dwattr $C$DW$384, DW_AT_name("RSVD0")
    5212                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_RSVD0")
    5213                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5214                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    5215              $C$DW$385       .dwtag  DW_TAG_member
    5216                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    5217                      .dwattr $C$DW$385, DW_AT_name("CTRL1D")
    5218                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_CTRL1D")
    5219                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5220                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    5221              $C$DW$386       .dwtag  DW_TAG_member
    5222                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$20)
    5223                      .dwattr $C$DW$386, DW_AT_name("CTRL2D")
    5224                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_CTRL2D")
    5225                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5226                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    5227              $C$DW$387       .dwtag  DW_TAG_member
    5228                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$21)
    5229                      .dwattr $C$DW$387, DW_AT_name("RSVD65")
    5230                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_RSVD65")
    5231                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5232                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    5233                      .dwendtag $C$DW$T$32
    5234              
    5235              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnRegs")
    5236                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
    5237                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    5238              
    5239              $C$DW$T$60      .dwtag  DW_TAG_array_type
    5240                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    5241                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    5242                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x400)
    5243              $C$DW$388       .dwtag  DW_TAG_subrange_type
    5244                      .dwattr $C$DW$388, DW_AT_upper_bound(0x3f)
    5245                      .dwendtag $C$DW$T$60
    5246              
    5247              
    5248              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5249                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    5250              $C$DW$389       .dwtag  DW_TAG_member
    5251                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  130

    5252                      .dwattr $C$DW$389, DW_AT_name("QSTATA")
    5253                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_QSTATA")
    5254                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5255                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    5256              $C$DW$390       .dwtag  DW_TAG_member
    5257                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$33)
    5258                      .dwattr $C$DW$390, DW_AT_name("RSVD0")
    5259                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_RSVD0")
    5260                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5261                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    5262              $C$DW$391       .dwtag  DW_TAG_member
    5263                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$20)
    5264                      .dwattr $C$DW$391, DW_AT_name("QSTAT1B")
    5265                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_QSTAT1B")
    5266                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5267                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    5268              $C$DW$392       .dwtag  DW_TAG_member
    5269                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$20)
    5270                      .dwattr $C$DW$392, DW_AT_name("QSTAT2B")
    5271                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_QSTAT2B")
    5272                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5273                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    5274              $C$DW$393       .dwtag  DW_TAG_member
    5275                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$21)
    5276                      .dwattr $C$DW$393, DW_AT_name("RSVD1")
    5277                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_RSVD1")
    5278                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5279                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    5280              $C$DW$394       .dwtag  DW_TAG_member
    5281                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$20)
    5282                      .dwattr $C$DW$394, DW_AT_name("QSTAT1C")
    5283                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_QSTAT1C")
    5284                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5285                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    5286              $C$DW$395       .dwtag  DW_TAG_member
    5287                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$23)
    5288                      .dwattr $C$DW$395, DW_AT_name("RSVD67")
    5289                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_RSVD67")
    5290                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5291                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    5292                      .dwendtag $C$DW$T$34
    5293              
    5294              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_UsbQmqnsRegs")
    5295                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$34)
    5296                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    5297              
    5298              $C$DW$T$63      .dwtag  DW_TAG_array_type
    5299                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    5300                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    5301                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x400)
    5302              $C$DW$396       .dwtag  DW_TAG_subrange_type
    5303                      .dwattr $C$DW$396, DW_AT_upper_bound(0x3f)
    5304                      .dwendtag $C$DW$T$63
    5305              
    5306              
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  131

    5307              $C$DW$T$64      .dwtag  DW_TAG_structure_type
    5308                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x6c00)
    5309              $C$DW$397       .dwtag  DW_TAG_member
    5310                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    5311                      .dwattr $C$DW$397, DW_AT_name("REVID1")
    5312                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_REVID1")
    5313                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5314                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    5315              $C$DW$398       .dwtag  DW_TAG_member
    5316                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    5317                      .dwattr $C$DW$398, DW_AT_name("REVID2")
    5318                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_REVID2")
    5319                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5320                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    5321              $C$DW$399       .dwtag  DW_TAG_member
    5322                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
    5323                      .dwattr $C$DW$399, DW_AT_name("RSVD0")
    5324                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_RSVD0")
    5325                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5326                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    5327              $C$DW$400       .dwtag  DW_TAG_member
    5328                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    5329                      .dwattr $C$DW$400, DW_AT_name("CTRLR")
    5330                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_CTRLR")
    5331                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5332                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5333              $C$DW$401       .dwtag  DW_TAG_member
    5334                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$33)
    5335                      .dwattr $C$DW$401, DW_AT_name("RSVD1")
    5336                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_RSVD1")
    5337                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5338                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    5339              $C$DW$402       .dwtag  DW_TAG_member
    5340                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    5341                      .dwattr $C$DW$402, DW_AT_name("STATR")
    5342                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_STATR")
    5343                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5344                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    5345              $C$DW$403       .dwtag  DW_TAG_member
    5346                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$33)
    5347                      .dwattr $C$DW$403, DW_AT_name("RSVD2")
    5348                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_RSVD2")
    5349                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5350                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5351              $C$DW$404       .dwtag  DW_TAG_member
    5352                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    5353                      .dwattr $C$DW$404, DW_AT_name("EMUR")
    5354                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_EMUR")
    5355                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5356                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5357              $C$DW$405       .dwtag  DW_TAG_member
    5358                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$33)
    5359                      .dwattr $C$DW$405, DW_AT_name("RSVD3")
    5360                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_RSVD3")
    5361                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  132

    5362                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    5363              $C$DW$406       .dwtag  DW_TAG_member
    5364                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    5365                      .dwattr $C$DW$406, DW_AT_name("MODE1")
    5366                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_MODE1")
    5367                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5368                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5369              $C$DW$407       .dwtag  DW_TAG_member
    5370                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    5371                      .dwattr $C$DW$407, DW_AT_name("MODE2")
    5372                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_MODE2")
    5373                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5374                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    5375              $C$DW$408       .dwtag  DW_TAG_member
    5376                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$21)
    5377                      .dwattr $C$DW$408, DW_AT_name("RSVD4")
    5378                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_RSVD4")
    5379                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5380                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    5381              $C$DW$409       .dwtag  DW_TAG_member
    5382                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    5383                      .dwattr $C$DW$409, DW_AT_name("AUTOREQ")
    5384                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_AUTOREQ")
    5385                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5386                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5387              $C$DW$410       .dwtag  DW_TAG_member
    5388                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$33)
    5389                      .dwattr $C$DW$410, DW_AT_name("RSVD5")
    5390                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_RSVD5")
    5391                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5392                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5393              $C$DW$411       .dwtag  DW_TAG_member
    5394                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$20)
    5395                      .dwattr $C$DW$411, DW_AT_name("SPRFIXTIME1")
    5396                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_SPRFIXTIME1")
    5397                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5398                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5399              $C$DW$412       .dwtag  DW_TAG_member
    5400                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    5401                      .dwattr $C$DW$412, DW_AT_name("SPRFIXTIME2")
    5402                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_SPRFIXTIME2")
    5403                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5404                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5405              $C$DW$413       .dwtag  DW_TAG_member
    5406                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$21)
    5407                      .dwattr $C$DW$413, DW_AT_name("RSVD6")
    5408                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_RSVD6")
    5409                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5410                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5411              $C$DW$414       .dwtag  DW_TAG_member
    5412                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    5413                      .dwattr $C$DW$414, DW_AT_name("TEARDOWN1")
    5414                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_TEARDOWN1")
    5415                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5416                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  133

    5417              $C$DW$415       .dwtag  DW_TAG_member
    5418                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$20)
    5419                      .dwattr $C$DW$415, DW_AT_name("TEARDOWN2")
    5420                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_TEARDOWN2")
    5421                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5422                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5423              $C$DW$416       .dwtag  DW_TAG_member
    5424                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$21)
    5425                      .dwattr $C$DW$416, DW_AT_name("RSVD7")
    5426                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_RSVD7")
    5427                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5428                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5429              $C$DW$417       .dwtag  DW_TAG_member
    5430                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    5431                      .dwattr $C$DW$417, DW_AT_name("INTSRCR1")
    5432                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_INTSRCR1")
    5433                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5434                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5435              $C$DW$418       .dwtag  DW_TAG_member
    5436                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    5437                      .dwattr $C$DW$418, DW_AT_name("INTSRCR2")
    5438                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_INTSRCR2")
    5439                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    5440                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5441              $C$DW$419       .dwtag  DW_TAG_member
    5442                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$21)
    5443                      .dwattr $C$DW$419, DW_AT_name("RSVD8")
    5444                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_RSVD8")
    5445                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5446                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    5447              $C$DW$420       .dwtag  DW_TAG_member
    5448                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    5449                      .dwattr $C$DW$420, DW_AT_name("INTSETR1")
    5450                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_INTSETR1")
    5451                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5452                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5453              $C$DW$421       .dwtag  DW_TAG_member
    5454                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    5455                      .dwattr $C$DW$421, DW_AT_name("INTSETR2")
    5456                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_INTSETR2")
    5457                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    5458                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5459              $C$DW$422       .dwtag  DW_TAG_member
    5460                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$21)
    5461                      .dwattr $C$DW$422, DW_AT_name("RSVD9")
    5462                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_RSVD9")
    5463                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5464                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5465              $C$DW$423       .dwtag  DW_TAG_member
    5466                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    5467                      .dwattr $C$DW$423, DW_AT_name("INTCLRR1")
    5468                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_INTCLRR1")
    5469                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5470                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5471              $C$DW$424       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  134

    5472                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    5473                      .dwattr $C$DW$424, DW_AT_name("INTCLRR2")
    5474                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_INTCLRR2")
    5475                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    5476                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5477              $C$DW$425       .dwtag  DW_TAG_member
    5478                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$21)
    5479                      .dwattr $C$DW$425, DW_AT_name("RSVD10")
    5480                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_RSVD10")
    5481                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5482                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5483              $C$DW$426       .dwtag  DW_TAG_member
    5484                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    5485                      .dwattr $C$DW$426, DW_AT_name("INTMSKR1")
    5486                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_INTMSKR1")
    5487                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5488                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5489              $C$DW$427       .dwtag  DW_TAG_member
    5490                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    5491                      .dwattr $C$DW$427, DW_AT_name("INTMSKR2")
    5492                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_INTMSKR2")
    5493                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    5494                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5495              $C$DW$428       .dwtag  DW_TAG_member
    5496                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$21)
    5497                      .dwattr $C$DW$428, DW_AT_name("RSVD11")
    5498                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_RSVD11")
    5499                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    5500                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5501              $C$DW$429       .dwtag  DW_TAG_member
    5502                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    5503                      .dwattr $C$DW$429, DW_AT_name("INTMSKSETR1")
    5504                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_INTMSKSETR1")
    5505                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5506                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5507              $C$DW$430       .dwtag  DW_TAG_member
    5508                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    5509                      .dwattr $C$DW$430, DW_AT_name("INTMSKSETR2")
    5510                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_INTMSKSETR2")
    5511                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    5512                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5513              $C$DW$431       .dwtag  DW_TAG_member
    5514                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$21)
    5515                      .dwattr $C$DW$431, DW_AT_name("RSVD12")
    5516                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_RSVD12")
    5517                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5518                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5519              $C$DW$432       .dwtag  DW_TAG_member
    5520                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    5521                      .dwattr $C$DW$432, DW_AT_name("INTMSKCLRR1")
    5522                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_INTMSKCLRR1")
    5523                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5524                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5525              $C$DW$433       .dwtag  DW_TAG_member
    5526                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  135

    5527                      .dwattr $C$DW$433, DW_AT_name("INTMSKCLRR2")
    5528                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_INTMSKCLRR2")
    5529                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    5530                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5531              $C$DW$434       .dwtag  DW_TAG_member
    5532                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$21)
    5533                      .dwattr $C$DW$434, DW_AT_name("RSVD13")
    5534                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_RSVD13")
    5535                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5536                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5537              $C$DW$435       .dwtag  DW_TAG_member
    5538                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$20)
    5539                      .dwattr $C$DW$435, DW_AT_name("INTMASKEDR1")
    5540                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_INTMASKEDR1")
    5541                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5542                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5543              $C$DW$436       .dwtag  DW_TAG_member
    5544                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    5545                      .dwattr $C$DW$436, DW_AT_name("INTMASKEDR2")
    5546                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_INTMASKEDR2")
    5547                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    5548                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5549              $C$DW$437       .dwtag  DW_TAG_member
    5550                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$21)
    5551                      .dwattr $C$DW$437, DW_AT_name("RSVD14")
    5552                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_RSVD14")
    5553                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    5554                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5555              $C$DW$438       .dwtag  DW_TAG_member
    5556                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    5557                      .dwattr $C$DW$438, DW_AT_name("EOIR")
    5558                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_EOIR")
    5559                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5560                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5561              $C$DW$439       .dwtag  DW_TAG_member
    5562                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$33)
    5563                      .dwattr $C$DW$439, DW_AT_name("RSVD15")
    5564                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_RSVD15")
    5565                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    5566                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5567              $C$DW$440       .dwtag  DW_TAG_member
    5568                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$20)
    5569                      .dwattr $C$DW$440, DW_AT_name("INTVECTR1")
    5570                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_INTVECTR1")
    5571                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5572                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5573              $C$DW$441       .dwtag  DW_TAG_member
    5574                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$20)
    5575                      .dwattr $C$DW$441, DW_AT_name("INTVECTR2")
    5576                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_INTVECTR2")
    5577                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    5578                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5579              $C$DW$442       .dwtag  DW_TAG_member
    5580                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$26)
    5581                      .dwattr $C$DW$442, DW_AT_name("RSVD16")
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  136

    5582                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_RSVD16")
    5583                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    5584                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5585              $C$DW$443       .dwtag  DW_TAG_member
    5586                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
    5587                      .dwattr $C$DW$443, DW_AT_name("GREP1SZR1")
    5588                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_GREP1SZR1")
    5589                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    5590                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5591              $C$DW$444       .dwtag  DW_TAG_member
    5592                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$20)
    5593                      .dwattr $C$DW$444, DW_AT_name("GREP1SZR2")
    5594                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_GREP1SZR2")
    5595                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
    5596                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5597              $C$DW$445       .dwtag  DW_TAG_member
    5598                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$21)
    5599                      .dwattr $C$DW$445, DW_AT_name("RSVD17")
    5600                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_RSVD17")
    5601                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    5602                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5603              $C$DW$446       .dwtag  DW_TAG_member
    5604                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$20)
    5605                      .dwattr $C$DW$446, DW_AT_name("GREP2SZR1")
    5606                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_GREP2SZR1")
    5607                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    5608                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5609              $C$DW$447       .dwtag  DW_TAG_member
    5610                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$20)
    5611                      .dwattr $C$DW$447, DW_AT_name("GREP2SZR2")
    5612                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_GREP2SZR2")
    5613                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
    5614                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5615              $C$DW$448       .dwtag  DW_TAG_member
    5616                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$21)
    5617                      .dwattr $C$DW$448, DW_AT_name("RSVD18")
    5618                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_RSVD18")
    5619                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    5620                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    5621              $C$DW$449       .dwtag  DW_TAG_member
    5622                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$20)
    5623                      .dwattr $C$DW$449, DW_AT_name("GREP3SZR1")
    5624                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_GREP3SZR1")
    5625                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5626                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    5627              $C$DW$450       .dwtag  DW_TAG_member
    5628                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$20)
    5629                      .dwattr $C$DW$450, DW_AT_name("GREP3SZR2")
    5630                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_GREP3SZR2")
    5631                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    5632                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    5633              $C$DW$451       .dwtag  DW_TAG_member
    5634                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$21)
    5635                      .dwattr $C$DW$451, DW_AT_name("RSVD19")
    5636                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_RSVD19")
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  137

    5637                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    5638                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    5639              $C$DW$452       .dwtag  DW_TAG_member
    5640                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    5641                      .dwattr $C$DW$452, DW_AT_name("GREP4SZR1")
    5642                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_GREP4SZR1")
    5643                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5644                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    5645              $C$DW$453       .dwtag  DW_TAG_member
    5646                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    5647                      .dwattr $C$DW$453, DW_AT_name("GREP4SZR2")
    5648                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_GREP4SZR2")
    5649                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    5650                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5651              $C$DW$454       .dwtag  DW_TAG_member
    5652                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$35)
    5653                      .dwattr $C$DW$454, DW_AT_name("RSVD20")
    5654                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_RSVD20")
    5655                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5656                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    5657              $C$DW$455       .dwtag  DW_TAG_member
    5658                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$20)
    5659                      .dwattr $C$DW$455, DW_AT_name("FADDR_POWER")
    5660                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_FADDR_POWER")
    5661                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x401]
    5662                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    5663              $C$DW$456       .dwtag  DW_TAG_member
    5664                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$20)
    5665                      .dwattr $C$DW$456, DW_AT_name("INTRTX")
    5666                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_INTRTX")
    5667                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x402]
    5668                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5669              $C$DW$457       .dwtag  DW_TAG_member
    5670                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$21)
    5671                      .dwattr $C$DW$457, DW_AT_name("RSVD21")
    5672                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_RSVD21")
    5673                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x403]
    5674                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5675              $C$DW$458       .dwtag  DW_TAG_member
    5676                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
    5677                      .dwattr $C$DW$458, DW_AT_name("INTRRX")
    5678                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_INTRRX")
    5679                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x405]
    5680                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    5681              $C$DW$459       .dwtag  DW_TAG_member
    5682                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$20)
    5683                      .dwattr $C$DW$459, DW_AT_name("INTRTXE")
    5684                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_INTRTXE")
    5685                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x406]
    5686                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5687              $C$DW$460       .dwtag  DW_TAG_member
    5688                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$21)
    5689                      .dwattr $C$DW$460, DW_AT_name("RSVD22")
    5690                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_RSVD22")
    5691                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x407]
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  138

    5692                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5693              $C$DW$461       .dwtag  DW_TAG_member
    5694                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    5695                      .dwattr $C$DW$461, DW_AT_name("INTRRXE")
    5696                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_INTRRXE")
    5697                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x409]
    5698                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5699              $C$DW$462       .dwtag  DW_TAG_member
    5700                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    5701                      .dwattr $C$DW$462, DW_AT_name("INTRUSB_INTRUSBE")
    5702                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_INTRUSB_INTRUSBE")
    5703                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x40a]
    5704                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5705              $C$DW$463       .dwtag  DW_TAG_member
    5706                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$21)
    5707                      .dwattr $C$DW$463, DW_AT_name("RSVD23")
    5708                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_RSVD23")
    5709                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x40b]
    5710                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5711              $C$DW$464       .dwtag  DW_TAG_member
    5712                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$20)
    5713                      .dwattr $C$DW$464, DW_AT_name("FRAME")
    5714                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_FRAME")
    5715                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x40d]
    5716                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5717              $C$DW$465       .dwtag  DW_TAG_member
    5718                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$20)
    5719                      .dwattr $C$DW$465, DW_AT_name("INDEX_TESTMODE")
    5720                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_INDEX_TESTMODE")
    5721                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x40e]
    5722                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5723              $C$DW$466       .dwtag  DW_TAG_member
    5724                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$21)
    5725                      .dwattr $C$DW$466, DW_AT_name("RSVD24")
    5726                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_RSVD24")
    5727                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x40f]
    5728                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5729              $C$DW$467       .dwtag  DW_TAG_member
    5730                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$20)
    5731                      .dwattr $C$DW$467, DW_AT_name("TXMAXP_INDX")
    5732                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_TXMAXP_INDX")
    5733                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x411]
    5734                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5735              $C$DW$468       .dwtag  DW_TAG_member
    5736                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$20)
    5737                      .dwattr $C$DW$468, DW_AT_name("PERI_CSR0_INDX")
    5738                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_PERI_CSR0_INDX")
    5739                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x412]
    5740                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5741              $C$DW$469       .dwtag  DW_TAG_member
    5742                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$21)
    5743                      .dwattr $C$DW$469, DW_AT_name("RSVD25")
    5744                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_RSVD25")
    5745                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x413]
    5746                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  139

    5747              $C$DW$470       .dwtag  DW_TAG_member
    5748                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$20)
    5749                      .dwattr $C$DW$470, DW_AT_name("RXMAXP_INDX")
    5750                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_RXMAXP_INDX")
    5751                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x415]
    5752                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5753              $C$DW$471       .dwtag  DW_TAG_member
    5754                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$20)
    5755                      .dwattr $C$DW$471, DW_AT_name("PERI_RXCSR_INDX")
    5756                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_PERI_RXCSR_INDX")
    5757                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x416]
    5758                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5759              $C$DW$472       .dwtag  DW_TAG_member
    5760                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$21)
    5761                      .dwattr $C$DW$472, DW_AT_name("RSVD26")
    5762                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_RSVD26")
    5763                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x417]
    5764                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5765              $C$DW$473       .dwtag  DW_TAG_member
    5766                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    5767                      .dwattr $C$DW$473, DW_AT_name("COUNT0_INDX")
    5768                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_COUNT0_INDX")
    5769                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x419]
    5770                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5771              $C$DW$474       .dwtag  DW_TAG_member
    5772                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$36)
    5773                      .dwattr $C$DW$474, DW_AT_name("RSVD27")
    5774                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_RSVD27")
    5775                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x41a]
    5776                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5777              $C$DW$475       .dwtag  DW_TAG_member
    5778                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    5779                      .dwattr $C$DW$475, DW_AT_name("CONFIGDATA_INDX")
    5780                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_CONFIGDATA_INDX")
    5781                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x41e]
    5782                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5783              $C$DW$476       .dwtag  DW_TAG_member
    5784                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$21)
    5785                      .dwattr $C$DW$476, DW_AT_name("RSVD28")
    5786                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_RSVD28")
    5787                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x41f]
    5788                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5789              $C$DW$477       .dwtag  DW_TAG_member
    5790                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    5791                      .dwattr $C$DW$477, DW_AT_name("FIFO0R1")
    5792                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_FIFO0R1")
    5793                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x421]
    5794                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5795              $C$DW$478       .dwtag  DW_TAG_member
    5796                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    5797                      .dwattr $C$DW$478, DW_AT_name("FIFO0R2")
    5798                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_FIFO0R2")
    5799                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x422]
    5800                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5801              $C$DW$479       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  140

    5802                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$21)
    5803                      .dwattr $C$DW$479, DW_AT_name("RSVD29")
    5804                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_RSVD29")
    5805                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x423]
    5806                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5807              $C$DW$480       .dwtag  DW_TAG_member
    5808                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    5809                      .dwattr $C$DW$480, DW_AT_name("FIFO1R1")
    5810                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_FIFO1R1")
    5811                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x425]
    5812                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5813              $C$DW$481       .dwtag  DW_TAG_member
    5814                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    5815                      .dwattr $C$DW$481, DW_AT_name("FIFO1R2")
    5816                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_FIFO1R2")
    5817                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x426]
    5818                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5819              $C$DW$482       .dwtag  DW_TAG_member
    5820                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$21)
    5821                      .dwattr $C$DW$482, DW_AT_name("RSVD30")
    5822                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_RSVD30")
    5823                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x427]
    5824                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5825              $C$DW$483       .dwtag  DW_TAG_member
    5826                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$20)
    5827                      .dwattr $C$DW$483, DW_AT_name("FIFO2R1")
    5828                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_FIFO2R1")
    5829                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x429]
    5830                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5831              $C$DW$484       .dwtag  DW_TAG_member
    5832                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    5833                      .dwattr $C$DW$484, DW_AT_name("FIFO2R2")
    5834                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_FIFO2R2")
    5835                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x42a]
    5836                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5837              $C$DW$485       .dwtag  DW_TAG_member
    5838                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$21)
    5839                      .dwattr $C$DW$485, DW_AT_name("RSVD31")
    5840                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_RSVD31")
    5841                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x42b]
    5842                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5843              $C$DW$486       .dwtag  DW_TAG_member
    5844                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
    5845                      .dwattr $C$DW$486, DW_AT_name("FIFO3R1")
    5846                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_FIFO3R1")
    5847                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x42d]
    5848                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5849              $C$DW$487       .dwtag  DW_TAG_member
    5850                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
    5851                      .dwattr $C$DW$487, DW_AT_name("FIFO3R2")
    5852                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_FIFO3R2")
    5853                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x42e]
    5854                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5855              $C$DW$488       .dwtag  DW_TAG_member
    5856                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$21)
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  141

    5857                      .dwattr $C$DW$488, DW_AT_name("RSVD32")
    5858                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_RSVD32")
    5859                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x42f]
    5860                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5861              $C$DW$489       .dwtag  DW_TAG_member
    5862                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$20)
    5863                      .dwattr $C$DW$489, DW_AT_name("FIFO4R1")
    5864                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_FIFO4R1")
    5865                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x431]
    5866                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5867              $C$DW$490       .dwtag  DW_TAG_member
    5868                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$20)
    5869                      .dwattr $C$DW$490, DW_AT_name("FIFO4R2")
    5870                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_FIFO4R2")
    5871                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x432]
    5872                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5873              $C$DW$491       .dwtag  DW_TAG_member
    5874                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$37)
    5875                      .dwattr $C$DW$491, DW_AT_name("RSVD33")
    5876                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_RSVD33")
    5877                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x433]
    5878                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5879              $C$DW$492       .dwtag  DW_TAG_member
    5880                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$20)
    5881                      .dwattr $C$DW$492, DW_AT_name("DEVCTL")
    5882                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_DEVCTL")
    5883                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x461]
    5884                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5885              $C$DW$493       .dwtag  DW_TAG_member
    5886                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$20)
    5887                      .dwattr $C$DW$493, DW_AT_name("TXFIFOSZ_RXFIFOSZ")
    5888                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_TXFIFOSZ_RXFIFOSZ")
    5889                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x462]
    5890                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5891              $C$DW$494       .dwtag  DW_TAG_member
    5892                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$21)
    5893                      .dwattr $C$DW$494, DW_AT_name("RSVD34")
    5894                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_RSVD34")
    5895                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x463]
    5896                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5897              $C$DW$495       .dwtag  DW_TAG_member
    5898                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$20)
    5899                      .dwattr $C$DW$495, DW_AT_name("TXFIFOADDR")
    5900                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_TXFIFOADDR")
    5901                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x465]
    5902                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5903              $C$DW$496       .dwtag  DW_TAG_member
    5904                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$20)
    5905                      .dwattr $C$DW$496, DW_AT_name("RXFIFOADDR")
    5906                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_RXFIFOADDR")
    5907                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x466]
    5908                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5909              $C$DW$497       .dwtag  DW_TAG_member
    5910                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$25)
    5911                      .dwattr $C$DW$497, DW_AT_name("RSVD35")
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  142

    5912                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_RSVD35")
    5913                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x467]
    5914                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5915              $C$DW$498       .dwtag  DW_TAG_member
    5916                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$20)
    5917                      .dwattr $C$DW$498, DW_AT_name("HWVERS")
    5918                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_HWVERS")
    5919                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x46d]
    5920                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5921              $C$DW$499       .dwtag  DW_TAG_member
    5922                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$38)
    5923                      .dwattr $C$DW$499, DW_AT_name("RSVD37")
    5924                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_RSVD37")
    5925                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x46e]
    5926                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5927              $C$DW$500       .dwtag  DW_TAG_member
    5928                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$40)
    5929                      .dwattr $C$DW$500, DW_AT_name("EPTRG")
    5930                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_EPTRG")
    5931                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x481]
    5932                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5933              $C$DW$501       .dwtag  DW_TAG_member
    5934                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$41)
    5935                      .dwattr $C$DW$501, DW_AT_name("RSVD38")
    5936                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_RSVD38")
    5937                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a9]
    5938                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5939              $C$DW$502       .dwtag  DW_TAG_member
    5940                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$20)
    5941                      .dwattr $C$DW$502, DW_AT_name("PERI_CSR0")
    5942                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_PERI_CSR0")
    5943                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x502]
    5944                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5945              $C$DW$503       .dwtag  DW_TAG_member
    5946                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$25)
    5947                      .dwattr $C$DW$503, DW_AT_name("RSVD39")
    5948                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_RSVD39")
    5949                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x503]
    5950                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5951              $C$DW$504       .dwtag  DW_TAG_member
    5952                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$20)
    5953                      .dwattr $C$DW$504, DW_AT_name("COUNT0")
    5954                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_COUNT0")
    5955                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x509]
    5956                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5957              $C$DW$505       .dwtag  DW_TAG_member
    5958                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$36)
    5959                      .dwattr $C$DW$505, DW_AT_name("RSVD40")
    5960                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_RSVD40")
    5961                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x50a]
    5962                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5963              $C$DW$506       .dwtag  DW_TAG_member
    5964                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$20)
    5965                      .dwattr $C$DW$506, DW_AT_name("CONFIGDATA")
    5966                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_CONFIGDATA")
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  143

    5967                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x50e]
    5968                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5969              $C$DW$507       .dwtag  DW_TAG_member
    5970                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$21)
    5971                      .dwattr $C$DW$507, DW_AT_name("RSVD42")
    5972                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_RSVD42")
    5973                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x50f]
    5974                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5975              $C$DW$508       .dwtag  DW_TAG_member
    5976                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$43)
    5977                      .dwattr $C$DW$508, DW_AT_name("EPCSR")
    5978                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_EPCSR")
    5979                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x511]
    5980                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5981              $C$DW$509       .dwtag  DW_TAG_member
    5982                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$44)
    5983                      .dwattr $C$DW$509, DW_AT_name("RSVD43")
    5984                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_RSVD43")
    5985                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x551]
    5986                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5987              $C$DW$510       .dwtag  DW_TAG_member
    5988                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$20)
    5989                      .dwattr $C$DW$510, DW_AT_name("DMAREVID1")
    5990                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_DMAREVID1")
    5991                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x1000]
    5992                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5993              $C$DW$511       .dwtag  DW_TAG_member
    5994                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$20)
    5995                      .dwattr $C$DW$511, DW_AT_name("DMAREVID2")
    5996                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_DMAREVID2")
    5997                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x1001]
    5998                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5999              $C$DW$512       .dwtag  DW_TAG_member
    6000                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$21)
    6001                      .dwattr $C$DW$512, DW_AT_name("RSVD44")
    6002                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_RSVD44")
    6003                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x1002]
    6004                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6005              $C$DW$513       .dwtag  DW_TAG_member
    6006                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$20)
    6007                      .dwattr $C$DW$513, DW_AT_name("TDFDQ")
    6008                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_TDFDQ")
    6009                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x1004]
    6010                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6011              $C$DW$514       .dwtag  DW_TAG_member
    6012                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$33)
    6013                      .dwattr $C$DW$514, DW_AT_name("RSVD45")
    6014                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_RSVD45")
    6015                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x1005]
    6016                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6017              $C$DW$515       .dwtag  DW_TAG_member
    6018                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$20)
    6019                      .dwattr $C$DW$515, DW_AT_name("DMAEMU")
    6020                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_DMAEMU")
    6021                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x1008]
TMS320C55x Assembler PC v4.4.1 Mon Aug 15 03:55:17 2016

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
usb.asm                                                              PAGE  144

    6022                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6023              $C$DW$516       .dwtag  DW_TAG_member
    6024                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$45)
    6025                      .dwattr $C$DW$516, DW_AT_name("RSVD47")
    6026                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_RSVD47")
    6027                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x1009]
    6028                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6029              $C$DW$517       .dwtag  DW_TAG_member
    6030                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$47)
    6031                      .dwattr $C$DW$517, DW_AT_name("CHANNEL")
    6032                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_CHANNEL")
    6033                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x1800]
    6034                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6035              $C$DW$518       .dwtag  DW_TAG_member
    6036                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$48)
    6037                      .dwattr $C$DW$518, DW_AT_name("RSVD48")
    6038                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_RSVD48")
    6039                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x1880]
    6040                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    6041              $C$DW$519       .dwtag  DW_TAG_member
    6042                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$20)
    6043                      .dwattr $C$DW$519, DW_AT_name("DMA_SCHED_CTRL1")
    6044                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL1")
    6045                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x2000]
    6046                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6047              $C$DW$520       .dwtag  DW_TAG_member
    6048                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$20)
    6049                      .dwattr $C$DW$520, DW_AT_name("DMA_SCHED_CTRL2")
    6050                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_DMA_SCHED_CTRL2")
    6051                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x2001]
    6052                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6053              $C$DW$521       .dwtag  DW_TAG_member
    6054                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$49)
    6055                      .dwattr $C$DW$521, DW_AT_name("RSVD50")
    6056                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_RSVD50")
    6057                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x2002]
    6058                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6059              $C$DW$522       .dwtag  DW_TAG_member
    6060                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$51)
    6061                      .dwattr $C$DW$522, DW_AT_name("CDMASCHETBLWORD")
    6062                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_CDMASCHETBLWORD")
    6063                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x2800]
    6064                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
