TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE    1

    3026              ; Temporary Registers Used: None
       1              ;*******************************************************************************
       2              ;* TMS320C55x C/C++ Codegen                                          PC v4.4.1 *
       3              ;* Date/Time created: Fri Sep 07 02:27:21 2018                                 *
       4              ;*******************************************************************************
       5                      .compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --si
       6                      .mmregs
       7                      .cpl_on
       8                      .arms_on
       9                      .c54cm_off
      10                      .asg AR6, FP
      11                      .asg XAR6, XFP
      12                      .asg DPH, MDP
      13                      .model call=c55_std
      14                      .model mem=large
      15                      .noremark 5002  ; code respects overwrite rules
      16              ;*******************************************************************************
      17              ;* GLOBAL FILE PARAMETERS                                                      *

    2050                      .dwattr $C$DW$185, DW_AT_low_pc(0x00)
    2051                      .dwattr $C$DW$185, DW_AT_TI_return
    2052 0004ab 4804          RET
    2053                                                      ; return occurs
    2054              
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   44

    2055              $C$DW$186       .dwtag  DW_TAG_TI_loop
    2056                      .dwattr $C$DW$186, DW_AT_name("F:\eZDSP_5535_Files\ccsws2\test\Debug\main.asm:$C$L37:1:1536312441")
    2057                      .dwattr $C$DW$186, DW_AT_TI_begin_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    2058                      .dwattr $C$DW$186, DW_AT_TI_begin_line(0x323)
    2059                      .dwattr $C$DW$186, DW_AT_TI_end_line(0x323)
    2060              $C$DW$187       .dwtag  DW_TAG_TI_loop_range
    2061                      .dwattr $C$DW$187, DW_AT_low_pc($C$DW$L$_systemInit$4$B)
    2062                      .dwattr $C$DW$187, DW_AT_high_pc($C$DW$L$_systemInit$4$E)
    2063                      .dwendtag $C$DW$186
    2064              
    2065              
    2066              $C$DW$188       .dwtag  DW_TAG_TI_loop
    2067                      .dwattr $C$DW$188, DW_AT_name("F:\eZDSP_5535_Files\ccsws2\test\Debug\main.asm:$C$L35:1:1536312441")
    2068                      .dwattr $C$DW$188, DW_AT_TI_begin_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    2069                      .dwattr $C$DW$188, DW_AT_TI_begin_line(0x318)
    2070                      .dwattr $C$DW$188, DW_AT_TI_end_line(0x318)
    2071              $C$DW$189       .dwtag  DW_TAG_TI_loop_range
    2072                      .dwattr $C$DW$189, DW_AT_low_pc($C$DW$L$_systemInit$2$B)
    2073                      .dwattr $C$DW$189, DW_AT_high_pc($C$DW$L$_systemInit$2$E)
    2074                      .dwendtag $C$DW$188
    2075              
    2076                      .dwattr $C$DW$175, DW_AT_TI_end_file("../FreeRTOS/Demo/c5515_CCS/main.c")
    2077                      .dwattr $C$DW$175, DW_AT_TI_end_line(0x32c)
    2078                      .dwattr $C$DW$175, DW_AT_TI_end_column(0x01)
    2079                      .dwendentry
    2080                      .dwendtag $C$DW$175
    2081              
    2082              ;*******************************************************************************
    2083              ;* FAR STRINGS                                                                 *
    2084              ;*******************************************************************************
    2085 000000               .sect   ".const:.string"
    2086                      .align  2
    2087 000000 0043  $C$FSL1:        .string "Check",0
         000001 0068 
         000002 0065 
         000003 0063 
         000004 006B 
         000005 0000 
    2088              ;******************************************************************************
    2089              ;* UNDEFINED EXTERNAL REFERENCES                                              *
    2090              ;******************************************************************************
    2091                      .global _EZDSP5535_init
    2092                      .global _EZDSP5535_waitusec
    2093                      .global _vTaskDelay
    2094                      .global _vTaskStartScheduler
    2095                      .global _xTaskGenericCreate
    2096                      .global _vStartLEDFlashTasks
    2097                      .global _xAreIntegerMathsTaskStillRunning
    2098                      .global _xArePollingQueuesStillRunning
    2099                      .global _reset_RTC
    2100                      .global _enable_i2s0
    2101                      .global _set_i2s0_slave
    2102                      .global _set_dma0_ch0_i2s0_Lout
    2103                      .global _set_dma0_ch1_i2s0_Rout
    2104                      .global _set_dma0_ch0_stop
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   45

    2105                      .global _set_dma0_ch1_stop
    2106                      .global _EZDSP5535_LED_init
    2107                      .global _EZDSP5535_LED_on
    2108                      .global _EZDSP5535_LED_off
    2109                      .global _EZDSP5535_XF_toggle
    2110                      .global _EZDSP5535_SAR_init
    2111                      .global _EZDSP5535_SAR_getKey
    2112                      .global _PLL_init
    2113                      .global _PLL_config
    2114                      .global _PLL_reset
    2115                      .global _mem_test
    2116                      .global _oled_test
    2117                      .global _spiflash_test
    2118                      .global _RTC_reset
    2119                      .global _fTimer
    2120                      .global _Flag_RTC
    2121                      .global _Conunt_RTC
    2122                      .global _VECSTART
    2123              
    2124              ;*******************************************************************************
    2125              ;* TYPE INFORMATION                                                            *
    2126              ;*******************************************************************************
    2127              
    2128              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2129                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    2130              $C$DW$190       .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2132                      .dwattr $C$DW$190, DW_AT_name("PLLCNTL1")
    2133                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PLLCNTL1")
    2134                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2136              $C$DW$191       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2138                      .dwattr $C$DW$191, DW_AT_name("PLLINCNTL")
    2139                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PLLINCNTL")
    2140                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2141                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2142              $C$DW$192       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2144                      .dwattr $C$DW$192, DW_AT_name("PLLCNTL2")
    2145                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PLLCNTL2")
    2146                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2147                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2148              $C$DW$193       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2150                      .dwattr $C$DW$193, DW_AT_name("PLLOUTCNTL")
    2151                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_PLLOUTCNTL")
    2152                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2153                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2154                      .dwendtag $C$DW$T$20
    2155              
    2156              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Config")
    2157                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
    2158                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2159              $C$DW$194       .dwtag  DW_TAG_TI_far_type
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   46

    2160                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$26)
    2161              $C$DW$T$35      .dwtag  DW_TAG_const_type
    2162                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$194)
    2163              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2164                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2165                      .dwattr $C$DW$T$27, DW_AT_address_class(0x17)
    2166              
    2167              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2168                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2169              $C$DW$195       .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    2171                      .dwattr $C$DW$195, DW_AT_name("EBSR")
    2172                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_EBSR")
    2173                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2174                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2175              $C$DW$196       .dwtag  DW_TAG_member
    2176                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
    2177                      .dwattr $C$DW$196, DW_AT_name("RSVD0")
    2178                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_RSVD0")
    2179                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2180                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2181              $C$DW$197       .dwtag  DW_TAG_member
    2182                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    2183                      .dwattr $C$DW$197, DW_AT_name("PCGCR1")
    2184                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PCGCR1")
    2185                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2186                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2187              $C$DW$198       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$21)
    2189                      .dwattr $C$DW$198, DW_AT_name("PCGCR2")
    2190                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PCGCR2")
    2191                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2192                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2193              $C$DW$199       .dwtag  DW_TAG_member
    2194                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    2195                      .dwattr $C$DW$199, DW_AT_name("PSRCR")
    2196                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PSRCR")
    2197                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2198                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2199              $C$DW$200       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    2201                      .dwattr $C$DW$200, DW_AT_name("PRCR")
    2202                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_PRCR")
    2203                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2204                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2205              $C$DW$201       .dwtag  DW_TAG_member
    2206                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    2207                      .dwattr $C$DW$201, DW_AT_name("RSVD1")
    2208                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_RSVD1")
    2209                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2210                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2211              $C$DW$202       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    2213                      .dwattr $C$DW$202, DW_AT_name("TIAFR")
    2214                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_TIAFR")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   47

    2215                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2216                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2217              $C$DW$203       .dwtag  DW_TAG_member
    2218                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    2219                      .dwattr $C$DW$203, DW_AT_name("RSVD2")
    2220                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_RSVD2")
    2221                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2222                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2223              $C$DW$204       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$21)
    2225                      .dwattr $C$DW$204, DW_AT_name("ODSCR")
    2226                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ODSCR")
    2227                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2228                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2229              $C$DW$205       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    2231                      .dwattr $C$DW$205, DW_AT_name("PDINHIBR1")
    2232                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_PDINHIBR1")
    2233                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2234                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2235              $C$DW$206       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$21)
    2237                      .dwattr $C$DW$206, DW_AT_name("PDINHIBR2")
    2238                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_PDINHIBR2")
    2239                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2240                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2241              $C$DW$207       .dwtag  DW_TAG_member
    2242                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$21)
    2243                      .dwattr $C$DW$207, DW_AT_name("PDINHIBR3")
    2244                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_PDINHIBR3")
    2245                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2246                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2247              $C$DW$208       .dwtag  DW_TAG_member
    2248                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    2249                      .dwattr $C$DW$208, DW_AT_name("DMA0CESR1")
    2250                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_DMA0CESR1")
    2251                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2252                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2253              $C$DW$209       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$21)
    2255                      .dwattr $C$DW$209, DW_AT_name("DMA0CESR2")
    2256                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_DMA0CESR2")
    2257                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2258                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2259              $C$DW$210       .dwtag  DW_TAG_member
    2260                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$21)
    2261                      .dwattr $C$DW$210, DW_AT_name("DMA1CESR1")
    2262                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_DMA1CESR1")
    2263                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2264                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2265              $C$DW$211       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$21)
    2267                      .dwattr $C$DW$211, DW_AT_name("DMA1CESR2")
    2268                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_DMA1CESR2")
    2269                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   48

    2270                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2271              $C$DW$212       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$21)
    2273                      .dwattr $C$DW$212, DW_AT_name("SDRAMCCR")
    2274                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_SDRAMCCR")
    2275                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2276                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2277              $C$DW$213       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    2279                      .dwattr $C$DW$213, DW_AT_name("CCR2")
    2280                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_CCR2")
    2281                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2282                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2283              $C$DW$214       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$21)
    2285                      .dwattr $C$DW$214, DW_AT_name("CGCR1")
    2286                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_CGCR1")
    2287                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2288                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2289              $C$DW$215       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$21)
    2291                      .dwattr $C$DW$215, DW_AT_name("CGICR")
    2292                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_CGICR")
    2293                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2294                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2295              $C$DW$216       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$21)
    2297                      .dwattr $C$DW$216, DW_AT_name("CGCR2")
    2298                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_CGCR2")
    2299                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2300                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2301              $C$DW$217       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$21)
    2303                      .dwattr $C$DW$217, DW_AT_name("CGOCR")
    2304                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_CGOCR")
    2305                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    2306                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2307              $C$DW$218       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$21)
    2309                      .dwattr $C$DW$218, DW_AT_name("CCSSR")
    2310                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_CCSSR")
    2311                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2312                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2313              $C$DW$219       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$21)
    2315                      .dwattr $C$DW$219, DW_AT_name("RSVD3")
    2316                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_RSVD3")
    2317                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    2318                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2319              $C$DW$220       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$21)
    2321                      .dwattr $C$DW$220, DW_AT_name("ECDR")
    2322                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_ECDR")
    2323                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2324                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   49

    2325              $C$DW$221       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$21)
    2327                      .dwattr $C$DW$221, DW_AT_name("RSVD4")
    2328                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_RSVD4")
    2329                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2330                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2331              $C$DW$222       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$21)
    2333                      .dwattr $C$DW$222, DW_AT_name("RAMSLPMDCNTLR1")
    2334                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
    2335                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2336                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2337              $C$DW$223       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$21)
    2339                      .dwattr $C$DW$223, DW_AT_name("RSVD5")
    2340                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_RSVD5")
    2341                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2342                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$224       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$21)
    2345                      .dwattr $C$DW$224, DW_AT_name("RAMSLPMDCNTLR2")
    2346                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
    2347                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2348                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2349              $C$DW$225       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$21)
    2351                      .dwattr $C$DW$225, DW_AT_name("RAMSLPMDCNTLR3")
    2352                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
    2353                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2354                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2355              $C$DW$226       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$21)
    2357                      .dwattr $C$DW$226, DW_AT_name("RAMSLPMDCNTLR4")
    2358                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
    2359                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2360                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2361              $C$DW$227       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$21)
    2363                      .dwattr $C$DW$227, DW_AT_name("RAMSLPMDCNTLR5")
    2364                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
    2365                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2366                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2367              $C$DW$228       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$23)
    2369                      .dwattr $C$DW$228, DW_AT_name("RSVD6")
    2370                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_RSVD6")
    2371                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2372                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2373              $C$DW$229       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$21)
    2375                      .dwattr $C$DW$229, DW_AT_name("DMAIFR")
    2376                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_DMAIFR")
    2377                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2378                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2379              $C$DW$230       .dwtag  DW_TAG_member
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   50

    2380                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$21)
    2381                      .dwattr $C$DW$230, DW_AT_name("DMAIER")
    2382                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_DMAIER")
    2383                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2384                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2385              $C$DW$231       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$21)
    2387                      .dwattr $C$DW$231, DW_AT_name("USBSCR")
    2388                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_USBSCR")
    2389                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2390                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2391              $C$DW$232       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$21)
    2393                      .dwattr $C$DW$232, DW_AT_name("ESCR")
    2394                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_ESCR")
    2395                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2396                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2397              $C$DW$233       .dwtag  DW_TAG_member
    2398                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$23)
    2399                      .dwattr $C$DW$233, DW_AT_name("RSVD7")
    2400                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_RSVD7")
    2401                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2402                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2403              $C$DW$234       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$21)
    2405                      .dwattr $C$DW$234, DW_AT_name("DMA2CESR1")
    2406                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_DMA2CESR1")
    2407                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2408                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2409              $C$DW$235       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$21)
    2411                      .dwattr $C$DW$235, DW_AT_name("DMA2CESR2")
    2412                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_DMA2CESR2")
    2413                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2414                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2415              $C$DW$236       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$21)
    2417                      .dwattr $C$DW$236, DW_AT_name("DMA3CESR1")
    2418                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_DMA3CESR1")
    2419                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2420                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2421              $C$DW$237       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$21)
    2423                      .dwattr $C$DW$237, DW_AT_name("DMA3CESR2")
    2424                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_DMA3CESR2")
    2425                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
    2426                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2427              $C$DW$238       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$21)
    2429                      .dwattr $C$DW$238, DW_AT_name("CLKSTOP")
    2430                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_CLKSTOP")
    2431                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2432                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2433              $C$DW$239       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$24)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   51

    2435                      .dwattr $C$DW$239, DW_AT_name("RSVD8")
    2436                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_RSVD8")
    2437                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    2438                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2439              $C$DW$240       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$21)
    2441                      .dwattr $C$DW$240, DW_AT_name("DIEIDR0")
    2442                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_DIEIDR0")
    2443                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2444                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2445              $C$DW$241       .dwtag  DW_TAG_member
    2446                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$21)
    2447                      .dwattr $C$DW$241, DW_AT_name("DIEIDR1")
    2448                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_DIEIDR1")
    2449                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
    2450                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2451              $C$DW$242       .dwtag  DW_TAG_member
    2452                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$21)
    2453                      .dwattr $C$DW$242, DW_AT_name("DIEIDR2")
    2454                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_DIEIDR2")
    2455                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2456                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2457              $C$DW$243       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$21)
    2459                      .dwattr $C$DW$243, DW_AT_name("DIEIDR3")
    2460                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_DIEIDR3")
    2461                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
    2462                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2463              $C$DW$244       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$21)
    2465                      .dwattr $C$DW$244, DW_AT_name("DIEIDR4")
    2466                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_DIEIDR4")
    2467                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2468                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2469              $C$DW$245       .dwtag  DW_TAG_member
    2470                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$21)
    2471                      .dwattr $C$DW$245, DW_AT_name("DIEIDR5")
    2472                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_DIEIDR5")
    2473                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    2474                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2475              $C$DW$246       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$21)
    2477                      .dwattr $C$DW$246, DW_AT_name("DIEIDR6")
    2478                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_DIEIDR6")
    2479                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2480                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2481              $C$DW$247       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$21)
    2483                      .dwattr $C$DW$247, DW_AT_name("DIEIDR7")
    2484                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_DIEIDR7")
    2485                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
    2486                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2487                      .dwendtag $C$DW$T$25
    2488              
    2489              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   52

    2490                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    2491                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2492              $C$DW$248       .dwtag  DW_TAG_TI_far_type
    2493                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$29)
    2494              $C$DW$249       .dwtag  DW_TAG_TI_ioport_type
    2495                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$248)
    2496              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    2497                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$249)
    2498              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2499                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2500                      .dwattr $C$DW$T$31, DW_AT_address_class(0x10)
    2501              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
    2502                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    2503                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2504              
    2505              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2506                      .dwattr $C$DW$T$33, DW_AT_name("PLL_Obj")
    2507                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x06)
    2508              $C$DW$250       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$27)
    2510                      .dwattr $C$DW$250, DW_AT_name("pllConfig")
    2511                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_pllConfig")
    2512                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2513                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2514              $C$DW$251       .dwtag  DW_TAG_member
    2515                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$28)
    2516                      .dwattr $C$DW$251, DW_AT_name("instId")
    2517                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_instId")
    2518                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2519                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2520              $C$DW$252       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$32)
    2522                      .dwattr $C$DW$252, DW_AT_name("sysAddr")
    2523                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_sysAddr")
    2524                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2525                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2526                      .dwendtag $C$DW$T$33
    2527              
    2528              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Obj")
    2529                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
    2530                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2531              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2532                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2533                      .dwattr $C$DW$T$37, DW_AT_address_class(0x17)
    2534              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    2535                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$33)
    2536                      .dwattr $C$DW$T$38, DW_AT_address_class(0x17)
    2537              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PLL_Handle")
    2538                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2539                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2540              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2541                      .dwattr $C$DW$T$3, DW_AT_address_class(0x17)
    2542              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
    2543                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$3)
    2544                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   53

    2545              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    2546                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2547                      .dwattr $C$DW$T$41, DW_AT_address_class(0x17)
    2548              
    2549              $C$DW$T$49      .dwtag  DW_TAG_subroutine_type
    2550                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2551              $C$DW$253       .dwtag  DW_TAG_formal_parameter
    2552                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$3)
    2553                      .dwendtag $C$DW$T$49
    2554              
    2555              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    2556                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    2557                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    2558              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
    2559                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2560                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2561              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2562                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2563                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2564                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2565              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2566                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2567                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2568                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2569              $C$DW$254       .dwtag  DW_TAG_TI_far_type
    2570                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$5)
    2571              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2572                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$254)
    2573              $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    2574                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2575                      .dwattr $C$DW$T$55, DW_AT_address_class(0x17)
    2576              $C$DW$255       .dwtag  DW_TAG_TI_far_type
    2577                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$55)
    2578              $C$DW$T$56      .dwtag  DW_TAG_const_type
    2579                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$255)
    2580              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2581                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2582                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2583                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2584              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("Uint8")
    2585                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$6)
    2586                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2587              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2588                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2589                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2590                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2591              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2592                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2593                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2594                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2595              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("Int16")
    2596                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$8)
    2597                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2598              $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("CSL_Status")
    2599                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   54

    2600                      .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2601              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2602                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2603                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2604                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2605              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    2606                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2607                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2608              $C$DW$256       .dwtag  DW_TAG_TI_far_type
    2609                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    2610              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
    2611                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$256)
    2612              
    2613              $C$DW$T$22      .dwtag  DW_TAG_array_type
    2614                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    2615                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2616                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
    2617              $C$DW$257       .dwtag  DW_TAG_subrange_type
    2618                      .dwattr $C$DW$257, DW_AT_upper_bound(0x0d)
    2619                      .dwendtag $C$DW$T$22
    2620              
    2621              
    2622              $C$DW$T$23      .dwtag  DW_TAG_array_type
    2623                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
    2624                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2625                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    2626              $C$DW$258       .dwtag  DW_TAG_subrange_type
    2627                      .dwattr $C$DW$258, DW_AT_upper_bound(0x01)
    2628                      .dwendtag $C$DW$T$23
    2629              
    2630              
    2631              $C$DW$T$24      .dwtag  DW_TAG_array_type
    2632                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
    2633                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2634                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x05)
    2635              $C$DW$259       .dwtag  DW_TAG_subrange_type
    2636                      .dwattr $C$DW$259, DW_AT_upper_bound(0x04)
    2637                      .dwendtag $C$DW$T$24
    2638              
    2639              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2640                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2641                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2642                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2643              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2644                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2645                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2646                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2647              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    2648                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$11)
    2649                      .dwattr $C$DW$T$83, DW_AT_address_class(0x17)
    2650              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    2651                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$11)
    2652                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2653              $C$DW$T$12      .dwtag  DW_TAG_base_type
    2654                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   55

    2655                      .dwattr $C$DW$T$12, DW_AT_name("long")
    2656                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    2657              $C$DW$T$13      .dwtag  DW_TAG_base_type
    2658                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2659                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2660                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    2661              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
    2662                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    2663                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2664              $C$DW$260       .dwtag  DW_TAG_TI_far_type
    2665                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$13)
    2666              $C$DW$T$98      .dwtag  DW_TAG_volatile_type
    2667                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$260)
    2668              $C$DW$T$14      .dwtag  DW_TAG_base_type
    2669                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2670                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    2671                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    2672                      .dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
    2673                      .dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
    2674              $C$DW$T$15      .dwtag  DW_TAG_base_type
    2675                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    2676                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    2677                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    2678                      .dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
    2679                      .dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
    2680              $C$DW$T$16      .dwtag  DW_TAG_base_type
    2681                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2682                      .dwattr $C$DW$T$16, DW_AT_name("float")
    2683                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    2684              $C$DW$T$17      .dwtag  DW_TAG_base_type
    2685                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2686                      .dwattr $C$DW$T$17, DW_AT_name("double")
    2687                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    2688              $C$DW$T$18      .dwtag  DW_TAG_base_type
    2689                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2690                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    2691                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x02)
    2692              $C$DW$T$99      .dwtag  DW_TAG_base_type
    2693                      .dwattr $C$DW$T$99, DW_AT_encoding(DW_ATE_signed_char)
    2694                      .dwattr $C$DW$T$99, DW_AT_name("signed char")
    2695                      .dwattr $C$DW$T$99, DW_AT_byte_size(0x01)
    2696              
    2697              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2698                      .dwattr $C$DW$T$34, DW_AT_name("xMEMORY_REGION")
    2699                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    2700              $C$DW$261       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$3)
    2702                      .dwattr $C$DW$261, DW_AT_name("pvBaseAddress")
    2703                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_pvBaseAddress")
    2704                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2706              $C$DW$262       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$13)
    2708                      .dwattr $C$DW$262, DW_AT_name("ulLengthInBytes")
    2709                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_ulLengthInBytes")
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   56

    2710                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2711                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2712              $C$DW$263       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$13)
    2714                      .dwattr $C$DW$263, DW_AT_name("ulParameters")
    2715                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_ulParameters")
    2716                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2717                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2718                      .dwendtag $C$DW$T$34
    2719              
    2720              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    2721                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$34)
    2722                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2723              $C$DW$264       .dwtag  DW_TAG_TI_far_type
    2724                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$84)
    2725              $C$DW$T$85      .dwtag  DW_TAG_const_type
    2726                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$264)
    2727              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    2728                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    2729                      .dwattr $C$DW$T$86, DW_AT_address_class(0x17)
    2730              $C$DW$265       .dwtag  DW_TAG_TI_far_type
    2731                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$86)
    2732              $C$DW$T$87      .dwtag  DW_TAG_const_type
    2733                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$265)
    2734                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2735              
    2736              ;***************************************************************
    2737              ;* DWARF CIE ENTRIES                                           *
    2738              ;***************************************************************
    2739              
    2740              $C$DW$CIE       .dwcie 91
    2741                      .dwcfi  cfa_register, 36
    2742                      .dwcfi  cfa_offset, 0
    2743                      .dwcfi  undefined, 0
    2744                      .dwcfi  undefined, 1
    2745                      .dwcfi  undefined, 2
    2746                      .dwcfi  undefined, 3
    2747                      .dwcfi  undefined, 4
    2748                      .dwcfi  undefined, 5
    2749                      .dwcfi  undefined, 6
    2750                      .dwcfi  undefined, 7
    2751                      .dwcfi  undefined, 8
    2752                      .dwcfi  undefined, 9
    2753                      .dwcfi  undefined, 10
    2754                      .dwcfi  undefined, 11
    2755                      .dwcfi  undefined, 12
    2756                      .dwcfi  undefined, 13
    2757                      .dwcfi  same_value, 14
    2758                      .dwcfi  same_value, 15
    2759                      .dwcfi  undefined, 16
    2760                      .dwcfi  undefined, 17
    2761                      .dwcfi  undefined, 18
    2762                      .dwcfi  undefined, 19
    2763                      .dwcfi  undefined, 20
    2764                      .dwcfi  undefined, 21
TMS320C55x Assembler PC v4.4.1 Fri Sep 07 02:27:22 2018

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
main.asm                                                             PAGE   57

    2765                      .dwcfi  undefined, 22
    2766                      .dwcfi  undefined, 23
    2767                      .dwcfi  undefined, 24
    2768                      .dwcfi  undefined, 25
    2769                      .dwcfi  same_value, 26
    2770                      .dwcfi  same_value, 27
    2771                      .dwcfi  same_value, 28
    2772                      .dwcfi  same_value, 29
    2773                      .dwcfi  same_value, 30
    2774                      .dwcfi  same_value, 31
    2775                      .dwcfi  undefined, 32
    2776                      .dwcfi  undefined, 33
    2777                      .dwcfi  undefined, 34
    2778                      .dwcfi  undefined, 35
    2779                      .dwcfi  undefined, 36
    2780                      .dwcfi  undefined, 37
    2781                      .dwcfi  undefined, 38
